[{"title": "Work in progress: Integration of topic modules and organization of session flow for the First-Year Seminar course in engineering to motivate and sustain student learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142696", "abstract": "This paper presents the overview of course instructional material in modules and the organization of these modules for presentation in sessions of the critical entry-level course, First-Year Seminar in Engineering, for undergraduate engineering majors at ABET-accredited institutions of higher education. The First-Year Seminar in Engineering at our University is offered once each year during the fall term. The enrollment can be between 45 and 50 first-year students. In recent years, the course, which is coordinated by one engineering faculty member and taught by up to fifteen different instructors, comprises a loosely organized collection of engineering and non-engineering topics delivered in twenty eight 55-minute sessions of the semester (14 weeks of instruction). The summative assessment of the student learning outcomes has revealed glaring weaknesses in content and delivery. For the incoming engineering student to receive both the holistic university experience and the ability to learn and retain fundamental engineering principles and practices, the course is being revised through central and integrative engineering design projects with service learning components. The revised structure places emphasis on the continuity across modules and sessions to ensure (a) the sustained engagement, and (b) the highest levels of student learning and retention of concepts throughout the semester.", "authors": [{"name": "Ramakrishnan Sundaram", "affiliation": "Gannon University"}], "tags": ["lead", "economics", "problem-solving", "seminars", "educational institutions", "materials"]}, {"title": "Set up and delivery of electrical and computer engineering projects at undergraduate engineering universities for outreach and partnership with K-12 STEM schools", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142697", "abstract": "This paper discusses the set up and delivery of Electrical and Computer Engineering (ECE) projects with critical Science, Technology, Engineering, and Mathematics (STEM) components as part of “Engage K-12 students in ECE”, the outreach and partnership program to (a) inspire K-12 students to pursue careers in ECE disciplines, and (b) integrate K-12 STEM learning with the ECE disciplines at institutes of higher education. In this form of outreach, called direct outreach, the K-12 students are invited to the University on ECE day to participate in hands-on ECE project activities in the ECE laboratories. The projects relate engineering principles to design specifications with real-world constraints. The project overview and the steps required to build and validate the design are presented by the ECE faculty member in charge of the project activities. The faculty member and currently enrolled ECE undergraduate students assist the K-12 STEM students. The K-12 students complete a survey at the end of the project as part of the summative evaluation. The survey comprised two sections (a) quantitative (b) qualitative. Despite the limited duration of each project, the students rated the projects to be very effective (greater than 3.8 on 5) in the application of STEM to real-world problems.", "authors": [{"name": "Ramakrishnan Sundaram", "affiliation": "Gannon University"}], "tags": ["cities and towns", "laboratories", "conferences", "educational institutions", "wireless communication", "wind power generation"]}, {"title": "Work in progress: Data-rich learning environments for engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142698", "abstract": "Green Research for Incorporating Data in the Classroom (GRIDC) is a National Science Foundation project designed to improve instructional practices in the curricula areas of science, technology, engineering, and mathematics (STEM). The project uses data collected from renewable energy technologies at the NC Solar House, and enables students in engineering and education to analyze, synthesize, and evaluate downloadable data. Students and instructors create data-driven and conceptual models to explain information obtained from the project's website using a variety of methods involved in technical data presentation. This paper explains the GRIDC project and how students in engineering and pre-service technology, engineering and design teacher education develop higher-order thinking skills. Preliminary research has been conducted on the effective use of these materials in college level environmental engineering classes and technical animation courses in engineering graphics. This research provides a base for continued research and development on using data-rich learning environments to further develop higher-order thinking skills for students across the country.", "authors": [{"name": "Aaron Clark", "affiliation": "North Carolina State University "}, {"name": "V. William DeLuca", "affiliation": "North Carolina State University "}, {"name": "Jeremy Ernst", "affiliation": "North Carolina State University "}, {"name": "Nasim Lari", "affiliation": "North Carolina State University"}], "tags": ["problem-solving", "educational institutions", "engineering education", "knowledge engineering", "decision making", "renewable energy resources"]}, {"title": "Learning from an initiative — Hands-on robotics workshops by IEEE Student Branch", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142699", "abstract": "The present contribution reports initiative of a relatively new IEEE Student Branch involving students in creative activities that build motivation for their future engineering studies. The IEEE Student Branch at Haldia Institute of Technology has always attempted to put more emphasis on hands-on learning and training for fellow students through various workshops and training sessions. As a part of such activity, training sessions on basics of mobile robots are being conducted for the last 3 years. Participation has been from a wide range of backgrounds, from different streams and different undergraduate to post graduate levels. Initial aim of the workshop sessions was to motivate students in design, estimation, fabrication and testing their own ideas of basic mobile robots. During the course of events in last few years, as will be reported in the paper, several interesting findings could be identified. It is felt that in order to perform well in their workplace, as well as to be responsible citizens, students are required to not only develop mastery of a particular subject, but civic, social, interpersonal and workplace skills as well [1]. In addition to reinforcing concepts from earlier and concurrent courses, such workshops can serve as a platform for exposing students to inter-disciplinary topics that appear in greater depth in later courses. Also, students mature in areas such as oral and written communication, awareness of professional ethics issues, and working effectively in a team-based setting. Mixing of students from different disciplines and different grades greatly enhances sense of fellow feeling and team spirit. Such workshops, being conducted by students themselves, increases the sense of belongingness, inculcates maturity, sensibility, leadership qualities among the organizing students [2].", "authors": [{"name": "Tuhin S. Mukherjee", "affiliation": "Haldia Institute of Technology "}, {"name": "P. Purkait", "affiliation": "Haldia Institute of Technology"}], "tags": ["conferences", "educational robots", "educational institutions", "microcontrollers", "robot sensing systems"]}, {"title": "Does an avatar motivate?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142700", "abstract": "The purpose of this study is to investigate students' perceptions of their motivation to learn while possessing an avatar alongside the learning activities. The activities include attendance and accessing the course module's eLearning portal. 47 students participated in the study and were divided into two groups: an avatar group and a non-avatar group. Additionally, two research instruments were used in the study. Firstly, an avatar environment named Avatar Hall was developed to allow the students from the avatar group to view their avatars. The second instrument was a motivation inventory, which was used to identify the students' perceptions of the extent to which the presence of an avatar motivated them to learn. The results for both groups show a moderate percentage distribution of the students' perceptions of their motivation to learn and further statistical test reveal no significant difference between the two groups of students in terms of their motivation to learn.", "authors": [{"name": "Liz Burd", "affiliation": "Durham University"}, {"name": "Mohammad Nur Azhar Mazlan", "affiliation": "Durham University "}], "tags": ["computers", "conferences", "games", "clothing", "instruments", "education", "avatars"]}, {"title": "Enhancing capstone design education in civil engineering: The potential synergies between academics and practitioners", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142701", "abstract": "The trend toward increasing design component in civil engineering curricula is part of an effort to better prepare graduates for the practice. While some design projects are still of the “made up” type; majority of projects today deal with “real-world problems” and are usually conducted by student's teams. The paper begins first by briefly reviewing the design as a “thought” process, focusing on “design thinking” and how “design thinking” skills are acquired. Second, the paper reports on the development, implementation, and subsequent evaluation of a senior design course at an international university, where practitioners from the Region have played a major role in teaching the capstone course. The restructured design course has met its objectives and exposed students to design practice. This industry-driven experience has also provided information on curricular content and capabilities of graduates. Outputs from the course can be used to provide guidance into: curricular changes, teaching methods, and civil engineering practice in the Region. Also, helps in establishing enduring connections with the industrial sector.", "authors": [{"name": "Waddah Akili", "affiliation": "Principal, Geotechnical Engineering, Ames, Iowa, USA"}], "tags": ["cities and towns", "schedules", "conferences", "educational institutions", "civil engineering", "probability"]}, {"title": "Tragedy in the gulf: A call for a new engineering ethic", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142702", "abstract": "The question that the present work addresses is how might we move the engineering profession towards a more encompassing engineering ethic and do it in a way which the practitioners might be receptive to such new ideas? Put another way, how might we develop a new engineering ethic, which focuses more upon the results as evidence by its adoption across the myriad of disciplines rather than the purity or elegance of the argument? The present work seeks to offer one approach that might work borrowing from our developing view of complex systems theory. One important characteristic of a complex system - and we shall consider others - is that a system is composed of interconnected parts that as a whole exhibit one or more properties. Stated another way, the behavior among the possible properties may not be obvious from the properties of the individual parts. The proposed new ethic also integrates new ideas from quantum mechanics as well as eco-philosophy.", "authors": [{"name": "George D. Catalano", "affiliation": "State University of New York at Binghamton"}], "tags": ["cities and towns", "conferences", "ethics", "presses", "educational institutions", "accidents", "quantum mechanics"]}, {"title": "Evolution of the university of denver engineering programs due to ABET accreditation criteria", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142703", "abstract": "Radical changes in the engineering programs at the University of Denver came in 1996 with the advent of ABET EC2000. Prior to EC2000, the engineering programs were developed based on the experience of faculty, the numbers of students and faculty, laboratory resources necessary to deliver the programs, and the accreditation requirements. As disciplinary programs evolved from a general engineering program and the number of students was low, this was a difficult process under the old ABET Criteria; the new ABET Criteria gave opportunities to design unique programs. New curricula were developed in 1996 along with an assessment process that took into account the needs of constituencies. Since then, the programs, assessment processes, as well as the process of determining the needs of constituencies have evolved substantially. Ethics has evolved from half of a course shared with engineering economic to ethics throughout the curricula; engineering economics has evolved into a full course for the BSME program, and an engineering entrepreneurship course for the BSEE and BSCpE programs; a legal studies course is required in the BSEE and BSCpE curricula; an option in Mechatronics Systems Engineering has been added to the BSEE program; and 5 year dual degree programs have been created that combine BS and MS degrees.", "authors": [{"name": "Ronald R. DeLyser", "affiliation": "University of Denver"}], "tags": ["computers", "industries", "accreditation", "educational institutions", "mechatronics", "mechanical engineering"]}, {"title": "Work in progress — Transversal competencies contributions to Computer Science 1 course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142704", "abstract": "A competence may be generically defined as the capacity of doing something and is more than just skills or knowledge. A transversal competence is one which can be re-used when shifting to another context. Our goal is to contribute to improve Computer Science 1 (CS1) course's results by the systematic incorporation of activities based on transversal competencies. We designed a set of activities to enhance the development of transversal competencies, specially planning and time management, team work and communication skills. Hypothetically, we propose that including this kind of activities helps to obtain better results in the course. An initial experimentation was done in 2010. The preliminary results show a remarkable positive difference in student's results. In the selected group the fail rate was only 12% (3 of 25 students). In other groups, the fail rate was 32% (8 of 25 students) and 40% (8 of 20 students). In previous years, this rate was approximately 40%.", "authors": [{"name": "Ines Friss de Kereki", "affiliation": "Universidad ORT Uruguay"}], "tags": ["computers", "conferences", "planning", "context", "programming profession"]}, {"title": "Measuring CS1 perceptions of parallelism", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142705", "abstract": "Educators in Computer Science (CS) generally agree that teaching concurrency can be difficult. CS programs typically offer parallel and distributed computing topics as advanced courses. A potential alternative approach is to provide instruction on parallelism early in the undergraduate curriculum, emphasizing conceptual design rather than implementation issues. This introduction of “parallel-thinking” to beginning CS undergraduates represents an innovation and significant extension to existing standard Computer Science curricula. The research described in this paper investigated the feasibility of integrating parallel computing concepts into a first-year CS course. To quantitatively assess student comprehension of parallel computing, an experimental two-factor mixed group design educational study was conducted to evaluate a control group and two instructional interventions: (1) lecture only, and (2) lecture with laboratory work using a software visualization Parallel Analysis Tool (PAT) specifically designed for this project. The Perceptions of Parallelism Survey (PoPS), a new evaluation instrument developed for this study and modeled after the Force Concept Inventory (FCI), was used to measure student learning. The results from this educational study show a statistically significant main effect among the repeated measures. PoPS results measured during the ninth week of the course reveal that performance levels remained high compared to pre-course performance scores.", "authors": [{"name": "Brian Rague", "affiliation": "Weber State University"}], "tags": ["concurrent computing", "educational institutions", "programming profession", "instruments", "parallel processing"]}, {"title": "Inspiring future female scientists", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142706", "abstract": "This paper will briefly summarize the current state of women in the sciences (especially computer science and engineering), examine current trends, and explore the needs of potential female scientists. One recognized need for academic achievement is the availability of mentors. Female mentors serve as role models and offer tangible proof that a woman can succeed in the field. This paper will explore one approach to inspiring and providing role models for women interested in the sciences. At the University of Mary Washington (UMW), a member of the Department of Computer Science introduced an innovative and novel freshman seminar: \"Beauty and Brains - Women in the Sciences\". This course is designed to expose students to the achievements and lives of many female scientists. Details about teaching methods, successful assignments, and outcomes are included in the paper. Feedback has been very positive.", "authors": [{"name": "Marsha Zaidman", "affiliation": "University of Mary Washington"}], "tags": ["engineering profession", "cities and towns", "computational modeling", "seminars", "educational institutions", "organizations", "computer science"]}, {"title": "Mixed reality for development of spatial skills of first-year engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142707", "abstract": "This paper follows up on the validation and usability study done on augmented reality, which is based on an application for the development of spatial skills in engineering students. In this phase, the training has been implemented in new Engineering degrees adapted to the new European Higher Education framework at a Spanish University. In this paper, the results obtained by students when improving spatial ability while carrying out their training, are shown and related to academic performance and drop-out rates, which are from current academic courses as well as previous ones. Additionally, a pilot study is introduced where a group of students use Head Mounted Displays (HMDs) for visualizing the real scene with augmented objects, so spatial ability improvement results and time spent, are compared to others belonging to the group using the PC monitor instead. Results confirm the training's validity and technical data which are collected to improve the interface's application as well as the augmented book. This has allowed the training to be made available to education centers which are waiting for the academic implementation through a commercial edition.", "authors": [{"name": "Jorge Martin-Gutierrez", "affiliation": "Universidad de La Laguna "}, {"name": "Montserrat Acosta Gonzalez", "affiliation": "Universidad de La Laguna"}, {"name": "Rosa E. Navarro", "affiliation": "Universidad de La Laguna "}], "tags": ["monitoring", "engineering students", "training", "augmented reality", "cameras"]}, {"title": "Proposal of methodology for learning of standard mechanical elements using augmented reality", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142708", "abstract": "Learning and teaching procedures need to evolve, considering the high technological profile most students have. Today's university students are steeped in a culture of technology and new devices such as smartphones, PDAs and laptops. These have found a place in students' lives as an important tool for studying. The use of these devices is widely used and seen when entering a first-year class, and most students work or take notes with them. This paper describes a physical interface (augmented book) based on augmented reality technology for learning standard mechanical elements. This book was included in the curriculum of an engineering graphics subject in a Mechanical Engineering Degree of a Spanish University. A validation study of didactic material was carried out by Twenty-five students that used this augmented book for studying the representation and designation of standard mechanical elements. A control group consisting of twenty-two students used traditional class notes with static images to study the same contents. We have analyzed the results through an evaluation test and a usability survey. The results show that the experimental group students enjoyed studying through the use of AR technology and even obtained better results in a contents evaluation test.", "authors": [{"name": "Jorge Martin-Gutierrez", "affiliation": "Universidad de La Laguna"}], "tags": ["cities and towns", "three dimensional displays", "materials", "augmented reality", "visualization", "education"]}, {"title": "Work in progress — The impact of time on building community in an ALN", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142709", "abstract": "The importance of establishing a sense of community is accepted as a central element in establishing an effective learning environment, impacting student persistence, satisfaction, and achievement. Although there is a body of research on building learning communities within an asynchronous learning network (ALN), that research is rather one-dimensional in that it is based upon a sample taken at a point in time and does not adequately address the dynamic characteristics of interpersonal relationships. The impact of shared experiences over time on feelings of community within an ALN is not clearly understood. This baseline information is necessary for providing context for an analysis of how to build community. This work in progress addresses that lack of context through a causal-comparative study that addresses the research question, “How does the sense of community change throughout the semester in a course offered in an ALN?” In deriving an answer to the research question, students in twelve graduate-level courses offered as part of the curriculum in a school of computer and information sciences completed the Classroom Community Scale twice during their 12-week terms: once at the midterm point, and again at the end of the term. A MANOVA analysis of the data did not suggest a change in community over the course of the semester.", "authors": [{"name": "Timothy J. Ellis", "affiliation": "Nova Southeastern University"}], "tags": ["communities", "atmospheric measurements", "particle measurements", "educational institutions", "context", "instruments"]}, {"title": "Work in progress — Effective teaching of technical teamwork to large cohorts of engineering students in China", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142710", "abstract": "Teamwork skills have been acknowledged as the key skills of potential engineers by industries internationally, including Chinese enterprises. This paper reports research in a joint Sino-UK programme in China on how teamwork can best be taught. Literature shows that little work has been done to find effective ways to teach teamwork to engineering students in China. This work attempts to implement successful cooperative learning practices of the West to a module that takes teamwork skills as one of its key teaching objectives and tries to design a new model for instructors to follow to teach teamwork effectively to Chinese engineering students. Preliminary results show that Chinese engineering students need training and practices in teamwork skills, and the situation is not exactly the same as previous research in other Confucius Heritage Culture countries.", "authors": [{"name": "Steve Ketteridge", "affiliation": "Queen Mary University of London"}, {"name": "Dan Zhang", "affiliation": "Queen Mary University of London "}, {"name": "Laurie Cuthbert", "affiliation": "Queen Mary University of London "}], "tags": ["conferences", "joints", "engineering students", "educational institutions", "teamwork", "cultural differences"]}, {"title": "Reading strategies and student comprehension in an Internet ethics course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142711", "abstract": "Our students' reading comprehension skills underpin their ability to learn the concepts and competencies in computer science. However, there has been little attention given to evaluating how well our students comprehend what they read and the effectiveness of strategies to improve their reading comprehension. In this paper we focus on the case of a non-major course on internet ethics and the reading of the original writings of key figures in ethical theory. Due to the observed weakness of the reading comprehension skills of the students, we have been teaching our students strategies to improve their skills in reading comprehension and meta-comprehension within the framework of an in-class group reading. The reading strategies we have been using are described, evaluated, and placed in the context of the reading comprehension literature. Increased awareness of the limitations of the reading comprehension skills of our students and of ways to teach the students strategies to improve those skills should prove useful in helping instructors ensure that our students have the foundation they need to be successful in their computer science studies.", "authors": [{"name": "Mark A. Holliday", "affiliation": "Department of Mathematics and Computer Science, Western Carolina University"}], "tags": ["cities and towns", "writing", "conferences", "ethics", "context", "education", "computer science"]}, {"title": "Teaching computer systems through common principles", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142712", "abstract": "Computer system subjects ranging from computer organization and operating systems to computer networking and database systems form an integral part of a computer science or computer engineering major. Because the subjects are usually taught as separate courses, students may not recognize that they share many design principles. We identify a set of these principles and demonstrate how they apply to all these aspects of a computer system. In our experience, students' understanding of these subjects and how they are inter-related improves when we identify and illustrate these common principles.", "authors": [{"name": "Mark A. Holliday", "affiliation": "Department of Mathematics and Computer Science, Western Carolina University"}], "tags": ["computers", "operating systems", "switches", "database systems", "bandwidth", "delay", "organizations"]}, {"title": "Integrating developmental instruction in sustainability contexts into an undergraduate engineering design curriculum: Level two", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142713", "abstract": "Developmental instruction in four sustainability contexts (environmental, social, economic, technical) in an engineering design curriculum offers a strong foundation and framework upon which to build an engineering program that teaches students the necessary methodologies for designing for sustainability. Instruction in sustainability contexts described in the current paper employs a developmental approach using Bloom's Taxonomy of Educational Objectives, which is a way to classify instructional activities or questions as they progress in cognitive difficulty. Our objective in this paper and presentation is to detail an instructional methodology (and results of a case study and focus group assessment) that integrates sustainability instruction in four contexts into the third and fourth classes in our six-course design curriculum using a developmental approach.", "authors": [{"name": "Olga Pierrakos", "affiliation": "James Madison University"}, {"name": "Eric Pappas", "affiliation": "James Madison University "}], "tags": ["communities", "economics", "taxonomy", "educational institutions", "green products", "context"]}, {"title": "A behavioral approach to building cognitive foundations for effective thought and action in a freshman critical thinking course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142714", "abstract": "Problem Solving Approaches in Science and Technology is a James Madison University three-credit freshman-level General Education course in psychological dispositional skills and metacognitive processes that includes instruction, practice, and maintenance in a variety of dispositional skills, intentional behavior, and lifestyle modification that support effective thought and action in academia, the workplace, and students' personal lives. Mean values of survey results of freshman students (n=118) of 1) perceived dispositional project and course value, 2) likelihood of continued use of acquired skills, and 3) perceived importance of these skills were positive and indicate the necessity of continued research into behavioral methodologies for teaching metacognitive skills.", "authors": [{"name": "Eric C. Pappas", "affiliation": "James Madison University"}], "tags": ["conferences", "problem-solving", "presses", "educational institutions", "psychology", "reflection"]}, {"title": "Factors influencing the decision to enroll in an engineering PhD program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142715", "abstract": "This research investigates the contributing factors for considering enrollment in engineering doctoral programs by offering responses' analysis of two groups; the first consists of 274 graduate students enrolled in various engineering programs in Lebanon and the second consists of 187 working engineers scattered in several countries around the world working in different social and multicultural settings. Both groups of participants completed a survey investigating the factors that may impact their decision to pursue a PhD degree. Based on the Theory of Reasoned Action, the Likert-scaled items aimed to identify the attitudinal and normative factors leading to the intention of enrolling in PhD program. An Independent t-test revealed no significance between students and engineers' intention. An exploratory Factor Analysis provided four factors: professional attitude, social attitude, financial attitude, and subjective norm. Repeated measures ANOVA showed the Professional attitude as the most important for participants followed by the Financial attitude, the Subjective norm, and the Social attitude. The findings are discussed and recommendations for future studies are offered.", "authors": [{"name": "Hoda Baytiyeh", "affiliation": "The American University of Beirut "}, {"name": "Mohamad K. Naja", "affiliation": "The Lebanese University"}], "tags": ["engineering profession", "conferences", "atmospheric measurements", "particle measurements", "educational institutions", "medical services"]}, {"title": "Practitioner engineers perceptions for a successful early employment career", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142716", "abstract": "The aim of this research is to examine the transition of Lebanese engineering students from collegiate life to working professional as a case study in the Middle East region. Practicing engineers (n=217) graduated from universities in Lebanon and working domestically and abroad in different social and multicultural settings were surveyed. The survey identified their current employment and their attitudes toward their academic preparation level. The results showed that locating a job is not a major concern for graduates due to the high demand of engineers in the prosperous Arabic Gulf States. However, novice engineers confront critical issues during the transition process. While Internships and graduation projects appear to be essentially helpful for participants, it was observed the lacking role of career centers in such critical stage. An Exploratory Factor Analysis revealed three main challenges facing engineering graduates: communication, responsibility, and self-confidence. Participants' answers to open-ended questions suggest a strong need for collaboration between the engineering industries and the academic institutions to facilitate a smoother transition.", "authors": [{"name": "Hoda Baytiyeh", "affiliation": "The American University of Beirut "}, {"name": "Mohamad K. Naja", "affiliation": "The Lebanese University"}], "tags": ["engineering profession", "communities", "industries", "conferences", "employment", "educational institutions"]}, {"title": "Work in progress — Enhancing students learning through instructional videos during hands-on laboratories on renewable energy sources", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142717", "abstract": "At the University of California Santa Cruz, a renewable energy sources course is a theory based course that includes six hands-on laboratory experiments. The course is designed for engineering and non-engineering undergraduate students and does not require any advanced mathematics or physics background. Each laboratory experiment introduces a miniature version of an energy conversion device that mimics the insights and workings of a real scale device. The hands-on laboratory experiments illustrate principles of the; solar pathfinder, flywheel, hydroelectricity, wind turbine, thermoelectricity and a fuel cell. In the past, each laboratory consisted of paper based instructions, pre and post questionnaires and a laboratory kit. Since many students in the class were non-science majors and had difficulty following the paper based instructions, we substituted the paper based instructions with instructional videos to ease the kit assembly and enhance student learning by providing more time to focus on the data gathering and analysis processes by minimizing the assembly time. The instructional videos demonstrate the experimental set-up and a method for collecting the data during each hands-on experiment. This work in progress paper presents description of our methods.", "authors": [{"name": "Philippe Matteini", "affiliation": "Baskin School of Engineering, University of California Santa Cruz "}, {"name": "Daniel Tate", "affiliation": "Baskin School of Engineering, University of California Santa Cruz "}, {"name": "Ali Shakouri", "affiliation": "Baskin School of Engineering, University of California Santa Cruz"}, {"name": "Oxana Pantchenko", "affiliation": "Baskin School of Engineering, University of California Santa Cruz "}, {"name": "Shehba Shahab", "affiliation": "Baskin School of Engineering, University of California Santa Cruz "}, {"name": "Michael Isaacson", "affiliation": "Baskin School of Engineering, University of California Santa Cruz "}], "tags": ["laboratories", "videos", "flywheels", "educational institutions", "assembly", "renewable energy resources"]}, {"title": "A review of an engineering teaching apprenticeship program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142718", "abstract": "A teaching apprentice program was implemented for senior-level engineering graduate students at the University of Notre Dame during the spring of 2009. The goal of the program was to offer a mentored teaching experience to graduate students that would soon be taking on roles as faculty members at institutions across the country. Responsibilities included: (1) teaching two sections of the first-year engineering course (as the instructor of record, receiving formal teaching evaluations), (2) helping to develop course materials (with feedback from engineering faculty and the Center for Teaching and Learning), and (3) leading two undergraduate teaching assistants (graders for their class). Finally, regular box lunch meetings were held for purpose of exposure to engineering education research and practice, through discussion of engineering education literature or meeting with outside guests from the engineering educational community. Program participants were required to document their goals at the start of the semester and to follow up with reflections at the end of each semester they participate; excerpts from participant reflections are presented. After completing the First-Year Engineering Teaching Apprentice Program (FYETAP), several participants have accepted post-docs or faculty positions and were able to use this experience in their interview process.", "authors": [{"name": "Kerry Meyers", "affiliation": "University of Notre Dame "}, {"name": "Jay Brockman", "affiliation": "University of Notre Dame"}], "tags": ["conferences", "interviews", "educational institutions", "materials", "engineering education", "reflection"]}, {"title": "Systematic analysis of peer interaction in cooperative learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142719", "abstract": "The strategies of cooperative learning have students help each other and make up for each other's learning differences, in order to enhance personal learning achievement and achieve learning objectives. Therefore, educators use the online platform to aid teaching, students can do various learning activities and discuss with classmates on the platform. Online platform not only provide students to learn the material, but also use the system to record the learning activities of students on the platform, students can also seek the assistance of peers on the platform. However, the discussion activities of the learning issues for each student are not necessarily structured type on learning platform, how do get information from the online discussion activities of students, discussion activities of the quantitative and qualitative analysis has become an important research topic. The study is based on Liu and Tsai proposed the interactive model as the cooperative learning group interaction on the classification, the paper is a way of observing and analyzing manually to determine the interaction patterns of each group. The study design the questionnaire of interactive mode, it can used automatic classification of group interaction scale, in order to reduce the load on manual observation and analysis. To ensure the interaction questionnaire can actually classified the interactive model, the study used statistical package for social science to verify reliability and validity of the subject content of the interaction questionnaire, in order to effectively grasp the cognition of student interaction.", "authors": [], "tags": ["cities and towns", "eigenvalues and eigenfunctions", "reliability", "conferences", "operating systems", "analytical models", "loading"]}, {"title": "An exploratory evaluation of an elementary mathematics and science attitude survey", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142720", "abstract": "Researchers have found that students in the United States display little interest in mathematics and science as early as the sixth grade. Multiple studies have established that elementary students' interest in these subjects is not only low but also decreases further throughout middle school and high school. Few studies have investigated students' interest in mathematics and science during the elementary years. Mathematics and science are essential subjects for future engineers and scientists, and the U.S. is experiencing a shortage in college students who are majoring in these fields. Understanding the attitudes of elementary students toward mathematics and science is essential to understanding the lack of interest students have in these subjects later in their education. This paper describes the development and the on-going validation of an assessment instrument that is designed to measure elementary student attitudes with respect to mathematics and science. Expert review and a factor analysis have been used in the development of the instrument, and subsequent results are reported. Additionally, this paper examines differences among elementary students' attitudes toward mathematics and science with respect to grade level and gender.", "authors": [{"name": "Barbara M. Moskal", "affiliation": "Colorado School of Mines"}, {"name": "Anna Forssen", "affiliation": "Colorado School of Mines "}, {"name": "Tonya Lauriski-Karriker", "affiliation": "Colorado School of Mines "}], "tags": ["cities and towns", "mathematics", "conferences", "educational institutions", "face", "instruments"]}, {"title": "Developing a survey instrument to characterize social capital resources impacting undergraduates' decisions to enter and persist in engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142721", "abstract": "This paper describes the theoretical basis, development, and initial results of a quantitative survey instrument that measures the engineering-related social capital resources of undergraduate engineering students. Despite significant efforts over the last few decades to increase participation of under-represented groups in engineering within the United States, progress has been disturbingly slow. Further research in this domain is needed to realize the significant advancements that are necessary for diversifying undergraduate engineering enrollment. The long-term purpose of this research is to develop a conceptual model based on Social Capital Theory to provide a deeper understanding and explanation of undergraduates' academic and career choices related to engineering, of which developing the survey instrument is the first step. Our “Name and Resource Generator” instrument has been administered to 890 students at three institutions within the United States. Supporting literature and initial results indicate that under-represented students in engineering may utilize different mechanisms for developing and activating engineering-related social capital compared to other engineering undergraduates, and that an approach utilizing social capital theory shows promise as a model with which to improve the diversity of the engineering field.", "authors": [{"name": "Julie P. Martin", "affiliation": "Clemson University "}, {"name": "Kyle Gipson", "affiliation": "Clemson University "}, {"name": "Matthew K. Miller", "affiliation": "Clemson University"}], "tags": ["engineering profession", "social network services", "engineering students", "educational institutions", "generators", "instruments"]}, {"title": "Developing instruments to assess first-year calculus and physics mechanics skills needed for a sophomore statics and dynamics course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142722", "abstract": "Anecdotally, engineering faculty members complain students taking sophomore engineering science courses are not prepared with respect to mathematics and mechanics-based physics. However, evidence has rarely been systematically collected and analyzed to determine the veracity of these assertions. Therefore, the paper intends to address two questions: 1) With respect to first-year mathematics and first-year physics mechanics knowledge, what do engineering faculty members expect students to know and be able to do when they begin a sophomore statics and dynamics course? 2) To what extent do students satisfy these expectations? To address these questions, the following steps were taken. First, engineering faculty members who taught a sophomore statics and dynamics course at Texas A&M University were asked for problems involving first-year mathematics and physics mechanics they thought students should be able to solve entering the course. Learning outcomes were abstracted, and two instruments were developed and administered near the beginning of the statics and dynamics course. After administering the instruments and analyzing results, faculty members have a better idea of the background of their students. Furthermore, there is evidence to examine the extent to which students are prepared in first-year mathematics and physics mechanics to begin a core engineering science course.", "authors": [{"name": "Kristi J. Shryock", "affiliation": "Texas A&M University "}, {"name": "Jeffrey E. Froyd", "affiliation": "Texas A&M University"}, {"name": "Arun R. Srinivasa", "affiliation": "Texas A&M University "}], "tags": ["educational institutions", "equations", "vectors", "knowledge engineering", "instruments", "physics"]}, {"title": "Work in progress — Developing an individualized life-long learning plan for junior electrical and Computer Engineering majors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142723", "abstract": "The Accreditation Board for Engineering and Technology (ABET), now ABET Inc., adopted Engineering Criteria 2000 (EC2000) in 1997. At the time this was considered a revolutionary approach to accreditation criteria, because of its focus on what is learned in the classroom rather than what is taught. In the spring of 2003 the faculty of the Electrical Engineering and Computer Engineering department at Binghamton University approved a new course - EECE 382 - Electrical and Computer Engineering Seminar II. The intent was to consolidate topics that were being taught across several courses within one focused seminar to better ensure that Criteria 3 of General Criteria for Basic Level Programs - Program Outcomes and Objectives - was consistently addressed. EECE 382 was to provide an overview of the professional aspects of the fields of Electrical Engineering and Computer Engineering. This paper reports on how one of the objectives of Criteria 3: `a recognition of the need for and an ability to engage in life-long learning' is addressed in EECE 382.", "authors": [{"name": "Michael Elmore", "affiliation": "Binghamton University, State University of New York, Binghamton, NY USA 13902-6000 "}, {"name": "James Constable", "affiliation": "Binghamton University, State University of New York, Binghamton, NY USA 13902-6000"}], "tags": ["engineering profession", "computers", "accreditation", "conference proceedings", "seminars", "educational institutions", "engineering education"]}, {"title": "Early project based learning improvements via a \"star trek engineering room\" game framework, and competition", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142724", "abstract": "In this work, we show how providing a constrained project framework for a second year digital design course improves the number of working student projects from 55% to 86%. Instead of an open-ended project as in previous years, we introduce an optional project framework, called \"Redhawk Duels\". Redhawk Duels is a game framework in which students design control algorithms and interfaces for a virtual ship. Once a competition begins, two opposing groups and their respective ships attempt to incapacitate the opposing ship by finding the opponent, shooting them, and budgeting their energy accordingly. Fifteen of the twenty-one groups in the 2010 class participated in Redhawk Duels for their final project, and 86% of these projects were working and demonstrated with sufficient complexity. The remaining six groups chose to implement open-ended projects and had a 66% success rate. This rate is similar to the 55% success rate of the 2009 class which were all open-ended projects. We surveyed the students involved to see how they felt the project helped them and how much they enjoyed the activity. The results show that the students strongly agree that participating in the framework motivated them and will help them in future engineering design projects.", "authors": [{"name": "Peter Jamieson", "affiliation": "Miami University"}], "tags": ["computers", "games", "educational institutions", "robots", "marine vehicles", "hardware"]}, {"title": "High tech garbage can help engineering colleges to improve hands-on education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142725", "abstract": "This paper presents a discussion on the potential use of high tech garbage, including electronic waste (e-waste), as a source of mechanisms, sensors and actuators, that can be adapted to improve the reality of microprocessor systems labs, at low cost. By means of some examples, it is shown that entire subsystems withdrawn of high tech equipments can be easily integrated into existing laboratory infrastructure. As examples, first a precision positioning mechanism is presented, which was taken from a discarded commercial ink jet printer and interfaced with a microprocessor board used in the laboratory classes. Secondly, a read/write head and its positioning mechanism has been withdrawn of a retired CD/DVD drive and again interfaced with the microprocessor board. Students who have been using these new experiments strongly approve their inclusion in the lab schedules.", "authors": [{"name": "Samuel E. de Lucena", "affiliation": "São Paulo State University"}], "tags": ["dc motors", "optical sensors", "electronic waste", "choppers", "microprocessors", "magnetic heads"]}, {"title": "Engineering Positive Organizational Behavior and managing the Psychological Capital for learning effectiveness", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142726", "abstract": "Social Intelligence has been a living concept for quite some time as an offshoot of Emotional Intelligence and has been used in engineering. Its usefulness in individual context has found several applications in developing individual effectiveness. Several researchers have expanded the concept to organizational development, and organizational effectiveness using modern concepts of Positive Organizational Behavior (POB). The POB has been derived from Psychological Capital and Psychological Ownership. These have been useful for implementing organizational development. POB and Social Intelligence studies in engineering classroom setting are important to today's engineering leadership development. This paper examines the intended outcomes of an Organizational Behavior (OB) course in shaping Positive Organizational Behavior (POB) using different tools - Authentic Leadership Questionnaire (ALQ), Psychological Capital Questionnaire (PCQ), Psychological Ownership Questionnaire (POQ), which were administered as pre and post semester basis. An analysis of result has been provided that can be directly attributed to the effects of carefully designed interventions in the course.", "authors": [{"name": "Hamid Khan", "affiliation": "Our Lady of the Lake University"}], "tags": ["cities and towns", "lead", "resilience", "conferences", "psychology", "meteorology", "organizations"]}, {"title": "Team formation by region to improve outcomes for distance-education students in a PBL course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142727", "abstract": "Because they are not able to meet face-to-face, distance education students find it more difficult to develop team-working skills: an important graduate attribute. In an effort to improve the development of this skill, (where possible) teams in a Problem-Based Learning (PBL) course were formed so that students were located in the same city or region. The expectation was that by being close together, the students would be able to communicate with each other more easily, thereby overcoming a barrier to performance. The results of a student survey show that they thought that their team's cohesion and performance were improved by being close together. All those whose team's performance was perceived to be improved wished to have the same opportunity to be close together in the future; many whose team's performance was not improved similarly wanted to work close together in the future. Analysis of the students' grades shows strong statistical significance that those students who were not geographically close to their teammates had lower grades on average. Efforts should be made to form teams relatively close geographically so that the ease of interaction leads to stronger interpersonal bonds, thereby improving the performance levels of the teams.", "authors": [{"name": "Andrew P. Wandel", "affiliation": "University of Southern Queensland"}], "tags": ["cities and towns", "conferences", "global communication", "virtual groups", "software", "meetings", "face"]}, {"title": "Work in progress — Enhancing communications among courses linked with prerequisites", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142728", "abstract": "This paper addresses the communication barrier exists among courses linked with prerequisite by proposing an active feedback system so that the instructor teaching the prerequisite can proactively report the student performance at each detail subject level and make it available to instructors requiring the course as prerequisite. It serves three purposes: (1) the instructors receiving such information have a better understanding of the incoming student readiness for the class, and if necessary, can offer a review session before starting a new chapter; (2) the prerequisite instructor can assess and improve his or her teaching effectiveness at each subject level by re-assigning the appropriate amount of time in each chapter; (3) the academic advisor can also use this information to recommend additional study between semesters in certain subject areas to help student to achieve academic success, if they demonstrate some weakness in those areas.", "authors": [{"name": "Ziliang Zhou", "affiliation": "California Baptist University"}], "tags": ["educational institutions", "engineering students", "physics", "vectors"]}, {"title": "Work in progress — Prediction of students' academic performance in an introductory engineering course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142729", "abstract": "Prediction of student academic performance helps instructors develop a good understanding of how well or how poorly the students will perform, so instructors can take proactive measures to improve student learning. This paper reports our recent ongoing efforts that focus on developing a predictive model to predict students' academic performance in an introductory engineering course titled Engineering Dynamics. A total of 2,151 data points were collected from 239 undergraduate students in three semesters. Four predictive models were developed using multivariate linear regression (MLR), multilayer perceptron (MLP) neural networks, radial basis function (RBF) neural networks, and support vector machines (SVMs), respectively. The results show that in many cases, the support vector machine model generates the overall best predictions: The average prediction accuracy is 89.0%-90.9% and good predictions are 62.3%-69.0%.", "authors": [{"name": "Shaobo Huang", "affiliation": "Department of Engineering and Technology Education, Utah State University "}, {"name": "Ning Fang", "affiliation": "Department of Engineering and Technology Education, Utah State University"}], "tags": ["accuracy", "computational modeling", "predictive models", "linear regression", "support vector machines", "neural networks", "calculus"]}, {"title": "Work in progress — Integrating mathematical modeling with computer visualization to improve students' problem solving in an introductory engineering course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142730", "abstract": "This paper reports ongoing efforts of integrating mathematical modeling with computer visualization to improve students' problem solving in an introductory Engineering Dynamics course. A special set of computer simulation and animation (CSA) learning modules was developed, implemented, and assessed in an Engineering Dynamics course taught by the author of this paper in multiple semesters. Qualitative and quantitative assessments were conducted, including pre-post tests to assess students' learning gains from the CSA learning modules, and questionnaire surveys and interviews to assess students' attitudes towards and experiences with the modules. The results showed that students made at least 48% learning gains with the CSA learning modules, and that 70%-80% of the students who responded to the survey agreed that the modules helped them build a connection between mathematics and Dynamics concepts.", "authors": [{"name": "Ning Fang", "affiliation": "Department of Engineering and Technology Education, Utah State University"}], "tags": ["computers", "kinetic theory", "problem-solving", "aerodynamics", "mathematical model"]}, {"title": "Enabling remote access to computer networking laboratories for distance education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142731", "abstract": "Academic organizations that provide students with the facilities for experimenting and learning basic and advanced concepts in networking rely on computer networking laboratories. These facilities can be implemented in many ways with varying degrees of cost, management complexity and capabilities. The benefits of these facilities can be extended by enabling remote access to them for distance education purposes. Providing remote access capabilities to these facilities with the objective of offering the learning experience of a computer networking laboratory to distance education students of Information and Communication Technology (ICT) programs is a challenging task. This paper provides a description and a comparative analysis of the implementation of three different computer network laboratory setups for which remote access was enabled and discusses lessons learned and good practices for similar setups.", "authors": [{"name": "Carlos E. Caicedo Bastidas", "affiliation": "Syracuse University"}], "tags": ["servers", "computers", "laboratories", "conferences", "computational modeling", "software", "education"]}, {"title": "Work in progress — Technical freehand sketching", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142732", "abstract": "In the past all engineering students took a drafting class. This involved the use of T-squares, triangles, architectural scales, pounce, eraser shields, bow compasses, pencils, and patience. It gave students a sense of how drawings and diagrams are made and used. As new subjects have come into the curriculum most engineering programs have dropped the drafting requirement, or at least replaced it with a computer-based CAD course. Also dropped, as a consequence, is the ability of engineering students to visually express the ideas they see in class and those that form in their heads. This paper describes the effort to address this change. This project is the result of a joint effort between an engineering and an art professor to empower students with the simple skills of producing reliable hand drawings for their notes and when expressing their design ideas. The result is a one-hour, lunch-time seminar open to engineering and science students to improve their technical freehand sketching techniques. They were coached by both professors in the techniques of hand sketching, including drawing straight and orthogonal lines, circles and ellipses, 2- and 3-D diagrams, graphs and charts, and labeling and lettering. Specific activities were used to gauge the improvement by the students as they progressed through the one-semester mini-course. This paper shares the best and the worst of this endeavor. This work was supported in part by a grant from the Professional Development Committee of SUNY Adirondack.", "authors": [{"name": "Kenneth S. Manning", "affiliation": "SUNY Adirondack "}, {"name": "John Hampshire", "affiliation": "SUNY Adirondack"}], "tags": ["lead", "conferences", "engineering students", "design automation", "visualization", "art", "bicycles"]}, {"title": "SHERPA: A mobile application for students and educators in the classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142733", "abstract": "Mobile computing is becoming ubiquitous across many areas including education. Many of the education-based applications are targeted toward the student as the end-user and trying to create a more effective educational environment using mobile technology. At our institution, we are investigating such applications, but wanted to look at tools focusing on the educator as well as the student. In this regard, we have developed and are testing a mobile productivity tool, SHERPA, for use by both the student and the instructor in the classroom. It is designed to assist the instructor in a number of administrative classroom activities and facilitate instructor-to-instructor communication. Student functionality includes the ability to interact with the instructor and other students, arrange collaborative meetings, and provide feedback on lectures. SHERPA is designed with a cloud computing architecture and attempts to leverage information sharing between instructors with common students. SHERPA was initially developed and tested in Fall semester 2010 with more extensive evaluation in the Spring 2011 semester. User feedback is very positive. This paper will describe SHERPA's functionality and design, its use in the classroom, instructor experience and feedback on the tool, and future plans.", "authors": [{"name": "Scott Teel", "affiliation": "United States Air Force Academy"}, {"name": "Dino Schweitzer", "affiliation": "United States Air Force Academy "}], "tags": ["servers", "cities and towns", "conferences", "databases", "productivity", "mobile handsets", "mobile communication"]}, {"title": "Work in progress — Enhancing the entrepreneurial mindset of freshman engineers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142734", "abstract": "Our research reports on an ongoing study of the impact of entrepreneurial interventions within first-year engineering courses on changes in the mindsets of engineering students. Entrepreneurial mindset in our study is operationally defined as a more growth oriented mindset versus a fixed oriented mindset. This operational definition and an accompanying mindset measurement instrument was developed and validated by Carol Dweck of Stanford University. Based on Dweck's research results we assume a growth mindset is a reasonable surrogate for a student engineer's creative and innovative or entrepreneurial skills. Mindsets of student engineers are benchmarked at the beginning of the freshman year and again at the end of the freshman year, soon after completion of a team based poverty alleviation freshman capstone project. Pre- and post- control samples of freshman engineer mindsets are being collected from similar sized engineering programs at comparable colleges in our geographic vicinity. A pilot study indicated a statistically significant tilt toward a fixed mindset in freshman engineering students compared to a growth mindset observed in an opportunity sample of freshman business students. We are currently tracking engineering students both at the group and at the individual level. Our long-term research goal is to determine how and why engineering course assignments affect a student engineer's entrepreneurial skill set. We hypothesize that a student engineer's creative and innovation skills are in part a learned behavior that is influenced by the student engineer's learning experiences and course assignments. In order to study this phenomenon we are establishing a baseline of the change in engineering student mindset over time. Once we have established this baseline of mindset data, we will then alter interventions to evaluate their differentiated impact on engineer mindset changes.", "authors": [{"name": "Daniel M. Ferguson", "affiliation": "Purdue University"}, {"name": "Kenneth J. Reid", "affiliation": "Ohio Northern University "}], "tags": ["engineering students", "innovation management", "educational institutions", "psychology", "instruments"]}, {"title": "Work in progress — A smartphone application as a teaching tool in undergraduate nursing education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142735", "abstract": "One in four people in a healthcare facility has a pressure ulcer (bedsore) at any given time, and bedsores are one of the leading iatrogenic causes of death reported in developed countries. Standardized documentation is identified as a critical component in the prevention and treatment of pressure ulcers, with the greatest challenges being non-compliance to protocol and inconsistency of documentation. As a result, attention is focused on electronic information systems, and the research objective in this work was to develop an interactive software application on a mobile device (Smartphone; tablet) to allow healthcare workers to electronically document patients' wounds, and to explore whether the application may promote higher consistency and compliance in wound care documentation, and higher patient and caregiver satisfaction relative to paper-based documentation. A prototype application on an Android platform is in progress with additional intelligence over paper-based forms. The prototype is being extended to a version designed as an educational tool for undergraduate nursing students learning clinical practices in wound care. The work advances the emerging area of healthcare applications and supports the increasing prevalence of e-health in nursing practice.", "authors": [{"name": "Jesse Vivanco", "affiliation": "University of Manitoba "}, {"name": "Bryan Demianyk", "affiliation": "University of Manitoba "}, {"name": "Marcia R. Friesen", "affiliation": "University of Manitoba"}, {"name": "Robert D. McLeod", "affiliation": "University of Manitoba "}], "tags": ["documentation", "educational institutions", "prototypes", "hospitals", "wounds", "protocols"]}, {"title": "Work in progress — Streamlining pathways to engineering degrees for military veterans", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142736", "abstract": "This paper will focus on the accelerated track for military veterans into bachelor's degrees in engineering. It is important to have contact with the military veteran prior to their arriving on campus to begin their schooling. An initial thorough evaluation of the veterans' training, experiences, and expertise will be conducted with the option of granting academic credit where appropriate. Current policies give little credit for military experience or training. The development of online pre and post assessments and subject based tutorials will be used to accelerate the veteran's entry into the traditional math sequence. The creation of accelerated courses specifically for veterans enrolled in the program will be another aspect used to accelerate degree completion. Veterans may have a base of technical knowledge acquired through the technical nature of their service posts. Assigning them to introductory level courses with traditional freshman and sophomore students does not respect their technical expertise nor challenge their capabilities and accustomed pace. Another aspect of this project is the inclusion of summer internships for participants.", "authors": [{"name": "Rekha Natarajan", "affiliation": "Kansas State University"}, {"name": "Noel N. Schulz", "affiliation": "Kansas State University "}, {"name": "David L. Soldan", "affiliation": "Kansas State University "}, {"name": "Don M. Gruenbacher", "affiliation": "Kansas State University "}, {"name": "Blythe Marlow Vogt", "affiliation": "Kansas State University "}], "tags": ["computers", "mathematics", "conferences", "acceleration", "educational institutions", "training"]}, {"title": "The effect of assessments on a telematics course for Telecommunication Engineers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142737", "abstract": "This paper studies the effect of including continuous assessments in the methodology of an introductory Telematics course for Telecommunication Engineers. Seven academic years were evaluated, corresponding to a total number of 364 students. Whereas the methodology of the first three years was based only on lectures and lab activities, the last four years included assessments (e.g., problem resolution, information searching, reports, tests, etc.) as an integral part of the students' final scores. Through statistical analysis, results reveal that there is no significant difference in the pass rate between years with assessments and years without assessments, taking into account all students enrolled in the course. However, there is a significant (statistical) difference in the fail and dropout rates. On the other hand, if only students who did not dropout the course are taken into account, then there is a significant (statistical) difference in the pass rate comparing both methodologies: including the assessments increased the pass rate from 53% to 72%. Nevertheless, no differences were found in the average final grades obtained by the students with either methodology. Regarding the students' gender, the effect of the assessments was higher for male students than for female students.", "authors": [{"name": "Maria-Dolores Cano", "affiliation": "Department of Information Technologies and Communications, Technical University of Cartagena"}], "tags": ["laboratories", "conferences", "analysis of variance", "telematics", "problem-solving", "media", "protocols"]}, {"title": "Multi-university precollege outreach from a renewable energy focused engineering research center", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142738", "abstract": "The precollege program in the NSF-supported Future Renewable Electric Energy Delivery and Management (FREEDM) Systems Center is in its third year with over 100 participants in the first two years at three university campuses. The precollege programs consist of (1) a Research Experience for Teachers, (2) a Young Scholars commuter program for high school students, and (3) summer science camps for middle school students. An Each One Mentor One approach is implemented which links mentorship between faculty, graduate and undergraduate students, teachers, and high school and middle school students. Program assessment results show that teachers now have an increased interest in research on how math and science can be applied, and the teachers feel more confident in talking to their students about future careers in the field of engineering. The precollege program has motivated both the high school and middle school students to study harder, and while high school students are more confident they will enroll in an engineering degree program, they are not as confident that they will complete an engineering degree.", "authors": [], "tags": ["engineering profession", "industries", "mathematics", "educational institutions", "materials", "instruments"]}, {"title": "On implementation of problem-based learning in engineering education: Thoughts, strategies and working models", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142739", "abstract": "This paper focuses on problem-based learning (PBL) in engineering programs, and argues that implementation of problem-based learning needs to be placed in a context and developed with careful consideration of the social, economic, and ethnic diversity of the student population and the university academic culture and prevailing norms. It includes a brief history, selected PBL models, strategies to infuse PBL in an engineering program, and suggestions for redesigning classes and courses to catalyze change in the classroom through student engagement. The paper examines and selects most suitable versions of PBL for potential adoption at the start, identifies essential elements of a well-structured learning strategy, and illustrates faculty role in implementing PBL. Proven methodologies and knowledge generated elsewhere, if and when properly adapted, should make it possible for institutions to devise their own PBL models that meet their classroom setting, objectives, and aspirations. The paper also addresses the potential difficulties that could arise during implementation of PBL, particularly when instructors are new to this instructional method.", "authors": [{"name": "Waddah Akili", "affiliation": "Principal, Geotechnical Engineering, Ames, Iowa, USA"}], "tags": ["cities and towns", "conferences", "educational institutions", "collaboration", "materials", "collaborative work"]}, {"title": "Cloud-based e-learning infrastructures with load forecasting mechanism based on Exponential Smoothing: A use case", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142740", "abstract": "The development of cloud technologies allows the implementation of scalable, versatile, and customized systems, constructed on-demand. This allows more efficient use of computing resources, improving the revenue of the system and enhancing the Quality of Service (QoS) received by users while minimizing the power consumption of the machines. Several research works conclude that in order to efficiently manage a cloud-based infrastructure (meaning, deploy computing resources when needed without affecting negatively to the QoS perceived by users), accurate predictions on the load of machines should be made. Thanks to this, resources can be ready to use when users need them, and shutdown when they are not needed - thus reducing the power consumption and enhancing the revenue of the system. This paper presents algorithms to perform forecasts of the load of machines based on Exponential Smoothing (ES), so that the machines of the technological infrastructure of our University can be efficiently managed. Furthermore, algorithms to perform monitoring and provision of resources based on load forecasts are presented. The usefulness of these algorithms is illustrated by means of a use case based on the e-learning facilities of our University. This use case shows that thanks to the use of cloud technologies, enhanced with the developed algorithms for load forecasting and provision of resources, better use of resources and lower power consumption can be achieved, without affecting the QoS received by user.", "authors": [{"name": "Salvador Ros", "affiliation": "Departamento de Sistemas de Comunicación y Control., Universidad Nacional de Educación a Distancia, UNED., Madrid, Spain "}, {"name": "Antonio Robles-Gomez", "affiliation": "Departamento de Sistemas de Comunicación y Control., Universidad Nacional de Educación a Distancia, UNED., Madrid, Spain "}, {"name": "Agustin C. Caminero", "affiliation": "Departamento de Sistemas de Comunicación y Control., Universidad Nacional de Educación a Distancia, UNED., Madrid, Spain "}, {"name": "Roberto Hernandez", "affiliation": "Departamento de Sistemas de Comunicación y Control., Universidad Nacional de Educación a Distancia, UNED., Madrid, Spain "}, {"name": "Rafael Pastor", "affiliation": "Departamento de Sistemas de Comunicación y Control., Universidad Nacional de Educación a Distancia, UNED., Madrid, Spain"}], "tags": ["monitoring", "prediction algorithms", "switches", "cloud computing", "educational institutions", "heuristic algorithms", "load forecasting"]}, {"title": "Work in progress — Undergraduate research course design at KFUPM, a basic starting experience", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142741", "abstract": "In this paper we share our approach into the design of undergraduate research course at King Fahd University of Petroleum and Minerals (KFUPM). The course design process, description and instruction delivery are discussed. The lessons learnt will be highlighted along with experiences and challenges from a first offering of the course during winter term of 2011. As a first assessment, major benefits of the course include for both students and faculty through providing increased interaction, increasing student intellectual maturity, and furthering faculty research projects.", "authors": [{"name": "Amar Khoukhi", "affiliation": "Department of Systems Engineering, King Fahd University of Petroleum and Minerals, Dhahran, Kingdom of Saudi Arabia, 31261"}], "tags": ["cities and towns", "conferences", "petroleum", "proposals", "educational institutions", "materials", "training"]}, {"title": "Legitimization of subject matter in a design intensive degree program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142742", "abstract": "This is a descriptive study at the departmental level of a university. It provides a glimpse into the ways that this department, as an academic community implementing a design intensive degree program, deals with the conflicts between accreditation as a system of program assessment and the processes that distinguish them as a culture. The process under primary investigation was modification of curriculum to introduce subject matter into the degree program (one possible terminus of subject matter's progress toward legitimization: recognition of being both integral to the required portion of the curriculum and well defined by cultural agreement and system records). Employing ethnomethodological strategies, the researcher maintained prolonged contact with members of this culture, interrogating legitimization and curriculum modification (regarding sustainability subject matter) that they attempted despite ongoing disturbances to these processes. The disturbances and reactions made cultural processes observable to an extent not likely under ordinary circumstances.", "authors": [{"name": "Charles D. Cox", "affiliation": "University of Pittsburgh Learning Research and Development Center"}], "tags": ["accreditation", "conferences", "interviews", "educational institutions", "context", "cultural differences"]}, {"title": "Representation of women and perceptions of support in engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142743", "abstract": "A deductive coding scheme developed during a previous stage of a multi-institutional research project was used with interview data to gain a more nuanced understanding of the types of gender specific supports identified by female participants and how these might be related to the numeric representation of women. Findings confirm that gender ratios in a field affect perceptions of the gender appropriateness of a field. The numeric representation of women is a type of contextual support that is important because it communicates, not that women need special treatment, but that women belong and can succeed in a field. Within the context of a culture that communicates values that are consistent with it, extracurricular clubs like SWE and positive female role models, send the message that obstacles, while present, are surmountable and that the benefits associated with the outcome make the effort worthwhile.", "authors": [{"name": "Elizabeth G. Creamer", "affiliation": "Virginia Tech"}], "tags": ["engineering profession", "conferences", "encoding", "interviews", "educational institutions", "instruments", "protocols"]}, {"title": "Reference designs for embedded controls", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142744", "abstract": "A set of reference designs suitable for our student design projects was developed and tested. The purpose is to make them available for students to choose the ones suitable for integration into their projects with confidence. All the reference designs are available on our website. Some of those that are intended for embedded control applications are described in this paper. They are reference designs for DC motor driver, stepper motor driver, and GPS module. These reference designs were adopted into our embedded control projects before. Other reference designs were also developed but due to limited space are not included into this paper but the hyperlinks to them are provided. Some of the interesting projects and their evaluations are also described in this paper. Another aspect of this paper is the description of the structure of the reference designs and the various issues encountered. The information should be useful to those intend to develop reference designs for their own design courses.", "authors": [{"name": "Chiu H. Choi", "affiliation": "University of North Florida"}], "tags": ["dc motors", "conferences", "global positioning system", "microcontrollers", "wiring", "clocks", "hardware"]}, {"title": "Game·Tel: An approach to multi-format and multi-device accessible engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142745", "abstract": "Game·Tel is an open source software system that supports personalized learning, focusing on serious games and simulations, making these and traditional content accessible and adaptive to the student and educational context. In this paper we discuss about its design and functionalities, its modular architecture and the multi-environment approach.", "authors": [], "tags": ["adaptation models", "tv", "computational modeling", "engines", "games", "least squares approximation", "visualization"]}, {"title": "Educators + tech-heads = Ed-techs, ‘the symphony’", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142746", "abstract": "When academics and computer technicians do not work in unison a dissonance can occur in the learning provided to students as the best software application or technical solution and the most appropriate or engaging learning experience may not be harmoniously orchestrated. At CQUniversity, Australia, out of the cacophony of experiences, frustration and limitations approaches have been developed and implemented to enable successful and innovative learning and teaching approaches. For the last ten years academics and computer technicians have collaborated to instigate Ed-Tech solutions, including interactive technologies into the classroom and for academics on the move, needing to access resources or communicate with students and colleagues in delivering its undergraduate Engineering programs. These innovations extend to web based communications (web conference between students through ScopiaTM'), application sharing (CitrixTM Main Frames Application Delivery via http for applications such as MatlabTM, Microsoft OfficeTM, AutoCADTM and other CAD applications, Strand 7TM and Visual StudioTM - on both Apple and Microsoft platforms for students and academics) and secure access outside of university networks. The collaborative relationship, the symphony', between technical staff and academics, has ensured `outside the box' thinking and far more realistic Information Technology outcomes have been implemented to improve lecturer delivery and student learning.", "authors": [{"name": "Patrick Keleher", "affiliation": "CQUniversity, Australia "}, {"name": "John Mark", "affiliation": "CQUniversity, Australia"}], "tags": ["computers", "cities and towns", "conferences", "educational institutions", "collaboration", "australia"]}, {"title": "Conducting successful studies in Materials Science and Engineering with consideration to a multiplicity of student cohorts and delivery modes", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142747", "abstract": "Second year students undertaking their studies in Materials Science and Engineering within the Bachelor of Engineering at CQUniversity, Australia, are a diverse group requiring a variety of approaches to enable them to undertake their studies. The university, whilst having a strong regional focussed approach, conducts its Engineering degree offerings over three campuses, at Mackay, Rockhampton and Gladstone, in Queensland, Australia and by flexible mode throughout Australia and internationally. Lecturers are located on each of the campuses and it is their role to oversee the cohort of on-campus students on that particular campus. On-campus, full-time students are traditionally secondary students who have continued with their studies into tertiary education or mature learners who have been in the workforce for some time and return to study to re-skill, up-skill or update their knowledge and skill base. While students who study by a part-time, external (ie. flexible or distance) study mode are practitioners who have a trade qualification or are university graduates wishing to re-skill, up-skill or update their knowledge and skill base and continue working throughout their study. All students have access to course materials, video-streams of lectures, student-student and student-lecturer communication channels via a dedicated course Moodle™ website.", "authors": [{"name": "Patrick Keleher", "affiliation": "CQUniversity, Australia "}, {"name": "Kai Duan", "affiliation": "CQUniversity, Australia"}, {"name": "Arun Patil", "affiliation": "CQUniversity, Australia "}], "tags": ["cities and towns", "laboratories", "conferences", "educational institutions", "materials", "australia"]}, {"title": "A senior service-learning design project in ecuador", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142748", "abstract": "International service-learning projects are an effective educational tool for universities striving to meet the ABET engineering criterion, while also providing transformational experiences to their students and a service to needy populations in the world. This paper discusses the benefits of international service-learning projects for the students and the university. Demand for these projects from students as well as supply of worthy projects in developing countries is also discussed. The ABET engineering criterion are then discussed, with specific attention to the criterion that are harder to address with traditional engineering education. Finally, the year-long process of development and piloting of the first international humanitarian engineering service-learning project within the University of Pittsburgh's Department of Civil Engineering is presented. This pilot project was a collaboration between the Pitt senior design course and a local chapter of Engineers Without Borders. A discussion of related efforts that emerged from this initiative is also presented.", "authors": [{"name": "Dan Budny", "affiliation": "University of Pittsburgh"}, {"name": "Rob Gradoville", "affiliation": "University of Pittsburgh "}], "tags": ["engineering profession", "communities", "conferences", "engineering students", "educational institutions", "teamwork"]}, {"title": "The co-operative education work term: A comparison of expectations and outcomes for international engineering graduates in Canada", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142749", "abstract": "The completion of a co-operative education work term allows students to reflect on how their work experience aligned with their initial expectations. Such an opportunity presented itself within a larger, exploratory study examining the perceptions of international engineering graduates (immigrant engineers) on their participation in a university co-op education program as part of an alternative pathway for professional engineering licensing. The pathway combines an eight-month academic term with a four-month, paid work term. Previous research has indicated the potential for co-op education programs to support the integration of women and other underrepresented groups into the engineering profession by developing soft skills largely through positive mentoring and networking experiences. The potential for the co-op placement to offer similar advantages for international engineering graduates was explored in this study. Qualitative data were collected through focus group sessions with students and employers, co-op work term reports, and program documents. Findings indicate the value to international engineering graduates of the cooperative work term in simultaneously developing technical and cultural competencies including mentoring and networking. This study highlights the potential of the co-op work term to contribute human, cultural and social capital essential to the integration of international engineering graduates into the Canadian engineering profession.", "authors": [{"name": "Sandra Ingram", "affiliation": "University of Manitoba "}, {"name": "Anita H. Ens", "affiliation": "University of Manitoba"}], "tags": ["engineering profession", "employee welfare", "global communication", "employment", "humans", "education", "cultural differences"]}, {"title": "Web editing module for tagging metadata of the Fedora Commons repository learning objects under DRD and LOM standards", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142750", "abstract": "Nowadays there is a large and increasing body of learning objects stored on the Web. Some of them reside in different learning repositories, such as the MERLOT repository [1], the Education Network Australia (EDNA) [2], and the Connexions repository [3]. Fedora is an acronym for Flexible Extensible Digital Object Repository Architecture [4]. Fedora's flexibility makes it capable of serving as a digital repository for a variety of use cases, including digital asset management, institutional repositories, digital archives, content management systems, scholarly publishing enterprises and digital libraries [5]. Many universities and companies around the world are using Fedora as a valid approach to manage their increasing knowledge. This document proposes an extension of the Fedora Commons repository which is composed by: A web editing module based on the ISO/IEC 24751-3 Digital Resource Description (DRD) [6] standard in order to label learning objects from the Fedora repository to provide them with accessible characteristics and on the other hand a web editing module to label learning objects from the Fedora Repository based on the IEEE Learning Object Metadata (LOM) [7] standard. Our approach offers institutions the possibility of labelling their learning objects in an accessible way, in order to facilitate the process of delivering the educational resources and the adaptive instructional design adjusted to the special needs of users. Our approach offers institutions the possibility of labelling their learning objects in an accessible way, in order to facilitate the process of delivering an adaptive instructional design adjusted to the special needs of users.", "authors": [], "tags": ["search problems", "labeling", "observatories", "iso standards", "xml", "education", "iec standards"]}, {"title": "LORSE: Intelligent meta-searcher of learning objects over distributed educational repositories based on intelligent agents", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142751", "abstract": "This paper introduce LORSE, a multiagent system based on JADE (Java Agents Development Framework) to support teachers and students in the time consuming task of searching for distributed learning objects in several learning objects repositories such as MERLOT, Connexions and Fedora Commons Repositories, It offers them the possibility of developing this task in the context of a learning management system. LORSE consist of a set of intelligent agents, whose responsibility it is to deliver to users different learning objects in response to specific searches requested by the users. The agents connect with the repositories by means of RESTful web services clients developed as one of its behaviors and then they develop the searches over the learning objects metadata to provide a suitable response to users. The integration process of LORSE with the dotLRN platform is presented and some implementations results are introduced.", "authors": [], "tags": ["search problems", "web services", "intelligent agents", "conferences", "multiagent systems", "xml", "education"]}, {"title": "Automatic assessment for the e-learning of the network services in the context of the EHEA", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142752", "abstract": "This work presents a new system for the automatic assessment of practical activities in the context of the EHEA. A subject focused on the configuration of network services has been chosen to implement the new automatic evaluation platform. Unlike traditional platforms based on theoretical contents to evaluate the students' knowledge, the proposed system is able to immediately evaluate students' practical skills and, additionally, provide them with feedback about the correctness of their activities. Therefore, faculty can dynamically follow the students' progress in order to adjust the learning process to their needs. Since the UNED University serves a large number of students via a distance-learning methodology, the use of scalable assessment platforms within the students' learning process is crucial to keep it working efficiently. Automatic assessment systems are also of particular interest when practical activities are performed within higher engineering courses.", "authors": [{"name": "Roberto Hernandez", "affiliation": "Departamento de Sistemas de Comunicación y Control, Universidad Nacional de Educación a Distancia (UNED), Madrid, España "}, {"name": "Agustin C. Caminero", "affiliation": "Departamento de Sistemas de Comunicación y Control, Universidad Nacional de Educación a Distancia (UNED), Madrid, España "}, {"name": "Antonio Robles-Gomez", "affiliation": "Departamento de Sistemas de Comunicación y Control, Universidad Nacional de Educación a Distancia (UNED), Madrid, España "}, {"name": "Salvador Ros", "affiliation": "Departamento de Sistemas de Comunicación y Control, Universidad Nacional de Educación a Distancia (UNED), Madrid, España "}, {"name": "Rafael Pastor", "affiliation": "Departamento de Sistemas de Comunicación y Control, Universidad Nacional de Educación a Distancia (UNED), Madrid, España"}, {"name": "Llanos Tobarra", "affiliation": "Departamento de Sistemas de Comunicación y Control, Universidad Nacional de Educación a Distancia (UNED), Madrid, España "}], "tags": ["servers", "conferences", "educational institutions", "least squares approximation", "java", "electronic learning"]}, {"title": "Work in progress — Using mobile & social game technology with location-based services for building learning communities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142753", "abstract": "In this Work in Progress, we describe the `my Learning Community' application design principles and theoretical foundation. The application is a learning community support tool, which we implement in a peer mentoring project in the Department of Computing and New Media Technologies at the University of Wisconsin-Stevens Point. Combining different learning frameworks, we implement location-based services utilizing publicly available interfaces to Foursquare/Gowalla, which allow the identification and tracking of student participation in study sessions and identification of experts (“mayors”), which in turn mentor fellow students. As students progress through the curriculum, the identified student participation will allow for a transition of students into informal topic leadership. The student and study group location and additional communication among participants of study sessions will be facilitated by the `my Learning Community' application, which we make available to our students for installation on mobile and desktop devices and are currently implementing our approach.", "authors": [], "tags": ["communities", "lead", "conferences", "educational institutions", "games", "mobile communication", "media"]}, {"title": "Work in progress — Music synthesizers: A tool in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142754", "abstract": "To improve the rates of retention in all academic programs NYIT created the Office of Academic Support and Retention Services (OoASRS). In spite of this initiative, the rate of freshman-related retention in the School of Engineering and Computing Sciences (SoECS) has not improved significantly. Contextual Teaching and Learning (CLT) is a concept of instruction that relates subject matter content to the real world and motivates students to make connections between knowledge and it applications. To improve retention rates the faculty of the SoECS requires all freshmen to take ETCS 105 “Career Discovery”. The course uses the educational philosophy and strategies of CLT to enable students to find “meaningfulness” in their education and offers a place for meaning and content to merge. Last semester, we developed a new 8-week CLT module for this course which used a modular music synthesizer to introduce freshmen to an extremely wide range of engineering concepts in an engaging way. This “Work in Progress” will describe the module's lessons and provide a preliminary assessment of student engagement and retention rates..", "authors": [{"name": "Steven Billis", "affiliation": "New York Institute of Technology "}, {"name": "Steven Giordano", "affiliation": "New York Institute of Technology"}, {"name": "Nada Anid", "affiliation": "New York Institute of Technology "}], "tags": ["synthesizers", "voltage-controlled oscillators", "education", "instruments", "frequency modulation", "amplitude modulation"]}, {"title": "Work in progress — Assessing information literacy in civil engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142755", "abstract": "Although information literacy is not specifically mentioned in the ABET outcomes, the development of these skills is essential to the achievement of several outcomes. Civil Engineering faculty at the United States Coast Guard Academy (USCGA) have developed performance indicators and assessment tools under existing ABET outcomes designed to develop and improve student information literacy skills. The link to ABET specific outcomes enables students to see the connection between information literacy and their ability to engage in lifelong learning, to follow contemporary issues, and to use modern information technology tools in their engineering work. The authors discuss steps taken at the USCGA to evaluate aspects of information literacy within the current assessment process in the Department of Civil Engineering.", "authors": [], "tags": ["cities and towns", "writing", "conferences", "civil engineering", "joining processes", "context", "meteorology"]}, {"title": "Workshop — Quantifying qualitative data in mixed methods research in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142756", "abstract": "This interactive pre-conference workshop builds on a workshop offered at FIE 2010 that provided an introduction to mixed methods research and the concept of mixing. The workshop aims to advance the use of mixed methods research in engineering education by delving into quantitizing as one strategy for mixing qualitative and quantitative data during the process of data analysis. Quantitizing refers to the process of assigning numerical values to qualitative data collected through interviews or through participant observation. A typology of different techniques for quantitizing will be shared along with examples from the engineering education research literature. Participants will have the opportunity to work in small groups to consider different strategies for quantitizing qualitative data they have collected and to develop examples of the different ways to mix or merge qualitative and quantitative data. The purposes and rationale for using this strategy will be discussed, along with consideration of the paradigmatic objections raised about data transformation.", "authors": [{"name": "E. G. Creamer", "affiliation": "Virginia Tech"}], "tags": [""]}, {"title": "STAIRSTEP: An interdisciplinary program fo retention and outreach in STEM", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142757", "abstract": "Lamar University's Students Advancing through Involvement in Research Student Talent Expansion Program (STAIRSTEP) is designed to increase the number of United States students receiving undergraduate degrees in science, technology, engineering and mathematics (STEM). The program's goals are to attract students to STEM, retain them through to graduation, and help them transition to careers or advanced study in STEM. The STAIRSTEP program targets talented “at risk” students who face social and economic barriers that can make it difficult for them to complete degrees in STEM. This includes women and minorities who are underrepresented in STEM, low income and first generation students. It uses recognized strategies from the literature for increasing participation in STEM and implements them in an innovative way. The program has been very successful in its first two years. This paper describes the program's strategies, activities and results achieved during this time. Benefits and challenges of the interdisciplinary approach are discussed, and key elements essential to the program's success are identified.", "authors": [{"name": "Christopher Martin", "affiliation": "Lamar University"}, {"name": "Joseph Kruger", "affiliation": "Lamar University "}, {"name": "Peggy Doerschuk", "affiliation": "Lamar University "}, {"name": "Cristian Bahrim", "affiliation": "Lamar University "}, {"name": "Jennifer Daniel", "affiliation": "Lamar University "}, {"name": "Judith Mann", "affiliation": "Lamar University "}], "tags": ["engineering profession", "communities", "mathematics", "conferences", "educational institutions", "organizations"]}, {"title": "Work in progress — Implementing peer observation of teaching", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142758", "abstract": "This paper describes how the Department of Engineering Technology & Management (ETM) at South Dakota State University (SDSU) is implementing a Peer Observation of Teaching process to improve teaching and as a result improve student learning. A robust definition of what constitutes good teaching that will address a variety of contexts and student cohorts has yet to be developed. There is general agreement that good teaching should lead to increased student learning. The teaching process is complex and difficult, however external feedback can be a useful tool to help faculty improve effectiveness. Based on a seminar provided to the entire SDSU campus, the ETM Department has developed and is beta-testing a seven-step process to implement peer observation and evaluation to provide feedback to teachers from their fellow faculty. Yet to be to fully developed is how to choose from among several possible ways to assess the results of the peer review of teaching process and to improve effective teaching. At the time of this paper's presentation in Fall 2011, we will report on the status of the process, some assessment outcomes, and recommendations for future implementation.", "authors": [{"name": "Teresa Hall", "affiliation": "South Dakota State University"}, {"name": "Byron Garry", "affiliation": "South Dakota State University "}, {"name": "Li Qian", "affiliation": "South Dakota State University "}], "tags": ["cities and towns", "observers", "conferences", "educational institutions", "materials", "context"]}, {"title": "The effect of emotive language in virtual teams", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142759", "abstract": "Technology continues to change en evolve in amazing ways. The use of technology is also evolving at a dizzying pace. The way virtual environments are being used continues to challenge the norm in education. The questions driving this research study centers around the use of emotive language and emoticons in the written communication in a virtual environment between two high school aged students. The more focused question is, how does the use of emotive language and emoticons affect the negotiation, and how will a virtual facilitator interact within that same virtual environment? This study will provide insight into how the use of emotive language affects the ability of students to reach a negotiated solution. Also, this study will provide an opportunity to look at the use of text language from authentic sources. The implications of this study are quite powerful. The potential of a virtual facilitator that understands modern colloquial text based language, may provide an additional level of safety for online interactions between young adults, in effect, giving a tool to combat such things as cyber bullying.", "authors": [{"name": "Obed Magny", "affiliation": "University of La Verne "}, {"name": "Linda Williams", "affiliation": "University of La Verne "}, {"name": "Ray Luechtefeld", "affiliation": "University of La Verne"}, {"name": "Nicholas Richter", "affiliation": "University of La Verne "}], "tags": ["virtual environments", "aging", "conferences", "educational institutions", "face", "medical services", "mediation"]}, {"title": "Work in progress — Analyzing engineering student conceptions of modeling in design", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142760", "abstract": "Modeling is a pervasive feature in any engineering curriculum that is rarely taught as an explicit topic to engineering learners. The implicit inclusion of modeling often results in conceptions of models being primarily descriptive - visual and physical representations - that originate from everyday and coursework use. A broader understanding of modeling is achieved when students are given opportunities to learn about the predictive nature of some modeling applications. Exploratory studies have shown that significant shifts occur in the modeling conceptions of senior engineering students when taught an explicit modeling intervention. Descriptive-centric conceptions remained prevalent with an additional focus on predictive mathematical models. The following work in progress describes the next steps of our study focused on expanding earlier findings. Student, and additionally faculty conceptions, will be observed to gain a greater understanding of modeling conceptions.", "authors": [{"name": "Adam R. Carberry", "affiliation": "Arizona State University "}, {"name": "Ann F. McKenna", "affiliation": "Arizona State University"}], "tags": ["adaptation models", "computational modeling", "engineering students", "analytical models", "context modeling", "mathematical model"]}, {"title": "Student reflections as an influence in the dynamics of an introductory programming course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142761", "abstract": "Learning computer programming is known to be difficult for many students. In the context of a wider study, which aims to design a pedagogical strategy for introductory programming, we decided to use some less conventional activities. This strategy was applied in the last three academic years with some success. In this paper we will discuss a component that proved very relevant, the biweekly reflections we asked the students to write during the course. They were expected to reflect on the course, the different activities, their learning, the difficulties felt, and any other aspect they considered important. The analysis of the texts written gave the teacher several hints that lead to some successful individual interventions. From a research point of view this analysis gave also some important clues to the refinement of our pedagogical strategy.", "authors": [{"name": "Antonio J. Mendes", "affiliation": "University of Coimbra "}, {"name": "Antonio D. Figueiredo", "affiliation": "University of Coimbra"}, {"name": "Scheila W. Martins", "affiliation": "University of Coimbra "}], "tags": ["cities and towns", "conferences", "materials", "context", "programming profession", "reflection"]}, {"title": "The use of concept maps in Computer Engineering education to promote meaningful learning, creativity and collaboration", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142762", "abstract": "Concept maps are graphical tools for organizing and representing knowledge. The fundamentals of concept mapping are in Ausubel's learning theory which is based on the assumption that meaningful learning occurs when the new concepts are linked to familiar concepts existing in the learner's cognitive structure. Creativity can be seen as a very high level of meaningful learning. Database Principles is a compulsory subject studied in the second year of the Computer Engineering degree at the University of the Basque Country UPV/EHU. The study presented in the paper was designed pursuing a twofold goal: (1) to introduce engineering students the Concept Mapping technique as a way to promote meaningful learning, and (2) to involve engineering students in both a creative and collaborative learning experience using concept maps. Final exam marks showed significant statistical differences among the experimental group and the control group. In addition, participants admitted that the use of the concept mapping technique to fulfill the objectives of this study is applicable to other domains, situations and problems.", "authors": [{"name": "Ana Arruarte", "affiliation": "Computer Languages and Systems Department, University of the Basque Country UPV/EHU "}, {"name": "Angel Conde", "affiliation": "Computer Languages and Systems Department, University of the Basque Country UPV/EHU"}, {"name": "Jon A. Elorriaga", "affiliation": "Computer Languages and Systems Department, University of the Basque Country UPV/EHU "}, {"name": "Inaki Calvo", "affiliation": "Computer Languages and Systems Department, University of the Basque Country UPV/EHU "}, {"name": "Mikel Larranaga", "affiliation": "Computer Languages and Systems Department, University of the Basque Country UPV/EHU "}], "tags": ["cities and towns", "computers", "databases", "engineering students", "software", "collaboration", "educational institutions"]}, {"title": "Work in progress — Course development of programming for general-purpose multicore processors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142763", "abstract": "This paper presents the course development activities on multicore programming at the Electrical and Computer Engineering Department of Virginia Commonwealth University. As multicore processors have become the main stream computing platform, it becomes a necessity to teach undergraduate on programming for multicore processors. This paper gives details information about the multicore programming course developed at VCU, including the course modules and a brief introduction of the labs.", "authors": [], "tags": ["computers", "multicore processing", "programming profession", "instruction sets"]}, {"title": "Visualizing conductive and convective heat transfer using thermographic techniques", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142764", "abstract": "This work explores the educational applications of thermography in teaching conductive and convective heat transfer concepts to undergraduate students. Thermography helps students effectively visualize heat transfer phenomena particularly in two and three dimensions. Experiments were designed to demonstrate one-dimensional heat transfer in metal rods, two dimensional heat transfer in a metal plate subject to given boundary conditions and convective heat transfer in fluid. The data obtained through these experiments, including thermal imaging video clips, was made available to students enrolled in instrumentation and physics courses. Using these thermographic data, students could physically observe heat transfer phenomena that otherwise would have been difficult to visualize.", "authors": [{"name": "Sanjeev Arora", "affiliation": "Fort Valley State University "}, {"name": "James E. Glover", "affiliation": "Fort Valley State University"}, {"name": "Masoud Naghedolfeizi", "affiliation": "Fort Valley State University "}], "tags": ["temperature measurement", "metals", "temperature distribution", "heating", "cameras", "heat transfer"]}, {"title": "Work in progress — Student task interpretation, design planning, and cognitive strategies in engineering design project: An exploratory study for Grades 9–12", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142765", "abstract": "This work in progress evaluates Grades 9-12 students' self-regulated learning (SRL) strategies during an engineering design project. The specific focus of this study is on student task interpretation and its relation to planning and cognitive strategies in engineering design activity. The two research questions guiding this study are: (1) to what degree does students' interpretation of the design task is reflected on their working plans and selected cognitive strategies? and (2) how those strategies relate to students' design performance? The subjects for this study are selected from students enrolled in the Architectural and Robotic design classes at a high school in Colorado this spring 2011 semester. Thirty students are expected to participate in the study. Survey questionnaire and Web-based engineering design journal writing will be used to capture students' metacognition. Students' perception about task interpretation, planning, cognitive, and self-regulating strategies, and performance criteria will be collected through the questionnaire. Except for the performance criteria, data for these metacognitive variables will also be collected through students' engineering design journal. A rubric will be used for the teacher to grade the students' design performance. Descriptive statistics and graphical views will be used to analyze the survey. Scoring rubric will be used to analyze journal entries.", "authors": [{"name": "Oenardi Lawanto", "affiliation": "Utah State University"}], "tags": ["cities and towns", "problem-solving", "planning", "educational institutions", "context", "psychology"]}, {"title": "An automatic correction tool that can learn", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142766", "abstract": "The majority of Computer Based Assessment (CBA) environments have been designed for fixed-response questions. This feature is not enough for the university context since not all the skills can be reduced to this typology of questions and free response exercises are required. In this paper, we present a web-based tool designed to automatically correct exercises that require a diagram or a graph to be solved. The main novelty of this tool is the strategy used for the correction. The tool starts without the knowledge about correct and incorrect solutions and then learns about the solutions provided by teachers and students. It automatically records the information of all entered solutions, the teacher correction and the corresponding feedback in a system database. When a new student solution is entered the information of the database is used for correction. The main components of the tool are the graph editor module, designed to support diagram drawing, and the correction module, which corrects the solutions entered by the students. These modules are integrated in a more general e-learning platform denoted ACME. ACME provides teachers all functionalities required for student work tracking, assessment, personalized attention, etc. The proposed tool has been evaluated on experimental group.", "authors": [{"name": "Ferran Prados", "affiliation": "University of Girona, Spain "}, {"name": "Jordi Poch", "affiliation": "University of Girona, Spain"}, {"name": "Josep Soler", "affiliation": "University of Girona, Spain "}, {"name": "Imma Boada", "affiliation": "University of Girona, Spain "}], "tags": ["computers", "cities and towns", "unified modeling language", "conferences", "databases", "educational institutions", "electronic learning"]}, {"title": "Results from a pilot survey of engineering and engineering technology students in 2-year and 4-year institutions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142767", "abstract": "Taking full advantage of community colleges as sources of science and engineering majors is a critical component of U.S. science and technology policy. Although data are available on the number of degree recipients in engineering and engineering technology (e/et) at the associate's degree level, there are not reliable data on either the number of community college students who intend to transfer to baccalaureate e/et programs or the number who successfully make the transition. As a first step in examining this issue, the current project is a pilot study with a purposeful sample of 35 community colleges and 15 engineering colleges in the U.S. The survey of the identified institutions is completed. Institutions provided information on the number and demographic information of students who have or will transfer to four-year e/et programs. Issues with data collection and results are discussed.", "authors": [], "tags": ["cities and towns", "communities", "conferences", "educational institutions", "engineering education", "data models"]}, {"title": "Work in progress — The evaluation tools database for assessing engineering education innovations", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142768", "abstract": "This paper describes a one-year project that addresses a national need to build the evaluation capacity of engineering educators to effectively evaluate engineering education programs, projects, and innovations. The project goal was to lay the foundation for the construction of an inventory of evaluation tools that could be used as part of evaluation by engineering educators. Project leaders conducted a search through ten years of archived literature to identify existing evaluation tools. An initial database was developed to document a variety of characteristics about the tools. A panel of stakeholders was assembled to assist in the review of tools and the structure of the database. Recommendations for refinement, further development, and dissemination of the inventory were offered by the panel and are documented in this paper.", "authors": [{"name": "Denny Davis", "affiliation": "Washington State University "}, {"name": "Mo Zhang", "affiliation": "Washington State University"}, {"name": "Jennifer E. LeBeau", "affiliation": "Washington State University "}, {"name": "Michael S. Trevisan", "affiliation": "Washington State University "}], "tags": ["lead", "conferences", "databases", "educational institutions", "engineering education", "teamwork"]}, {"title": "Teaching a service learning introductory engineering course — Lessons learned and improvements made", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142769", "abstract": "This paper describes the format of an introductory engineering course that applies service learning teaching pedagogy. The semester-long service learning project consists of mentoring elementary and middle school students during an eight week long LEGO robotics competition that is annually held at Texas Tech University in Lubbock, Texas. The service learning section is currently being offered for the second time by the same instructor and this paper describes adjustments that were made resulting out of the experiences during the first year.", "authors": [{"name": "Tanja Karp", "affiliation": "Texas Tech University"}], "tags": ["employee welfare", "educational robots", "educational institutions", "games", "gears", "robot sensing systems"]}, {"title": "Utilizing topic modeling techniques to identify the emergence and growth of research topics in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142770", "abstract": "In this paper we present findings from a project that used topic modeling and associated techniques to chart the emergence and growth of research topics in engineering education research over 9 years, from 2000-2008. As a field engineering education research has undergone significant changes over the past decade. There has been an increase in the number of scholars and practitioners involved in the field, particularly those that are applying rigorous research principles to advance understanding of engineering education. In such a circumstance, it is important to understand the topics, approaches, and ideas that have caught the imagination of people in the community. Since this nature of work has not been done in relation to engineering education research, a significant part of the effort described here is innovative and exploratory in nature where different techniques were tested with the goal to collect a diversity of topics that are of interest to the community. We identify major categories of topics and primary topics of interest to the community. We also identify a lack of engagement with theoretical and analytical ideas as an area of concern.", "authors": [], "tags": ["communities", "hidden markov models", "analytical models", "frequency control", "engineering education", "data models"]}, {"title": "Work in progress — Student learning as a function of attendance in large engineering classes", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142771", "abstract": "This study documents an alternative for freshman engineering students to attending a large lecture in their introductory engineering course. In the fall semester students are required to be physically present in lecture. In the spring semester students are given the option of either being physically present, when the lecture is given, or viewing the recorded lecture. Attendance is recorded in the lecture with an iClicker™. Students, who choose to not attend lecture can access the recording on Blackboard™ during the same week the lecture is given. The study compares student performance on first semester midterm exam grades with student performance on second semester midterm exam grades. It is seen that students, as a group, tend to achieve the same midterm grade whether they attend the lecture, when it is given, or not. Lecture assignment completion rates are also compared to lecture attendance. Suggestions for further study are given.", "authors": [{"name": "Michael Elmore", "affiliation": "Binghamton University, State University of New York, Binghamton, NY USA 13902-6000 "}, {"name": "Koenraad Gieskes", "affiliation": "Binghamton University, State University of New York, Binghamton, NY USA 13902-6000"}], "tags": ["conferences", "engineering students", "educational institutions", "materials", "springs"]}, {"title": "Assessing the impact of faculty advising and mentoring in a project-based learning environment on student learning outcomes, persistence in engineering and post-graduation plans", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142772", "abstract": "In 2000, we introduced an undergraduate engineering curricular option to serve as an alternative to the traditional two-semester senior capstone experience, and intended to better meet the needs of students and industry. Initially funded through NSF, this program offers teams of students from varied disciplines the opportunity to work for several years in a business-like setting solving real-world problems supplied by industry. This program has converted the traditional classroom into a multi-year, interdisciplinary, experiential learning environment, and the role of instructor from one who imparts knowledge to that of mentor, guiding students as they discover and apply knowledge. The program is now self-sustaining and successfully attracts and retains STEM-discipline students, making them more marketable to employers upon graduation. Under NSF's IEECI program, we undertook a study to determine whether participation in such a project-based learning environment, together with the redefined role of faculty mentors, are positively correlated to student education outcomes. One measurement tool used to capture student perceptions was a modified form of the Academic Pathways of People Learning Engineering Survey (APPLES), to look at contributors to students' persistence in engineering. In this paper, we will share the results of the APPLES survey component of our study as related to the faculty mentor role and project-based team learning environments.", "authors": [{"name": "Valorie Troesch", "affiliation": "Michigan Technological University"}, {"name": "Mary Raber", "affiliation": "Michigan Technological University "}, {"name": "Susan Amato-Henderson", "affiliation": "Michigan Technological University "}], "tags": ["engineering profession", "employee welfare", "industries", "conferences", "particle measurements", "instruments", "education"]}, {"title": "Tablet PC use in freshman mathematics classes promotes STEM retention", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142773", "abstract": "Tablet PCs are standalone personal computers with touch-sensitive screens that serve as the primary input device. The interface between the user and the computer depends on contact between the surface of the screen and a finger or stylus, a pen-like instrument designed to enable users to write directly on the screen. Tablet PCs are fully functional laptop computers that have conventional PC operating systems and applications. The use of Tablet PCs and other tablet technologies in educational settings has increased tremendously over the past decade and now many reports describing classroom applications of Tablet PCs appear in the literature. While some studies have described implementations of Tablet PCs in undergraduate education, few have specifically examined the impact of Tablet PCs on student performance and retention in the sciences and engineering. To address the paucity of data about the effects of Tablet PC use in undergraduate education, we have implemented a longitudinal student tracking study to better understand the impact of this technology on students. The most important finding is that students who began their undergraduate mathematics education in Tablet PC classes were more likely to continue their science and engineering studies than were their peers who took non-Tablet PC courses during their first semester of college.", "authors": [{"name": "Carla A. Romney", "affiliation": "Boston University, Metropolitan College, Science and Engineering Program, Boston, MA 02215"}], "tags": ["tablet computers", "educational institutions", "calculus", "materials", "algebra", "springs"]}, {"title": "Mobile laboratory programs as vehicles to promote STEM education in K-12 and beyond", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142774", "abstract": "Mobile laboratories refer to self-contained, traveling laboratories that accommodate student participation in hands-on laboratory science aboard the mobile laboratory unit. Most of the mobile laboratory programs that are now in operation focus on providing middle and high school students and teachers with access to science equipment and supplies that are difficult for them to acquire and maintain. In addition, many of the mobile laboratory programs provide inquiry-based curricular materials that are engaging, substantive, and thought provoking. Further, since mobile laboratories are completely self-sustained and can travel to urban and rural locations that are often educationally and economically disadvantaged, they provide equal access to state-of the art learning opportunities. The use of mobile laboratories is an innovative way to transform science teaching and learning, particularly in the pre-college setting. While many of the mobile laboratory programs now in operation focus on the biological sciences, we believe that these programs can be adapted to broader applications in STEM education. Mobile laboratories have the potential to offer powerful and unique ways to engage and inspire future scientists and engineers. These “vehicles” may pique the curiosity of students and motivate them to continue their study of science in high school and beyond. As such, mobile science laboratories may contribute to increasing the number of students who become science-literate citizens and members of the science workforce.", "authors": [], "tags": ["cities and towns", "laboratories", "cognition", "conferences", "educational institutions", "mobile communication"]}, {"title": "Work in progress — Why are most underrepresented groups even more underrepresented in a vehicle design program?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142775", "abstract": "Minority groups, especially females, provide a large pool of talent which is largely underrepresented in the engineering workplace. The purpose of this study is to determine the factors that cause students to choose an engineering technology major, and more specifically, a vehicle design major in an engineering technology program, to help infer why minority groups are not choosing it. Preliminary data analysis shows that this particular program is well below the national average for nearly all underrepresented groups in engineering technology programs. The data does not indicate that a significant retention problem exists within this program; rather it is most likely an initial recruitment problem. Recognizing that some underrepresented groups are represented to an even lesser degree in engineering technology programs than in engineering programs may shed some light on this problem. Through the use of student and alumni surveys and interviews, this study will attempt to determine why students are choosing the vehicle design major and how they perceive the program in several areas to provide insight as to why underrepresented groups are not entering and finishing this major at nationally equivalent levels. It will also attempt to determine if common influencing factors exist for students choosing the vehicle design major.", "authors": [{"name": "Janet M. Braun", "affiliation": "Department of Engineering Technology, College of Sciences and Technology Western Washington University, Bellingham, WA 98225"}], "tags": ["computer aided manufacturing", "cities and towns", "conferences", "interviews", "design automation", "educational institutions", "vehicles"]}, {"title": "Demo program for teaching the characteristics of low-pass IIR filters", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142776", "abstract": "Demo programs that illustrate concepts with visual aids, become the important tools in the field of engineering education. They help students to learn better, remember longer, and better identify the appropriate concepts. Another benefit of the demo programs is, that they can be used as a complementary tool in the traditional classes in the classroom, to visualize and improve understanding of the presented subject. To this end here is presented the demo program for teaching the principal characteristics of digital IIR (Infinite impulse response) filters: Butterwort, Chebyshev I, Chebyshev II, and Elliptic filters. The program was implemented in MATLAB using MATLAB tool makeshow which has different favorable characteristics. First it is demonstrated how the analog filters can be converted into digital IIR filters using impulse invariance and bilinear transforms. The goal is to visualize the advantages of the bilinear transform. Next goal was to visualize the comparison of different above mentioned IIR filters in terms of complexity, magnitude and phase responses. The program can be also used as a self-study tool for the classes on the fundamentals of digital signal processing at the graduate level. The student validation of the program is also included.", "authors": [{"name": "Gordana Jovanovic Dolecek", "affiliation": "Institute Inaoe"}], "tags": ["digital filters", "transforms", "iir filters", "chebyshev approximation", "visualization", "education", "matlab"]}, {"title": "Mini workshop — Innovation for a crowded curriculum: Learning modules for tomorrow's energy engineers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142777", "abstract": "As energy technology evolves to meet demands for development and ecological sustainability, engineers need to have up-to-date skills and knowledge to meet the creative challenges our energy problems demand. However, current engineering thermodynamics textbooks are grounded in historical developments of the steam engine in Europe and subsequent fossil fuel technologies. A set of course modules has been designed to take a fresh look at the engineering knowledge and skills required for current and emerging energy challenges. Stand-alone modules facilitate integration with existing courses and curricula and are adaptable to a variety of settings. Modules employ innovative engineering pedagogies that foster student engagement. Because energy engineers will need the full range of capabilities outlined in ABET's learning outcomes, modules address outcomes not often addressed in conventional thermodynamics courses: design within realistic social and technical constraints, professional ethics, effective communication, understanding social contexts of engineering, lifelong learning, and a knowledge of contemporary issues. Modules also focus on policy analysis for energy technology selection, and incorporate contributions from the global South. The mini-workshop will demonstrate the use of the modules in core engineering courses. Participants will individually design a plan for implementing a module of their choice in one of their courses.", "authors": [{"name": "Donna Riley", "affiliation": "Smith College"}], "tags": [""]}, {"title": "Serious gaming for experiential learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142778", "abstract": "In Engineering Education, the traditional process of knowledge building was based on one-way (teacher->;student) delivery of information, in classrooms. Students were passive receptors of the teacher's messages. In the past few years, the tendency is to implement active learning paradigms where students are the focus of the educational process. The interaction between teacher and students is more dynamic, enhanced by technological tools and includes rich content and flexible activities. The integration of Virtual Environments in Engineering Education allows new and innovative learning methods and is, therefore, a contribution to these new paradigms. This article presents the instantiation of these learning methods with first year engineering students. In our study, students were involved in simulation/gaming environments related to fundamental physics learning. Afterwards their knowledge was tested and their perception of the relevance of the system was evaluated. Results show that knowledge construction was greatly enhanced and that student's motivation for learning was increased.", "authors": [{"name": "Carlos Vaz de Carvalho", "affiliation": "Graphics, Interaction and Learning Technologies, Instituto Superior de Engenharia do Porto"}, {"name": "Duarte Lopes", "affiliation": "Graphics, Interaction and Learning Technologies, Instituto Superior de Engenharia do Porto "}, {"name": "David Gouveia", "affiliation": "Graphics, Interaction and Learning Technologies, Instituto Superior de Engenharia do Porto "}], "tags": ["friction", "aerodynamics", "games", "haptic interfaces", "context", "education", "force"]}, {"title": "Work in progress — Adapting team-based learning to the first circuit theory course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142779", "abstract": "The purpose of this work-in-progress paper is to report progress made in adapting the learning strategy known as team-based learning for use in the required sophomore-level electric circuit theory course. The project is motivated by the desire to introduce students to self-directed independent learning and to learning in groups early in their programs, both of which concepts are, in theory, provided by team-based learning. Despite the potential benefits, several practical challenges have been encountered while attempting to implement the strategy. These include motivating students to study and learn new material outside of class and before encountering it in the classroom; and motivating them to follow a prescribed model of good group work. The paper describes progress in overcoming these and other challenges, and changes being implemented to improve the approach.", "authors": [{"name": "Robert M. O'Connell", "affiliation": "University of Missouri"}], "tags": ["cities and towns", "computers", "conferences", "materials", "educational institutions", "circuit theory"]}, {"title": "Work in progress — Integrating educational online lab platforms around the iLab Shared Architecture", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142780", "abstract": "", "authors": [], "tags": ["servers", "laboratories", "conferences", "service oriented architecture", "computer architecture", "instruments"]}, {"title": "A comprehensive project utilizing spatial visualization skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142781", "abstract": "", "authors": [], "tags": ["fitting", "materials", "educational institutions", "visualization", "solid modeling"]}, {"title": "Utilizing university research and upper-division course material for an enhanced first-year design experience", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142782", "abstract": "", "authors": [], "tags": ["cities and towns", "laboratories", "aquaculture", "wind turbines", "aerodynamics", "materials", "educational institutions"]}, {"title": "Problem-based learning and adaptive expertise", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142783", "abstract": "", "authors": [], "tags": ["trajectory", "cognition", "conferences", "technological innovation", "educational institutions", "engineering education"]}, {"title": "Tiospaye in Engineering and Science: Inculcating a sustained culture for recruiting, retaining, and graduating American Indian students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142784", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "seminars", "educational institutions", "scholarships", "cultural differences"]}, {"title": "Work in progress — Assessment of a leadership curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142785", "abstract": "", "authors": [], "tags": ["cities and towns", "lead", "reliability", "conferences", "educational institutions", "instruments"]}, {"title": "Improving efficiency in engineering education through asynchronous computer-based instruction", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142786", "abstract": "", "authors": [], "tags": ["educational institutions", "concrete", "boolean algebra", "adders", "springs"]}, {"title": "Improving programming education in Tanzania: Teachers' and students' perceptions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142787", "abstract": "", "authors": [], "tags": ["computers", "conferences", "interviews", "educational institutions", "programming profession"]}, {"title": "Classroom mediated by technology model: A new proposal for education to remote regions of the Amazon", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142788", "abstract": "", "authors": [], "tags": ["cities and towns", "computer aided instruction", "tv", "satellites", "educational institutions", "satellite broadcasting"]}, {"title": "Developing IT education in Tanzania: Empowering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142789", "abstract": "", "authors": [], "tags": ["computers", "cities and towns", "conferences", "interviews", "educational institutions", "internet"]}, {"title": "Activities to infuse sustainability and renewable energy concepts in electrical and computer engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142790", "abstract": "", "authors": [], "tags": ["computers", "laboratories", "conferences", "wind turbines", "educational institutions", "batteries", "renewable energy resources"]}, {"title": "Work in progress — PI2E, towards a Google home page for e-learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142791", "abstract": "", "authors": [], "tags": ["web services", "conferences", "information services", "google", "least squares approximation", "electronic learning"]}, {"title": "Cognitive dissonance during engineering design", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142792", "abstract": "", "authors": [], "tags": ["fluctuations", "project management", "conferences", "problem-solving", "educational institutions", "engineering education"]}, {"title": "Effective evaluation strategies to meet global accreditation requirements", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142793", "abstract": "", "authors": [], "tags": ["monitoring", "cities and towns", "accreditation", "conferences", "educational institutions", "training", "portfolios"]}, {"title": "Work in progress — Design of interactive learning objects for improvement of digital electronics teaching and learning in high school and distance learning universities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142794", "abstract": "", "authors": [], "tags": ["adaptation models", "computer aided instruction", "radiation detectors", "educational institutions", "animation", "visualization", "integrated circuit modeling"]}, {"title": "Comparing the collaborative and independent viewing of program visualizations", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142795", "abstract": "", "authors": [], "tags": ["tutorials", "taxonomy", "collaboration", "materials", "visualization", "programming profession"]}, {"title": "Introducing “Sustainability and Social Commitment” skills in an engineering degree", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142796", "abstract": "", "authors": [], "tags": ["informatics", "conferences", "economics", "proposals", "educational institutions", "materials"]}, {"title": "A take-home exam to assess professional skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142797", "abstract": "", "authors": [], "tags": ["cities and towns", "writing", "conferences", "educational institutions", "teamwork", "principal component analysis"]}, {"title": "Work in progress — Open source usability evaluation: The case of Moodle", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142798", "abstract": "", "authors": [], "tags": ["conferences", "usability", "educational institutions", "materials", "open source software"]}, {"title": "Unifying program-level ABET assessment data collection, analysis, and presentation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142799", "abstract": "", "authors": [], "tags": ["servers", "accreditation", "conferences", "databases", "portals", "materials", "educational institutions"]}, {"title": "Work in progress — United States Coast Guard Academy Robotics on Water competition as recruiting tool — Program enhancement for STEM & diversity outreach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142800", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "educational institutions", "materials", "standardization", "robots"]}, {"title": "Encouraging participation in computer science with CONNECT", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142801", "abstract": "", "authors": [], "tags": ["employee welfare", "cities and towns", "communities", "electronic mail", "conferences", "educational institutions"]}, {"title": "Work in progress — Interdisciplinary international preprofessional service within the first-year engineering curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142802", "abstract": "", "authors": [], "tags": ["cities and towns", "buildings", "engineering students", "proposals", "educational institutions", "medical services", "organizations"]}, {"title": "Work in progress — A transparency and scaffolding framework for computational simulation tools", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142803", "abstract": "", "authors": [], "tags": ["computers", "computational modeling", "data models", "mathematical model", "education", "numerical models", "nanoelectronics"]}, {"title": "Work in progress — Structural art: Encouraging student creativity and artistic expression", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142804", "abstract": "", "authors": [], "tags": ["cities and towns", "communities", "structural engineering", "educational institutions", "bridges", "art"]}, {"title": "Work in progress — An interactive, execution-safe system for teaching e-commerce using real-time feedback", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142805", "abstract": "", "authors": [], "tags": ["cities and towns", "security", "conferences", "weaving", "educational institutions"]}, {"title": "Work in progress — A grand challenge leadership course for engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142806", "abstract": "", "authors": [], "tags": ["lead", "conferences", "engineering students", "ethics", "educational institutions", "training", "business"]}, {"title": "Work in progress — Analysis of misconceptions of engineering technology students about electrical technology concepts. A mixed methods study", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142807", "abstract": "", "authors": [], "tags": ["conferences", "electricity", "cognitive science", "educational institutions", "engineering education", "electrical engineering"]}, {"title": "Global systems: Advancing global competency in an innovative course for sophomores", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142808", "abstract": "", "authors": [], "tags": ["cities and towns", "systematics", "conferences", "economics", "educational institutions", "reflection", "globalization"]}, {"title": "Work in progress — Using the levenshtein distance to examine changes to teams' model-eliciting activity solutions throughout a semester", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142809", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "jacobian matrices", "educational institutions", "mathematical model", "atmospheric modeling", "plagiarism"]}, {"title": "Jump-starting a senior-level capstone project through hands-on laboratory exercises", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142810", "abstract": "", "authors": [], "tags": ["voltage measurement", "laboratories", "wind turbines", "current measurement", "materials", "generators", "batteries"]}, {"title": "Multi-core system education through a hands-on project on FPGAs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142811", "abstract": "", "authors": [], "tags": ["system-on-a-chip", "sdram", "multicore processing", "embedded systems", "field programmable gate arrays", "hardware"]}, {"title": "iGraf: An interactive graphical software for CSET education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142812", "abstract": "", "authors": [], "tags": ["graphics", "software", "least squares approximation", "educational institutions", "calculus"]}, {"title": "Work in progress — A framework for building Interactive Learning Modules", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142813", "abstract": "", "authors": [], "tags": ["buildings", "component architectures", "software", "least squares approximation", "object oriented modeling", "graphical user interfaces", "education"]}, {"title": "Work in progress — Early improvement in report writing skills using critiques", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142814", "abstract": "", "authors": [], "tags": ["cities and towns", "laboratories", "writing", "conferences", "standards", "guidelines", "education"]}, {"title": "Multidiscipline interactions in STEM: Analysis by artifact", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142815", "abstract": "", "authors": [], "tags": ["measurement", "cities and towns", "social network services", "mathematics", "conferences", "standards", "education"]}, {"title": "Comparing design cognition of undergraduate engineering students and high school pre-engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142816", "abstract": "", "authors": [], "tags": ["cognition", "encoding", "engineering students", "educational institutions", "protocols"]}, {"title": "Student empowerment in higher education through participatory evaluation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142817", "abstract": "", "authors": [], "tags": ["cities and towns", "communities", "conferences", "interviews", "context", "reflection", "education"]}, {"title": "Work in progress — STEM collaboration cubed", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142818", "abstract": "", "authors": [], "tags": ["diffusion processes", "informatics", "conferences", "educational institutions", "materials", "computer science"]}, {"title": "Work in progress — Enhancing on-line interaction with graphical tools", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142819", "abstract": "", "authors": [], "tags": ["electronic mail", "graphics", "web sites", "educational institutions", "equations", "cellular phones"]}, {"title": "A first course in Operating Systems with and without rubrics", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142820", "abstract": "", "authors": [], "tags": ["operating systems", "silicon", "interviews", "programming", "educational institutions"]}, {"title": "Distributed systems design supported by reflective writing and CATs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142821", "abstract": "", "authors": [], "tags": ["communities", "unified modeling language", "writing", "programming", "cats", "educational institutions"]}, {"title": "Using Virtual Worlds in distance learning environments", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142822", "abstract": "", "authors": [], "tags": ["servers", "three dimensional displays", "conferences", "second life", "educational institutions", "generators"]}, {"title": "Security planning for small businesses: A service-learning course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142823", "abstract": "", "authors": [], "tags": ["communities", "security", "planning", "materials", "organizations", "standards organizations"]}, {"title": "Identifying cognitive abilities to improve CS1 outcome", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142824", "abstract": "", "authors": [], "tags": ["computers", "cognition", "conferences", "interviews", "programming profession", "education"]}, {"title": "Work in progress — Design and delivery of the graduate course on electronic systems integration", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142825", "abstract": "", "authors": [], "tags": ["circuit simulation", "computers", "system analysis and design", "printed circuits", "software", "educational institutions", "layout"]}, {"title": "Effects of design education on design cognition: A preliminary study of a sophomore design course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142826", "abstract": "", "authors": [], "tags": ["syntactics", "cognition", "encoding", "statistical analysis", "education", "protocols", "ontologies"]}, {"title": "Work in progress — An immersion course concentration in mobile web computing", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142827", "abstract": "", "authors": [], "tags": ["mobile computing", "mobile communication", "mobile handsets", "programming profession", "education", "data privacy"]}, {"title": "Work in progress — Engineering pathways study: The college-career transition", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142828", "abstract": "", "authors": [], "tags": ["engineering profession", "conferences", "engineering students", "interviews", "educational institutions", "instruments"]}, {"title": "Work in progress — Match or mismatch? the teaching and learning of teamwork and communication skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142829", "abstract": "", "authors": [], "tags": ["writing", "conferences", "interviews", "educational institutions", "engineering education", "teamwork"]}, {"title": "Use of LMS functionalities in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142830", "abstract": "", "authors": [], "tags": ["electronic mail", "conferences", "web sites", "least squares approximation", "training", "electronic learning"]}, {"title": "Work in progress — Development and practice of national colleges of technology version embedded technology skill standards", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142831", "abstract": "", "authors": [], "tags": ["servers", "industries", "standards", "data visualization", "educational institutions", "materials"]}, {"title": "Applying a assessment tool in distance learning education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142832", "abstract": "", "authors": [], "tags": ["laboratories", "databases", "courseware", "software", "least squares approximation", "educational institutions", "electronic learning"]}, {"title": "Timeline-based authoring tool for e-Textbook: Bringing the “mind-mapped learning model”", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142833", "abstract": "", "authors": [], "tags": ["conferences", "electronic publishing", "software", "educational institutions", "prototypes", "xml"]}, {"title": "Work in progress — The process of evaluating the impact of an international experience on students' global engineering skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142834", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "conferences", "engineering students", "educational institutions", "cultural differences"]}, {"title": "Work in progress — A framework for assessing the impact of instructional technology on the nature of teaching and learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142835", "abstract": "", "authors": [], "tags": ["cities and towns", "systematics", "conferences", "technological innovation", "educational institutions", "materials"]}, {"title": "Informal learning in engineering education: Where we are — Where we need to go", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142836", "abstract": "", "authors": [], "tags": ["cities and towns", "communities", "educational institutions", "engineering education", "remuneration", "instruments"]}, {"title": "A system for forecasting student performance based on course evaluation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142837", "abstract": "", "authors": [], "tags": ["adaptation models", "cities and towns", "topology", "network topology", "conferences", "analytical models", "predictive models"]}, {"title": "Patents and intellectual property in entrepreneurship education in computing at Hofstra University", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142838", "abstract": "", "authors": [], "tags": ["technological innovation", "law", "innovation management", "educational institutions", "patents"]}, {"title": "Women and higher engineering education — Choosing one's degree program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142839", "abstract": "", "authors": [], "tags": ["engineering profession", "mathematics", "conferences", "educational institutions", "materials", "engineering education"]}, {"title": "Cooperative learning: Lessons and insights from thirty years of championing a research-based innovative practice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142840", "abstract": "", "authors": [], "tags": ["communities", "conferences", "technological innovation", "educational institutions", "history", "engineering education"]}, {"title": "Work in progress — The role of working memory and epistemic beliefs on open-ended problem solving", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142841", "abstract": "", "authors": [], "tags": ["atmospheric measurements", "particle measurements", "engineering students", "problem-solving", "interviews", "educational institutions", "materials"]}, {"title": "Work in progress — Elassys: Online tool for teamwork analysis and assessment in software engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142842", "abstract": "", "authors": [], "tags": ["joints", "ieee computer society", "software engineering", "software", "educational institutions", "teamwork"]}, {"title": "A comparative study of academic partnerships from a student perspective", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142843", "abstract": "", "authors": [], "tags": ["communities", "industries", "software engineering", "educational institutions", "collaboration", "organizations", "standards organizations"]}, {"title": "Special session — Connecting and expanding the emerging engineering education research (EER) and engineering education innovation (EEI) communities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142844", "abstract": "", "authors": [], "tags": [""]}, {"title": "New pedagogic challenges in engineering education and the answer of IGIP", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142845", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "educational institutions", "engineering education", "knowledge engineering", "mobile communication"]}, {"title": "Work in progress — Courses dedicated to the development of logical and algorithmic thinking", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142846", "abstract": "", "authors": [], "tags": ["algorithm design and analysis", "cognition", "problem-solving", "software algorithms", "educational institutions", "computer science"]}, {"title": "Group-work tutorials for an introductory materials engineering course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142847", "abstract": "", "authors": [], "tags": ["mechanical factors", "copper", "tutorials", "materials", "steady-state", "visualization"]}, {"title": "Understanding physical models in design cognition: A triangulation of qualitative and laboratory studies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142848", "abstract": "", "authors": [], "tags": ["measurement", "buildings", "cognition", "conferences", "cognitive science", "testing", "data models"]}, {"title": "An agile boot camp: Using a LEGO®-based active game to ground agile development principles", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142849", "abstract": "", "authors": [], "tags": ["cities and towns", "industries", "conferences", "software engineering", "programming", "education", "business"]}, {"title": "Work in progress — Implementing and evaluating efforts to engage interdisciplinary teams to solve real-world design challenges", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142850", "abstract": "", "authors": [], "tags": ["industries", "biomedical engineering", "awards activities", "educational institutions", "collaboration", "materials"]}, {"title": "Success factors for students transferring into undergraduate engineering degree programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142851", "abstract": "", "authors": [], "tags": ["engineering profession", "communities", "engineering students", "encoding", "problem-solving", "interviews", "educational institutions"]}, {"title": "Work in progress — Software residency: A contribution for professional maturity", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142852", "abstract": "", "authors": [], "tags": ["companies", "industries", "standards", "software engineering", "programming", "software"]}, {"title": "Work in progress — How to provoke creativity and innovation within the classroom by modifying the role of faculty", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142853", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "technological innovation", "educational institutions", "atmospheric modeling", "electronic learning"]}, {"title": "Preparing for future data center professionals: Integrating storage technology into the Computer Information Technology curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142854", "abstract": "", "authors": [], "tags": ["servers", "universal serial bus", "storage area networks", "cloud computing", "protocols", "drives"]}, {"title": "Work in progress — Teaching engineering concepts to liberal arts students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142855", "abstract": "", "authors": [], "tags": ["laboratories", "economics", "educational institutions", "safety", "production", "art"]}, {"title": "Work in progress — Introducing Solar Energy Engineering in an Australian middle elementary school", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142856", "abstract": "", "authors": [], "tags": ["solar energy", "cities and towns", "conferences", "physics", "educational institutions", "australia"]}, {"title": "Special session — Attracting and supporting military veterans in engineering programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142857", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Sustainability and senior design at the University of San Diego", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142858", "abstract": "", "authors": [], "tags": ["laboratories", "temperature sensors", "industries", "logistics", "educational institutions", "electrical engineering"]}, {"title": "Acquiring professional skills: Virtual facilitator as model for team communication", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142859", "abstract": "", "authors": [], "tags": ["cities and towns", "communities", "lead", "conferences", "software", "educational institutions", "teamwork"]}, {"title": "A grounded theory approach to effects of virtual facilitation on team communication and the development of professional skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142860", "abstract": "", "authors": [], "tags": ["conferences", "encoding", "virtual groups", "educational institutions", "face", "testing", "teamwork"]}, {"title": "Mini workshop — P — 12 engineering education: Using Engineering Teaching Kits to address student misconceptions in science", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142861", "abstract": "", "authors": [], "tags": [""]}, {"title": "Mini workshop — Aligning content, assessment, and pedagogy in the design of engineering courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142862", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Alternative interfaces for e-learning platforms used in remote areas", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142863", "abstract": "", "authors": [], "tags": ["multimedia communication", "cities and towns", "least squares approximation", "digital tv", "education", "internet"]}, {"title": "Work in progress — Live programming learning objects repository", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142864", "abstract": "", "authors": [], "tags": ["algorithm design and analysis", "problem-solving", "educational institutions", "programming profession", "process control"]}, {"title": "A quantitative study of the impact of automated facilitation on engineering student dyadic task completion", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142865", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "engineering students", "technological innovation", "problem-solving", "google"]}, {"title": "Accountability and the use of classroom response devices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142866", "abstract": "", "authors": [], "tags": ["cities and towns", "portable computers", "conferences", "atmospheric measurements", "google", "materials", "stress"]}, {"title": "A qualitative analysis for the facilitation of innovative problem completion amongst dyads of engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142867", "abstract": "", "authors": [], "tags": ["cities and towns", "systematics", "conferences", "problem-solving", "google", "collaboration", "educational institutions"]}, {"title": "Work in progress — Item retrieval system in distributed repositories to generate adaptive assessments supported in items response theory (.IRTT)", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142868", "abstract": "", "authors": [], "tags": ["adaptation models", "cities and towns", "unified modeling language", "conferences", "mathematical model", "context", "adaptive systems"]}, {"title": "A two-channel bioamplifier design as a cross-course experience", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142869", "abstract": "", "authors": [], "tags": ["connectors", "cities and towns", "laboratories", "conferences", "switches", "biosensors", "band pass filters"]}, {"title": "Work in progress — Higher-level-learning enhancements to online assignments in an electrical engineering linear systems course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142870", "abstract": "", "authors": [], "tags": ["linear systems", "frequency domain analysis", "fourier series", "interviews", "materials", "time domain analysis", "education"]}, {"title": "Work in progress — Soil watering systems as teaching materials for technology education in junior high schools", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142871", "abstract": "", "authors": [], "tags": ["soil", "soil measurements", "educational institutions", "materials", "programming profession"]}, {"title": "Enabling scalability, richer experiences and ABET-accreditable learning outcomes in computer science Capstone courses through inversion of control", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142872", "abstract": "", "authors": [], "tags": ["employee welfare", "industries", "conferences", "software engineering", "educational institutions", "organizations", "springs"]}, {"title": "Work in progress — Web penetration testing: Effectiveness of student learning in Web application security", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142873", "abstract": "", "authors": [], "tags": ["computer crime", "conferences", "google", "computer hacking", "testing", "education"]}, {"title": "Teaching students software engineering practices for micro-teams", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142874", "abstract": "", "authors": [], "tags": ["knowledge transfer", "documentation", "software engineering", "software", "programming profession", "education"]}, {"title": "Work in progress — Cognitive scaffolding in contemporary computer documentation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142875", "abstract": "", "authors": [], "tags": ["multimedia communication", "documentation", "usability", "materials", "educational institutions", "context", "psychology"]}, {"title": "Special session — Cognitive processes critical for ill-defined problem solving: Linking theory, research, and classroom implications", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142876", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Identity development of first-year engineering students through a summer college prep program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142877", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "conferences", "engineering students", "educational institutions", "design methodology"]}, {"title": "Work in progress — An agile embedded systems design capstone course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142878", "abstract": "", "authors": [], "tags": ["electrostatic discharges", "computers", "project management", "prototypes", "embedded systems", "hardware"]}, {"title": "Ultra-low power and the millennium generation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142879", "abstract": "", "authors": [], "tags": ["laboratories", "materials", "microcontrollers", "microcomputers", "assembly", "education", "internet"]}, {"title": "Work in progress — The iCollaborate MSE project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142880", "abstract": "", "authors": [], "tags": ["collaborative work", "collaboration", "materials", "educational institutions", "engineering education", "portable media players"]}, {"title": "Examining the impact of mathematics identity on the choice of engineering careers for male and female students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142881", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "loading", "mathematical model", "engineering education"]}, {"title": "Connecting reality with theory — An approach for creating integrative industry case studies in the software engineering curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142882", "abstract": "", "authors": [], "tags": ["conferences", "libraries", "software engineering", "software", "materials", "context", "education"]}, {"title": "Fostering lifelong learning in a capstone design environment: An implementation assessment", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142883", "abstract": "", "authors": [], "tags": ["cities and towns", "industries", "conferences", "materials", "mechanical engineering", "engineering education"]}, {"title": "Work in progress — An innovative design of a Master in Computer Science program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142884", "abstract": "", "authors": [], "tags": ["computers", "mobile computing", "security", "conferences", "education", "computer science", "internet"]}, {"title": "Work in progress — Assessing cognitive skills in asynchronous online discussion: A case study of Student Centered E-Learning Environment in Indonesia", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142885", "abstract": "", "authors": [], "tags": ["educational institutions", "mathematics", "programming profession", "electronic learning"]}, {"title": "Implementing nanotechnology education in the high school classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142886", "abstract": "", "authors": [], "tags": ["consumer products", "educational institutions", "materials", "nanobioscience", "nanoscale devices"]}, {"title": "Work in progress — Does the marketing of engineering courses through pedagogical differentiation matter?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142887", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "educational institutions", "mechanical engineering", "engineering education", "australia"]}, {"title": "Work in progress — What attracts students to the study of engineering? perceptions and motivations", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142888", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "conferences", "educational institutions", "engineering education", "australia"]}, {"title": "Teaching object-oriented software design within the context of software frameworks", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142889", "abstract": "", "authors": [], "tags": ["androids", "humanoid robots", "software", "educational institutions", "object oriented modeling", "games", "computer science"]}, {"title": "Work in progress — The Rod-Spring approximation: An intuitive approach to the best-fit least-squares linear approximation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142890", "abstract": "", "authors": [], "tags": ["educational institutions", "equations", "mathematical model", "torque", "data models", "force", "springs"]}, {"title": "Work in progress — Engineering's Grand Challenges: An analysis of student viewpoints", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142891", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "engineering students", "educational institutions", "robots", "safety", "fuels"]}, {"title": "On providing successful Research Experiences for Undergraduates", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142892", "abstract": "", "authors": [], "tags": ["employee welfare", "conferences", "proposals", "planning", "software", "educational institutions", "computer science education"]}, {"title": "An analysis of DC circuit theory content in an engineering textbook: Presentation features, conceptual content, and use of analogies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142893", "abstract": "", "authors": [], "tags": ["voltage measurement", "electricity", "encoding", "analytical models", "context modeling", "electric potential", "context"]}, {"title": "Work in progress — Developing a hands-on course on network science", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142894", "abstract": "", "authors": [], "tags": ["measurement", "analytical models", "data analysis", "educational institutions", "mathematical model", "transportation", "data models"]}, {"title": "A social-based meta-multidisciplinary framework to motivate the creation of a new generation of electronics 2.0 systems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142895", "abstract": "", "authors": [], "tags": ["cities and towns", "technological innovation", "innovation management", "proposals", "ethics", "prototypes"]}, {"title": "Evaluation of a ten year life planning assignment for an Academic Scholarship Success Class", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142896", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "planning", "educational institutions", "scholarships", "computer science"]}, {"title": "Work in progress — Intervening to improve the dissertation of final year engineering research projects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142897", "abstract": "", "authors": [], "tags": ["cities and towns", "surface treatment", "writing", "conferences", "context", "high definition video", "education"]}, {"title": "Work in progress — Exercises in Squeak Smalltalk for pre-college education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142898", "abstract": "", "authors": [], "tags": ["conferences", "encoding", "tutorials", "educational institutions", "programming profession"]}, {"title": "Perspectives on leadership concepts by engineering academics", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142899", "abstract": "", "authors": [], "tags": ["lead", "industries", "conferences", "interviews", "educational institutions", "context"]}, {"title": "The challenge of embedding Information Literacy as a graduate attribute into engineering and technology courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142900", "abstract": "", "authors": [], "tags": ["cities and towns", "control theory", "libraries", "databases", "standards", "materials", "australia"]}, {"title": "Facing computer science misconceptions: An introductory course based on historical strands and career paths at a glance", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142901", "abstract": "", "authors": [], "tags": ["engineering profession", "computers", "conferences", "educational institutions", "programming profession"]}, {"title": "Towards flexibility on IMS Learning Design scripts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142902", "abstract": "", "authors": [], "tags": ["electronic publishing", "conferences", "information services", "materials", "collaboration", "education", "internet"]}, {"title": "Work in progress — LOM4CE: LOM for the Content Ecosystem", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142903", "abstract": "", "authors": [], "tags": ["conferences", "standards", "ecosystems", "semantics", "context", "electronic learning"]}, {"title": "Student perspectives on learning through developing software for the real world", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142904", "abstract": "", "authors": [], "tags": ["lead", "conferences", "programming", "software", "educational institutions", "teamwork"]}, {"title": "Frontiers of engineering: Opportunity and challenges", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142905", "abstract": "", "authors": [], "tags": ["conferences", "humans", "educational institutions", "engineering education", "globalization", "business"]}, {"title": "Developing the next generation of entrepreneurs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142906", "abstract": "", "authors": [], "tags": ["companies", "innovation management", "educational institutions", "patents", "computer science"]}, {"title": "Human side of engineering: Dealing with complex and ethical challenges", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142907", "abstract": "", "authors": [], "tags": ["conferences", "technological innovation", "humans", "educational institutions", "engineering education", "knowledge engineering"]}, {"title": "A novel pedagogical tool integrating sustainability competence into engineering degrees", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142908", "abstract": "", "authors": [], "tags": ["laboratories", "humans", "educational institutions", "java", "mathematical model", "biological system modeling"]}, {"title": "Developing case modules for teaching software engineering and computer science concepts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142909", "abstract": "", "authors": [], "tags": ["analytical models", "software engineering", "programming", "software", "materials", "dh-hemts", "education"]}, {"title": "Wow! linear systems and signal processing is fun!", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142910", "abstract": "", "authors": [], "tags": ["linear systems", "convolution", "mathematical model", "band pass filters", "matlab", "finite impulse response filter"]}, {"title": "‘Green’ remote laboratory for Chemical Engineering Degree: A new paradigm for training", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142911", "abstract": "", "authors": [], "tags": ["remote laboratories", "chemicals", "educational institutions", "mathematical model", "chemical processes"]}, {"title": "Work in progress — Weaving threads of sustainability into the fabric of the mechanical engineering curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142912", "abstract": "", "authors": [], "tags": ["thermodynamics", "conferences", "weaving", "materials", "educational institutions", "mechanical engineering"]}, {"title": "Using remote experimentation in a large undergraduate course: Initial findings", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142913", "abstract": "", "authors": [], "tags": ["cities and towns", "laboratories", "conferences", "electricity", "educational institutions", "physics"]}, {"title": "Work in progress — Hands-on learning of fundamental concepts in electromagnetic fields", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142914", "abstract": "", "authors": [], "tags": ["laboratories", "electromagnetic fields", "materials", "capacitors", "educational institutions"]}, {"title": "Conflicted identities and sexism in computing graduate programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142915", "abstract": "", "authors": [], "tags": ["cities and towns", "computers", "industries", "conferences", "educational institutions", "medical services", "computer science"]}, {"title": "Work in progress — Enhancing Interactive Geometry Systems with intelligent tutoring features", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142916", "abstract": "", "authors": [], "tags": ["computers", "conferences", "artificial intelligence", "software", "least squares approximation", "education", "geometry"]}, {"title": "Engineering futures: Female students, careers, and work/life balance", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142917", "abstract": "", "authors": [], "tags": ["engineering profession", "engineering students", "encoding", "educational institutions", "psychology", "instruments"]}, {"title": "Robots, recruitment, and retention: Broadening participation through CS0", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142918", "abstract": "", "authors": [], "tags": ["computers", "educational robots", "programming", "educational institutions", "robot sensing systems"]}, {"title": "Work in progress — Application of the Boe-Bot in teaching K12 electricity fundamentals", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142919", "abstract": "", "authors": [], "tags": ["resistance", "electricity", "educational institutions", "nasa", "robot sensing systems"]}, {"title": "Work in progress — Using social media to teach engineering process", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142920", "abstract": "", "authors": [], "tags": ["computers", "conferences", "programming", "games", "educational institutions", "media"]}, {"title": "Impact of introducing single-gender classrooms in higher education on student achievement levels: A case study in software engineering courses in the GCC region", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142921", "abstract": "", "authors": [], "tags": ["computers", "cities and towns", "conferences", "software engineering", "educational institutions", "computer science"]}, {"title": "Work in progress — Diversity harnessing in a general education course on digital information technology", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142922", "abstract": "", "authors": [], "tags": ["communities", "information technology", "interviews", "educational institutions", "materials"]}, {"title": "New tools and methodologies for programming languages learning using the scribbler robot and Alice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142923", "abstract": "", "authors": [], "tags": ["three dimensional displays", "conferences", "educational institutions", "programming profession", "robots"]}, {"title": "Work in progress — Using a “cigar box” guitar to teach waves and sound in a high school physics program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142924", "abstract": "", "authors": [], "tags": ["conferences", "educational institutions", "materials", "instruments", "physics", "tuning", "neck"]}, {"title": "Work in progress — Development of an integrated circuits course that includes the full experience of designing an ASIC in a CMOS process", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142925", "abstract": "", "authors": [], "tags": ["conferences", "educational institutions", "cmos integrated circuits", "integrated circuit modeling", "microelectronics", "solid modeling"]}, {"title": "An evaluation of the Australian engineers without borders challenge from the course coordinators' perspectives", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142926", "abstract": "", "authors": [], "tags": ["teamwork", "communities", "conferences", "interviews", "educational institutions", "australia", "cultural differences"]}, {"title": "Providing end-to-end perspectives in software engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142927", "abstract": "", "authors": [], "tags": ["software engineering", "software", "games", "materials", "education", "computer science", "business"]}, {"title": "A novel interdisciplinary course in gerontechnology for disseminating computational thinking", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142928", "abstract": "", "authors": [], "tags": ["computers", "conferences", "gerontechnology", "computer science", "teamwork"]}, {"title": "Work in progress — Computer science perspectives on integration with human-centered design", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142929", "abstract": "", "authors": [], "tags": ["industries", "software engineering", "software", "educational institutions", "visual communication", "computer science"]}, {"title": "In-service Teaching Assistant Training (InsTAT) for engineering and computer science graduate students in Hong Kong: A blended-learning approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142930", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "educational institutions", "training", "portfolios", "electronic learning"]}, {"title": "Five years with kattis — Using an automated assessment system in teaching", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142931", "abstract": "", "authors": [], "tags": ["electronic mail", "conferences", "problem-solving", "testing", "programming profession", "education"]}, {"title": "Work in progress — A Blended Mobile Learning context oriented model applied to an information systems undergraduate degree curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142932", "abstract": "", "authors": [], "tags": ["computational modeling", "google", "context modeling", "information systems", "mobile communication", "context", "education"]}, {"title": "Nash meets Van Valkenburg: A game-theoretic approach to effective learning and teaching in engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142933", "abstract": "", "authors": [], "tags": ["cities and towns", "communities", "games", "educational institutions", "nash equilibrium"]}, {"title": "Work in progress — Developing a cognitively based digital logic calculator", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142934", "abstract": "", "authors": [], "tags": ["conferences", "logic gates", "interviews", "problem-solving", "logic design", "educational institutions", "calculators"]}, {"title": "Work in progress — The age of apathy: Reigniting engineering educating", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142935", "abstract": "", "authors": [], "tags": ["cities and towns", "storms", "conferences", "educational institutions", "engineering education", "internet"]}, {"title": "Work in progress — Interpreting elementary students' advanced conceptions of engineering from the Draw-an-Engineer Test", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142936", "abstract": "", "authors": [], "tags": ["buildings", "cities and towns", "conferences", "educational institutions", "head", "engineering education", "instruments"]}, {"title": "Work in progress — SUNRISE: Schools, university ‘N’ (and) resources in the sciences and engineering-a NSF/GMU GK-12 fellows project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142937", "abstract": "", "authors": [], "tags": ["mathematics", "educational institutions", "fellows", "collaboration", "training", "atmospheric modeling"]}, {"title": "Workshop — Using IDEALS to demonstrate development of professional skills in project courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142938", "abstract": "", "authors": [], "tags": [""]}, {"title": "Mini workshop — Exploration of the ethical development of engineering undergraduates", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142939", "abstract": "", "authors": [], "tags": [""]}, {"title": "An introductory electronics course oriented to develop real-life-engineering design skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142940", "abstract": "", "authors": [], "tags": ["semiconductor device modeling", "mosfet circuits", "laboratories", "transistors", "education", "physics"]}, {"title": "Mixing numbers and letters: Collaboration between engineering and English to improve graduate student work", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142941", "abstract": "", "authors": [], "tags": ["schedules", "writing", "industries", "conferences", "proposals", "collaboration", "educational institutions"]}, {"title": "The articulation of military training onto engineering degree plans", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142942", "abstract": "", "authors": [], "tags": ["engineering profession", "military aircraft", "educational institutions", "concrete", "training", "frequency modulation"]}, {"title": "Work in progress — The organization of a symposium that supports faculty development in the embedded-systems field", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142943", "abstract": "", "authors": [], "tags": ["cities and towns", "companies", "industries", "conferences", "educational institutions", "embedded systems"]}, {"title": "Work in progress — Using a computer gaming strategy to facilitate undergraduates' learning in a computer programming course: An experimental study", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142944", "abstract": "", "authors": [], "tags": ["computers", "atmospheric measurements", "particle measurements", "programming", "games", "materials", "time measurement"]}, {"title": "Work in progress — Classroom and distance components of a GK12 program placing graduate students in high school classrooms", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142945", "abstract": "", "authors": [], "tags": ["computers", "mathematics", "software", "fellows", "educational institutions", "hardware"]}, {"title": "Workshop — Evaluation of education development projects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142946", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — A hardware platform for a continuous-time signals and systems course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142947", "abstract": "", "authors": [], "tags": ["voltage measurement", "laboratories", "filtering", "materials", "power harmonic filters", "instruments", "hardware"]}, {"title": "A mini-workshop on how people learn", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142948", "abstract": "", "authors": [], "tags": [""]}, {"title": "Results of the cooperative learning program at Telemark University College, Norway", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142949", "abstract": "", "authors": [], "tags": ["cities and towns", "industries", "conferences", "educational institutions", "training", "engineering education"]}, {"title": "Work in progress — Project-Based Service Learning in engineering: Investigating partner relationships", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142950", "abstract": "", "authors": [], "tags": ["communities", "interviews", "educational institutions", "materials", "engineering education", "organizations"]}, {"title": "Engineering capstone project an individual approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142951", "abstract": "", "authors": [], "tags": ["computers", "monitoring", "conferences", "complexity theory", "planning", "educational institutions", "context"]}, {"title": "An advanced level radio-frequency circuit course with laboratory and design exercises that emphasize complete system performance", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142952", "abstract": "", "authors": [], "tags": ["radio frequency", "laboratories", "receivers", "mixers", "probes", "transmitters", "benchmark testing"]}, {"title": "Work in progress — Asleep in class are the schedules of college students hampering their ability to learn?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142953", "abstract": "", "authors": [], "tags": ["temperature measurement", "schedules", "conferences", "lighting", "educational institutions", "materials", "sleep"]}, {"title": "Using low-stakes quizzing for student self-evaluation of readiness for exams", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142954", "abstract": "", "authors": [], "tags": ["cities and towns", "buildings", "steel", "conferences", "materials", "educational institutions", "springs"]}, {"title": "Mini workshop — A strategy for assessing student work on open-ended problems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142955", "abstract": "", "authors": [], "tags": [""]}, {"title": "Decision-making and conflict resolutions skills enhanced by virtual facilitation: A qualitative study", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142956", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "educational institutions", "medical services", "knowledge engineering", "decision making"]}, {"title": "Knowledge and information sharing improved by simulation technology: A quantitative study", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142957", "abstract": "", "authors": [], "tags": ["cities and towns", "buildings", "atmospheric measurements", "conferences", "particle measurements", "training", "medical services"]}, {"title": "Teaching capstone design: The influence of problem complexity", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142958", "abstract": "", "authors": [], "tags": ["systematics", "analysis of variance", "moon", "complexity theory", "predictive models", "design methodology", "springs"]}, {"title": "Evaluation of a natural sketch interface for truss FBDs and analysis", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142959", "abstract": "", "authors": [], "tags": ["cities and towns", "computers", "conferences", "software", "mice", "education", "force"]}, {"title": "Students' perceptions of the engineering profession and implications for interest in the field", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142960", "abstract": "", "authors": [], "tags": ["engineering profession", "writing", "laboratories", "mathematics", "interviews", "knowledge engineering", "physics"]}, {"title": "Improving energy literacy among middle school youth with project-based learning pedagogies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142961", "abstract": "", "authors": [], "tags": ["conferences", "electricity", "energy resources", "educational institutions", "renewable energy resources", "energy measurement"]}, {"title": "Mini workshop — Exploration of a direct method for measuring ABET professional skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142962", "abstract": "", "authors": [], "tags": [""]}, {"title": "Experiences with CS2 and data structures in the 100 problems format", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142963", "abstract": "", "authors": [], "tags": ["algorithm design and analysis", "cities and towns", "conferences", "complexity theory", "data structures", "computer science", "springs"]}, {"title": "Comparing attributes of electrical engineering, mechanical engineering and non-engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142964", "abstract": "", "authors": [], "tags": ["computers", "cities and towns", "conferences", "engineering students", "electric variables measurement", "mechanical engineering", "physics"]}, {"title": "Work in progress — Engineering creativity and propensity for innovative thinking and design in engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142965", "abstract": "", "authors": [], "tags": ["reliability", "indexes", "technological innovation", "engineering students", "educational institutions", "instruments", "business"]}, {"title": "A class record and reviewing system designed to promote programming learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142966", "abstract": "", "authors": [], "tags": ["servers", "computers", "least squares approximation", "programming profession", "media", "streaming media"]}, {"title": "Work in progress — Exploring teacher and student differences in assessment of constructivist practices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142967", "abstract": "", "authors": [], "tags": ["cities and towns", "reliability", "conferences", "educational institutions", "calibration", "instruments"]}, {"title": "An application for the collaborative development of semantic content", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142968", "abstract": "", "authors": [], "tags": ["encyclopedias", "electronic publishing", "collaboration", "semantics", "internet", "ontologies"]}, {"title": "Assessing creativity in engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142969", "abstract": "", "authors": [], "tags": ["engineering students", "problem-solving", "correlation", "educational institutions", "psychology", "instruments"]}, {"title": "\"Microaggressions\" in engineering education: Climate for Asian, Latina and White women", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142970", "abstract": "", "authors": [], "tags": ["cities and towns", "color", "conferences", "educational institutions", "engineering education", "meteorology"]}, {"title": "Work in progress — Collaborative and reflective learning in engineering programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142971", "abstract": "", "authors": [], "tags": ["computational modeling", "object oriented modeling", "history", "programming profession", "collaborative work", "education"]}, {"title": "Work in progress — An example of the variations of visual representations in mechanical engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142972", "abstract": "", "authors": [], "tags": ["conferences", "problem-solving", "mechanical engineering", "visualization", "education", "gravity"]}, {"title": "Work in progress — Using graphical programming to contextualize a conventional programming course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142973", "abstract": "", "authors": [], "tags": ["syntactics", "propulsion", "java", "context", "programming profession", "media"]}, {"title": "Team-based software/system development in a vertically-integrated project-based course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142974", "abstract": "", "authors": [], "tags": ["servers", "documentation", "machine learning", "programming", "software", "teamwork"]}, {"title": "Work in progress — Robust engineering problems for the study of problem solving strategies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142975", "abstract": "", "authors": [], "tags": ["monitoring", "cities and towns", "conferences", "accuracy", "engineering students", "problem-solving", "educational institutions"]}, {"title": "Work in progress — Extending parallelism education to the first year with a bottom-up approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142976", "abstract": "", "authors": [], "tags": ["computers", "concurrent computing", "educational institutions", "programming profession", "instruments", "parallel processing"]}, {"title": "Evaluation of a K-8 LEGO robotics program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142977", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "educational robots", "educational institutions", "games", "gears"]}, {"title": "Work in progress — Putting the “E” in STEM teacher preparation: A new Bachelor of Science degree with an engineering education major", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142978", "abstract": "", "authors": [], "tags": ["engineering profession", "mathematics", "accreditation", "standards", "educational institutions", "engineering education"]}, {"title": "Inversion of technical and communication emphasis in an engineering product design class", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142979", "abstract": "", "authors": [], "tags": ["cities and towns", "schedules", "writing", "conferences", "prototypes", "product design", "education"]}, {"title": "Teaching computational thinking to non-computing majors using spreadsheet functions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142980", "abstract": "", "authors": [], "tags": ["computers", "conferences", "problem-solving", "educational institutions", "instruments", "computer science"]}, {"title": "A PIC18 robot-centered microcontroller systems laboratory", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142981", "abstract": "", "authors": [], "tags": ["laboratories", "microcontrollers", "robot sensing systems", "programming profession", "assembly"]}, {"title": "Work in progress — Direct assessment of course outcomes in a computer modeling and simulation class", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142982", "abstract": "", "authors": [], "tags": ["computers", "cities and towns", "conferences", "computational modeling", "taxonomy", "materials", "educational institutions"]}, {"title": "Work in progress — Does maintenance first improve student's understanding and appreciation of clean code and documentation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142983", "abstract": "", "authors": [], "tags": ["maintenance engineering", "documentation", "software engineering", "software reliability", "software testing", "software"]}, {"title": "Implications of black greek letter membership on the development of the Engineer of 2020", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142984", "abstract": "", "authors": [], "tags": ["engineering profession", "lead", "interviews", "educational institutions", "organizations", "standards organizations"]}, {"title": "Developing an intermediate embedded-systems course with an emphasis on collaboration", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142985", "abstract": "", "authors": [], "tags": ["laboratories", "industries", "programming", "microcontrollers", "embedded systems", "education", "hardware"]}, {"title": "Work in progress: The J-DSP/ESE software for analyzing Earth systems signals", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142986", "abstract": "", "authors": [], "tags": ["time series analysis", "earth", "conferences", "signal processing", "java", "programming profession"]}, {"title": "Work in progress — A comparison of mentoring functions in capstone courses across engineering disciplines", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142987", "abstract": "", "authors": [], "tags": ["employee welfare", "cities and towns", "conferences", "materials", "engineering education", "career development"]}, {"title": "New approach to teaching an introductory computer science course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142988", "abstract": "", "authors": [], "tags": ["computers", "laboratories", "materials", "programming profession", "education"]}, {"title": "Student difficulties with basic concepts in introductory materials science engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142989", "abstract": "", "authors": [], "tags": ["metals", "interviews", "atomic measurements", "elasticity", "stress", "force"]}, {"title": "Middle school girls' perceptions of engineers before and after a female only summer enrichment program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142990", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "mathematics", "conferences", "pre-college programs", "educational institutions", "knowledge engineering"]}, {"title": "Demonstrating the impact of multitasking in the classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142991", "abstract": "", "authors": [], "tags": ["electronic mail", "portable computers", "materials", "facebook", "multitasking", "internet"]}, {"title": "Work in progress — Computer science e-portfolios: Perspectives from upper and lower division students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142992", "abstract": "", "authors": [], "tags": ["engineering profession", "communities", "conferences", "educational institutions", "data structures", "portfolios", "computer science"]}, {"title": "Work in progress — Product evolution from an engineering perspective", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142993", "abstract": "", "authors": [], "tags": ["technological innovation", "innovation management", "fluids", "educational institutions", "media", "biological system modeling"]}, {"title": "How to involve students in FOSS projects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142994", "abstract": "", "authors": [], "tags": ["schedules", "communities", "electronic publishing", "information services", "blogs", "software", "internet"]}, {"title": "A video-message evaluation tool integrated in the UNED e-learning platform", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142995", "abstract": "", "authors": [], "tags": ["multimedia communication", "real time systems", "conferences", "training", "electronic learning", "internet", "streaming media"]}, {"title": "Work in progress — Entrepreneurship literacy for engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142996", "abstract": "", "authors": [], "tags": ["conferences", "engineering students", "innovation management", "knowledge engineering", "instruments"]}, {"title": "Understanding a studio environment: A complex system approach to a community of practice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142997", "abstract": "", "authors": [], "tags": ["cities and towns", "communities", "complexity theory", "collaboration", "educational institutions", "portfolios", "reflection"]}, {"title": "Work in progress — Enhancement of distance learning through hybrid e-learning approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142998", "abstract": "", "authors": [], "tags": ["computer aided instruction", "programming", "software", "educational institutions", "medical services", "electronic learning"]}, {"title": "Workshop — Developing cross-disciplinary collaborations for engineering education research", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6142999", "abstract": "", "authors": [], "tags": [""]}, {"title": "Teaching teamwork in engineering and computer science", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143000", "abstract": "", "authors": [], "tags": ["conferences", "google", "educational institutions", "computer science", "teamwork"]}, {"title": "Work in progress — Merging science inquiry and engineering design: A summer workshop series for middle and high school science teachers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143001", "abstract": "", "authors": [], "tags": ["adaptation models", "conferences", "standards", "materials", "educational institutions", "engineering education"]}, {"title": "The third dimension in open learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143002", "abstract": "", "authors": [], "tags": ["servers", "routing", "three dimensional displays", "second life", "animation", "wireless communication", "education"]}, {"title": "Development of professional competencies in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143003", "abstract": "", "authors": [], "tags": ["conferences", "educational institutions", "engineering education", "context", "portfolios", "reflection"]}, {"title": "Algae as a biofuel: An interdisciplinary high school curriculum incorporating engineering, biology and education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143004", "abstract": "", "authors": [], "tags": ["biomass", "standards", "algae", "educational institutions", "biofuels"]}, {"title": "Performance trajectory of students in the engineering disciplines", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143005", "abstract": "", "authors": [], "tags": ["computers", "conferences", "engineering students", "educational institutions", "materials"]}, {"title": "Work in progress — Initiating the Beaver contest on computer science and computer fluency in Israel", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143006", "abstract": "", "authors": [], "tags": ["computers", "cities and towns", "informatics", "educational institutions", "programming profession"]}, {"title": "Work in progress — Modules and laboratories for a pathways course in signals and systems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143007", "abstract": "", "authors": [], "tags": ["computers", "laboratories", "educational institutions", "programming profession", "digital signal processing", "phase locked loops"]}, {"title": "Does diversity in novice teams lead to greater innovation?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143008", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "technological innovation", "correlation", "educational institutions", "engineering education", "cultural differences"]}, {"title": "Mathematics INstruction using Decision Science and Engineering Tools", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143009", "abstract": "", "authors": [], "tags": ["conferences", "materials", "educational institutions", "mathematical model", "context"]}, {"title": "Work in progress — Effect of departmental culture on ePortfolios for graduate engineering programmatic assessment", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143010", "abstract": "", "authors": [], "tags": ["laboratories", "engineering students", "medical services", "portfolios", "springs"]}, {"title": "Workshop — Assessing and developing critical thinking skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143011", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Exploiting videoconferencing possibilities to promote the European convergence process", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143012", "abstract": "", "authors": [], "tags": ["teleconferencing", "europe", "convergence", "educational institutions", "streaming media", "hardware"]}, {"title": "Effectiveness of technology education learning activities on the improvement of spatial skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143013", "abstract": "", "authors": [], "tags": ["cities and towns", "three dimensional displays", "conferences", "educational institutions", "visualization"]}, {"title": "Engineering self-efficacy of women engineering students at urban vs. Rural universities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143014", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "mathematics", "conferences", "engineering students", "educational institutions"]}, {"title": "Work in progress — Assessing and evaluating mentorship programs affecting students retention at the University of Maryland Baltimore County in mechanical engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143015", "abstract": "", "authors": [], "tags": ["employee welfare", "engineering profession", "communities", "cities and towns", "educational institutions", "mechanical engineering"]}, {"title": "Work in progress — Developing a curriculum to prepare engineers to participate in public policy", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143016", "abstract": "", "authors": [], "tags": ["communities", "conferences", "educational institutions", "engineering education", "knowledge engineering", "public policy"]}, {"title": "Work in progress — The impact of integrating first-year students into the broader curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143017", "abstract": "", "authors": [], "tags": ["schedules", "software", "educational institutions", "collaboration", "programming profession"]}, {"title": "Work in progress — Developmental engineering: Using observation for understanding child behaviors as precursors to engineering thinking", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143018", "abstract": "", "authors": [], "tags": ["mathematics", "problem-solving", "educational institutions", "engineering education", "knowledge engineering", "protocols"]}, {"title": "A novel REU program to develop the skills of the Engineer of 2020", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143019", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "conferences", "seminars", "educational institutions", "context", "art"]}, {"title": "University outreach in STEM education through a Roller Coaster Science and Engineering Camp", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143020", "abstract": "", "authors": [], "tags": ["engineering profession", "companies", "mathematics", "conferences", "educational institutions", "training", "physics"]}, {"title": "Panel — Tales from the field — Cross-college curriculum development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143021", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Developing a graduate consortium in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143022", "abstract": "", "authors": [], "tags": ["communities", "lead", "conferences", "mission and vision", "educational institutions", "engineering education"]}, {"title": "Capstone experiences: Effects of adapted physical activity design projects on attitudes and learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143023", "abstract": "", "authors": [], "tags": ["cities and towns", "foot", "conferences", "fabrication", "engineering students", "data analysis", "educational institutions"]}, {"title": "Model-driven development of learning objects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143024", "abstract": "", "authors": [], "tags": ["cities and towns", "unified modeling language", "conferences", "computational modeling", "software testing", "collaboration"]}, {"title": "Improving cooperation in Virtual Learning Environments using multi-agent systems and AIML", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143025", "abstract": "", "authors": [], "tags": ["monitoring", "electronic publishing", "discussion forums", "information services", "software", "knowledge based systems", "internet"]}, {"title": "Mini workshop — Real World Engineering Projects: Discovery-based curriculum modules for first-year students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143026", "abstract": "", "authors": [], "tags": [""]}, {"title": "It's not what you think: A theory for understanding the lack of interest among domestic students in the engineering PhD", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143027", "abstract": "", "authors": [], "tags": ["engineering profession", "engineering students", "interviews", "educational institutions", "medical services"]}, {"title": "From the manager's perspective: Classroom contributions to open-source projects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143028", "abstract": "", "authors": [], "tags": ["encyclopedias", "conferences", "programming", "educational institutions", "open source software"]}, {"title": "Thayer quiz method: Replacing homework with frequent quizzes in engineering classes", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143029", "abstract": "", "authors": [], "tags": ["cities and towns", "laboratories", "conferences", "materials", "programming profession", "electrical engineering"]}, {"title": "A gender analysis of student learning in physics", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143030", "abstract": "", "authors": [], "tags": ["writing", "laboratories", "educational institutions", "instruments", "force"]}, {"title": "Assessment of the pilot implementation of a game-based gear design laboratory", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143031", "abstract": "", "authors": [], "tags": ["laboratories", "conferences", "engines", "games", "gears", "mechanical engineering", "assembly"]}, {"title": "Work in progress — Cooperative and competitive projects for engaging students in advanced ICT subjects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143032", "abstract": "", "authors": [], "tags": ["video coding", "cities and towns", "speech processing", "proposals", "education", "teamwork", "communications technology"]}, {"title": "Work in progress — Promoting metacognitive knowledge and shared note-taking to learn electric circuit concepts through enhanced guided notes", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143033", "abstract": "", "authors": [], "tags": ["social network services", "conferences", "collaboration", "materials", "educational institutions", "springs"]}, {"title": "Design-based research: A framework for designing novel teaching and learning experiences in middle school engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143034", "abstract": "", "authors": [], "tags": ["cities and towns", "temperature sensors", "software", "educational institutions", "engineering education", "robot sensing systems"]}, {"title": "Problematizations of women's underrepresentation: Comparing educator interviews with the literature", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143035", "abstract": "", "authors": [], "tags": ["communities", "conferences", "economics", "interviews", "engineering education", "cultural differences"]}, {"title": "High school teacher development workshops that create long-term student impact", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143036", "abstract": "", "authors": [], "tags": ["conferences", "educational institutions", "prototypes", "mathematical model", "vehicles", "fuel cells"]}, {"title": "Leading change in the internal quality assurance system implantation of a European technical university", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143037", "abstract": "", "authors": [], "tags": ["computers", "conferences", "educational institutions", "training", "organizations", "educational activities"]}, {"title": "Curricula design model for designing and evaluating systems and computing engineering programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143038", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "technological innovation", "educational institutions", "face", "context", "organizations"]}, {"title": "Teaching deflection of stepped shafts: Castigliano's theorem, dummy loads, heaviside step functions and numerical integration", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143039", "abstract": "", "authors": [], "tags": ["shafts", "software", "materials", "shape", "equations", "mathematical model", "geometry"]}, {"title": "Work in progress — Exploring the evolution of the mentoring relationship in a summer undergraduate research program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143040", "abstract": "", "authors": [], "tags": ["employee welfare", "cities and towns", "presses", "educational institutions", "data models", "marine vehicles"]}, {"title": "Defining, integrating, and assessing a purposeful progression of cross-curricular initiatives into a computer science program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143041", "abstract": "", "authors": [], "tags": ["algorithm design and analysis", "security", "testing", "programming profession", "education"]}, {"title": "Work in progress — The bridge to the doctorate experience: A reflection on best practices and project outcomes", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143042", "abstract": "", "authors": [], "tags": ["conferences", "interviews", "seminars", "educational institutions", "fellows", "medical services", "best practices"]}, {"title": "Teaching and assessing an interdisciplinary science of design pilot course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143043", "abstract": "", "authors": [], "tags": ["computers", "teamwork", "conferences", "problem-solving", "ethics", "education", "art"]}, {"title": "Work in progress — Modeling academic success of female and minority engineering students using the student attitudinal success instrument and pre-college factors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143044", "abstract": "", "authors": [], "tags": ["lead", "engineering students", "predictive models", "educational institutions", "mathematical model", "instruments"]}, {"title": "Panel — What is global engineering education for?: The making of International Educators", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143045", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Interactive signal-processing labs and simulations on iOS devices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143046", "abstract": "", "authors": [], "tags": ["smart phones", "software", "convolution", "object oriented modeling", "mobile communication", "digital signal processing"]}, {"title": "Student development in the co-curriculum through values-based teaming", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143047", "abstract": "", "authors": [], "tags": ["manufacturing", "lead", "educational institutions", "training", "engineering education", "reflection"]}, {"title": "Introducing object oriented design patterns through a puzzle-based serious computer game", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143048", "abstract": "", "authors": [], "tags": ["software engineering", "software", "games", "educational institutions", "bridges", "legged locomotion"]}, {"title": "Mobile learning experience in the calculus classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143049", "abstract": "", "authors": [], "tags": ["databases", "portals", "materials", "educational institutions", "mobile communication", "digital audio broadcasting", "calculus"]}, {"title": "First experiences with eBlocks as an assistive technology for individuals with autistic spectrum condition", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143050", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "lighting", "visualization", "alarm systems", "education", "teamwork"]}, {"title": "Work in progress — Development of a linear integrated circuits course focused on design under realistic trade-off conditions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143051", "abstract": "", "authors": [], "tags": ["electronic circuits", "educational institutions", "differential amplifiers", "cmos integrated circuits", "negative feedback"]}, {"title": "Building a medical learning methodology based on open source technologies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143052", "abstract": "", "authors": [], "tags": ["communities", "three dimensional displays", "videos", "portals", "hospitals", "education", "production"]}, {"title": "Assessing creativity practices in design", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143053", "abstract": "", "authors": [], "tags": ["computers", "cities and towns", "conferences", "educational institutions", "psychology", "computer science"]}, {"title": "Focusing high school teachers on attracting diverse students to computer science and engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143054", "abstract": "", "authors": [], "tags": ["engineering profession", "computers", "conferences", "educational institutions", "computer science education", "computer science"]}, {"title": "Interactions among undergraduate engineers: How care and respect are demonstrated among peers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143055", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "engineering students", "interviews", "materials", "mechanical engineering", "teamwork"]}, {"title": "Gift young engineers: An extra-curricular initiative for updating computer and electrical engineering courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143056", "abstract": "", "authors": [], "tags": ["cities and towns", "industries", "programming", "software", "educational institutions", "digital tv", "hardware"]}, {"title": "A pass/fail option for first-semester engineering students: A critical evaluation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143057", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "engineering students", "educational institutions", "history", "stress"]}, {"title": "A preliminary motivational evaluation of milestone-based laboratory assessment", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143058", "abstract": "", "authors": [], "tags": ["cities and towns", "laboratories", "writing", "conferences", "stability criteria", "automation", "mechatronics"]}, {"title": "An interactive approach to renewable energy research and education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143059", "abstract": "", "authors": [], "tags": ["wind energy", "three dimensional displays", "electricity", "wind turbines", "databases", "wind speed", "solid modeling"]}, {"title": "Control system experiments at home", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143060", "abstract": "", "authors": [], "tags": ["dc motors", "laboratories", "heating", "educational institutions", "mathematical model", "hardware"]}, {"title": "Reinventing the engineering: An extracurricular program designed to attract new engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143061", "abstract": "", "authors": [], "tags": ["laboratories", "mathematics", "conferences", "chemistry", "biology", "educational institutions"]}, {"title": "Work in progress — Computing for middle-school students: The experience of teaching computers for 7th grade students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143062", "abstract": "", "authors": [], "tags": ["computers", "games", "educational institutions", "programming profession", "robots"]}, {"title": "Teaching mobile solution development in a global context: Comparing solutions proposed by students in the developed and developing world", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143063", "abstract": "", "authors": [], "tags": ["communities", "smart phones", "educational institutions", "java", "mobile communication", "context"]}, {"title": "On project-based learning through the vertically-integrated projects program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143064", "abstract": "", "authors": [], "tags": ["cities and towns", "tracking", "transforms", "hidden markov models", "materials", "education", "cameras"]}, {"title": "ASME vision 2030: Helping to inform mechanical engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143065", "abstract": "", "authors": [], "tags": ["engineering profession", "lead", "industries", "mechanical engineering", "engineering education", "force"]}, {"title": "Work in progress — Design and the robotically-controlled mini-plant in freshman chemical engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143066", "abstract": "", "authors": [], "tags": ["chemical engineering", "mathematics", "chemistry", "educational institutions", "materials", "robot sensing systems"]}, {"title": "Knowledge servers for the classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143067", "abstract": "", "authors": [], "tags": ["servers", "materials", "semantic web", "data structures", "graphical user interfaces", "ontologies"]}, {"title": "Work in progress — A video game for teaching dynamics", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143068", "abstract": "", "authors": [], "tags": ["cities and towns", "vehicle dynamics", "sampling methods", "conferences", "games", "mechanical engineering", "education"]}, {"title": "An experimental Nexos laboratory using Virtual Xinu", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143069", "abstract": "", "authors": [], "tags": ["servers", "laboratories", "virtual machining", "kernel", "hardware"]}, {"title": "Work in progress — Undergraduates and intellectual property: Trends, policies, and practices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143070", "abstract": "", "authors": [], "tags": ["technology transfer", "innovation management", "technological innovation", "interviews", "educational institutions", "intellectual property"]}, {"title": "Work in progress — Calculus placement modeling for engineering student potentially contributes to appropriate advising", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143071", "abstract": "", "authors": [], "tags": ["engineering students", "correlation", "predictive models", "educational institutions", "mathematical model", "calculus"]}, {"title": "Work in progress — A feedback system for peer evaluation of engineering student teams to enhance team effectiveness", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143072", "abstract": "", "authors": [], "tags": ["cities and towns", "reliability", "conferences", "educational institutions", "engineering education", "vectors", "instruments"]}, {"title": "Affordable K-12 robotics programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143073", "abstract": "", "authors": [], "tags": ["conferences", "service robots", "educational robots", "educational institutions", "games", "gears"]}, {"title": "Identifying and assessing relational understanding in ordinary differential equations", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143074", "abstract": "", "authors": [], "tags": ["interviews", "web sites", "educational institutions", "differential equations", "equations"]}, {"title": "Synergies and opportunities between engineering and law", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143075", "abstract": "", "authors": [], "tags": ["cities and towns", "accreditation", "engineering students", "law", "educational institutions"]}, {"title": "Work in progress — Games for life workshop: Outreach to middle and high school age girl scouts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143076", "abstract": "", "authors": [], "tags": ["computers", "communities", "conferences", "jacobian matrices", "tutorials", "games", "materials"]}, {"title": "Work in progress — Performance evaluation of online learning tools", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143077", "abstract": "", "authors": [], "tags": ["monitoring", "laboratories", "quality of service", "educational institutions", "system performance", "context"]}, {"title": "Virtual collaborative space to support active learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143078", "abstract": "", "authors": [], "tags": ["monitoring", "electronic publishing", "information services", "collaborative tools", "collaborative work", "internet"]}, {"title": "Work in progress — Developing engineers for 2020 — An innovative curricular and co-curricular approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143079", "abstract": "", "authors": [], "tags": ["communities", "lead", "seminars", "educational institutions", "scholarships", "programming profession"]}, {"title": "Public school students left behind: Contrasting the trends in public and private school computer science advanced placement participation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143080", "abstract": "", "authors": [], "tags": ["computers", "educational institutions", "computer science", "art", "calculus"]}, {"title": "Mini workshop — How to organize a professional development workshop for high school CS teachers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143081", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — A new laboratory project in a required Electrical Engineering course for non-majors: Design, survey, and analysis of student feedback", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143082", "abstract": "", "authors": [], "tags": ["three dimensional displays", "temperature control", "educational institutions", "knowledge engineering", "programming profession", "electrical engineering"]}, {"title": "Work in progress — Integrating computational and engineering thinking through online design and simulation of multidisciplinary systems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143083", "abstract": "", "authors": [], "tags": ["conferences", "computational modeling", "sugar industry", "mathematical model", "knowledge engineering", "education", "glass"]}, {"title": "Work in progress — Preparation creating effective faculty of engineering: A technological literacy approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143084", "abstract": "", "authors": [], "tags": ["economics", "engineering students", "presses", "educational institutions", "training"]}, {"title": "Facilitating the design of physics active learning problems through authoring simulation tools: Authorphysics", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143085", "abstract": "", "authors": [], "tags": ["friction", "computational modeling", "java", "mathematical model", "pulleys", "education"]}, {"title": "Predictive assessment of student performance for early strategic guidance", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143086", "abstract": "", "authors": [], "tags": ["mathematics", "vegetation", "predictive models", "educational institutions", "training", "data models", "physics"]}, {"title": "The Itasca CC Engineering Learning Model", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143087", "abstract": "", "authors": [], "tags": ["engineering profession", "communities", "engineering students", "educational institutions", "knowledge engineering", "calculus"]}, {"title": "Introducing CATs to STEM faculty through graduate students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143088", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "interviews", "cats", "materials", "reflection", "education"]}, {"title": "Work in progress — Implementation of a project-based learning curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143089", "abstract": "", "authors": [], "tags": ["adaptation models", "communities", "industries", "educational institutions", "engineering education", "iron"]}, {"title": "Work in progress: Gender impacts of relevant robotics curricula on high school students' engineering attitudes and interest", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143090", "abstract": "", "authors": [], "tags": ["conferences", "educational institutions", "engineering education", "context", "robot sensing systems", "knowledge engineering"]}, {"title": "Increasing instrumentality without decreasing instructional time: An intervention for engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143091", "abstract": "", "authors": [], "tags": ["engineering students", "materials", "educational institutions", "psychology", "instruments", "calculus"]}, {"title": "Successful practices for online computing, engineering, and technology courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143092", "abstract": "", "authors": [], "tags": ["laboratories", "conferences", "discussion forums", "software", "materials", "cleaning", "plagiarism"]}, {"title": "Renewable energy education at the Colorado School of Mines: A survey of development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143093", "abstract": "", "authors": [], "tags": ["photovoltaic systems", "physics", "educational institutions", "materials", "fuel cells", "renewable energy resources"]}, {"title": "Work in progress — Development and integration of an online soil mapping Web application", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143094", "abstract": "", "authors": [], "tags": ["earth", "soil", "google", "usability", "educational institutions", "visualization"]}, {"title": "Work in progress — Improving the dissemination of CCLI (TUES) educational innovations", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143095", "abstract": "", "authors": [], "tags": ["social network services", "conferences", "libraries", "technological innovation", "seminars", "materials", "education"]}, {"title": "Workshop — Developing active learning classroom exercises for use with Tablet PCs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143096", "abstract": "", "authors": [], "tags": [""]}, {"title": "Mini workshop — How to improve teaching and learning: Selecting, implementing and evaluating digital resources in the Engineering Pathway", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143097", "abstract": "", "authors": [], "tags": [""]}, {"title": "Results from repeated evaluation of an online tutor on introductory Computer Science", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143098", "abstract": "", "authors": [], "tags": ["cities and towns", "computers", "conferences", "analysis of variance", "software", "computer science", "springs"]}, {"title": "Work in progress — Programming in a confined space — A case study in porting modern robot software to an antique platform", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143099", "abstract": "", "authors": [], "tags": ["joints", "learning", "educational robots", "tactile sensors", "computer science"]}, {"title": "Work in progress — Creating a professional software development environment to support capstone programming projects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143100", "abstract": "", "authors": [], "tags": ["databases", "courseware", "open source software", "programming"]}, {"title": "Probing a deeper understanding of modern physics concepts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143101", "abstract": "", "authors": [], "tags": ["instruments", "quantum mechanics", "correlation", "mechanical variables measurement"]}, {"title": "Context-aware recommendation algorithms for the percepolis personalized education platform", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143102", "abstract": "", "authors": [], "tags": ["computational modeling", "materials", "recommender systems", "pervasive computing", "context", "software agents"]}, {"title": "Special session — The CS2013 computer science curriculum guidelines project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143103", "abstract": "", "authors": [], "tags": [""]}, {"title": "Using the Matlab-based iRobot create simulator to engage introductory computer programming students in program development and observing computational errors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143104", "abstract": "", "authors": [], "tags": ["robot kinematics", "approximation methods", "robot sensing systems", "programming profession"]}, {"title": "Work in progress — NEESacademy as a cyber-enabled learning experiences for K-16 earthquake engineering and science education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143105", "abstract": "", "authors": [], "tags": ["libraries", "materials", "educational institutions", "engineering education", "earthquake engineering"]}, {"title": "Work in progress — Using multiple methods to investigate the role of feedback in open-ended activities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143106", "abstract": "", "authors": [], "tags": ["cities and towns", "mathematics", "conferences", "interviews", "educational institutions", "engineering education"]}, {"title": "Work in progress — Vertically integrated teams to inspire student interest in computing", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143107", "abstract": "", "authors": [], "tags": ["cities and towns", "conferences", "programming", "educational institutions", "materials", "data models", "educational activities"]}, {"title": "Work in progress — Virtual facilitation and procedural knowledge education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143108", "abstract": "", "authors": [], "tags": ["conferences", "engineering students", "educational institutions", "equations", "mathematical model", "knowledge engineering"]}, {"title": "Special session — Assessing student learning of engineering design", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143109", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — A survey of popular game creation platforms used for computing education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143110", "abstract": "", "authors": [], "tags": ["syntactics", "games", "educational institutions", "green products", "programming profession"]}, {"title": "A survey on computer science K-12 outreach: Teacher training programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143111", "abstract": "", "authors": [], "tags": ["conferences", "curriculum development", "educational institutions", "materials", "training", "computer science"]}, {"title": "Work in progress — Tools and technology to implement a students personal laboratory", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143112", "abstract": "", "authors": [], "tags": ["laboratories", "signal generators", "nickel", "data acquisition", "educational institutions", "instruments", "hardware"]}, {"title": "Special session — Engineering ethics: Toward a definition", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143113", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Reporting S-STEM retention: New diversity vs. Supporting existing diversity", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143114", "abstract": "", "authors": [], "tags": ["lead", "mathematics", "recruitment", "educational institutions", "scholarships"]}, {"title": "Work in progress — A problem-based learning approach for systems understanding in the MSU AES program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143115", "abstract": "", "authors": [], "tags": ["industries", "globalization", "computational modeling", "educational institutions", "engineering education", "mathematical model", "business"]}, {"title": "Workshop — Introducing and teaching smartphone application development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143116", "abstract": "", "authors": [], "tags": [""]}, {"title": "Work in progress — Peer-directed learning in a project based model", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143117", "abstract": "", "authors": [], "tags": ["industries", "educational institutions", "engineering education", "knowledge engineering", "iron", "physics"]}, {"title": "Workshop — Service-learning in engineering, technology and computing", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143118", "abstract": "", "authors": [], "tags": [""]}, {"title": "mJeliot: ICT support for interactive teaching of programming", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143119", "abstract": "", "authors": [], "tags": ["servers", "computer science education", "mobile handsets", "visualization", "programming profession"]}, {"title": "Work in progress — Evaluation and feedback for web programming curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143120", "abstract": "", "authors": [], "tags": ["fires", "companies", "industries", "browsers", "programming profession"]}, {"title": "Work in progress — A health information technology centralized web application", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143121", "abstract": "", "authors": [], "tags": ["computers", "humans", "hospitals", "history", "insurance", "computer graphics"]}, {"title": "Work in progress — Engineering math with EARLY BIRD", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143122", "abstract": "", "authors": [], "tags": ["birds", "engineering students", "educational institutions", "bridges", "calculus"]}, {"title": "Introducing sustainability concepts in lower division engineering core courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143123", "abstract": "", "authors": [], "tags": ["temperature measurement", "thermodynamics", "water resources", "educational institutions", "materials", "turbines", "springs"]}, {"title": "Work in progress — Creating a collaborative learning environment for engineers and technologists", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143124", "abstract": "", "authors": [], "tags": ["cities and towns", "communities", "conferences", "employment", "engineering education", "business"]}, {"title": "Mini workshop — Designing project-based courses for learning and cost-effective teaching", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143125", "abstract": "", "authors": [], "tags": [""]}, {"title": "Engineering education in Iberian America", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143126", "abstract": "", "authors": [], "tags": [""]}, {"title": "Application and user perceptions of using the WebLab-Deusto-PLD in technical education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143127", "abstract": "", "authors": [], "tags": [""]}, {"title": "A survey of issues and approaches to remote laboratory adoption by teacher-academics", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143128", "abstract": "", "authors": [], "tags": [""]}, {"title": "Collaborative Web labs as a service: Challenges and opportunities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143129", "abstract": "", "authors": [], "tags": [""]}, {"title": "Integration of virtual and remote experiments into undergraduate engineering courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143130", "abstract": "", "authors": [], "tags": [""]}, {"title": "An online lab to support a master program in remote engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143131", "abstract": "", "authors": [], "tags": [""]}, {"title": "A toolkit for remote laboratory design & development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143132", "abstract": "", "authors": [], "tags": [""]}, {"title": "VISIR deployment in undergraduate engineering practices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143133", "abstract": "", "authors": [], "tags": [""]}, {"title": "A select and annotated bibliography of philosophy in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143134", "abstract": "", "authors": [], "tags": [""]}, {"title": "A historical overview of recent developments in the search for a philosophy of engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143135", "abstract": "", "authors": [], "tags": [""]}, {"title": "2011 FIE conference awards presentations", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143136", "abstract": "", "authors": [], "tags": [""]}, {"title": "Table of contents", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143137", "abstract": "", "authors": [], "tags": [""]}, {"title": "Who was Benjamin Dasher?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143139", "abstract": "", "authors": [], "tags": [""]}, {"title": "Conference program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143144", "abstract": "", "authors": [], "tags": [""]}, {"title": "Global online laboratory consortium", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143145", "abstract": "", "authors": [], "tags": [""]}, {"title": "Helen Margaret Lester Plants [biography]", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143147", "abstract": "", "authors": [], "tags": ["plants, helen margaret lester", "biographies"]}, {"title": "Contents", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143148", "abstract": "", "authors": [], "tags": [""]}, {"title": "The Visa Waiver Program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143152", "abstract": "", "authors": [], "tags": [""]}, {"title": "Thursday sessions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143155", "abstract": "", "authors": [], "tags": [""]}, {"title": "Author index", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143156", "abstract": "", "authors": [], "tags": [""]}, {"title": "Monumental innovations from around the world", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143157", "abstract": "", "authors": [], "tags": [""]}, {"title": "FIE 2011 preliminary conference at a glance", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143158", "abstract": "", "authors": [], "tags": [""]}, {"title": "Frontiers in education 2011", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143159", "abstract": "", "authors": [], "tags": [""]}, {"title": "Frontiers in Education 2011", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2011.6143161", "abstract": "", "authors": [], "tags": [""]}]