[{"title": "Work in progress: A machine learning approach for assessment and prediction of teamwork effectiveness in software engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462205", "abstract": "One of the challenges in effective software engineering (SE) education is the lack of objective assessment methods of how well student teams learn the critically needed teamwork practices, defined as the ability: (i) to learn and effectively apply SE processes in a teamwork setting, and (ii) to work as a team to develop satisfactory software (SW) products. In addition, there are no effective methods for predicting learning effectiveness in order to enable early intervention in the classroom. Most of the current approaches to assess achievement of SE teamwork skills rely solely on qualitative and subjective data taken as surveys at the end of the class and analyzed only with very rudimentary data analysis. In this paper we present a novel approach to address the assessment and prediction of student learning of teamwork effectiveness in software engineering education based on: a) extracting only objective and quantitative student team activity data during their team class project; b) pairing these data with related independent observations and grading of student team effectiveness in SE process and SE product components in order to create “training database” and c) applying a machine learning (ML) approach, namely random forest classification (RF), to the above training database in order to create ML models, ranked factors and rules that can both explain (e.g. assess) as well as provide prediction of the student teamwork effectiveness. These student team activity data are being collected in joint and already established (since 2006) SE classes at San Francisco State University (SFSU), Florida Atlantic University (FAU) and Fulda University, Germany (Fulda), from approximately 80 students each year, working in about 15 teams, both local and global (with students from multiple schools).", "authors": [{"name": "Shihong Huang", "affiliation": "Department of Computer Science & Engineering, Florida Atlantic University, Boca Raton, USA"}, {"name": "Kazunori Okada", "affiliation": "Department of Computer Science, San Francisco State University, San Francisco, USA "}, {"name": "Aishwarya Iyer", "affiliation": "Department of Computer Science, San Francisco State University, San Francisco, USA "}, {"name": "Marc Sosnick", "affiliation": "Department of Computer Science, San Francisco State University, San Francisco, USA "}, {"name": "Shenhaochen Zhu", "affiliation": "Department of Computer Science, San Francisco State University, San Francisco, USA "}, {"name": "Rainer Todtenhoefer", "affiliation": "Department of Applied Computer Science, Fulda University of Applied Science, Fulda, Germany "}, {"name": "Dragutin Petkovic", "affiliation": "Department of Computer Science, San Francisco State University, San Francisco, USA "}], "tags": ["educational institutions", "software engineering teamwork", "training", "software", "assessment", "machine learning", "software engineering education", "software engineering", "teamwork"]}, {"title": "Teaching software inspection effectiveness: An active learning exercise", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462206", "abstract": "This paper discusses a novel active learning exercise which teaches students how to perform and assess the effectiveness of formal software inspections. In this exercise, students are responsible for selecting an artifact from their senior capstone design projects. The students then use fault injection to strategically place faults within the artifact that should be caught by the inspection exercise. Based on the needs of the team, students prepare an inspection packet consisting of a set of inspection instructions, applicable checklists, and the inspection artifact. Students then “hire” a set of inspectors based on classmates' backgrounds and experiences. The team leader then holds two inspection meetings and reports the results. The results are then used to assess the effectiveness of the inspection. Overall, in analyzing 5 years worth of data from this exercise, it is found that students are capable of selecting appropriate materials for inspection and performing appropriate software inspections. The yield of students is lower than an experienced professional might have and the inspection rates tend to be slightly higher than desired for their experience. However, the yield is related to individual preparation time. Students overall find this to be a highly educational experience and highly recommend it be continued for future classes.", "authors": [{"name": "Walter W. Schilling", "affiliation": "Department of Electrical Engineering and Computer Science, Milwaukee School of Engineering, Milwaukee, WI 53202"}], "tags": ["measurement", "inspection", "correlation", "software", "education", "materials", "market research"]}, {"title": "Microwave engineering education over the web", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462207", "abstract": "An online simulated Smith chart is designed as an aid to train students to perform impedance matching exercises and to easily follow amplifier design procedures. The tool enables the instructor to conduct classes remotely to a group of students in a broadcasting mode. Students have participated actively and regularly in the online Smith chart tool and their reactions have been positive.", "authors": [{"name": "A. Y. Al-Zoubi", "affiliation": "Communication Engineering Department, Princess Sumaya University for Technology, Amman, Jordan "}, {"name": "Omar Ata", "affiliation": "Communication Engineering Department, Princess Sumaya University for Technology, Amman, Jordan "}, {"name": "Omar Hasan", "affiliation": "Communication Engineering Department, Princess Sumaya University for Technology, Amman, Jordan"}], "tags": ["formatting", "microwave circuits", "microwave communication", "insert (key words)", "transistors", "styling", "style", "microwave amplifiers", "microwave transistors"]}, {"title": "Work in progress: Redesigned First-Year Seminar course in engineering — Delivery, learning outcomes assessment, and lessons learned", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462208", "abstract": "This paper discusses the delivery of content and rubrics for assessment of learning outcomes in the redesigned version of the critical entry-level course, First-Year Seminar course in Engineering, for undergraduate engineering students. The First-Year Seminar in Engineering at our institution is offered once each year during the fall term. The course comprises 45 to 50 first-year students who will graduate with engineering degrees from four-year programs. The redesign of this course was necessitated by the (1) disparate nature of the content from session to session (2) lack of continuity across sessions, and (3) absence of a common thread to bind the content of the course. For the incoming engineering student to receive both the holistic University experience and develop the ability to learn and retain fundamental engineering principles and practices, the course has been redesigned to incorporate community-based engineering projects as the core theme of the course. The students formed teams, and maintained team-based blogs to document their progress on the engineering project. In addition to the traditional learning outcomes assessment methods (e.g. in-class testing, homework assignments, individual and group reports), rubrics were developed to assess the performance of the students in the engineering projects.", "authors": [{"name": "Ramakrishnan Sundaram", "affiliation": "Gannon University"}], "tags": ["engineering profession", "reflection", "educational institutions", "communities", "seminars", "blogs", "course modules", "engineering projects", "collaboration", "team blog", "service learning"]}, {"title": "Animated engineering tutors: Middle school students' preferences and rationales on multiple dimensions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462209", "abstract": "The goal of the study was to explore middle school students' preferences for an animated engineering tutor, and investigate their rationales for their choices. 77 middle school students participated in the study, and provided their preferences and rationales on various dimensions of an animated engineering tutor such as gender, age, personality, and clothing. Results showed that for teaching engineering in a computer-based instructional module, students preferred an animated engineering tutor that was similar to their age, matching their own gender, with a fun personality, and that speaks slowly.", "authors": [{"name": "Amy Johnson", "affiliation": "School of Electrical, Computer and Energy Engineering, Arizona State University, Tempe, USA "}, {"name": "Martin Reisslein", "affiliation": "School of Electrical, Computer and Energy Engineering, Arizona State University, Tempe, USA"}, {"name": "Gamze Ozogul", "affiliation": "School of Electrical, Computer and Energy Engineering, Arizona State University, Tempe, USA "}], "tags": ["educational institutions", "clothing", "humans", "engineering education", "preferences", "engineering tutor", "animated pedagogical agents", "helium", "speech"]}, {"title": "Work in progress: Entrepreneurial skills for computing graduates", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462210", "abstract": "Preliminary experience with a final year activity focusing on Entrepreneurship & Enterprise is presented. The curriculum is described and its suitability for Computing students evaluated. Persuading technical students to participate in a non-technical course is a considerable challenge. The University has recently organized an annual business competition, with prizes, to encourage students to pursue their ideas and develop commercial products and services. This has been incorporated into the assessed course with some success.", "authors": [{"name": "Jeff Graham", "affiliation": "XOR Systems, Cirencester, Gloucs., GL76PY, UK"}, {"name": "Rob Williams", "affiliation": "Dept CSCT, University of the West of England (UWE), Bristol, BS161QY, UK "}], "tags": ["focusing", "professional development", "educational institutions", "employment", "graduate training", "innovation management", "enterprise", "entrepreneurship", "economic indicators"]}, {"title": "Standards-based grading: Preliminary studies to quantify changes in affective and cognitive student behaviors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462211", "abstract": "Assessing student learning is a key component to education. Most institutions assess learning using a score-based grading system. Such systems use multiple individual assignment scores to produce a cumulative final course grade, which may or may not represent what a student has learned. Standards-based grading offers an alternative that addresses the need to directly assess how well students are developing toward meeting the course objectives. The course objectives are the focal point of the grading system, allowing the instructor to assess students on clearly defined objectives throughout the course. The system assesses how well students become proficient in the course objectives over the duration of the course. This study extends the use of standards-based grading at the K-12 level into the realm of undergraduate science, technology, engineering, and mathematics (STEM) education. Five STEM courses pilot tested the integration of a standards-based grading system to investigate how it impacts affective and cognitive student behaviors. The results suggest that a standards-based grading system increased student domain-specific self-efficacy, was perceived as valuable, and helped students develop more sophisticated beliefs about STEM knowledge.", "authors": [{"name": "John David N. Dionisio", "affiliation": "Seaver College of Science and Engineering, Loyola Marymount University, Los Angeles, CA, USA"}, {"name": "Matthew T. Siniawski", "affiliation": "Seaver College of Science and Engineering, Loyola Marymount University, Los Angeles, CA, USA "}, {"name": "Adam R. Carberry", "affiliation": "College of Technology & Innovation, Arizona State University, Mesa, AZ, USA "}], "tags": ["educational institutions", "presses", "standards-based grading", "engineering education", "reliability", "instruments", "student behaviors", "assessment", "standards"]}, {"title": "Integrating developmental instruction in four sustainability contexts into an undergraduate engineering design curriculum: Level three", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462212", "abstract": "Developmental instruction in four sustainability contexts (environmental, social, economic, technical) in an engineering design curriculum offers a strong foundation and framework upon which to build an engineering program that teaches students the necessary methodologies for designing for sustainability. Instruction in sustainability contexts described in the current paper employs a developmental approach using Bloom's Taxonomy of Educational Objectives, which is a way to classify instructional activities or questions as they progress in cognitive difficulty. Our objective in this paper and presentation is to detail an instructional methodology (and results of a case study and focused group assessment) that integrates sustainability instruction in four contexts into the fifth and sixth classes in our six-course design curriculum using a developmental approach. This effort is funded by National Science Foundation IEECI Grant #0933948 and National Science Foundation CCLI Grant #0837465.", "authors": [{"name": "Eric Pappas", "affiliation": "James Madison University "}, {"name": "Robert Nagel", "affiliation": "James Madison University"}, {"name": "Olga Pierrakos", "affiliation": "James Madison University "}], "tags": ["educational institutions", "sustainability", "communities", "engineering design", "developmental instruction", "green products", "economics", "context", "taxonomy"]}, {"title": "On deployment of effective instructional strategies: Students' engagement through cooperative learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462213", "abstract": "Engineering education in the Arab Gulf States (the Region) faces significant challenges as it seeks to meet the demands on the engineering profession in the twenty first century. This paper focuses on classroom-based pedagogies of engagement, and cooperative learning strategies in particular. The paper is a follow up to previous work by the author, on viable strategies to improve the classroom environment of engineering colleges in the Region. At the start, the paper provides an overview of relevant benchmarks of engineering education in the Region. Then, relates author's preliminary findings on teaching/learning practices in Region's colleges, sheds light on the pros and cons of the lecture format, and examines the literature on substance of different active learning protocols, focusing on cooperative engagement strategies. Next, it identifies barriers to reformation in general, and to the use of modern pedagogical skills in particular. The paper also argues that any meaningful change in Region's classroom practices (dominated by traditional lecture-based methods) should be supported by the university administration. What is necessary to create a change, is for the department or college, to have a comprehensive and feasible set of plans: articulated expectations, opportunities for faculty to learn about new pedagogies, and an equitable reward system.", "authors": [{"name": "Waddah Akili", "affiliation": "Principal, Geotechnical Engineering, Ames, Iowa, USA"}], "tags": ["active learning protocols", "art", "educational institutions", "communities", "protocols", "engineering education", "lecture format", "arab gulf states", "cooperative learning", "materials"]}, {"title": "Introducing “stickiness” as a versatile metric of engineering persistence", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462214", "abstract": "A new metric, “stickiness,” is proposed, tracking longitudinally all students who have contact with a discipline to determine the likelihood those students will “stick” to that discipline and graduate in it. This metric has the versatility to be relevant for students making contact with engineering through a variety of pathways. Stickiness exhibits significant disciplinary differentiation. Whereas earlier work has shown that Industrial Engineering is the most successful at attracting and retaining students, the disciplinary distribution of stickiness shows that Industrial Engineering is exceptional. Disaggregating by race/ethnicity and gender, much larger variations in stickiness are observed (as much as 48 percent), and positive and negative outcomes are identified where students in particular subpopulations are more or less likely to stick than expected. Aggregated by race/ethnicity and gender, the stickiness of transfer students ranks the disciplines in the same order as the stickiness of first-time-in-college students, but transfer stickiness exhibits less disciplinary variation and transfer students in all disciplines exhibit higher stickiness than first-time-in-college students.", "authors": [{"name": "Marisa K. Orr", "affiliation": "Engineering Education, Purdue University, West Lafayette, Indiana, USA "}, {"name": "Richard A. Layton", "affiliation": "Mechanical Engineering, Rose-Hulman Institute of Technology, Terre Haute, Indiana, USA "}, {"name": "Susan M. Lord", "affiliation": "Engineering, University of San Diego, San Diego, California, USA "}, {"name": "Matthew W. Ohland", "affiliation": "Engineering Education, Purdue University, West Lafayette, Indiana, USA "}, {"name": "Russell A. Long", "affiliation": "Engineering Education, Purdue University, West Lafayette, Indiana, USA"}], "tags": ["measurement", "statistics", "retention", "industrial engineering", "educational institutions", "engineering education", "transfer students", "sociology", "persistence", "metric", "longitudinal"]}, {"title": "Work in progress: En route to lifelong learning? Academic motivations, goal orientations, and learning conceptions of entering first-year engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462215", "abstract": "Although lifelong learning is among the most critical skills required of today's engineering graduates, the complex processes through which individuals develop the attitudes, beliefs, and skills of lifelong learners remains unclear. Instructors have only begun to understand the impacts of academic background, institutional climate, and pedagogy on students' development of the motivations and learning strategies characteristic of lifelong learners. In this ongoing mixed-methods investigation, we draw on existing motivation and self-regulated learning theories to examine how undergraduate students at a small private college and a large public university become more self-directed as they progress through the first two years of their engineering programs. Preliminary findings indicate that first-year students at the two institutions report significant differences in their motivations and goal orientations. Students at the small private college express higher intrinsic motivation and learning orientation, and lower external regulation and grade orientation, compared to students at the large public university. The two groups also show differences in their beliefs about individual versus social learning. We briefly discuss how differences in motivations, goals, and beliefs may impact student responses to early program experiences, and require instructors to tailor their approaches to support the needs of emerging lifelong learners.", "authors": [{"name": "Robert Martello", "affiliation": "Franklin W. Olin College of Engineering, Needham, MA, USA "}, {"name": "Roberta Herter", "affiliation": "California Polytechnic State University at San Luis, Obispo, San Luis Obispo, CA, USA"}, {"name": "Jonathan Stolk", "affiliation": "Franklin W. Olin College of Engineering, Needham, MA, USA "}, {"name": "Katherine C. Chen", "affiliation": "California Polytechnic State University at San Luis, Obispo, San Luis Obispo, CA, USA "}, {"name": "Taylor Lobe", "affiliation": "Franklin W. Olin College of Engineering, Needham, MA, USA "}, {"name": "Boris Taratutin", "affiliation": "Franklin W. Olin College of Engineering, Needham, MA, USA "}], "tags": ["uncertainty", "lifelong learning", "self-regulated learning", "educational institutions", "epistemic beliefs", "self-directed learning", "presses", "motivation", "goal orienatation", "engineering students", "psychology"]}, {"title": "Work in progress: Student outcomes of design projects across the curriculum", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462216", "abstract": "This addresses the question, \"To what degree can design projects integrated into the Chemical and Biomolecular Engineering (ChBE) curriculum affect student confidence in their design skills and perceptions of ChBE as a whole?\" To answer this question, students were evaluated on their confidence with engineering design and their satisfaction with ChBE as a discipline before and after the design projects, as well as their perceived learning outcomes after completing the design projects.", "authors": [{"name": "Ayesha Boyce", "affiliation": "I-STEM Education Initiative, University of Illinois at Urbana-Champaign, Urbana, Illinois "}, {"name": "Kathryn Trenshaw", "affiliation": "Department of Chemical and Biomolecular Engineering, University of Illinois at Urbana-Champaign, Urbana, Illinois "}, {"name": "Jerrod Henderson", "affiliation": "Department of Chemical and Biomolecular Engineering, University of Illinois at Urbana-Champaign, Urbana, Illinois "}, {"name": "Lizanne DeStefano", "affiliation": "I-STEM Education Initiative, University of Illinois at Urbana-Champaign, Urbana, Illinois"}], "tags": ["educational institutions", "design", "chemicals", "chemical engineering", "engineering education", "capstone", "pipelines", "project", "student outcomes", "curriculum", "industries"]}, {"title": "Exploring the significance of multi-touch tables in enhancing collaborative software design using UML", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462217", "abstract": "Encouraging collaborative software design through the use of multi-touch interfaces has become increasingly important, because such surfaces can accommodate more than one user concurrently, which is particularly useful for collaborative software design. In this paper, the potential of using multi-touch MT-CollabUML application for collaborative software design is explored. This exploration is done by looking at how students' collaboration might be enhanced in collaborative software design using Unified Modeling Language (UML) comparing the traditional paper-based environment with the contemporary multi-touch table environment.", "authors": [{"name": "Liz Burd", "affiliation": "School of Engineering and Computing Sciences, Durham University, Durham, United Kingdom"}, {"name": "Mohammed Basheri", "affiliation": "Faculty of Computing and Information Technology, King Abdulaziz University, Jeddah, Saudi Arabia "}], "tags": ["collaborative work", "unified modeling language", "educational institutions", "multi-touch table", "software design", "collaborative software", "uml", "teamwork"]}, {"title": "Computational science programs: The background research", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462218", "abstract": "There are many good reasons for an academic institution to pursue the addition of an undergraduate program in computational science. However, poor planning can lead to wasted time, money and resources, and ultimately a failed program. To create a viable program, it is essential to have buy-in from the computational faculty and science faculty, as well as the administration. In addition, it is important to understand the skill-set desired by the potential employers and graduate programs, and to design a curriculum around those needs keeping in mind the expertise of the faculty involved. This paper strives to share what was learned from over a year of background research on what it takes to have a successful computational science program.", "authors": [{"name": "Catherine Crockett", "affiliation": "Mathematical, Information, and Computer Sciences Department, Point Loma Nazarene University San Diego, CA, USA"}, {"name": "Lori Carter", "affiliation": "Mathematical, Information, and Computer Sciences Department, Point Loma Nazarene University San Diego, CA, USA "}, {"name": "Ryan Botts", "affiliation": "Mathematical, Information, and Computer Sciences Department, Point Loma Nazarene University San Diego, CA, USA "}], "tags": ["educational institutions", "computational science", "curriculum design", "scientific computing", "interdisciplinary", "biology", "bioinformatics", "computers", "computer science"]}, {"title": "Modelling remote laboratories integrations in e-learning tools through remote laboratories federation protocols", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462220", "abstract": "An educational remote laboratory is a software and hardware tool that allows students to remotely access real equipment located in the university as if they were in a hands-on-lab session. Federations of remote laboratories have existed for years: they are based on enabling two universities to exchange remote laboratories directly, without registering students of the latter on the former university. Integration of remote laboratories on Learning Management Systems (LMS) or Content Management Systems (CMS) have also been addressed in the past, enabling institutions to delegate the authentication or authorization of the experiments to the LMS/CMS. However, these integrations are usually achieved in an ad hoc way, integrating each particular laboratory to a LMS/CMS. This contribution studies the use of federation models to integrate remote laboratory management systems in LMS/CMSs, since both approaches (integrating a laboratory on an a external electronic learning tool, and integrating a laboratory on other laboratory) are essentially equivalent. The contribution defines two case studies to evaluate this approach, showing how this integration is achieved on a LMS (Moodle) and on a CMS (Joomla).", "authors": [{"name": "Diego Lopez-de-Ipina", "affiliation": "DeustoTech - Deusto Institute of Technology, University of Deusto, Bilbao, Spain "}, {"name": "Manuel Castro", "affiliation": "Electrical and Computer Engineering Department (DIEEC), Spanish University for Distance Education (UNED), Madrid, Spain "}, {"name": "Javier Garcia-Zubia", "affiliation": "Faculty of Engineering University of Deusto, Bilbao, Spain"}, {"name": "Mikel Emaldi", "affiliation": "DeustoTech - Deusto Institute of Technology, University of Deusto, Bilbao, Spain "}, {"name": "Elio Sancristobal", "affiliation": "Electrical and Computer Engineering Department (DIEEC), Spanish University for Distance Education (UNED), Madrid, Spain "}, {"name": "Pablo Orduna", "affiliation": "DeustoTech - Deusto Institute of Technology, University of Deusto, Bilbao, Spain "}], "tags": ["authorization", "educational institutions", "least squares approximation", "remote laboratories", "protocols", "authentication"]}, {"title": "Eliciting Yucatan peninsula teachers' images of engineering and engineers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462221", "abstract": "Data were collected using the Draw an Engineer test followed by unstructured informal interviews to determine individual conceptions of engineering and what engineers do, as well as to make a comparison between teachers' conceptions from two states of the Yucatan peninsula. Drawings and open-ended responses were analyzed following an inductive data analysis approach. Four main categories emerged: 1) engineers in action, 2) characteristics of an engineer, 3) gender, and 4) work context. The majority of participants in this study perceive engineers as male individuals that perform activities related to construction (in the case of Quintana Roo) or oil (in the case of Campeche) industries. Interviews supported main findings while helping researchers gain insight into individual reasoning behind the interviewed teachers' drawings and answers. Our results suggest differences on how Yucatan peninsula teachers perceive engineering and engineers based on the state where they are from, their gender, and grade in which they teach.", "authors": [{"name": "Aurelio Lopez-Malo", "affiliation": "Center for Science, Engineering, and Technology Education. Universidad de las Américas Puebla. Cholula, Mexico "}, {"name": "Enrique Palou", "affiliation": "Center for Science, Engineering, and Technology Education. Universidad de las Américas Puebla. Cholula, Mexico"}, {"name": "Maria Jose Guillermo Echeverria", "affiliation": "Center for Science, Engineering, and Technology Education. Universidad de las Américas Puebla. Cholula, Mexico "}, {"name": "Caridad C. Cruz Lopez", "affiliation": "Center for Science, Engineering, and Technology Education. Universidad de las Américas Puebla. Cholula, Mexico "}], "tags": ["engineering profession", "yucatan", "educational institutions", "conferences", "images of engineering and engineers", "draw an engineer", "mathematics", "context", "interviews"]}, {"title": "Using modern graph analysis techniques on mind maps to help quantify learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462222", "abstract": "In this work, we use a graph analysis tool to measure how student-created mind maps reflect learning. Mind maps consist of words and connections between words, and this visual tool helps illustrate how an individual understands how these words connect together in a field. From an analysis standpoint, mind maps are graphs consisting of nodes connected by edges. In the fall of 2011, students created three mind maps over the duration of a digital system design course, and at each of the three intervals, these mind maps were created with the same 20 terms that were introduced throughout the course. Each student's mind maps were then digitally encoded and analyzed using a modern graph analysis tool called GraphCrunch II. Our results show that a simple analysis of graph density is a poor indicator of learning since this metric does not capture a graph's structure, and it is this structure that reflects meaning and understanding by the learner. Instead, a metric called relative graphlet frequency distance (RGF-distance), which is calculated by comparing a golden mind map (expert created mind map) to each of the students mind maps, is used to analyze each students understanding of how these words relate. Our results show that learner's mind maps decrease in RGF-distance over the period of the course, and this means that the students are building graphs more similar to that of the golden model. We, also, see that the RGF-distance over the set of students compared to their grades on an exam or overall grade in the course has some correlation, meaning that these mind maps relate to grades in terms of the learners understanding of vocabulary, but the correlation is not strong. The ultimate goal of these tools is to provide the learners with a method of getting automatic feedback on their understanding as well as learning progress in particular topics.", "authors": [{"name": "Peter Jamieson", "affiliation": "Deptartment of Electrical and Computer Engineering, Miami University"}], "tags": ["educational institutions", "frequency measurement", "correlation", "vocabulary", "market research", "computers"]}, {"title": "Quality of service, quality of experience and online learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462223", "abstract": "Online learning tools are widely used in engineering education. This includes traditional face-to-face, but also distance education. Since these tools rely on Internet connections, the performance of those connections (speed, latency) can impact on how learning tools are experienced by students. Quality of Service (QoS) describes technical performance parameters that reflect the quality of an Internet connection. Quality of Experience (QoE) on the other hand has been widely used to describe how users experience a particular service. In the context of this work, users are students undertaking learning tasks. While technical literature addresses QoE and educational literature discusses online learning, a gap exists describing the relationship of QoS and the quality of the learning experience. This work uses a mixed methods approach to address the research question: What dimensions of QoE of online learning can be affected by QoS? To answers this question, two groups of students were exposed to changing QoS conditions while they were undertaking an online learning activity using remote access technology. Both technical performance parameters, as well as, the impressions where recorded. Subsequently, a focus group was held to get a better understanding of the students' perception of the relationship between QoS, QoE and online learning tools. It is concluded that QoS factors only have an intermediate impact on the quality of the learning experience of the students. Factors such as course design and pedagogy largely determine the quality of online learning.", "authors": [{"name": "Alexander A. Kist", "affiliation": "Faculty of Engineering and Surveying, University of Southern Queensland, Toowoomba, Australia "}, {"name": "Lyn Brodie", "affiliation": "Faculty of Engineering and Surveying, University of Southern Queensland, Toowoomba, Australia"}], "tags": ["internet", "educational institutions", "quality of experience", "laboratories", "distance education", "online learning tools", "quality of service", "quality of learning experience performance", "materials", "context"]}, {"title": "New pedagogic challenges in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462224", "abstract": "Never has the speed of development in the area of engineering been as accelerated as it is today, as we observe the enormous and driven growth of the area of engineering. Today's tendencies require concerted new efforts in engineering education — or in other words, the importance of pedagogy in the field of engineering is growing enormously. These changes strongly demand new didactic and pedagogic paradigms. The International Society of Engineering Education (IGIP) offers to contribute to the relevance and pedagogical aspects related to developing educational concepts in engineering education.", "authors": [{"name": "Michael E. Auer", "affiliation": "International Society of Engineering Education (IGIP), Villach, Austria "}, {"name": "Danilo Zutin", "affiliation": "Dept. Engineering & IT, Carinthia University of Applied Sciences (CUAS), Villach, Austria"}], "tags": ["accreditation", "challenges", "educational institutions", "pedagogy", "didactics", "engineering education", "knowledge engineering", "training", "igip", "media"]}, {"title": "Work in progress: How student use lecture notes in an Operating Systems course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462225", "abstract": "In our Operating Systems course we make available in advance the lecture slides and lab sessions material. The slides are built paying attention to present the key ideas and with embedded links to sites in the Web where the topic is covered in greater detail. We also provide the corresponding excerpts of selected textbooks. Following the download activity and paying attention on what our students are doing during the lectures, we are able to collect some data on notes usage. By carefully selecting some questions in the test we can distinguish which student used the material available in links and excerpts. In this paper we present some patterns of use of the lecture notes.", "authors": [{"name": "Maria Feldgen", "affiliation": "Facultad de Ingeniería, Universidad de Buenos Aires, Argentina"}, {"name": "Osvaldo Clua", "affiliation": "Facultad de Ingeniería, Universidad de Buenos Aires, Argentina "}], "tags": ["internet", "student attendance", "educational institutions", "operating systems", "student notes", "encoding", "psychology", "hypertext", "materials", "computers"]}, {"title": "Work in progress: A constructivist didactic methodology for a humanoid robotics workshop", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462226", "abstract": "This paper presents a constructivist methodology oriented to training Robotics in its wide sense, and its implementation in higher education. A humanoid robotics workshop is included as a part of the curriculum of ‘Industrial Robotics’ in the Industrial Engineering. This workshop covers one third of the laboratory practices of this subject. A constructivist view for learning is adopted, whereby robotic technologies are not seen as mere tools, but rather as potential vehicles of new ways of thinking about teaching, learning and education at large. Students, in a constructivist learning environment, are invited to work on experiments and authentic problem-solving; with selective use of available resources according to their own interests, research and learning strategies. The authors, as trainers of this workshop, chose ROBONOVA humanoid robots, among other devices, which attempt to partner technology with ideas of constructivism. The materials used in the workshop offer building parts, sensors thus connecting a robot with the external environment and programming software with a simple graphical interface intended for the creation of robot behavioral movements. The idea is “learning by design”, which is central in the constructivist pedagogy introduced firstly by Resnick. In this workshop we corroborate this idea through the project-based learning approach in robotics. Learning tasks of the workshop are organized as projects (small and large) that encourage students to develop their own designs. Projects are either instructor led or completely arisen from students.", "authors": [{"name": "Antoni Grau", "affiliation": "Automatic Control Dept, Technical University of Catalonia UPC, Barcelona, Spain "}, {"name": "Yolanda Bolea", "affiliation": "Automatic Control Dept, Technical University of Catalonia UPC, Barcelona, Spain "}, {"name": "Alberto Sanfeliu", "affiliation": "Automatic Control Dept, Technical University of Catalonia UPC, Barcelona, Spain"}, {"name": "Alexandre Miranda", "affiliation": "Automatic Control Dept, Technical University of Catalonia UPC, Barcelona, Spain "}], "tags": ["robot sensing systems", "educational institutions", "humanoid robots", "conferences", "constructivism", "service robots", "robotics"]}, {"title": "Work in progress: Exploring programming anti-patterns as emphasis on creativity in the teaching of computer programming: Programming anti-patterns as emphasis on creativity", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462227", "abstract": "Computer programming is a creative activity. However, while computer scientists have devoted their work to solving complex problems and developing new technology, few have written on the creative process behind their innovations. This work explores programming anti-patterns as beneficial detour to the creation of good programming designs. Examples of programming anti-patterns are: failure to combine linear traversal and a flag variable to search a given value in a uni-dimensional array; to draw wrong analogies from natural language; not consider uncommon cases in a solution; to overlook minor parts of the problem; to assume that a program construct will work in the same manner in all situations; not be flexible in understanding new code, not being aware that there are many different right solutions to a problem. In this research, the teacher of introductory programming course promotes discussions among students involving the bad and good features of program anti-patterns, when there are programming anti-patterns code examples and discussions based on situations having the potential to prevent programming anti-patterns, when programming anti-patterns describe a lack of programming skill. An initial experiment showed improvements in creation of good program designs by students, when the teacher boosts discussions exploring program anti-pattens.", "authors": [{"name": "Deller James Ferreira", "affiliation": "Informatics Institute, Federal University of Goiás, Goiânia, Brazil"}], "tags": ["creative programmer", "conferences", "collaboration", "education", "collaborative programming", "programming anti-pattern", "programming profession", "computers"]}, {"title": "An assessment of stress factors on engineering academics in a regional context", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462228", "abstract": "The Australian higher education sector has accepted that increasing work-related stresses can have a negative impact on the quality and productivity of academic life. Workplace stresses can have significant financial impact both on university budgets and the overall economy due to poor decision-making, health issues and accidents resulting from illness. Engineering academics that teach and/or research within higher education institutions have been reported anecdotally to have a high prevalence of stress. The actual (self-perceived) level however has been largely unquantified. The research reported in this paper was conducted to assess self-perceived stress levels and identify the stress factors within a cohort of engineering academics at the University of Southern Queensland (USQ), a small regionally based Australian university renowned for its distance education. The questionnaire was applied using a mix of validated and non-validated survey instruments and incorporated a set of questions previously applied at the University of Adelaide (UoA). Findings from USQ are broadly in line with those independently reported elsewhere for Australia and the UK, with some minor exceptions. In summary the USQ project indicates that engineering academics have higher perceived stress levels than the validated health threshold, with significant variation based on age, academic type (teaching-research), and for staff with English as a second language. The results from both universities also indicated that there are significant stress contributors related to the pressure to obtain grants and to publish and to the (low) resultant levels of recognition from employers for any success. More specific to distance education providers (such as USQ), there are stress contributors related to servicing and dealing with the external mode of course design, delivery and lecture preparation.", "authors": [{"name": "Hong Zhou", "affiliation": "Faculty of Engineering and Surveying, University of Southern Queensland, Toowoomba, Australia "}, {"name": "Frank Bullen", "affiliation": "Faculty of Engineering and Surveying, University of Southern Queensland, Toowoomba, Australia "}, {"name": "Kenneth Davey", "affiliation": "Faculty of Engineering, Computer and Mathematical Sciences, University of Adelaide, Adelaide, Australia"}, {"name": "Steven Goh", "affiliation": "Faculty of Engineering and Surveying, University of Southern Queensland, Toowoomba, Australia "}], "tags": ["australia", "productivity", "educational institutions", "employment", "workplace practices", "stress", "academic development", "work-related stress", "faculty development", "context"]}, {"title": "Promoting design skills in distributed systems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462229", "abstract": "Distributed software system design is by nature an ill-defined or wicked problem. In order to learn to design them, the student must be presented with complex, open-ended problems for which there may be more than one correct solution. The decision-making strategies students acquired in previous courses are not effective when applied to large, complex problems of distributed systems. Students (novice designers) tend to think linearly and focus only on the problem at hand. They also tend to use trial-and-error strategies and they lack confidence in their design decisions. The purpose of the distributed systems' course is to create a learning approach that helps students to adopt and to apply expert design decision-making strategies. We use a case-based learning approach with classroom assessment techniques and rubrics to identify the critical weaknesses in the approaches that novices typically use when attempting to solve difficult design-oriented problems. The novice-oriented knowledge-based learning and application environment is supported by scaffoldings to incorporate expert strategies. In this paper, we describe the experience and the learning environment that provides the opportunities for professional development. We present and analyze our data comparing the students' outcomes over four terms, the time it takes to develop our students' expertise and how time spent with an expert (instructor) is crucial to an overall development.", "authors": [{"name": "Osvaldo Clua", "affiliation": "Facultad de Ingenieria, University of Buenos Aires, Buenos Aires, Argentina"}, {"name": "Maria Feldgen", "affiliation": "Facultad de Ingenieria, University of Buenos Aires, Buenos Aires, Argentina "}], "tags": ["cognition", "cats", "unified modeling language", "expertise", "assembly", "formative assessment", "prototypes", "problem-based learning", "distributed systems", "software", "scaffoldings", "problem-solving"]}, {"title": "Work in progress: Multi-faceted penetration of fast fourier transform by interactively analyzing real-world objects via mobile technology", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462230", "abstract": "Recent research shows that the engineering students have problems connecting the required computation to a conceptual understanding, as well as translating a graphical understanding of the process to a symbolic mathematical representation, especially when handling the multiple steps of the procedures. The students are usually able to perform sequences of the underlying calculations but cannot piece together the higher conceptual relationship that drives these procedures. This work-in-progress paper presents a viable approach and a new teaching and learning paradigm to enhance the effectiveness of teaching fast Fourier transform and significantly improve the learning outcomes. By integrating the mobile and cloud computing technologies, we are developing a handheld real-world relevance laboratory that includes an integrated learning module for Fourier transform and a shared intelligent project repository to host the module and real-world relevant data. This development is expected to overcome the intellectual inaccessibility of transform techniques and tackle the challenges in existing approaches: the prohibitive cost of project-based approach; limited access and real-world relevance data in simulation-based approach, and unreliable and unsustainable support.", "authors": [{"name": "Kai Qian", "affiliation": "School of Computer Science and Software Engineering, Southern Polytechnic State University, Marietta, GA "}, {"name": "Chih-Cheng Hung", "affiliation": "School of Computer Science and Software Engineering, Southern Polytechnic State University, Marietta, GA"}, {"name": "Liang Hong", "affiliation": "Department of Electrical and Computer Engineering, Tennessee State University, Nashville, TN "}], "tags": ["mobile device", "interactive analysis", "laboratories", "real-world relevance", "mobile communication", "education", "fast fourier transforms", "fast fourier transform", "computers"]}, {"title": "Improving students understanding of engineering concepts through project based learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462231", "abstract": "Traditional methods of teaching are falling short in engaging students at higher levels of learning. To adequately prepare students for engineering practice, innovative methods of teaching, learning and assessment are required. Particular emphasis should be placed on enabling students to make the connection between theory and practice. The authors discuss how the approach of “theory to practice” was implemented using project based learning and case studies in two courses at the United States Coast Guard Academy. Students' feedback and other assessment tools indicated that students were engaged in a higher level of learning and understanding of engineering principles.", "authors": [{"name": "Brian Maggi", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut "}, {"name": "Kassim Tarhini", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut "}, {"name": "Nathan Rumsey", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut"}, {"name": "Hudson Jackson", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut "}], "tags": ["case study", "design", "geotechnical engineering", "concrete", "soil", "project based learning", "reinforced concrete", "knowledge engineering", "education", "structural beams", "civil engineering", "taxonomy"]}, {"title": "Developing a simple and effective method of assessing Civil Engineering student outcomes", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462232", "abstract": "The assessment of student outcomes can be made easier if the proper plan and processes are put in place before starting data collection. The key to simplifying the process is to collect targeted data after developing performance indicators and mapping them to appropriate courses. The authors discuss the evolution of the Coast Guard Academy's Civil Engineering assessment process highlighting how the process has been streamlined and simplified through the development of assessment tools to measure achievement of performance indicators linked to each student outcome. The authors further discuss how the assessment data are analyzed holistically and used to guide improvements to courses and the curriculum.", "authors": [{"name": "Sharon Zelmanowitz", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut "}, {"name": "Kassim Tarhini", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut "}, {"name": "Charles Hatfield", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut"}, {"name": "Hudson Jackson", "affiliation": "Department of Engineering, United States Coast Guard Academy, New London, Connecticut "}], "tags": ["performance indicator", "accreditation", "educational institutions", "laboratories", "data collection", "assessment tools", "student outcomes", "standards", "civil engineering", "industries"]}, {"title": "Developing innovative thinking among engineering undergraduates: Examining the role of slate enabled technology", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462233", "abstract": "This paper reports the planned implementation for a NSF sponsored study that is being undertaken to examine whether effective use of instructional technology, specifically slate enabled technology, has an impact on the innovative thinking skills among engineering undergraduates enrolled in large lecture classes. The methodology used in this study a quasi-experimental mixed method approach utilizing a control and treatment group. Findings from the planned study can be used to improve innovative thinking skills through effective pedagogical approaches which may include employment of various forms of slate enabled instructional technology.", "authors": [{"name": "Bevlee A. Watford", "affiliation": "Associate Dean of Academic Affairs, College of Engineering, Virginia Tech, Blacksburg, VA USA "}, {"name": "Glenda Scales", "affiliation": "Associate Dean for Information Technology and, International Programs, College of Engineering, Virginia Tech, Blacksburg, VA USA"}, {"name": "Catherine T. Amelink", "affiliation": "Dean's Office, College of Engineering, Virginia Tech, Blacksburg, VA USA "}], "tags": ["educational institutions", "pedagogy", "innovative thinking", "collaboration", "data models", "training", "software", "faculty development", "tablet computers"]}, {"title": "Starting a new conversation: An engineering faculty advisor development program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462234", "abstract": "This work addresses a gap in the professional development of engineering faculty: student advising. The development and assessment of the Designated Faculty Advisor program is described, including training components, student and faculty responses, and future plans.", "authors": [{"name": "Eva Schiorring", "affiliation": "The Research and Planning Group for California Community Colleges, Berkeley, CA"}, {"name": "Emily Allen", "affiliation": "Charles W. Davidson College of Engineering, San José State University, San Jose, CA "}, {"name": "Francisco Castillo", "affiliation": "Charles W. Davidson College of Engineering, San José State University, San Jose, CA "}], "tags": ["educational institutions", "employee welfare", "communities", "advisor", "mentoring", "springs", "training", "four-player model", "doped fiber amplifiers", "faculty development", "advising"]}, {"title": "Work in progress: Hands-on biomechanics lab for undergraduate universities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462235", "abstract": "This paper discusses the development of a biomechanics lab course suitable for use at undergraduate engineering institutions who wish to expand their elective offerings or move towards developing a bioengineering degree program. The labs are designed to be low cost and feasible in a teaching environment with groups of students rotating through stationary lab setups. The biomechanics course at the University of Portland has nine labs. The six stationary labs are 1) Gait Force Profile Analysis, 2) Basketball Freethrow Arm Angle Analysis, 3) Biomechanical Arm Muscle Analysis, 4) Muscle Fatigue Analysis, 5) Occupational Biomechanics Glove Fatigue Analysis, and 6) Breathing, Heart Rate, and Knee Motion Analysis. The three labs performed as a class are 7) Sprint Acceleration and Terminal Velocity Analysis, 8) Auto Collision Analysis, and 9) Orthopaedic Implant Mechanical Testing. The remainder of this paper is a detailed description of each lab, its learning objectives, and how it was implemented. Other aspects, such as final projects, research reports, and student opinions of the course will also be discussed.", "authors": [{"name": "Deborah Schenberger Munro", "affiliation": "Donald P. Shiley School of Engineering, University of Portland, Portland, United States"}], "tags": ["force", "hands-on laboratory experiments", "educational institutions", "undergraduate engineering", "biomedical engineering", "laboratories", "bioengineering", "biomechanics", "fatigue", "muscles"]}, {"title": "Facilitating the creation of K-12 interactive learning objects using a multi device web tool", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462236", "abstract": "This paper presents the experience of designing and implementing an educational content creator adapted to mobile devices in a K-12 environment. Two main issues have been detected when designing this tool. The first one is the screen size, which will limit the contents´ size and the quantity of contents presented at the same time in the screen. The second issue is related to the touch screens these devices have, which changes the whole user experience. Four types of resources can be generated with this tool considering these issues. Firstly, a virtual microscope where the user can select a sample and study it in detail through the microscope. Secondly, a quiz where the user has to join words to their corresponding definitions or images. Thirdly, a virtual chemistry experiment where the user has to drag and drop pipettes to complete chemical formulas. And finally, a generic flashcard that presents a background image and several “hot zones” where the user can touch and see additional contents that the teacher has previously tagged. Details about the technologies and details related to its implementation are described in the paper.", "authors": [], "tags": ["videos", "browsers", "virtual experiments", "microscopy", "interactive learning objects", "smart phones", "chemistry", "materials", "multi-device resources", "science in education"]}, {"title": "A web tool to create educational content with gaming visualization", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462237", "abstract": "Students usually love games. They captivate their attention and hold it for lengthy periods of time. Educational systems have taken advantage of this fact and have used games in education for many years. However, teachers cannot create their own games as easily as they create other learning objects. A tool to assist this labor would be very useful for them. In this paper, we present NICE-Game, an innovative game-like educational content creation tool. It is divided into two modules, the builder to create the games and the viewer to play them. With NICE-Game, different kinds of educational contents (i.e. images, videos, texts) can be easily integrated into a game. Using personal handheld devices is a growing trend among students, hence multi-platform and multi-device issues have been also considered in this implementation. Details about the design, development and the tool itself are explained in this paper as well as an example of an educational game available online.", "authors": [], "tags": ["games in education", "nice-game", "videos", "games and mobile-learning", "browsers", "games", "education", "europe", "servers", "smart phones"]}, {"title": "Students' experiences and attitudes towards learning computer science", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462238", "abstract": "Low enrollment and high drop-out rates in computer science (CS) have led to an alarming decrease in number of graduates in western countries. What are students' learning experiences, how do these affect their attitudes towards learning CS? This question was explored by investigating diverse students, of a broad study program with courses in humanities and technology, at the end of an introductory course in CS (CS1), which has been designed to enhance students' engagement. The results of a first questionnaire were remarkably positive: All students reflected their experiences as overall positive. Almost half of the students stated, that they had been skeptical towards learning CS before the course. All of these students described positive transformations of attitudes. These results provided an interesting starting point for further research using interviews: What exactly have these students experienced and how do they reason about future engagement? We point out students' experiences that were crucial for a positive transformation of attitudes as well as critical aspects in students' reasoning on future engagement in CS.", "authors": [{"name": "Arnold Pears", "affiliation": "Department of Computer Systems, Uppsala University, Box 325, 751 05 Uppsala, Sweden"}, {"name": "Anne-Kathrin Peters", "affiliation": "Department of Computer Systems, Uppsala University, Box 325, 751 05 Uppsala, Sweden "}], "tags": ["cognition", "programming", "educational institutions", "computers", "interviews"]}, {"title": "Work in progress: Towards a framework for adaptive learning systems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462239", "abstract": "The development of systems which adapt to the needs of student learning is a complex task. Learning involves several factors, including effective communication in a specific context. In this paper, we propose a conceptual framework to allow the integration of adaptive hypermedia in learning management systems from a cognitive-semantic perspective.", "authors": [{"name": "Erika H. Nozawa", "affiliation": "IATECAM Manaus, Brazil "}, {"name": "Luciana F. Costa", "affiliation": "IATECAM Manaus, Brazil "}, {"name": "Elaine H. T. Oliveira", "affiliation": "Institute of Computing, Federal University of Amazonas, Manaus, Brazil "}, {"name": "Rosa M. Vicari", "affiliation": "Institute of Informatics, Federal University of Rio Grande do, Sul "}, {"name": "Yuri Albuquerque", "affiliation": "IATECAM, Manaus, Brazil"}], "tags": ["educational institutions", "ontologies", "adaptation models", "adaptive systems", "software", "context"]}, {"title": "An INSPIRED game programming academy for high school students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462240", "abstract": "The demand for computing professionals is growing, but the number of college freshmen selecting computing majors has declined in recent years. Many organizations host academies that attempt to engage students in computing at an early age by exposing them to fun applications. Lamar University's Increasing Student Participation in Computing Program has developed a high school computing academy that uses game programming as an engaging hands-on approach to teach kids computing concepts. The game programming platform is freely downloaded and so is easily accessible to teachers and students. A formal assessment of the 2011 academy found that the high school participants experienced a significant increase in knowledge and interest in computing. This paper describes how the academy is organized, taught and assessed. The paper also has pointers to a website from which the instructional and assessment materials for the academy can be freely downloaded. The intent of the paper is to provide all of the information that is needed for others to host such academies and further promote the effort to increase participation in computing.", "authors": [{"name": "Judith Mann", "affiliation": "Lamar University, Beaumont, Texas"}, {"name": "Jiangjiang Liu", "affiliation": "Lamar University, Beaumont, Texas "}, {"name": "Peggy Doerschuk", "affiliation": "Lamar University, Beaumont, Texas "}], "tags": ["high school", "game programming", "educational institutions", "introductory computing", "games", "educational robots", "greenfoot", "increasing participation in computing", "materials", "programming profession"]}, {"title": "The effectiveness of undergraduate research programs: A follow-up study", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462241", "abstract": "Graduate work, especially the Ph.D., requires extensive research, a skill not often emphasized in undergraduate programs. Although not much is known about all the factors that influence undergraduate students' decision to pursue or not pursue graduate studies, particularly in science, technology, engineering and mathematics, recent research indicates that many undergraduates feel unprepared for graduate studies and view the research requirement as a deterrent. Opportunities for undergraduates to engage in research have increased recently as a result of federally funded programs including Research Experiences for Undergraduates (REUs), McNair Achievement Programs and Bioengineering and Bioinformatics Summer Institutes (BBSI). Students work in research laboratories during the summer, interact with faculty and graduate students, learning hands-on how to do research. The Attitudes toward Graduate Studies Survey was developed to help evaluate the effectiveness of these programs at New Jersey Institute of Technology. Students who participate in these programs show increases in their attitudes toward graduate studies and have significantly higher attitudes than students who do not participate. Often students indicate confidence in their ability to pursue graduate studies but only a small percentage think that they will have the skills necessary to begin a Ph.D. program when they complete their undergraduate degree. A possible conclusion is that even though students feel confident in their academic abilities they do not feel confident enough about their research skills to complete a Ph.D. program, making research programs such as REU's, BBSI and McNair, necessary. A follow-up study of students who attended these programs at NJIT over the last decade has found that participation in these programs increases attendance in graduate programs.", "authors": [{"name": "Howard Kimmel", "affiliation": "New Jersey Institute of Technology, Center for Pre-College Programs, Newark, New Jersey, USA"}, {"name": "John Carpinelli", "affiliation": "New Jersey Institute of Technology, Center for Pre-College Programs, Newark, New Jersey, USA "}, {"name": "Angelo Perna", "affiliation": "New Jersey Institute of Technology, Center for Pre-College Programs, Newark, New Jersey, USA "}, {"name": "Linda S. Hirsch", "affiliation": "New Jersey Institute of Technology, Center for Pre-College Programs, Newark, New Jersey, USA "}], "tags": ["attitudes toward engineering", "engineering profession", "research experiences for undergraduates (reu)", "educational institutions", "biomems", "us government", "mcnair", "engineering students", "science - general", "attitudes toward graduate studies"]}, {"title": "Work in progress: Early prediction of students' academic performance in an introductory engineering course through different mathematical modeling techniques", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462242", "abstract": "This paper presents our ongoing efforts in developing mathematical models to make early predictions, even before the semester starts, of what score a student will earn in the final comprehensive exam of the engineering dynamics course. A total of 1,938 data records were collected from 323 undergraduates in four semesters. Employed were four different mathematical modeling techniques: multivariate linear regression, multilayer perceptron neural networks, radial basis function neural networks, and support vector machines. The results show that within the five predictor variables investigated in this study, there is no significant difference in the prediction accuracy of these four mathematical models.", "authors": [{"name": "Shaobo Huang", "affiliation": "Department of Engineering Education, Utah State University, Logan, Utah, USA "}, {"name": "Ning Fang", "affiliation": "Department of Engineering Education, Utah State University, Logan, Utah, USA"}], "tags": ["aerodynamics", "accuracy", "numerical analysis", "engineering dynamics", "calculus", "mathematical model", "mathematical modeling", "predictive models", "support vector machines", "students' academic performance", "early prediction"]}, {"title": "Work in progress: An Intelligent Tutoring System for improving student learning in a sophomore engineering dynamics course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462243", "abstract": "This paper presents our ongoing efforts toward developing an Intelligent Tutoring System (ITS) to improve student learning in a sophomore engineering dynamics course. An ITS module was developed to guide students applying the Principle of Work and Energy to solve particle dynamics problems. Pre-post tests, each including six technical questions, were administrated to 74 engineering undergraduates who took a dynamics course in a recent semester. The assessment results show that the developed ITS module helps students master dynamics concepts and associated calculations.", "authors": [{"name": "Yongqing Guo", "affiliation": "Department of Engineering Education, Utah State University, Logan, Utah, USA "}, {"name": "Ning Fang", "affiliation": "Department of Engineering Education, Utah State University, Logan, Utah, USA"}], "tags": ["aerospace engineering", "educational institutions", "aerodynamics", "engineering education", "student learning", "intelligent tutoring system", "artificial intelligence", "mathematical model", "assessment", "engineering dynamics", "computers"]}, {"title": "Implementation of a multidisciplinary introduction to microfabrication at Binghamton University", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462244", "abstract": "Microfabrication is a critical area to many branches of science and engineering. Beginning in 2009, we undertook a broad multidisciplinary approach to bring microfabrication into all aspects of the science and engineering curriculum. This program was coupled with a comprehensive assessment activity to evaluate the program's effectiveness and continuously improve it year to year. In this paper, we report on the details of our implementation process, the techniques we have found to bring a hands-on experience to large classes and the lessons learned from our attempts to make this topic a mainstream part of engineering and science education.", "authors": [{"name": "Weili Cui", "affiliation": "Binghamton University Binghamton, NY "}, {"name": "Bruce White", "affiliation": "Binghamton University Binghamton, NY "}, {"name": "Greta Myers", "affiliation": "Binghamton University Binghamton, NY "}, {"name": "Wayne Jones", "affiliation": "Binghamton University Binghamton, NY "}, {"name": "David Klotzkin", "affiliation": "Binghamton University Binghamton, NY "}, {"name": "Shawn Wagoner", "affiliation": "Binghamton University Binghamton, NY"}], "tags": ["fabrication", "videos", "educational institutions", "nanofabrication", "engineering education", "knowledge engineering", "pipelines", "microfabrication", "chemistry"]}, {"title": "The adjustment experience of first-year international undergraduate students in engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462245", "abstract": "To compare the challenges that domestic and international students experience in adjusting to college, we conducted a mixed-methods study of first-year undergraduate engineering students at a large public university in the Midwest. We administered a survey to all first-year engineering students. We conducted separate focus groups of domestic and international first-year students. While the domestic and international students identified similar adjustment issues, international students had more difficulty with making American friends, understanding cultural references, adapting to American food, and becoming acquainted with unfamiliar teaching methods and assignments.", "authors": [{"name": "Whitney Barnes", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois at Urbana-Champaign, Urbana, Illinois, USA "}, {"name": "Michael C. Loui", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois at Urbana-Champaign, Urbana, Illinois, USA"}], "tags": ["educational institutions", "diversity", "history", "international students", "asia", "engineering students", "cultural differences", "europe", "first-year students"]}, {"title": "A model for generating proactive context-aware recommendations in e-Learning systems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462246", "abstract": "A proactive recommender system pushes recommendations to the user when the current situation seems appropriate, without explicit user request. This is suitable in e-Learning scenarios in which a great amount of learning objects are available but it is difficult to find them according to the user's needs. In this paper, we present a model for generating proactive context-aware recommendations in the Virtual Science Hub (ViSH), a educational platform related to the GLOBAL excursion European project. The model relies on domain-dependent context modeling in several categories to generate personalized recommendations to teachers and scientists that will produce the learning resources the students will consume. The recommendation process is divided into three phases. First, the generation of the social context information related to the users in the platform. Then, the current situation considering the social, location and user context is analyzed. Finally, the suitability of particular learning objects to be recommended is examined. Therefore, details about the recommendation model proposed and advantages related to applying the model in ViSH can be found in the paper, in addition to some conclusion remarks and outlook on future work.", "authors": [], "tags": ["proactivity", "personalized learning", "context modeling", "mobile handsets", "context-awareness", "europe", "electronic learning", "learning objects recommendation", "market research", "context", "recommender systems"]}, {"title": "Open channel flow misconceptions and ontological categories", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462247", "abstract": "National calls have been made for the identification of preconceptions and misconceptions in science and engineering. Identifying misconceptions can provide a basis for improved research-based curriculum development and implementation. The recognition of false beliefs and flawed mental models of these concepts can also contribute to theories of conceptual change. The purpose of this research was to identify misconceptions related to open channel flow. During spring and fall of 2011, out of 91 students from two sections of ‘Water Resources Engineering’ course, 50 students were interviewed, and 41 students were given a pre/post test. The goal of these open-ended interviews and pre/post-tests was to obtain detailed data on students understanding of open channel flow concepts. Results suggest students have misconceptions relating to the hydraulic and energy grade line (HGL/EGL), flow transitions, and flow profiles. Many students have the correct terms of the HGL and EGL but lack understanding of where the terms re on an open channel flow profile. A large percentage of tested students revealed false beliefs relating to transitions. For example, more than 50 percent of tested students drew a decrease in water depth for a subcritical drop, rather than an increase in depth. Students also had difficult in labeling subcritical, critical, and supercritical places along flow profiles and how water flows over or under different weir structures. Repairing these fundamental misconceptions is essential for students to be able to apply these concepts in diverse situations and learn more advanced topics.", "authors": [{"name": "Jennifer Adam", "affiliation": "Civil and Environmental Engineering, Washington State University, Pullman, USA "}, {"name": "Shane Brown", "affiliation": "Civil and Environmental Engineering, Washington State University, Pullman, USA "}, {"name": "Bernard Vanwie", "affiliation": "Civil and Environmental Engineering, Washington State University, Pullman, USA"}, {"name": "Andrew Easley", "affiliation": "Civil and Environmental Engineering, Washington State University, Pullman, USA "}, {"name": "Devlin Montfort", "affiliation": "Civil and Environmental Engineering, Washington State University, Pullman, USA "}], "tags": ["conceptual change", "educational institutions", "water resources", "misconceptions", "earth", "fluids", "open channel flow", "color", "context", "interviews"]}, {"title": "Development of the science technology engineering and mathematics — Active listening skills assessment (STEM-ALSA)", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462248", "abstract": "The purpose of this investigation was to develop the STEM Active Listening Skills Assessment (STEM-ALSA), a conceptually grounded instrument designed to measure four components of active listening, a key element of communication in an academic setting. The STEM-ALSA is comprised of three unique scales that measure a person's knowledge (12 items), ability to apply (25 items), and self-efficacy (5 items) with respect to active listening. Two pilot studies were conducted with N = 99 upper level undergraduate students enrolled in STEM disciplines to develop and evaluate the instrument. Results of an exploratory factor analysis identified both a unidimensional factor structure for each of the three scales and total scores with adequate internal consistency reliability estimates. The STEM-ALSA provides a mechanism for measuring active listening skills among students in STEM.", "authors": [{"name": "Jennifer M. Bekki", "affiliation": "Department of Engineering, Arizona State University, Mesa, AZ USA "}, {"name": "Robert K. Atkinson", "affiliation": "School of Computing, Informatics, and Decision Systems Engineering, Arizona State University, Tempe, AZ USA"}, {"name": "Kerrie G. Wilkins", "affiliation": "Counseling and Counseling Psychology Program, Arizona State University, Tempe, AZ USA "}, {"name": "Bianca L. Bernstein", "affiliation": "Counseling and Counseling Psychology Program, Arizona State University, Tempe, AZ USA "}, {"name": "Caroline J. Harrison", "affiliation": "CareerWISE Project Manager/Post-Doctoral Researcher, Arizona State University, Tempe, AZ, USA "}], "tags": ["educational institutions", "communication", "instruments", "training", "medical services", "psychology", "loading", "assessment", "graduate students in stem"]}, {"title": "Work in progress: A pilot project to assess the added value of engineering and student affairs collaboration on student cognitive and affective development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462250", "abstract": "This Work-In-Progress paper describes a pilot project at Western Michigan University to assess the added value of academic and student affairs collaboration on student cognitive and affective development. The academic performance in first-year science, technology, engineering and mathematics (STEM) courses as well as retention to STEM are used as measures of cognitive development, and the students' experience in co-curricular activities as captured in their written summaries is used as a measure of their affective development. While there is no statistically significant difference in individual course performance, first-year Engineering House (EH) students have a statistically significant higher GPA than non-EH in fall 2010, and they have a statistically significant higher fall-to-spring retention to engineering and applied sciences than non-EH students.", "authors": [{"name": "Edmund Tsang", "affiliation": "Western Michigan University, College of Engineering & Applied Sciences, Office of Residence Life "}, {"name": "Betsy Aller", "affiliation": "Western Michigan University, Dept. of Industrial & Manufacturing Engineering "}, {"name": "Amanda Glick", "affiliation": "Western Michigan University, Dept. of Industrial & Manufacturing Engineering "}, {"name": "Laura Darrah", "affiliation": "Western Michigan University, College of Engineering & Applied Sciences, Office of Residence Life"}, {"name": "Troy Place", "affiliation": "Western Michigan University, Dept. of Industrial & Manufacturing Engineering "}], "tags": ["cognitive and affective development", "educational institutions", "collaboration", "calculus", "springs", "academic and student affairs collaboration", "monitoring", "taxonomy"]}, {"title": "A study on the influence of rich versus traditional classroom response system (CRS) questions on concept retention", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462251", "abstract": "Clickers in classrooms have been shown to increase student engagement. With the emergence of touch-based smart devices, such as iPhones and iPads, there is a move towards migrating the functionality offered by the clickers to these advanced response systems. Apart from being a convenient alternative, do these advanced touch-based devices offer anything new with respect to student learning? For a start, beyond the traditional multiple-choice and true/false responses, these advanced clickers provide several new question modalities that the traditional button-based clickers do not offer. It can be hypothesized that the rich interactions offered by touch-based devices can enhance student engagement even further than the traditional clickers currently do and contribute towards improvements in student learning. To explore this hypothesis, a study was designed to investigate the difference in concept retention among students who use the traditional versus rich classroom response systems (CRS). The study was conducted using a custom-designed iPhone app during an engineering lecture. While no significant difference in retention was evident, several insights were gained in favor of the rich interactions offered by the new CRS. This work highlights the distinct features that make advanced clickers conducive to student engagement and guides future developments in such next generation classroom technologies.", "authors": [{"name": "Smitesh Bakrania", "affiliation": "Mechanical Engineering, Rowan University, Glassboro, NJ, USA"}], "tags": ["ipad", "iphone", "rapid feedback", "smartphones", "sparks", "visualization", "ipod", "pistons", "classroom response system", "servers", "portable media players", "clickers", "crs", "tablet computers", "materials", "student feedback"]}, {"title": "Work in progress: From sage on the stage to guide on the side: Examining shifts in teaching practice through stories of open community participation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462252", "abstract": "Many professors are reluctant to transform their teaching practices from \"sage on the stage\" to \"guide on the side” for understandable reasons. Facilitating student work in a potentially unfamiliar setting has a steep learning curve and requires professors to relinquish control of their classrooms without assurance their career evaluations will benefit. However, professors who do transform their teaching practices continue to report exactly the same concerns — so how does the sage-to-guide shift occur? This work-in-progress paper describes early efforts in a grounded theory study whose initial participants are professors who have involved their classes in open software, hardware, and content communities, a choice which requires such a shift in teaching practices for successful student participation. Inspired by the radical transparency of the open communities our participants work with, the study itself is an open content project, creating a public compendium of teaching transformation stories that can be accessed by educators considering similar transformations to their own teaching practices.", "authors": [{"name": "Mel Chua", "affiliation": "Student, Engineering Education, Purdue University West Lafayette, Indiana, USA "}, {"name": "Sebastian Dziallas", "affiliation": "Engineering with Computing, Franklin W. Olin College of Engineering, Needham, Massachusetts, USA"}], "tags": ["teaching open source", "free and open source software (foss)", "educational institutions", "communities", "storytelling", "sociology", "grounded theory", "usa councils", "open source software", "interviews"]}, {"title": "A mastery-based learning approach for undergraduate engineering programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462253", "abstract": "We report the results of an action research study in which a modified mastery-based learning approach was implemented in three undergraduate engineering courses: engineering statistics, LabVIEW programming, and environmental engineering. In this paper, we describe both the action research and the modified mastery-based learning approach that was implemented. Findings from the analysis of data on student performance, and student and faculty perceptions of the approach are presented. In addition, we discuss our recommendations for modifications to the approach that could be used in future implementations.", "authors": [{"name": "Caitlyn S. Butler", "affiliation": "Department of Civil and Environmental Engineering, University of Massachusetts, Amherst, MA, USA"}, {"name": "Jennifer M. Bekki", "affiliation": "Department of Engineering, Arizona State University, Mesa, AZ, USA "}, {"name": "Odesma Dalrymple", "affiliation": "Department of Engineering, Arizona State University, Mesa, AZ, USA "}], "tags": ["reflection", "educational institutions", "programming", "undergraduate engineering", "mastery-based learning", "action research", "assessment", "standards", "materials", "usa councils"]}, {"title": "Distance education with remote poles: An example from the Amazon region", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462254", "abstract": "The Amazon region is characterized by its low population density, with one large city, the capital Manaus, and the remainder of its population distributed in small and less economically developed towns. Most of these towns suffer from huge geographic isolation, as these are scattered in the forest and their access are only through rivers. With all these difficulties, taking education to this population consists of a real and daily challenge. To provide an opportunity for students of this region to enter into an upper-level course, one of the solutions devised by the Federal University of Amazonas, through its Center for Distance Education (CDE) was the creation of undergraduate courses in non-face mode. CDE project consisted of organizing headquarters, called poles, to receive courses in Administration, Public Administration, Fine Arts, Biology, Agricultural Sciences and Physical Education. This paper describes this educational experience and presents the structure of the pedagogical model supported by technology (PMT) which allows this scenario to become reality. The innovation of this model is to allow the 1,618 students, distributed in 17 different poles, assisted by CDE, to keep pace with their course through a structure of logistical and technological support adapted to their reality. Resources offered by a Course Management System (CMS), tutors and other specialized tools that support off-line activities make it possible for higher education to reach the most remote regions of Amazon.", "authors": [{"name": "Filho Walfredo Lucena", "affiliation": "FUCAPI, Manaus, Brazil"}, {"name": "Erika H. Nozawa", "affiliation": "IATECAM, Manaus, Brazil "}, {"name": "Elaine H. T. de Oliveira", "affiliation": "Institute of Computing, Federal University of Amazonas, Manaus, Brazil "}, {"name": "Ketlen K. Teles Lucena", "affiliation": "Center for Distance Education, Federal University of Amazonas, Manaus, Brazil "}], "tags": ["internet", "cities and towns", "educational institutions", "pedagogical model supported by technology", "adaptation models", "distance education", "sociology", "materials"]}, {"title": "Quantifying learning from web-based course materials using different pre and post tests", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462255", "abstract": "Engineering instructors seek to gauge the effectiveness of their instruction. One gauge has been to use standardized tests, such as concept inventories and to quantify learning as the change in score over the semester. Here we question whether that approach is always the best practice for gauging the effect of instruction, and we propose an alternative of administering different tests at the start and end of the semester. In particular, to gauge the influence of one aspect of instruction, the use of interactive web-based course materials that had been developed for Statics, we administered the Force Concept Inventory at the start of the course, and the Statics Concept Inventory at the end of the course. Correlations and then linear regression were applied to study how conceptual knowledge measured at the end of the course depended on conceptual knowledge measured at the start and the amount of use of the web-based courseware. Usage of the web-based courseware was found to promote conceptual knowledge at the end of the course in a statistically significant way only after accounting for initial knowledge as judged by the different conceptual test administered at the start of the course. Thus, it is not necessary to measure gain on one test; instead each test should capture well the variation in relevant ability across students at the time the test is administered.", "authors": [{"name": "Paul S. Steif", "affiliation": "Carnegie Mellon University, Pittsburgh, PA "}, {"name": "Anna Dollar", "affiliation": "Miami University, Oxford, OH, USA"}, {"name": "Marsha Lovett", "affiliation": "Carnegie Mellon University, Pittsburgh, PA "}], "tags": ["force", "web-based courseware", "educational institutions", "correlation", "engineering education", "pre-post tests", "knowledge engineering", "statics", "interactive learning", "concept inventory", "materials", "measures of knowledge"]}, {"title": "Differences between same-sex and cross-sex mentoring relationships in capstone design courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462256", "abstract": "Within capstone design courses, the relationship between faculty and students can be classified as mentoring, where instructors fulfill functions that support career and psychosocial development of the students. Unlike traditional mentoring relationships, however, matching student teams to faculty mentors is not simply a process of one mentor and one mentee choosing each other. Project, team, and course structures are all dominant factors, resulting in both cross-sex and same-sex mentoring relationships. Literature on mentoring relationships in higher education has produced conflicting reports on which match yields better outcomes. Thus understanding the implications of same-sex and cross-sex relationships can be helpful in enabling faculty to effectively support the development of all students. This study applies an empirically derived model of capstone mentoring to data from a 2011 national survey of students enrolled in capstone design courses. The survey addresses students' perceptions of faculty teaching and their self-reported learning gains, and the data analysis presented in this paper focuses on similarities and differences based on the sex-pairing. The results provide preliminary insights regarding the impact of sex differences on the capstone mentoring relationship, and thus contribute to a more complete understanding of design teaching.", "authors": [{"name": "Marie C. Paretti", "affiliation": "Engineering Education, Virginia Tech, Blacksburg, VA"}, {"name": "James J. Pembridge", "affiliation": "Freshman Engineering, Embry-Riddle Aeronautical University, Daytona Beach, FL "}], "tags": ["engineering profession", "educational institutions", "design teaching", "employee welfare", "mentoring", "career development", "ethics", "gender", "interviews"]}, {"title": "Work in progress: First year engineering women: A qualitative investigation of retention factors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462257", "abstract": "Many universities face disturbing trends in the retention, underrepresentation and socialization of women students in engineering. The focus of this present study is the retention of first-year women students currently enrolled in a large state college of engineering in the Rocky Mountain region. Eight hour-long focus groups were conducted consisting of four to ten first-year women in a first-year engineering design projects course. Participants were asked a structured set of questions to investigate several topics. These focus groups were video-taped and later transcribed for analysis. Six research questions were posed for the current study: • Do women express a loss of interest during the first year of the program? • Is there a chilly climate for first-year women in the college? • Do women's self-efficacy levels change during the first year of the program? • Do academic performance levels play a role in women's retention in engineering during the first year? • Do women have adequate support structures in the college during the first year? • Does the structure of the academic program instill career awareness in the first year? Implications for strategies to boost retention and an explication of the themes from the qualitative analysis will be discussed in the paper.", "authors": [{"name": "Beverly Louie", "affiliation": "University of Colorado at Boulder Boulder, United States of America"}, {"name": "Daniel Knight", "affiliation": "University of Colorado at Boulder Boulder, United States of America "}, {"name": "Jordan Hornback", "affiliation": "University of Colorado at Boulder Boulder, United States of America "}], "tags": ["engineering profession", "retention", "educational institutions", "employee welfare", "probes", "first-year programs", "engineering students", "gender", "chemistry", "meteorology"]}, {"title": "Understandings of value in engineering practice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462258", "abstract": "This paper draws on a large body of empirical data from interviews and field observations to suggest that many engineers, even some professional organizations, have difficulty explaining the commercial value of engineering work. This difficulty could contribute to a public and employer perception that marginalizes the significance of engineering work. Research data came from qualitative interviews with engineers in Australia and other material. Data from individual engineers and other studies contributes to a description that educators and engineers could draw on to better explain the value of engineering to students, firms and the community at large. This paper presents a limited sample of the evidence behind this research.", "authors": [{"name": "James Trevelyan", "affiliation": "The University of Western Australia"}], "tags": ["uncertainty", "australia", "communities", "engineering education", "engineering practice", "economics", "safety", "community perceptions of engineers", "business", "interviews"]}, {"title": "Unveiling fieldbus network technology through project-based learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462259", "abstract": "Fieldbus communications networks are a fundamental part of modern industrial automation technique. This paperwork presents an application of project-based learning (PBL) paradigm to help electrical engineering students grasp the major concepts of fieldbus networks, while attending a one-term long, elective microcontroller course.", "authors": [{"name": "Omar Mogames", "affiliation": "Department of Electrical Engineering, Unesp - São Paulo State University, Guaratinguetá, Brazil"}, {"name": "Samuel E. de Lucena", "affiliation": "Department of Electrical Engineering, Unesp - São Paulo State University, Guaratinguetá, Brazil "}], "tags": ["local area networks", "open systems", "electrical engineering", "education", "hardware", "microcontrollers", "automation"]}, {"title": "Work in progress: Transfer students in engineering: A qualitative study of pathways and persistence", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462260", "abstract": "Our paper presents preliminary results of interviews of 28 transfer students in engineering at two institutions and is part of a larger mixed-methods study on engineering transfer students. The two institutions differ on a key dimension: one has many formal articulation agreements and the other does not. We discuss the reasons students begin their studies at the sending institution and describe their experiences with the applications and admissions process at the receiving institution. We describe the “culture shock” students experience when adjusting to the academic requirements and social culture of the new institution; we also highlight the transfer student capital and strategies students use to adjust to the receiving institution.", "authors": [{"name": "Catherine E. Brawner", "affiliation": "Research Triangle Educational Consultants, Raleigh, NC USA 27612"}, {"name": "Catherine Mobley", "affiliation": "Department of Sociology and Anthropology, Clemson University, Clemson, SC USA 29634 "}, {"name": "Erin G. Shealy", "affiliation": "Department of Sociology and Anthropology, Clemson University, Clemson, SC USA 29634 "}], "tags": ["electric shock", "educational institutions", "articulation agreement", "transfer shock", "communities", "employment", "databases", "engineering students", "persistence", "stem", "transfer student", "interviews"]}, {"title": "Work in progress — engineering case studies inspired by society's Grand Challenges for Engineering: An integrated approach to middle school stem instruction", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462261", "abstract": "The National Academy of Engineering “Grand Challenges for Engineering” (GCE) initiative has inspired the introduction of humanitarian applications of engineering into middle school science and math classrooms. Two GCE case study instructional modules have been developed by an interdisciplinary research team and piloted at six participating middle schools during the 2011–12 school year. Each module employs realistic fictional scenarios to engage a broad spectrum of students through role-play as engineers. Students develop engineering skills by tackling specific problems inspired by societal needs. Relevant science and math content, based on state and national middle school standards, are embedded within the modules. Integration of engineering with science and math instruction is aligned with recommendations in the Framework for National K-12 Science Standards, recently published by the National Research Council. The pilot modules, “Improving Aging Infrastructure” and “Solar Energy,” were introduced to teachers at participating schools at a professional development workshop during Summer 2011. The success of this approach as a strategy to increase interest in STEM (science, technology, engineering and math) fields among all students, especially women and under-represented groups, is being evaluated through measurement of participating students' attitudes toward math, science and STEM-related occupations.", "authors": [{"name": "Susan Hagness", "affiliation": "University of Wisconsin-Madison, Madison, WI USA "}, {"name": "Lauren Aneskavich", "affiliation": "University of Wisconsin-Madison, Madison, WI USA "}, {"name": "Tam Mayeshiba", "affiliation": "University of Wisconsin-Madison, Madison, WI USA "}, {"name": "Amy Wendt", "affiliation": "University of Wisconsin-Madison, Madison, WI USA "}, {"name": "Kevin Cheng", "affiliation": "University of Wisconsin-Madison, Madison, WI USA "}, {"name": "Steven Cramer", "affiliation": "University of Wisconsin-Madison, Madison, WI USA "}, {"name": "Kimberly A. S. Howard", "affiliation": "Boston University Boston, MA USA"}, {"name": "Amy Schiebel", "affiliation": "Edgewood College Madison, WI USA "}, {"name": "Jean DeMerit", "affiliation": "University of Wisconsin-Madison, Madison, WI USA "}], "tags": ["national k-12 science standards", "engineering profession", "educational institutions", "diversity", "engineering education", "mathematical model", "grand challenges", "bridges", "stem", "standards", "middle school", "usa councils"]}, {"title": "Work in progress: Weekly innovation challenge: Changing the mindset one step at a time every week", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462262", "abstract": "While the value of the entrepreneurial mindset in engineering is now well recognized, faculty members are still struggling to find curricular and extracurricular activities to instill this mindset. This paper presents weekly innovation challenges as a relatively easy to implement set of activities that can be incorporated into: • Existing courses as impromptu competitions and icebreakers that require no major curricular overhaul • Extracurricular activities to effectively engage students and faculty, and • Outreach activities to promote STEM and entrepreneurship through summer camps, engineers week competitions, K-12 outreach, and open-house events. The goal of the weekly innovation challenges is to instill the entrepreneurial mindset and foster interdisciplinary team to address a need under tight time constraints. In the long-term, the challenges have the potential to change the eco-system of the entire school. This paper provides insights into the organization of such challenges and logistics in conducting them.", "authors": [{"name": "Sridhar S. Condoor", "affiliation": "Parks College of Engineering, Aviation and Technology, Saint Louis University, Saint Louis, USA "}, {"name": "Gregory Keogh", "affiliation": "Parks College of Engineering, Aviation and Technology, Saint Louis University, Saint Louis, USA"}], "tags": ["entrepreneurial mindset", "reflection", "educational institutions", "boats", "challenges", "technological innovation", "prototypes", "multidisciplinary teamwork", "bridges", "game theory", "innovation"]}, {"title": "Introducing parallel programming to traditional undergraduate courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462263", "abstract": "Parallel programming is an important issue for current multi-core processors and necessary for new generations of many-core architectures. This includes processors, computers, and clusters. However, the introduction of parallel programming in undergraduate courses demands new efforts to prepare students for this new reality. This paper describes an experiment on a traditional Computer Science course during a two-year period. The main focus is the question of when to introduce parallel programming models in order to improve the quality of learning. The goal is to propose a method of introducing parallel programming based on OpenMP (a shared-variable model) and MPI (a message-passing model). Results show that when the OpenMP model is introduced before the MPI model the best results are achieved. The main contribution of this paper is the proposed method that correlates several concepts such as concurrency, parallelism, speedup, and scalability to improve student motivation and learning.", "authors": [{"name": "Henrique Cota de Freitas", "affiliation": "Department of Computer Science, Pontifícia Universidade Católica de Minas Gerais (PUC Minas), Belo Horizonte, Brazil"}], "tags": ["message systems", "parallel processing", "concurrent computing", "education", "computer architecture", "parallel programming", "computer science and engineering", "learning evaluation", "programming profession"]}, {"title": "Practical experiences on building structured remote and virtual laboratories from the student's point of view", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462264", "abstract": "Nowadays, the use of remote laboratories is a common feature in order to get students involved in practical experiences. This is particularly important in distance learning environment. The regular practice is to develop a particular laboratory, required by the student competence's curricula. Usually, this involves a lack of methodology or a standard procedure so, new developments must be done to include new laboratories, additionally so many “manual” procedures are required. RELATED (REmote LABoratory Extended) it's used to solve these issues. In this paper, a practical experience of the structured development process of a virtual laboratory, using RELATED framework, will be presented from the point of view of students. This virtual laboratory is a simple signal generator. This signal generator will be used to generate a reference position for the height of the ball of an electromagnetic levitation system in a control experiment. Finally, responses of surveys made by students will be presented, in order to get satisfaction results of using/development of virtual/remote laboratories using RELATED.", "authors": [], "tags": ["reactive power", "xml", "practical experience", "remote experimenting", "remote laboratories", "virtual and remote laboratories", "services and facilities", "signal generators", "software", "servers", "software development"]}, {"title": "Increasing access to engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462265", "abstract": "Based on research, constructing a program to increase accessibility for students with financial need, and diversity of students graduating with engineering baccalaureate degrees requires multiple components and partnerships to recruit, retain and graduate students. This paper describes how a program at Texas A&M University was initially constructed, how it has evolved, and what influences on student success have been observed.", "authors": [{"name": "Margaret Hobson", "affiliation": "Texas A&M University "}, {"name": "Sandra Nite", "affiliation": "Texas A&M University "}, {"name": "Magdalini Z. Lagoudas", "affiliation": "Texas A&M University "}, {"name": "Jacqueline Hodge", "affiliation": "Texas A&M University "}, {"name": "Jeffrey E. Froyd", "affiliation": "Texas A&M University "}, {"name": "Diane Hurtado", "affiliation": "Texas A&M University "}, {"name": "Joy Monroe", "affiliation": "Texas A&M University"}], "tags": ["retention", "educational institutions", "diversity", "communities", "scholarships", "calculus", "recruitment", "engineering students"]}, {"title": "A first look at student motivation resulting from a pass/fail program for first-semester engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462266", "abstract": "In 2010, administrators at Colorado State University implemented an experimental program allowing first-semester engineering students to take their entire course load for pass/fail grades, instead of the traditional A-F grades. Engineering educators were interested in the impact that this program had, and initially looked to GPA and grades. Realizing that those were insufficient to understand impact of the program, this study expands on previous work by obtaining a preliminary measure of students' motivation and correlating it with GPA and other variables of interest. Results indicate that the pass/fail students and traditionally graded students were very similar in terms of motivational qualities on average, but that motivational qualities showed relationships with semester GPA uniquely for pass/fail versus traditionally graded students. Also, student comments suggested that at the least they felt no harm was done by the program being offered and their enrollment or non-enrollment.", "authors": [{"name": "Tom Siller", "affiliation": "Colorado State University, Fort Collins, Colorado, USA"}, {"name": "Ken C. Stanton", "affiliation": "Colorado State University, Fort Collins, Colorado, USA "}], "tags": ["educational institutions", "motivation", "stress", "grades", "correlation", "calculus", "instruments", "engineering students", "pass/fail", "student stress", "indexes"]}, {"title": "Workshop: Training students to become better raters: Raising the quality of self- and peer-evaluations using a new feature of the CATME system", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462267", "abstract": "The goal of this workshop is to introduce participants to tools that can help them manage teams in their classes effectively and efficiently. We review some of the factors that instructors may wish to consider when administering self- and peer-evaluations and how they might improve the quality of those evaluations using rater training. Attendees with wireless-network-capable laptop computers will interact with the system in real-time.", "authors": [{"name": "Matthew W. Ohland", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA "}, {"name": "Hal Pomeranz", "affiliation": "Deer Run Associates, Eugene, OR, USA"}, {"name": "Misty L. Loughry", "affiliation": "Department of Management, Marketing, & Logistics, Georgia Southern University, Statesboro, GA, USA "}, {"name": "Richard A. Layton", "affiliation": "Mechanical Engineering, Rose-Hulman Institute of Technology, Terre Haute, IN, USA "}], "tags": ["peer evaluation", "educational institutions", "conferences", "calibration", "training", "rater training", "usa councils", "teamwork"]}, {"title": "“Inform, Experience, Implement” — Teaching an intensive high school summer course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462268", "abstract": "During the summer of 2011, twenty-four high school students participated in an intense, three-week computer science course at the University of Virginia. The course met for twenty-one three-hour sessions, thus encompassing more contact time than a standard college-level course. The course was structured in an “Inform, Experience, Implement” active-learning format: students were exposed to the history of a particular problem in context and participated in an active learning lesson regarding the topic before learning how to address the examined problem through programming. This structure helped integrate into the course best practices from experiential learning, kinesthetic outreach activities, and active learning pedagogy. Utilizing this three-part rotation curriculum achieved some important goals, including holding the interest of students during the summer for six hours a day and successfully motivating students who had no programming background.", "authors": [{"name": "Mark Sherriff", "affiliation": "Department of Computer Science, University of Virginia, Charlottesville, Virginia 22904 "}, {"name": "Luther Tychonievich", "affiliation": "Department of Computer Science, University of Virginia, Charlottesville, Virginia 22904"}, {"name": "Ryan Layer", "affiliation": "Department of Computer Science, University of Virginia, Charlottesville, Virginia 22904 "}], "tags": ["global positioning system", "educational institutions", "programming profession", "context"]}, {"title": "Evaluation of the learning effectiveness of game-based and hands-on gear train laboratories", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462269", "abstract": "Recently, academic institutions have started to explore the potential of commercially available multiplayer computer game engines for the development of virtual environments for instructional purposes. This trend is motivated by the fact that many students are highly accustomed to and knowledgeable about playing electronic and computer games. Computer games share a number of potential characteristics with effective instructional tools and therefore have a great potential for positively affecting learning. Achieving a sense of immersion by the students and interactive collaboration among them are two of the main goals being pursued in exploring new types of educational laboratories as alternatives or complements to traditional hands-on experiments. A scripted scenario for a game-based gear train laboratory exercise was implemented in ‘ME 358 Mechanisms and Machine Dynamics’, a junior-level course for mechanical engineering majors at Stevens Institute of Technology (SIT). This paper discusses the learning assessment conducted in that implementation. The results are presented for two assessment studies comparing versions of game-based gear train experiments to workbook-based gear train experiments with a ‘hands-on’ laboratory experience. The results suggest that the students learned the concepts addressed by the laboratory content better in the game-based condition and that they had a realistic understanding and appreciation of the practical advantages of game-based gear train experiments over more traditional learning experiences. In addition, a questionnaire was administered to the students and then analyzed in order to obtain further insights into the students' opinions about and attitudes toward the game-based laboratory approach.", "authors": [{"name": "James E. Corter", "affiliation": "Teachers College, Columbia University, New York, NY 10027, USA "}, {"name": "Yizhe Chang", "affiliation": "Stevens Institute of Technology, Department of Mechanical Engineering, Hoboken, New Jersey 07030, USA "}, {"name": "El-Sayed Aziz", "affiliation": "Stevens Institute of Technology, Department of Mechanical Engineering, Hoboken, New Jersey 07030, USA "}, {"name": "Sven K. Esche", "affiliation": "Stevens Institute of Technology, Department of Mechanical Engineering, Hoboken, New Jersey 07030, USA "}, {"name": "Constantin Chassapis", "affiliation": "Stevens Institute of Technology, Department of Mechanical Engineering, Hoboken, New Jersey 07030, USA"}], "tags": ["virtual experiment", "gears", "gear design", "games", "assembly", "laboratories", "education", "assessment", "game engine", "game-based laboratory", "engines", "computers"]}, {"title": "Problem-driven learning on two continents: Lessons in pedagogic innovation across cultural divides", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462270", "abstract": "While internationally there is an awareness that we need new, innovative approaches to engineering education, it is unclear whether a pioneering pedagogy within one cultural context will readily transfer and find acceptance in a very different cultural context. In this paper, we report on a three-site, collaborative experiment in using problem-driven learning in an introductory engineering class. Our three sites are universities in the United States, Abu Dhabi and China. In each location, first year students in biomedical engineering begin the major by joining a team of students who tackle real-world, open-ended problems. Our paper will report on 1) the development and exchange of problems across the three sites, 2) the different constraints, realizations and outcomes of the problem-driven approach at each of using problem-driven learning as a transnational pedagogy for 21st century engineering education.", "authors": [{"name": "Wendy C. Newstetter", "affiliation": "Department of Biomedical Engineering, Georgia Institute of Technology, Atlanta, USA "}, {"name": "Kinda Khalaf", "affiliation": "Department of Biomedical Engineering, Khalifa University of Science, Technology and Research, Abu Dhabi, UAE "}, {"name": "Peng Xi", "affiliation": "Department of Biomedical Engineering, Peking University, Beijing, China"}], "tags": ["educational institutions", "global education", "biological system modeling", "biomedical engineering", "engineering education", "problem-based learning", "cultural differences", "problem-solving", "context"]}, {"title": "Work in progress: Using smart mobile tools to enhance autism therapy for children", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462271", "abstract": "Autism and related communicative disorders in children are major issues facing parents, school districts, and government institutions. Autism now affects one in eighty-eight children in the United States, and treatment requires significant resources — time, expertise, and financial. This project seeks to enhance the reach of therapeutic efforts through a family of smart mobile tools created to assist therapists working with autism and communicative disorders. The system uses cloud services and a knowledge automation expert (artificial intelligence) engine to track patterns in treatment and visually display those patterns for clinicians, schools, and parents, thereby creating a space for cross-communication between parties that is tailored to the treatment needs of each child.", "authors": [], "tags": ["pediatrics", "communicative disorders", "autism", "mobile communication", "artificial intelligence", "real-time systems", "mobile development", "engines", "aba or speech therapy"]}, {"title": "Mobile communications anytime, anywhere: The impact on work-life balance and stress", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462272", "abstract": "Mobile communication technologies have fundamentally altered the concept of going to work. Work has been transformed from a place you go to a function you perform, whenever and wherever you are. Laptops, smartphones, and tablets enable users to transition seamlessly between work and personal activities anytime and anywhere. The effect of this capability on an individual's ability to balance their work and personal life and manage personal stress remains under study. One thing is clear. Modern societies are still in the early stages of this transformation. While 88% of Americans have cell phones, only 46% have Smartphones and just 19% have Tablet PCs. These devices are fast, powerful, and quickly become integrated into our lives as constant companions. This paper presents the results of a survey of engineering and technology students at a Midwestern university. No significant relationship between laptop use and personal stress was found and work-life balance was only negatively impacted when usage exceeded 3 hours on days off. While significant percentages of smartphone users reported increased stress, similar percentages felt the accessibility of the smartphone reduced their stress levels. Users overwhelmingly responded that smartphones improve their ability to balance their work and personal life.", "authors": [{"name": "Paul Makinson", "affiliation": "School of Engineering & Technology, Indiana University Purdue University Indianapolis, Indianapolis, U.S.A. "}, {"name": "Eugenia Fernandez", "affiliation": "School of Engineering & Technology, Indiana University Purdue University Indianapolis, Indianapolis, U.S.A."}, {"name": "Stephen Hundley", "affiliation": "School of Engineering & Technology, Indiana University Purdue University Indianapolis, Indianapolis, U.S.A. "}, {"name": "Charles Feldhaus", "affiliation": "School of Engineering & Technology, Indiana University Purdue University Indianapolis, Indianapolis, U.S.A. "}], "tags": ["portable computers", "mobile communications", "educational institutions", "stress", "smartphones", "cellular phones", "laptop computers", "cell phones", "mobile communication", "work life balance", "smart phones"]}, {"title": "Will texting help student learning? A case study of using mobile devices in university classrooms", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462273", "abstract": "The use of Student Response Systems (SRS) has been shown to increase student attendance, participation, and learning. Prevailing systems at universities are typically SRS that require installation of software by the university and purchasing of “clickers”. Thus, the adoption of SRS usually requires a sizable initial investment. Given the diffusion of mobile phones and wide-spread use of mobile technology by students, the possibility of using them as a cost-effective alternative to clickers is attracting more attention. The emergence of audience response systems hosted in the cloud instead of being physically connected to a computer triggered WPI faculty and staff to explore the use of mobile technology as a response tool through Poll Everywhere. First, we present our motivations for adopting this technology (limited clicker supply, desire for open-ended response option, etc.). Second, using our experience in the classroom and findings from extant literature, we make suggestions related to course design to enable faculty to take full advantage of cloud-based SRS. We evaluate whether students concur with our perceived benefits of Poll Everywhere in terms of ease of use and facilitation of learning. We close with discussion and suggestions for future research.", "authors": [{"name": "Jianyu Liang", "affiliation": "Department of Mechanical Engineering, Worcester Polytechnic Institute Worcester, MA 01609"}, {"name": "Erin H. DeSilva", "affiliation": "Academic Technology Center, Worcester Polytechnic Institute Worcester, MA 01609 "}, {"name": "Fabienne Miller", "affiliation": "School of Business, Worcester Polytechnic Institute Worcester, MA 01609 "}], "tags": ["portable computers", "educational institutions", "mobile learning", "cellular phones", "mobile handsets", "mobile communication", "student response systems", "mobile devices", "clickers", "business", "feedback"]}, {"title": "Work in progress: Sustainable projects for software engineering courses: Collaborating with technology courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462274", "abstract": "Teaching Software Engineering (SE) based on “real-world” projects engages students with practical application of software engineering concepts-students develop a deeper interest in the project deliverables while they acquire the skills of critically analyzing the problem and determining the best course of action. It can be challenging to find and maintain a reliable stream of suitable software projects that match learning outcomes, technical scope, and academic calendar of an SE class. On the other hand, a typical university campus has many nonComputer Science (CS) technology classes that require their students to study, understand, and evaluate existing software applications in specific areas. With purposeful coordination, these non-CS technology classes can serve as effective source of real projects for SE classes. This paper describes our experience of collaborating with the Education Program in their Technology in Education course. While we encountered some challenges, our experience has demonstrated that it is indeed mutually beneficial and rewarding for students in both courses. We offer recommendations on choosing non-CS technology classes and logistical guidelines to ensure the success of such collaborations.", "authors": [{"name": "Robin L. Angotti", "affiliation": "Education Program, University of Washington, Bothell, Bothell, WA, USA "}, {"name": "Hazeline U. Asuncion", "affiliation": "Computing and Software Systems, University of Washington, Bothell, Bothell, WA, USA "}, {"name": "Kelvin Sung", "affiliation": "Computing and Software Systems, University of Washington, Bothell, Bothell, WA, USA"}], "tags": ["guidelines", "collaboration", "software", "education courses", "education", "software engineering education", "software engineering", "usa councils"]}, {"title": "Reconfigurable electronics remote lab from the experiments and instruments point of view", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462275", "abstract": "A new model for building and measuring analog electronic circuits has been developed and validated in the area of remote laboratories. The goal of the proposed solution is to facilitate and improve the set-up, maintenance and update of the hardware used during the configuration, control and measurement of the instruments and experiments included in the lab. The experimental setup does not reduce the performance of the lab, allowing the users to carry out the same actions and activities as they were in a hands-on laboratory. Therefore, thanks to this new paradigm users can practice through Internet and transparently to the hardware that makes possible the remote configuration of the experiments obtaining the same results as in a hands-on lab.", "authors": [{"name": "Javier Garcia-Zubia", "affiliation": "University of Deusto, Bilbao - Spain"}, {"name": "Unai Hernandez-Jayo", "affiliation": "University of Deusto, Bilbao - Spain "}], "tags": ["voltage measurement", "electrical resistance measurement", "instruments", "software", "switches", "remote engineering education", "current measurement", "instrumentation and measurement education"]}, {"title": "Engineering and computer science community college transfers and native freshmen students: Relationships among participation in extra-curricular and co-curricular activities, connecting to the university campus, and academic success", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462276", "abstract": "Research studies have shown the importance of the relationship between “a sense of belonging” and successfully adjusting to college life for undergraduate students. Few studies, however, have compared if native freshmen and transfer students connect to the campus in similar ways. The purpose of this study was to examine the relationships among participation in social and academic engagement activities, social integration, and academic success for students graduating with engineering or computer science Bachelor's degrees at a large, public university. An additional area of interest was the role of undergraduate research experiences (UREs) in making friends on campus. Using analysis of variance, 1,042 responses were analyzed from senior exit survey questions and cumulative GPA from student records. Students who reported higher levels of social integration on average had higher GPAs. Seven activities were found to be strongly associated with social integration for native freshmen, and three activities for transfer students. Three activities — organizations in their major, experiential learning, and intramural sports — were common to both groups. Surprisingly, given the cohort experience structure of UREs, no significant relationship was found for social integration in this study. This finding may be limited by the sample size or other factors such as self-selection bias.", "authors": [{"name": "Patrice Lancey", "affiliation": "University of Central Florida Orlando, FL, USA "}, {"name": "Cynthia Young", "affiliation": "University of Central Florida Orlando, FL, USA"}, {"name": "Lisa Massi", "affiliation": "University of Central Florida Orlando, FL, USA "}, {"name": "Michael Georgiopoulos", "affiliation": "University of Central Florida Orlando, FL, USA "}, {"name": "Rachel Straney", "affiliation": "University of Central Florida Orlando, FL, USA "}, {"name": "Uday Nair", "affiliation": "University of Central Florida Orlando, FL, USA "}], "tags": ["joining processes", "engineering profession", "analysis of variance", "retention", "educational institutions", "communities", "academic success", "organizations", "persistence", "college adjustment", "computer science"]}, {"title": "Work in progress: Leadership emergence among groups in an online environment", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462277", "abstract": "Virtual learning is a growing means of expansion for both courses and programs for numerous colleges. As the popularity of online courses and programs increases, the question of ensuring “excellence” often follows particularly when discussing curriculum concerns. Certifying online instruction presents challenges especially with regard to traditional methods such as that of group work. One factor that assists groups or teams with their work is that of leadership. Often, in more traditional classroom settings, group leaders are selected by the team after several meetings. How then is the selection and the determination of a leader established in online groups? Is the process similar or different? Does an online group share the same experiences in regard to leadership as a face-to-face group? These questions assisted in directing a two year study at the School of Engineering and Technology at Indiana University-Purdue University Indianapolis (IUPUI) that sought to determine how leader emergence is realized in one online course, International Management, in which a group project has been assigned in place of the final exam. The goal of our project is to not only better understand the process of leader selection in group work, but to help guide faculty in developing an online learning that will enhance and promote student engagement. There are several steps to be performed in our project and this work-in-progress paper will outline those steps and our progress to date.", "authors": [{"name": "Stephen P. Hundley", "affiliation": "Organizational Leadership and Supervision, Indiana University-Purdue University (IUPUI), Indianapolis, IN"}, {"name": "Julie M. Little-Wiles", "affiliation": "Organizational Leadership and Supervision, Indiana University-Purdue University (IUPUI), Indianapolis, IN "}], "tags": ["educational institutions", "least squares approximation", "online groups", "presses", "lead", "collaboration", "psychology", "learning management system", "leader emergence"]}, {"title": "Special session: IEEE Real World Engineering Projects: Discovery-based curriculum modules for first-year students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462278", "abstract": "This special session is organized to provide an interactive forum for the introduction of a set of new curriculum modules developed under IEEE's Real World Engineering Projects (RWEP) program. The modules, which are representative of a larger collection of curriculum modules available to the public via an open-access RWEP web portal, are designed for use in the first-year engineering and computer science classroom, and are hands-on, team-based projects that emphasize the societal impact of the work that engineers do. After a brief introduction to the RWEP program and the showcased curriculum modules, the authors of the modules will work one-on-one with the audience providing tutorials on the laboratory activities associated with their modules in a highly interactive, simultaneous mode. Audience members can learn in-depth about the modules that interest them most. Each project will have its own demonstration table, with posters of information and hands-on demonstrations and / or videos. This will allow for audience members to interact directly with the authors, and to try out the same sorts of activities that are proposed for the students.", "authors": [{"name": "Mingrui Zhang", "affiliation": "Winona State University, Winona, MN "}, {"name": "Kirk Reinkens", "affiliation": "Washington State University, Pullman, WA "}, {"name": "Jacques Nicolas Beneat", "affiliation": "Norwich University, Northfield, VT "}, {"name": "David Lin", "affiliation": "Washington State University, Pullman, WA "}, {"name": "Stephen Williams", "affiliation": "MSOE, Milwaukee, WI "}, {"name": "Eric Carr", "affiliation": "Drexel University, Philadelphia, PA "}, {"name": "Francesco Amoroso", "affiliation": "Winona State University, Winona, MN"}, {"name": "Anita Vasavada", "affiliation": "Washington State University, Pullman, WA "}, {"name": "Gregory Cappuccino", "affiliation": "University of Calabria, Rende Cosenza, Italy "}, {"name": "Warren Rosen", "affiliation": "Drexel University, Philadelphia, PA "}], "tags": ["educational institutions", "software algorithms", "laboratory instruction", "algorithm design and analysis", "kirk field collapse effect", "engineering education", "mathematical model", "first-year students", "matlab", "curriculum development", "computer science"]}, {"title": "What should I do next? How advanced engineering students decide their post-baccalaureate plans", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462279", "abstract": "To describe how advanced engineering students decide their post-baccalaureate plans, we conducted a mixed-methods study with engineering students at a large public university in the Midwest. According to the surveys, there were no statistically significant differences between men and women in their choices of post-baccalaureate plans. Students who had positive undergraduate research experiences and students who felt attached to their departments as undergraduates were more likely to enter graduate school immediately after graduation. Students who had industrial internships were more likely to enter professional practice immediately. From the interview data, we defined eight decision style archetypes that characterize how students make post-baccalaureate plans.", "authors": [{"name": "Michael C. Loui", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois at Urbana-Champaign, Urbana, Illinois, USA"}, {"name": "Anwen Jiang", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois at Urbana-Champaign, Urbana, Illinois, USA "}], "tags": ["engineering profession", "graduate study", "educational institutions", "careers", "engineering students", "industries", "organizations", "post-baccalaureate plans", "decision-making", "market research", "interviews"]}, {"title": "Enhancing the engineering curriculum: Defining discovery learning at Marquette University", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462280", "abstract": "This paper summarizes the results of our investigation into the feasibility of increasing the level of discovery learning in the College of Engineering (COE) at Marquette University. We review the education literature, document examples of discovery learning currently practiced in the COE and other schools, and propose a Marquette COE-specific definition of discovery learning. Based on our assessment of the benefits, costs, and tradeoffs associated with increasing the level of discovery learning, we present several recommendations and identify resources required for implementation. These recommendations may be helpful in enhancing engineering education at other schools.", "authors": [{"name": "Jay R. Goldberg", "affiliation": "Marquette University, Milwaukee, WI USA "}, {"name": "Mark L. Nagurka", "affiliation": "Marquette University, Milwaukee, WI USA"}], "tags": ["learning systems", "collaborative work", "educational institutions", "active learning", "student-centered learning", "laboratories", "collaboration", "discovery learning", "industries"]}, {"title": "The effect of student learning styles on the learning gains achieved when interactive simulations are coupled with real-time formative assessment via pen-enabled mobile technology", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462281", "abstract": "This paper describes results from a project in an undergraduate engineering physics course that coupled classroom use of interactive computer simulations with the collection of real-time formative assessment using pen-enabled mobile technology. Interactive simulations (free or textbook-based) are widely used across the undergraduate engineering curriculum to help actively engaged students increase their understanding of abstract concepts or phenomena which are not directly or easily observable. However, there are indications in the literature that we do not yet know the pedagogical best practices associated with their use to maximize learning. This project couples student use of interactive simulations with the gathering of real-time formative assessment via pen-enabled mobile technology (in this case, Tablet PCs). The research question addressed in this paper is: are learning gains achieved with this coupled model greater for certain types of learners in the undergraduate engineering classroom? To answer this, we correlate learning gains with various learning styles, as identified using the Index of Learning Styles (ILS) developed by Felder and Soloman. These insights will be useful for others who use interactive computer simulations in their instruction and other adopters of this pedagogical model; the insights may have broader implications about modification of instruction to address various learning styles.", "authors": [{"name": "Frank V. Kowalski", "affiliation": "Department of Physics, Colorado School of Mines, Golden CO, USA "}, {"name": "Susan E. Kowalski", "affiliation": "Department of Physics, Colorado School of Mines, Golden CO, USA"}], "tags": ["interactive simulations", "real-time formative assessment", "active learning", "inksurvey", "engineering education", "reliability", "physics", "learning styles", "computational modeling", "integrated circuit modeling", "real-time systems"]}, {"title": "Enhancing curiosity using interactive simulations combined with real-time formative assessment facilitated by open-format questions on Tablet computers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462282", "abstract": "Students' curiosity often seems nearly nonexistent in a lecture setting; we discuss a variety of possible reasons for this, but it is the instructor who typically poses questions while only a few students, usually the better ones, respond. As we have developed and implemented the use of InkSurvey to collect real-time formative assessment, we have discovered that it can serve in an unanticipated role: to promote curiosity in engineering physics undergraduates. Curiosity often motivates creative, innovative people. To encourage such curiosity, we solicit questions submitted real-time via InkSurvey and pen-enabled mobile devices (Tablet PCs) in response to interactive simulations (applets) run either before or in class. This provides students with practice in asking questions, increases metacognition, and serves as a rich springboard from which to introduce content and/or address misconceptions. We describe the procedure for measuring curiosity and results from applying this method in a junior level electromagnetics engineering physics course. We conclude that students are indeed more curious than they appear in class, and students participate even without extrinsic motivation. This method of enhancing curiosity using interactive simulations coupled with real-time formative assessment in response to open-format questions could be implemented in a wide variety of engineering courses as well as elsewhere.", "authors": [{"name": "Susan E. Kowalski", "affiliation": "Department of Physics, Colorado School of Mines, Golden, CO USA"}, {"name": "Frank V. Kowalski", "affiliation": "Department of Physics, Colorado School of Mines, Golden, CO USA "}], "tags": ["interactive simulations", "atmospheric measurements", "real-time formative assessment", "curiosity", "inksurvey", "conductors", "physics", "mathematical model", "computational modeling", "open-format questions", "inductance", "real-time systems"]}, {"title": "Communities that make a difference: The STEM student perspective", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462283", "abstract": "Responses from open-ended survey questions regarding undergraduate students' connections to community were collected from five different institutions, ranging from a large research institution in the Pacific Northwest to a small teaching college in the Northeast. Our results show that, regardless of institution or U.S. geographical location, STEM students felt connected to family more than any other community in their undergraduate experience. At institutions where faith plays a role in the institutional mission and culture, connections to religious organizations (especially church) were a close second in the strong connections to community that students reported in their lives. Across institutions, friends played a strong role in the communities in which students participated, and traditional extracurricular activities (non-academic clubs within the institution itself) also provided a significant source of connection for many students.", "authors": [{"name": "Denise Wilson", "affiliation": "Department of Electrical Engineering, University of Washington, Seattle, Washington, USA "}, {"name": "Diane Jones", "affiliation": "College of Education, University of Washington, Seattle, Washington, USA "}, {"name": "Don Peter", "affiliation": "Department of Engineering, Seattle Pacific University, Seattle, Washington, USA "}, {"name": "Rebecca Bates", "affiliation": "Department of Computer Science, Minnesota State University, Mankato, Mankato, Minnesota, USA "}, {"name": "Joy Crawford", "affiliation": "College of Education, University of Washington, Seattle, Washington, USA "}, {"name": "Tamara Floyd-Smith", "affiliation": "Department of Chemical Engineering Tuskegee University Tuskegee, Alabama. USA"}, {"name": "Nanette Veilleux", "affiliation": "Dept of Mathematics, Statistics, and Computer Science, Simmons College, Boston, Massachusetts, USA "}], "tags": ["extracurricular", "educational institutions", "standards organizations", "communities", "stem education", "belonging", "church", "friends", "sports", "community", "organizations", "sociology", "usa councils", "family"]}, {"title": "Work in progress: A holistic approach to ReEngineering the freshmen engineering course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462284", "abstract": "Engineering schools must strive to evolve a new paradigm for undergraduate education that recognizes the evolution of the skills and learning styles of its incoming students and prepares them to tackle society's grand challenges of the future, while at the same time increases the probability of their success in their chosen engineering program. Most researchers and experts in the field agree on some basic tenants of retention [1–3], which include developing community amongst freshmen, creating connections for freshmen through meaningful interactions with returning students and faculty, engaging freshmen in active learning environments, helping freshmen understand and internalize the vision and mission of the school, and assisting freshmen to develop a personal identity as an Engineer. This paper describes the creation of new freshmen engineering courses, taught in a new learning environment with a new instructional model that addresses all of these important tenants of retention.", "authors": [{"name": "James Collofello", "affiliation": "Ira A. Fulton Schools of Engineering, Arizona State University "}, {"name": "Amy Hall", "affiliation": "Ira A. Fulton Schools of Engineering, Arizona State University"}], "tags": ["engineering profession", "educational institutions", "communities", "engineering design", "robots", "multi-disciplinary", "prototypes", "freshmen engineering", "software", "engineering students", "project-based learning", "first-year experience"]}, {"title": "Work in progress: Out-of-class learning: Shaping perception of learning and building knowledge of IT professions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462285", "abstract": "Freshman and sophomore college students, who have just begun their academic careers in Computer Science, are challenged by difficult courses while having little insight about the job demands in the information technology (IT) industry. This study adopts an out-of-class learning approach to discover how out-of-class learning (1) shapes students' perception of learning computer science subjects, (2) promotes understanding related to the challenges in IT professions, and (3) closes the gap between computer science education and the required IT skills in industry. The preliminary findings of this study demonstrate that interviewing IT professionals sheds light on the challenges of working in IT. Subsequently, students realize the critical skills in support of future success. This study proposes that course work in project management is a useful mechanism to bridge between the critical skills and technical skills, thereby better preparing students for careers in IT.", "authors": [{"name": "Greg Gogolin", "affiliation": "Information Security & Intelligence, Ferris State University, Big Rapids, MI. USA"}, {"name": "Hwee-Joo Kam", "affiliation": "Information Security & Intelligence, Ferris State University, Big Rapids, MI. USA "}], "tags": ["computer science", "educational institutions", "computer science education", "interviews", "shape", "computational modeling", "project management education in computer science", "computer science learning outcomes", "out-of-class learning", "industries"]}, {"title": "Work in progress: Integrating computation across engineering curricula: Preliminary impact on students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462286", "abstract": "The Collaborative Process to Align Computing Education with Engineering Workforce Needs (CPACE) team developed a partnership among various stakeholders to identify the computational skills that are essential for a globally competitive engineering workforce. Our goal is to redesign the role of computing within the engineering programs at Michigan State University (MSU) and Lansing Community College (LCC) to develop computational competencies — informed by industry needs — by infusing computational learning opportunities into the undergraduate engineering curriculum. In this paper we summarize the process that we used to translate our research findings about the computational competencies needs in the engineering workplace into fundamental computer science (CS) concepts that can be used in curricular implementation. We also discuss the initial phase of our curricular implementation strategy in two disciplinary engineering programs at MSU and transfer programs at LCC.", "authors": [{"name": "Abdol-Hossein Esfahanian", "affiliation": "Michigan State University East Lansing, MI "}, {"name": "Jon Sticklen", "affiliation": "Michigan State University East Lansing, MI "}, {"name": "Neeraj Buch", "affiliation": "Michigan State University East Lansing, MI "}, {"name": "Cindee Dresen", "affiliation": "Corporation for Skilled Workforce, Ann Arbor, MI "}, {"name": "Claudia E. Vergara", "affiliation": "Michigan State University East Lansing, MI "}, {"name": "Daina Briedis", "affiliation": "Michigan State University East Lansing, MI "}, {"name": "Mark Urban-Lurain", "affiliation": "Michigan State University East Lansing, MI "}, {"name": "Louise Paquette", "affiliation": "Lansing Community College, Lansing, MI "}, {"name": "Kysha Frazier", "affiliation": "Corporation for Skilled Workforce, Ann Arbor, MI"}], "tags": ["educational institutions", "curricular reform", "industry to academia", "interviews", "industries", "computational thinking in engineering", "matlab", "problem-solving", "computer science"]}, {"title": "Instilling a software engineering mindset through freshman Seminar", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462287", "abstract": "Student retention is a challenge faced by all engineering programs. Our first year software engineering students have schedules filled with computer science, mathematics, science and humanities. The lack of any exposure to engineering meant some students, expressing a dislike for software engineering, left the program before they had any exposure to the discipline. To address this issue, we created a one credit Software Engineering Freshman Seminar, which all entering students take in their first term at RIT. This lets us insure student/faculty contact early in the program, as well as providing an opportunity to introduce engineering concepts and practices early in each student's program of study. This paper discusses the seminar's current incarnation. In particular, we focus on those aspects of the course which help students identify with software engineering as a profession. The challenge we face is achieving this goal with students whose technical knowledge and skills are modest. We have settled on an approach that provides experience with teamwork, requirements elicitation, and the effects of change, and addressing professional ethics. These in-class activities are complemented by an assignment to interview a practicing software engineer and to write an interview summary for discussion. This activity ensemble serves to disabuse students of the notion that software engineering is little more than programming, or that the discipline is identical to computer science. Should a student exit the program at this point, at least he or she knows a bit about what they are leaving behind.", "authors": [{"name": "Daniel E. Krutz", "affiliation": "Department of Software Engineering, Rochester Institute of Technology, Rochester, NY, USA"}, {"name": "Michael J. Lutz", "affiliation": "Department of Software Engineering, Rochester Institute of Technology, Rochester, NY, USA "}, {"name": "Kenn Martinez", "affiliation": "Department of Software Engineering, Rochester Institute of Technology, Rochester, NY, USA "}, {"name": "James R. Vallino", "affiliation": "Department of Software Engineering, Rochester Institute of Technology, Rochester, NY, USA "}], "tags": ["computer science", "seminars", "ethics", "collaboration", "software", "first-year seminar", "software engineering", "teamwork", "interviews"]}, {"title": "Work in progress: A new concept mapping approach in an introductory engineering course: Correlation between students' conceptual understanding and problem-solving skills", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462288", "abstract": "This paper presents a new concept mapping approach, called “Tree of Dynamics,” to enhance students' perception (intuitive cognition) of the relationships among fundamental concepts in an introductory engineering dynamics course. In this approach, the relationships among concepts are represented by tree structures including roots, trunks, branches, leaves, and fruits, rather than by using linking words or phrases. A total of 76 engineering undergraduates participated in this work-in-progress study. Statistical analysis showed that moderate correlation (r = 0.309, p < 0.05) existed between students' “tree” scores and exam scores. This research finding implies that the new “Tree of Dynamics” approach not only helps identify students' misconceptions, but also provides a useful tool to help assess students' problem-solving skills in the introductory engineering course.", "authors": [{"name": "Ning Fang", "affiliation": "Department of Engineering Education, Utah State University, Logan, Utah, USA"}], "tags": ["joining processes", "acceleration", "educational institutions", "tree of dynamics", "aerodynamics", "problem-solving skills", "correlation", "engineering education", "problem-solving", "concept mapping", "conceptual understanding"]}, {"title": "Perceptions of engineering identity: Diversity and EWB-USA", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462289", "abstract": "Currently, the engineering community faces shortages. These shortages can be conceptualized as both literal shortages of numbers, particularly females, and a more conceptual shortage of engineers who are trained and qualified to handle the transitioning global context of the profession. With its rapid growth, high female involvement, and global vision, Engineers Without Borders-USA (EWB-USA) stands as a prime research model for the larger engineering field. During a series of five regional EWB-USA workshops, participants were asked to respond to six open-ended questions dealing with identity and gains from their involvement. Thousands of unique responses were coded into emergent themes to identify the most common responses and to compare response themes across questions. Results suggest that EWB-USA members identify strongly with the organization, which may increase their identity with and motivation to remain in the profession. Results also show that EWB-USA members are filling significant education gaps from their organizational involvement and are gaining the desirable global engineering qualities required within the field. These results help unpack the motivations driving EWB-USA members and gains from their membership that may help, through future curriculum development, attract and retain a diverse engineering population able to handle future challenges required by the profession.", "authors": [{"name": "Amy Javernick-Will", "affiliation": "University of Colorado at Boulder, Department of Civil, Environmental and Architectural Engineering"}, {"name": "Kaitlin Litchfield", "affiliation": "University of Colorado at Boulder, Department of Civil, Environmental and Architectural Engineering "}], "tags": ["engineering profession", "educational institutions", "conferences", "engineering identity", "organizations", "ewb-usa", "market research", "usa councils", "motivations"]}, {"title": "Aural instruction with visualization in E-Learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462290", "abstract": "This research investigates the effectiveness of using aural instructions together with visualisation in teaching some concepts of data structures to novice computer science students. A prototype learning system, known as the Data Structure Learning (DSL) tool, was developed and used first in a short mini study that showed that, used together with visualisations of algorithms, aural instructions produced faster student response times than did textual instructions. This result suggested that the additional use of the auditory sensory channel did indeed reduce the cognitive load. The tool was then used in a second, longitudinal, study over two academic terms in which students studying the Data Structures module were offered the opportunity to use the DSL approach with either aural or textual instructions. Both the quantitative data provided by the automatic recording of DSL use and an end-of-study questionnaire showed appreciation by students of the help the tool had provided and enthusiasm for its future use and development. These findings were supported by qualitative data provided by student written feedback at the end of each task, by interviews at the end of the experiment and by interest from the lecturer in integrating use of the tool with the teaching of the module.", "authors": [{"name": "Fuad Alhosban", "affiliation": "Durham University "}, {"name": "Liz Burd", "affiliation": "Durham University"}], "tags": ["dsl", "cognitive load", "data visualization", "visualization", "data structure learning tool", "computer science learning", "electronic learning", "aural instructions", "data structures", "interviews"]}, {"title": "Work in progress: Evaluating the use of mobile game development in introductory CS courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462291", "abstract": "Computer games have been accepted as an engaging and motivating tool in the CS curriculum. However, designing and implementing a playable game is challenging and is best done in advanced courses. Games for mobile devices offer the advantage of being simpler and, thus, easier to program for lower-level students. By exposing these students to a wide range of advanced topics, we can demonstrate to them that CS can be much more than coding. Here, we discuss our evaluation of a set of learning modules for introductory CS courses that use mobile game development as a motivational learning context.", "authors": [{"name": "Stan Kurkovsky", "affiliation": "Department of Computer Science, Central Connecticut State University, New Britain, CT 06050 "}, {"name": "Delvin Defoe", "affiliation": "Department of Computer Science and Software Engineering, Rose-Hulman Institute of Technology, Terre Haute, IN 47803"}], "tags": ["learning systems", "educational institutions", "games", "motivation", "engagement", "mobile computing", "land mobile radio", "materials", "computers", "introductory courses", "computer science"]}, {"title": "Harnessing theory in the service of engineering education research", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462292", "abstract": "Research questions in STEM disciplines are frequently strongly contextualised in the teaching and learning practice of the researcher. In this paper we chart a number of possible paths a researcher can follow from a single research proposition, or fundamental research question, to results which can vary significantly in nature. In order to do this, we establish a theoretical framework for research activity and examine the meaning of “theory” as a cognitive and research tool that helps engineering education practitioners and researchers. The paper reflects on the nature and role of different types of theory at four distinct stages of engineering education research: disciplinary, methodological, analytical, and interpretive. We illustrate how theory applies to the framing and integration of study results, and assists in the process of relating theories of learner development and learning to results of empirical data analysis.", "authors": [{"name": "Neena Thota", "affiliation": "Department of Information Technology, Uppsala University Box 325, 751 05 Uppsala, Sweden "}, {"name": "Paivi Kinnunen", "affiliation": "Education Department, University of Eastern Finland, Joensuu, Finland "}, {"name": "Anders Berglund", "affiliation": "Department of Information Technology, Uppsala University Box 325, 751 05 Uppsala, Sweden"}, {"name": "Arnold Pears", "affiliation": "Department of Information Technology, Uppsala University Box 325, 751 05 Uppsala, Sweden "}], "tags": ["educational institutions", "data collection", "engineering education", "interviews", "context", "computer science"]}, {"title": "Understanding industry experiences: From problem solving to engineering students' learning gains", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462293", "abstract": "This paper reports the findings from surveying a diverse group of undergraduate engineering students (N∼100) who participated in summer industry experiences. The goal was to capture and understand (a) the nature of industry experiences and (b) students' learning outcome gains (cognitive and affective) during these industry experiences. Ultimately, we aim to understand how students learn in real-world problem solving contexts in order to transfer such learning and such experiences into the engineering classroom. In undergraduate curriculum, well-structured problems with known solutions acquired through preferred solution methods are encountered more frequently than ill-structured problems. The linear process of problem solving teaches students a procedure to be memorized, practiced, and habituated, a process that emphasizes getting answers over making meaning. Real-world problem solving, though, commonly encountered in industry experiences suffused with complex and ill-structured problems, foster cognitive development of essential, problem-based, and globally competitive problem solving skills. Although industry experiences offer many benefits and enable engineering students to begin the practice of solving real-world complex problems, there is limited research on students' learning outcomes and skill gains as a result of participating in such experiences. Further, there is a lack of understanding of characteristics of the problems or projects that students work on. Our research serves to address these limitations.", "authors": [{"name": "Anna Zilberberg", "affiliation": "Center for Assessment and Research Studies, James Madison University, Harrisonburg, VA, USA "}, {"name": "Olga Pierrakos", "affiliation": "School of Engineering, James Madison University, Harrisonburg, VA, USA "}, {"name": "Jacquelyn K. S. Nagel", "affiliation": "School of Engineering, James Madison University, Harrisonburg, VA, USA "}, {"name": "Sean McVay", "affiliation": "Center for Assessment and Research Studies, James Madison University, Harrisonburg, VA, USA"}], "tags": ["complexity theory", "complex problem solving", "knowledge engineering", "instruments", "engineering students", "industry experience", "structuredness", "problem-solving", "writing", "complexity", "industries"]}, {"title": "Effective teaching of technical teamwork to large cohorts of engineering students in China", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462294", "abstract": "Teamwork skills are recognized internationally as important skills for engineering professionals. Literature shows that professional skills, especially teamwork skills, have not been included into the curriculum design and assessment in Chinese engineering programmes, and little work has been done to find the effective way to learn teamwork for engineering students in academic settings in China. This work attempts to implement successful cooperative learning practices from the West to a Personal Development Plan module with teamwork skills as one of its main teaching objectives in a joint Sino-UK degree programme in China. This paper reports the real situation of cooperative learning for Chinese engineering students. Experimental results indicate that there is no significant difference between different grouping methods on both academic and teamwork performance, although self-selected groups do not appear to be the best approach for Chinese students. No statistical correlation was observed between peer rating and the mark obtained for the task. Students can rate themselves and others, and different genders without bias. In the MBTI test, we found higher frequencies of Feeling over Thinking, and Judging over Perceiving. These students need more knowledge and training on conflict resolution skills and multi-task management skills to overcome their intrinsic weakness in cooperative learning.", "authors": [{"name": "Dan Zhang", "affiliation": "School of Electronic Engineering and Computer Science, Queen Mary University of London, London, UK "}, {"name": "Steve Ketteridge", "affiliation": "The Learning Institute, Queen Mary University of London, London, UK"}, {"name": "Na Yao", "affiliation": "School of Electronic Engineering and Computer Science, Queen Mary University of London, London, UK "}, {"name": "Laurie Cuthbert", "affiliation": "School of Electronic Engineering and Computer Science, Queen Mary University of London, London, UK "}, {"name": "Eleanor M Pritchard", "affiliation": "School of Electronic Engineering and Computer Science, Queen Mary University of London, London, UK "}], "tags": ["educational institutions", "team working", "correlation", "mbti", "peer rating", "engineering students", "teamwork skill", "chinese engineering students", "cooperative learning", "grouping methods", "teamwork"]}, {"title": "Using domain general learning models to guide engineering education research", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462295", "abstract": "The goal of this session is to help attendees understand the difference between domain general and domain specific theories of learning, and how to apply domain general models of learning to engineering classroom research. The participants will work with the presenter to develop new ways of thinking about their own research through the use of examples and group work.", "authors": [{"name": "Jonathan C. Hilpert", "affiliation": "Georgia Southern University"}], "tags": ["learning systems", "educational institutions", "context modeling", "engineering education", "modeling", "learning", "aboengineering education research", "information processing", "context"]}, {"title": "Uncovering and repairing crystal structure misconceptions in an introductory materials engineering class", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462296", "abstract": "The crystal structure of a metal plays an important role in its relationship to its macroscopic properties as well as atomic mechanisms of structural change. As such, students need to have an ability to visualize planar crystal atomic packing features, but often find it difficult. Thus, the research question here is, \"How can a student's baseline knowledge and misconceptions of planar atomic packing features for different metal structures be measured and how well can instruction promote conceptual change and misconception repair.\" Answering this question will provide insight for developing more effective pedagogy for crystal structures. A multiple-choice survey with six items was developed using misconceptions from students' pencil and paper sketches of face-centered cubic (FCC) and body-centered cubic (BCC) atoms on (100), (110), and (111) planes. Pretests and posttests of the survey were administered to students in a Spring 2012 introductory materials engineering course. Misconceptions that were revealed included: missing atoms, extra atoms, misplaced atoms, \"non-touching atoms where they should touch\" and \"touching atoms that should not touch\". Students' difficulty in solving increased from (100) to (110) to (111) planes for both BCC and FCC structures. Details of the survey instrument and results are described in the paper.", "authors": [{"name": "Steve Krause", "affiliation": "Materials Science and Engineering Program, School of Engineering, Arizona State University, Tempe, AZ, USA "}, {"name": "Cindy Waters", "affiliation": "Mechanical and Chemical Engineering Department, College of Engineering, North Carolina A & T Univ., Greensboro, NC, USA"}], "tags": ["atomic measurements", "crystals", "conceptual change", "misconceptions", "visualization", "metals", "instruments", "crystal structure", "assessment", "fcc"]}, {"title": "Security across the curriculum and beyond", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462297", "abstract": "Society's dependency on information technology has drastically outpaced educational curricula and the opportunities that universities and higher education institutes provide to students from both technical (e.g., computer engineering, computer science) and non-technical majors. To increase the opportunities for all students to learn how protect themselves as individuals and others as professionals from numerous cyber threats the focus of this work is to identify gaps in engineering curricula and present novel approaches to fulfill the growing and diverse needs of cyber security education. The overall objective of this paper is to make security education accessible, relevant, and tangible across educational curricula, as well as to provide the framework to extend these efforts beyond university classrooms and into community colleges and high schools. While the predominant focus, research, and innovative practices in the area of cyber security have focused on technical students at the university level, this work instead concentrates on the demographic of students that desire to learn about cyber security without having to major in computer engineering, for example. In this paper we present a three-tiered framework that provides breadth and depth to security education across multiple education levels. This all-encompassing framework for security education includes providing (1) formal literacy-based training for students of all backgrounds, (2) inquiry-based learning through security- and technically-focused student groups and activities, and (3) classical technical·based initiatives. For each of these respective areas, previous research and efforts are discussed as well as the innovative practices that we have developed to address identified educational gaps.", "authors": [{"name": "Joseph Idziorek", "affiliation": "Department of Electrical and Computer Engineering, Iowa State University, Ames, Iowa 50011 "}, {"name": "Julie Rursch", "affiliation": "Department of Electrical and Computer Engineering, Iowa State University, Ames, Iowa 50011 "}, {"name": "Doug Jacobson", "affiliation": "Department of Electrical and Computer Engineering, Iowa State University, Ames, Iowa 50011"}], "tags": ["inquiry-based learning", "security education", "educational institutions", "security literacy", "communities", "computer security", "context", "computers"]}, {"title": "Learning Artificial Intelligence clip by clip: Post class reflections on the first online Norvig-Thrun-Stanford-Know Labs Artificial Intelligence course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462298", "abstract": "The free on-line Artificial Intelligence (AI) course taught by Norvig and Thrun in Fall 2011 is likely to be a game changer in postsecondary education. The huge course enrollment demonstrates that there is a keen interest in this new type of open education, and that no campus-based alternative can be suitable for educating such large numbers of students. The AI course was offered as a sequence of granular, interactive video clips grouped into topics. Homework and exams were video-based as well. This paper provides a critical evaluation of the author's experience as a student enrolled in the advanced track of the AI course. The author is a tenured associate professor at a Canadian medium-sized, research-intensive university. Her expertise lies in Computer Vision, a topic that is closely related to Artificial Intelligence. The paper is based on participatory action research methods.", "authors": [{"name": "Alexandra Branzan Albu", "affiliation": "Electrical and Computer Engineering, cross-listed with Computer Science, University of Victoria, Victoria (BC) Canada"}], "tags": ["learning systems", "participatory research methods", "digital audio broadcasting", "educational institutions", "computer vision", "open education", "on-line learning", "video-based learning", "materials"]}, {"title": "Present@: A virtual environment for dissertation defense", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462299", "abstract": "", "authors": [], "tags": ["virtual dissertation", "videos", "educational institutions", "virtual environments", "visualization", "presentation", "software", "face", "final degree project"]}, {"title": "Qualitative inquiry of best practices and challenges faced by faculty engaged in learning through service efforts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462300", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "learning through service", "communities", "service-learning", "faculty perspective", "focus group", "organizations", "usa councils", "context", "qualitative methods"]}, {"title": "Work in progress: Transitioning from novice to expert software engineers through design patterns: Is it really working?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462302", "abstract": "", "authors": [], "tags": ["ontologies", "pattern matching", "design patterns", "software", "education", "software engineering education", "software engineering"]}, {"title": "Work in progress: Describing the responsibilities of Teaching Assistants in first-year engineering programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462303", "abstract": "", "authors": [], "tags": ["first-year engineering", "internet", "educational institutions", "engineering students", "teaching assistants", "psychology", "survey", "context"]}, {"title": "A philosophy driven curriculum: The example of an engineering science course in england", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462304", "abstract": "", "authors": [], "tags": ["operational(working) philosophy", "educational institutions", "examinations", "conferences", "laboratories", "syllabus", "engineering education", "physics", "assessment", "materials", "curriculum development"]}, {"title": "Work in progress: An International Engineering: Certificate: Incentivizing engineering students to pursue global experiences", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462305", "abstract": "", "authors": [], "tags": ["statistics", "educational institutions", "global experiences", "international engineering education", "engineering students", "international engineering certificate", "sociology", "context", "computer science"]}, {"title": "A sophomore capstone solid modeling experience: Virtual dissection and reassembly of legacy drawings", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462306", "abstract": "", "authors": [], "tags": ["legacy drawings", "educational institutions", "rendering", "assembly", "solid modeling", "animation", "drawing package formulation", "engineering drawings", "virtual dissection", "design automation", "engines"]}, {"title": "An approach for teaching algorithms and computer programming using Greenfoot and Python", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462307", "abstract": "", "authors": [], "tags": ["python", "educational institutions", "greenfoot", "programming teaching", "algorithms teaching", "green products", "programming profession", "introductory computing courses", "computers"]}, {"title": "Work in progress: Putting control engineering in middle school girls' futures", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462308", "abstract": "", "authors": [], "tags": ["optics", "robot sensing systems", "engineering profession", "educational institutions", "conferences", "k-12 initiatives", "control engineering", "communal goals", "gender", "purification"]}, {"title": "Infusion of ABET — Specified professional and academic content into off-campus work experiences via distance learning modules", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462309", "abstract": "", "authors": [], "tags": ["educational institutions", "employment", "cooperative education", "professional skills", "ethics", "engineering students", "economics", "project management", "online distance education", "materials"]}, {"title": "A survey of attitudes, beliefs, and perceptions regarding the internationalization of engineering and Computer Science undergraduate programs at the University of Victoria", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462310", "abstract": "", "authors": [], "tags": ["internationalization", "educational institutions", "data collection", "interviews", "cultural differences", "qualitative analysis", "plagiarism", "focus groups", "global education", "computer science"]}, {"title": "Work in progress: Update 2012 on the iCollaborate MSE project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462311", "abstract": "", "authors": [], "tags": ["cognition", "collaborative work", "educational institutions", "low-stakes quizzing", "ict enabled inductive teaching", "ipod touch applications", "portable media players", "materials science and engineering", "mse apps", "materials", "collaborative learning", "computers"]}, {"title": "Development of an augmented reality based remedial course to improve the spatial ability of engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462312", "abstract": "", "authors": [], "tags": ["games", "augmented reality", "solid modeling", "visualization", "training", "engineering students", "spatial skills", "remedial course (key words)"]}, {"title": "Automating the authoring of learning material in Computer Engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462313", "abstract": "", "authors": [], "tags": ["cognition", "natural language processing", "ontologies", "content authoring", "semi automatic authoring", "leanring objects", "object oriented programming", "grammar", "knowledge acquisition", "materials", "syntactics"]}, {"title": "Assessment of self-regulated attitudes and behaviors of introductory programming students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462314", "abstract": "", "authors": [], "tags": ["cognition", "self-regulation", "programming", "educational institutions", "behavior", "motivation", "iache", "organizations", "programming profession", "achievement"]}, {"title": "IT experiential learning: The Living Lab", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462315", "abstract": "", "authors": [], "tags": ["educational institutions", "living lab", "springs", "servers", "organizations", "security", "experiential learning", "service", "it", "information technology"]}, {"title": "Work in progress: Extending a LMS with social capabilities: Integrating Moodle into Facebook", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462316", "abstract": "", "authors": [], "tags": ["least squares approximation", "control systems", "facebook", "web 2.0", "education", "ieee members"]}, {"title": "Stories of change: How educators change their practice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462317", "abstract": "", "authors": [], "tags": ["learning systems", "engineering profession", "change of practice", "reflection", "change stories", "sharing practice", "education", "books", "materials", "context", "education research"]}, {"title": "Challenges and issues in the development of a Software Engineering simulation game", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462318", "abstract": "", "authors": [], "tags": ["analytical models", "games", "investments", "software process improvement", "simulation game", "software", "education", "organizations", "software engineering"]}, {"title": "FASENG: A framework for development of Software Engineering simulation games", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462319", "abstract": "", "authors": [], "tags": ["requirements", "unified modeling language", "simulation games", "adaptation models", "games", "software", "computational modeling", "software engineering education", "software engineering", "engines", "framework"]}, {"title": "Workshop: Evaluation of educational research and development projects: Pre-conference workshop", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462320", "abstract": "", "authors": [], "tags": ["evaluation", "abstracts", "pimmel format", "conferences", "us government", "education", "evaluation tools", "research and development", "evaluation types", "thumb", "data interpretation", "evaluation plan"]}, {"title": "Results from an action research approach for designing CS1 learning environments in Tanzania", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462321", "abstract": "", "authors": [], "tags": ["analysis of variance", "educational institutions", "collaboration", "problem-solving", "programming profession"]}, {"title": "Work in progress: Empowering teaching assistants to become agents of education reform", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462322", "abstract": "", "authors": [], "tags": ["barium", "motivation", "reform", "training", "teaching assistants", "intrinsic motivation"]}, {"title": "A snapshot of current languages used in industry", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462323", "abstract": "", "authors": [], "tags": ["languages", "computer science education", "correlation", "java", "software", "industry", "curriculum", "standards", "industries"]}, {"title": "An engineering curriculum track for IT for sustainability", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462324", "abstract": "", "authors": [], "tags": ["knowledge discovery", "cities and towns", "curriculum innovation", "sustainability", "technological innovation", "information technology (it)", "engineering education", "data mining", "sensors", "economics", "future cities", "bs", "computer science"]}, {"title": "Work in progress: Do students need to learn to speak \"Engineering-ese?\" conceptual change as language acquisition in engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462325", "abstract": "", "authors": [], "tags": ["5g mobile communication", "three-dimensional displays"]}, {"title": "Work in progress: First-year engineering students development of test cases for model development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462326", "abstract": "", "authors": [], "tags": ["first-year engineering", "statistics", "engineering education", "data models", "mathematical model", "problem-solving", "mathematical modeling", "standards", "companies"]}, {"title": "Awareness of and receptiveness to active learning strategies among STEM faculty", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462327", "abstract": "", "authors": [], "tags": ["collaborative work", "educational institutions", "active learning", "faculty", "classroom practice", "engineering education", "interviews", "usa councils", "computer science"]}, {"title": "Trust in engineering teams and groups and virtual facilitation methods", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462328", "abstract": "", "authors": [], "tags": ["buildings", "educational institutions", "communication systems", "training", "engineering students", "teamwork"]}, {"title": "The impact of real-world topic labs on student performance in CS1", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462329", "abstract": "", "authors": [], "tags": ["programming", "educational institutions", "games", "springs", "switches", "computers"]}, {"title": "Work in progress: Understanding the experiences of women of color in engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462330", "abstract": "", "authors": [], "tags": ["women of color", "educational institutions", "diversity", "shape", "identity", "engineering students", "color", "interviews"]}, {"title": "Work in progress: Investigating the engineering design process: Novices vs. experts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462331", "abstract": "", "authors": [], "tags": ["protocol analysis", "educational institutions", "problem decomposition", "protocols", "teaming", "engineering education", "encoding", "knowledge engineering", "fbs", "recomposition of sub-problems", "engineeering design", "industries"]}, {"title": "Peer mentoring: Linking the value of a reflective activity to graduate student development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462332", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "employee welfare", "communities", "peer mentoring", "graduate students", "engineering education", "identity", "graduate engineering education consortium for sstudents (geecs)", "monitoring"]}, {"title": "Work in progress: Changes in elementary teachers' Noticing of engineering Pre/Post professional development with engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462333", "abstract": "", "authors": [], "tags": ["teacher professional development", "educational institutions", "manufacturing", "engineering education", "encoding", "assessment", "standards", "problem-solving", "elementary engineering"]}, {"title": "“Need to Know” in engineering programs; STEMing the uncertainty around graduate education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462334", "abstract": "", "authors": [], "tags": ["aerospace engineering", "engineering profession", "educational institutions", "qualitative", "chemicals", "engineering students", "undergraduate", "navigation", "graduate"]}, {"title": "Utilizing reflection in projects for increased metacognition and enhanced learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462335", "abstract": "", "authors": [], "tags": ["reflection", "mercury (metals)", "active learning", "barium", "critical thinking"]}, {"title": "Work in progress: Examination of student experiences in immersive vs. traditional group projects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462336", "abstract": "", "authors": [], "tags": ["virtual worlds", "immersive group projects", "reliability and internal consistency of test scores", "student engagement", "decision support systems"]}, {"title": "Work in progress: What is critical thinking?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462337", "abstract": "", "authors": [], "tags": ["educational institutions", "instruments", "engineering students", "critical thinking", "materials", "context", "interviews"]}, {"title": "Work in progress: Engaging new PIs using an electronic mentoring system", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462338", "abstract": "", "authors": [], "tags": ["employee welfare", "communities", "us government", "engineering education", "electronic mentoring", "community of practice", "lead", "principal investigators", "project management", "science - general"]}, {"title": "Work in progress: Engineering education and pragmatism: Imagining an undergraduate engineering course based on the educational philosophy of John Dewey", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462339", "abstract": "", "authors": [], "tags": ["art", "educational institutions", "laboratories", "dewey and engineering", "engineering synthesis", "engineering students", "open design", "pragmatism and engineering", "philosophy of engineering", "standards"]}, {"title": "Assessing the application of three theories of conceptual change to interdisciplinary data sets", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462340", "abstract": "", "authors": [], "tags": ["cognition", "conceptual change", "programming", "stress", "digital logic", "strain", "mechanics of materials", "materials", "context", "interviews"]}, {"title": "Work in progress: Outreach assessment: Measuring engagement: An integrated approach for learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462341", "abstract": "", "authors": [], "tags": ["engineering profession", "reflection", "observational studies", "atmospheric measurements", "particle measurements", "laboratories", "education", "wind turbines", "k12 outreach", "integrated leaning"]}, {"title": "Work in progress: Theoretical approach to characterizing changes in students' and engineers' conceptual understanding and personal epistemologies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462342", "abstract": "", "authors": [], "tags": ["cognition", "conceptual change", "educational institutions", "data collection", "qualitative research", "psychology", "cognitive science", "epistemology", "personal epistemology", "context"]}, {"title": "Work in progress: The University of Texas System Louis Stokes Alliance for Minority Participation: A state-wide initiative to promote STEM undergraduate research", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462343", "abstract": "", "authors": [], "tags": ["educational institutions", "production", "national science foundation", "communities", "undergraduate research", "laboratories", "training", "proposals", "stem"]}, {"title": "Using inquiry-based activities to repair student misconceptions related to Heat, energy and temperature", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462344", "abstract": "", "authors": [], "tags": ["formatting", "analysis of variance", "educational institutions", "misconceptions", "heat transfer", "engineering education", "physics", "heating", "materials", "inquiry"]}, {"title": "Improving collaborative learning by personalization in Virtual Learning Environments using agents and competency-based ontology", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462345", "abstract": "", "authors": [], "tags": ["multiagent systems", "ontologies", "least squares approximation", "petri nets", "learning management system (lms)", "mathematical model", "competency", "electronic learning", "ontology", "standards", "multi-agent systems"]}, {"title": "Differentiating undergraduates from graduate student and faculty inventors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462346", "abstract": "", "authors": [], "tags": ["commercialization", "educational institutions", "technological innovation", "intellectual property", "technology transfer", "innovation management", "engineering education", "product design", "undergraduate", "entrepreneurship", "innovation", "market research"]}, {"title": "Work in progress: Making Room: Creating design spaces for design practice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462347", "abstract": "", "authors": [], "tags": ["design thinking", "mechatronics", "educational institutions", "product development", "technological innovation", "engineering design", "engineering education", "collaboration", "creativity", "arrays", "workspaces"]}, {"title": "Work in progress: Constructing a multidisciplinary design project for first-year engineering and Computing students: Traffic Simulation Engineering Design Challenge", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462348", "abstract": "", "authors": [], "tags": ["first-year engineering", "problem based learning", "automata", "programming", "algorithm design and analysis", "graphical user interfaces", "engineering design", "humans", "software", "projects", "traffic control", "vehicles", "multidisciplinary"]}, {"title": "Predictive models on improvement of spatial abilities in controlled training", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462349", "abstract": "", "authors": [], "tags": ["augmented reality", "solid modeling", "engineering education", "visualization", "best practices", "training", "geometry", "predictive models", "training courses", "spatial skills", "introductory courses"]}, {"title": "Why do some engineering students study alone?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462350", "abstract": "", "authors": [], "tags": ["educational institutions", "communities", "solitude", "belonging", "isolation", "engagement", "engineering students", "community", "switches", "standards", "interviews"]}, {"title": "Work in progress: Help in finding evaluation instruments for engineering education innovations", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462351", "abstract": "", "authors": [], "tags": ["evaluation", "evaluation capacity building", "appraisal", "communities", "technological innovation", "engineering education", "databases", "instruments", "software"]}, {"title": "Using eReaders and Tablets in the engineering classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462352", "abstract": "", "authors": [], "tags": ["educational institutions", "ereader", "electronic publishing", "tablet", "portable document format", "software", "consumer electronics", "graphics", "handouts", "kindle", "preparing course content", "nook", "materials"]}, {"title": "Physical modeling in design projects: Development and testing of a new design method", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462353", "abstract": "", "authors": [], "tags": ["measurement", "force", "guidelines", "design cognition", "design methodology", "analytical models", "physical models", "bicycles", "design method", "prototyping guidelines", "buildings"]}, {"title": "Workshop: Learning agile through active learning activities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462354", "abstract": "", "authors": [], "tags": ["reflection", "conferences", "games", "collaboration", "software", "tutorials", "software engineering"]}, {"title": "Work in progress: A generic model for interactivity-intense intelligent tutor authoring tools", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462355", "abstract": "", "authors": [], "tags": ["authoring systems", "user interfaces", "educational institutions", "intelligent tutoring systems", "artificial intelligence", "software", "computer architecture", "electronic learning", "computer assisted instruction", "computers"]}, {"title": "I'm absolutely certain that's probably true: Exploring epistemologies of sophomore engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462356", "abstract": "", "authors": [], "tags": ["cognition", "personal epistemology", "protocols", "reliability", "knowledge engineering", "statics", "civil engineering", "context", "interviews"]}, {"title": "Engineering matriculation paths: Outcomes of Direct Matriculation, First-Year Engineering, and Post-General Education Models", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462357", "abstract": "", "authors": [], "tags": ["first-year engineering", "engineering profession", "major change", "educational institutions", "switching", "accessibility", "engineering students", "switches", "transfer students", "persistence", "usa councils"]}, {"title": "Work in progress: How differences in student motivation characterize differences between engineering disciplines", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462358", "abstract": "", "authors": [], "tags": ["statistics", "complexity theory", "educational institutions", "engineering disciplines", "motivation", "biomedical engineering", "engineering education", "scholarships", "sociology", "attitudes"]}, {"title": "A proposed teaching and learning curriculum for COMPLEETE based on current national trends", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462359", "abstract": "", "authors": [], "tags": ["communities", "encoding", "education", "planning", "materials", "programming profession"]}, {"title": "Work in progress: Video tutorials that enhance laboratory learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462360", "abstract": "", "authors": [], "tags": ["videos", "youtube", "biomedical engineering", "laboratories", "laboratory", "education", "biomedical measurements", "circuits", "tutorials", "buildings"]}, {"title": "Intensive international Summer Schools in Global Distributed Software Development", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462361", "abstract": "", "authors": [], "tags": ["computer science", "educational institutions", "communities", "software", "software engineering", "computers", "industries"]}, {"title": "Work in progress: Grand challenges for Engineering in the middle school classroom: Preliminary results", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462362", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "atmospheric measurements", "particle measurements", "employee welfare", "program evalution", "engineering education", "grand challenges", "stem", "middle school"]}, {"title": "Comparing the mobile novice programming environments: App Inventor for Android vs. GameSalad", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462363", "abstract": "", "authors": [], "tags": ["educational institutions", "humanoid robots", "gamesalad", "mobile communication", "software", "androids", "visual “blocks” programming", "novice programming environment", "programming profession", "app inventor for android"]}, {"title": "Design considerations: Implications of domain expertise", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462364", "abstract": "", "authors": [], "tags": ["design thinking", "broad thinking", "educational institutions", "communities", "engineering education", "encoding", "knowledge engineering", "domain expertise", "design process", "economics", "context"]}, {"title": "Implementing a new Computer Science Curriculum for middle school in Israel", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462365", "abstract": "", "authors": [], "tags": ["computer science", "educational institutions", "training", "education", "algorithmic thinking", "computational thinking", "teachers' professional development", "curriculum", "middle school", "programming profession", "computers"]}, {"title": "Workshop: Interactive education tools for earth systems and sustainability applications", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462366", "abstract": "", "authors": [], "tags": ["ocean temperature", "sea level", "earth system", "sustainability", "conferences", "earth", "laboratories", "online labs", "java tools", "climate change", "digital signal processing", "meteorology"]}, {"title": "Constructing a collegiate Motorsports Engineering program", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462367", "abstract": "", "authors": [], "tags": ["educational institutions", "innovative pracatice", "program development", "motorsports", "vehicle dynamics", "economics", "vehicles", "business", "industries"]}, {"title": "Department Climate: A key to recruiting and retaining a diverse and successful faculty", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462368", "abstract": "", "authors": [], "tags": ["department climate", "retention", "educational institutions", "diversity", "conferences", "lead", "recruitment", "personnel", "faculty recruitment", "meteorology"]}, {"title": "Work in progress: A comprehensive approach for mapping student's progress: Assessing student progress in freshman engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462369", "abstract": "", "authors": [], "tags": ["evaluation", "abstracts", "reflection", "educational institutions", "conferences", "engineering education", "equations", "assessment", "mental representation", "systematics", "learning verbalization", "context"]}, {"title": "Care ethics in engineering education: Undergraduate student perceptions of responsibility", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462370", "abstract": "", "authors": [], "tags": ["environmental justice", "electronic waste", "humanitarian engineering", "ethics of care", "ethics", "collaboration", "government", "recycling", "social justice", "companies"]}, {"title": "Work in progress: Integrating writing instruction in engineering courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462371", "abstract": "", "authors": [], "tags": ["integration", "educational institutions", "communication", "engineering education", "program development", "mechanical engineering", "outcomes-based assessment", "writing", "teamwork"]}, {"title": "Evaluating the effectiveness of the use of teaching materials in video format in distance learning environments", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462372", "abstract": "", "authors": [], "tags": ["measurement", "video delivery", "streaming media", "viewer engagement", "education", "servers", "absorption", "monitoring", "materials", "distance learning"]}, {"title": "Work in progress: Abstraction as a vector: Distinguishing engineering and science", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462373", "abstract": "", "authors": [], "tags": ["abstracts", "educational institutions", "conferences", "presses", "engineering education", "philosophy of engineering education", "philosophy of engineering", "usa councils", "vectors"]}, {"title": "A system to help teaching and learning algorithms", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462374", "abstract": "", "authors": [], "tags": ["learning system", "computer languages", "visualization", "visual programming", "algorithms", "education", "software", "introductory programming", "free software", "programming environments", "programming profession"]}, {"title": "Using robots to teach programming to K-12 teachers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462375", "abstract": "", "authors": [], "tags": ["programming", "educational institutions", "graphical programming languages", "conferences", "computer science education", "robots", "educational robotics", "introductory programming", "materials", "frequency locked loops", "k-12 teacher education"]}, {"title": "Work in progress: Serving rural communities: A K-8 LEGO robotics case study", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462376", "abstract": "", "authors": [], "tags": ["robot sensing systems", "gears", "teacher professional development", "k-12 engineering education", "educational institutions", "conferences", "webinars", "lego robotics", "educational robots"]}, {"title": "Application of item response theory (IRT) for the generation of adaptive assessments in an introductory course on object-oriented programming", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462377", "abstract": "", "authors": [], "tags": ["web services", "unified modeling language", "adaptation models", "adaptive systems", "education", "neural networks", "context"]}, {"title": "Work in progress: How do first-year engineering students develop as self-directed learners?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462378", "abstract": "", "authors": [], "tags": ["lifelong learning", "self-regulated learning", "help-seeking", "metacognition", "educational institutions", "self-directed learning", "presses", "collaboration", "engineering students", "psychology", "goal-orienatation"]}, {"title": "Panel: Engineering and development: Facilitating successful project work in diverse global contexts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462379", "abstract": "", "authors": [], "tags": ["buildings", "educational institutions", "global engineering", "communities", "engineering education", "community development", "engineering students", "service learning", "project-based learning", "pbl", "usa councils", "context"]}, {"title": "Work in progress: Performing signal analysis laboratories using Android devices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462381", "abstract": "", "authors": [], "tags": ["dsp education", "signal processing algorithms", "laboratories", "graphical programming", "mobile communication", "android", "performance evaluation", "smart phones", "j-dsp", "digital signal processing"]}, {"title": "Work in progress: Identification of misconceptions governed by emergent phenomena in photovoltaics content using the Delphi Method", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462382", "abstract": "", "authors": [], "tags": ["photovoltaic systems", "delphi", "educational institutions", "misconceptions", "emergent phenomena", "photovoltaics", "emergent processes", "semiconductors", "psychology", "complexity", "materials"]}, {"title": "Special session: The CS2013 Computer Science curriculum guidelines project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462383", "abstract": "", "authors": [], "tags": ["guidelines", "programming", "communities", "computer science education", "curricula", "computing", "software", "education", "cs2013", "usa councils"]}, {"title": "Special session: Race and the idea of privilege in the engineering classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462384", "abstract": "", "authors": [], "tags": ["stereotype threat", "white prvilege", "engineering culture", "underrepresented minorities", "social justice"]}, {"title": "Integrating international students' contests with computer sciecnce capstone: Lessons learned and best practices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462385", "abstract": "", "authors": [], "tags": ["educational institutions", "proposals", "cultural differences", "software engineering education", "software engineering", "integrated circuits", "collaborative learning", "computer science"]}, {"title": "Work in progress: Can Bourdieu's Habitus provide a theoretical framework for engineering education research?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462386", "abstract": "", "authors": [], "tags": ["australia", "habitus", "educational institutions", "engineering education", "bourdieu", "cultural differences", "sociology", "student diversity", "writing", "disposition"]}, {"title": "Work in progress: Developing and evaluating tutor training for collaborative teaching", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462387", "abstract": "", "authors": [], "tags": ["problem based learning", "professional development", "evaluation", "message systems", "educational institutions", "conferences", "training", "online teaching", "tutor training", "monitoring", "materials"]}, {"title": "Work in progress: Developing engineering systems thinking through the modeling of a complex bioengineering system", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462388", "abstract": "", "authors": [], "tags": ["heart", "blood", "k-12 engineering education", "educational institutions", "biomedical engineering", "systems thinking", "materials", "valves"]}, {"title": "Implementing & evaluating Undergraduate Research in renewable energy at Colorado School of Mines", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462389", "abstract": "", "authors": [], "tags": ["educational institutions", "analytical models", "communities", "context modeling", "reu evaluation", "research experiences for undergraduates", "reu implementation", "renewable energy resources", "materials", "renewable energy", "context"]}, {"title": "Redesign of senior capstone program in electrical and computer engineering and its assessment", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462390", "abstract": "", "authors": [], "tags": ["capstone program", "educational institutions", "design", "proposals", "organizations", "assessment", "teamwork", "industries"]}, {"title": "Work in progress: Using mobile phones to accomplish an Audience Response System with IGoogle home page", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462391", "abstract": "", "authors": [], "tags": ["igoogle", "portable computers", "web services", "opensocial", "audience response system", "receivers", "electronic learning", "smart phones", "object recognition", "gadget"]}, {"title": "Using practice theory to investigate professional engineers' workplace learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462392", "abstract": "", "authors": [], "tags": ["continuing professional development", "australia", "educational institutions", "employment", "professional learning", "shape", "qualitative research", "practice theory", "materials", "context"]}, {"title": "Peering at the peer review process for conference submissions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462393", "abstract": "", "authors": [], "tags": ["australia", "educational institutions", "engineering education research", "communities", "data handling", "engineering education", "research quality", "logic gates", "peer review", "standards"]}, {"title": "Work in progress: Does motivation matter for conceptual change? exploring the implications of “hot cognition” on conceptual learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462394", "abstract": "", "authors": [], "tags": ["cognition", "hot cognition", "data collection", "intentionality", "engagement", "engineering students", "teaching strategies", "thermal engineering", "conceptual understanding", "interviews"]}, {"title": "Constructive scaffolding for accessible PBL: Situated meta-critique in the classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462395", "abstract": "", "authors": [], "tags": ["law", "educational institutions", "games", "hci", "first year computing undergraduates", "problem-based learning", "situated meta-critique", "tutorials", "growth mindset", "context"]}, {"title": "Factors influencing STEM teachers' effectiveness in the UAE", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462396", "abstract": "", "authors": [], "tags": ["teacher effectiveness", "educational institutions", "grade k-12", "mathematics", "stem", "standards", "remuneration", "materials", "usa councils", "uae"]}, {"title": "Work in progress: Integrating a college of engineering teaching and learning center into a leading position in the institution", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462397", "abstract": "", "authors": [], "tags": ["guidelines", "educational institutions", "conferences", "teaching and learning center", "learning skills", "training", "faculty development", "standards", "mathematics"]}, {"title": "Automatic classification of question difficulty level: Teachers' estimation vs. students' perception", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462398", "abstract": "", "authors": [], "tags": ["teachers'", "automatic question classification", "estimation", "expert systems", "educational institutions", "accuracy", "students'", "educational technology", "perception", "electronic learning", "materials", "context"]}, {"title": "Work in progress: Integrating entrepreneurship into undergraduate engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462399", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "technological innovation", "innovation management", "program development", "undergraduate education", "engineering students", "identification", "willingess", "future career", "entrepreneurship", "stem"]}, {"title": "A Systematic Knowledge Pattern (SKP) for teaching Knowledge Management", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462400", "abstract": "", "authors": [], "tags": ["innovative computing tools", "knowledge management", "pedagogical pattern", "knowledge based systems", "high school curriculum", "databases", "collaboration", "education", "organizations", "knowledge pattern", "systematics"]}, {"title": "Collaborative learning frameworks to promote a positive learning culture", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462401", "abstract": "", "authors": [], "tags": ["complexity theory", "collaborative work", "educational institutions", "collaborative learning", "summative", "collaboration", "histograms", "formative", "learning oriented assessment", "materials", "context", "assessment scafolding"]}, {"title": "Using technology to improve peer review and collaborative conversations to benchmark academic standards", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462402", "abstract": "", "authors": [], "tags": ["benchmarking", "australia", "educational institutions", "conferences", "academic standards", "benchmark testing", "software", "self and peer assessment", "peer review", "standards"]}, {"title": "Work in progress: Software for remote laboratories designed with the focus on learners", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462403", "abstract": "", "authors": [], "tags": ["educational institutions", "remote laboratories", "remote laboratory", "engineering education", "software", "hardware", "automated pedagodical support", "context"]}, {"title": "Work in progress: International experience in semiconductor product engineering", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462404", "abstract": "", "authors": [], "tags": ["joint degree programs", "educational institutions", "joints", "graduate education", "electrical engineering", "testing", "international experience", "computers", "companies"]}, {"title": "A comparison of electrical, computer, and chemical engineering facultys' progressions through the innovation-decision process", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462405", "abstract": "", "authors": [], "tags": ["innovation-decision process", "physics education", "technological innovation", "conferences", "chemical engineering", "engineering education", "engineering sciences", "diffusion of innovation"]}, {"title": "Work in progress: Using rigorous design reviews to teach and assess students' design capabilities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462406", "abstract": "", "authors": [], "tags": ["design reviews", "educational institutions", "design assessment", "probes", "chemical engineering", "us government agencies", "documentation", "usa councils", "context"]}, {"title": "Work in progress: Development of computer modules to improve student metacognition and motivation strategies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462407", "abstract": "", "authors": [], "tags": ["motivation strategies", "lifelong learning", "reflection", "educational institutions", "manufacturing", "osmosis", "e-learning", "learning styles", "tutorials", "monitoring"]}, {"title": "Work in progress: Analysis of the relationship between teaching contents and motivation in programming education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462408", "abstract": "", "authors": [], "tags": ["educational institutions", "analysis", "games", "arcs model", "motivation", "java", "introductory programming", "computational modeling", "programming profession"]}, {"title": "Undergraduate hands-on senior capstone project experience on emerging mobile IPV6 technology", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462409", "abstract": "", "authors": [], "tags": ["manganese", "mobile ipv6", "kernel", "virtualization", "ipv6", "open source", "undergraduate research experience", "mobile communication", "linux", "mobile computing", "workstations", "hands-on"]}, {"title": "Student reflections on Collaborative Technology in a globally distributed student project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462410", "abstract": "", "authors": [], "tags": ["reflections", "reflection", "educational institutions", "scaffolding", "collaboration", "collaborative technology", "global collaboration", "cultural differences", "open-ended group projects", "information technology", "writing", "context"]}, {"title": "Categorizing how students use Collaborative Technologies in a globally distributed project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462411", "abstract": "", "authors": [], "tags": ["reflections", "reflection", "educational institutions", "collaborative technologies", "laboratories", "electronic mail", "collaboration", "web 2.0", "global collaboration", "open-ended group projects", "survey", "context"]}, {"title": "A multinational case study on using diverse feedback types applied to introductory programming learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462412", "abstract": "", "authors": [], "tags": ["complexity theory", "software testing", "educational institutions", "programming learning", "logical errors", "pedagogical rubric", "programming profession", "context", "feedback"]}, {"title": "Managing international student collaborations: An experience report", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462413", "abstract": "", "authors": [], "tags": ["experience report", "complexity theory", "international collaboration", "educational institutions", "international student collaboration", "collaboration", "open ended group project", "cultural differences", "organizations", "context"]}, {"title": "Work in progress: Choose your own homework", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462414", "abstract": "", "authors": [], "tags": ["educational institutions", "humans", "data models", "open-ended problems", "algebra", "online homework", "differentiated instruction", "materials", "context"]}, {"title": "Work in progress: Enhance CS/CE student learning in computer architecture and organization through a remote instrument control lab with mixed reality", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462415", "abstract": "", "authors": [], "tags": ["fpga", "educational institutions", "virtual reality", "browsers", "hardware", "remote lab", "servers", "mixed reality", "education", "field programmable gate arrays", "computers"]}, {"title": "Examining the effect of design education on the design cognition: Measurements from protocol studies", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462416", "abstract": "", "authors": [], "tags": ["cognition", "design cognition", "ontologies", "design education", "protocols", "encoding", "education", "verbal protocol studies", "market research", "indexes"]}, {"title": "Work in progress: What calculus do students learn after calculus?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462417", "abstract": "", "authors": [], "tags": ["acculumation", "abstracts", "differential equations", "educational institutions", "back transfer", "function", "understanding", "apos", "interviews"]}, {"title": "Work in progress: Student lab on graphics cards' multi buffer architecture implemented in an FPGA", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462418", "abstract": "", "authors": [], "tags": ["laboratory assignment", "laboratories", "digital hardware design", "vhdl programming", "hardware", "computer architecture", "graphics", "data transfer", "field programmable gate arrays", "buffer storage"]}, {"title": "Workshop: Assessing professional skills for ABET", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462419", "abstract": "", "authors": [], "tags": ["learning systems", "design engineering", "accreditation", "professional development", "conferences", "instruments", "abet", "materials", "teamwork", "student outcomes assessment"]}, {"title": "Work in progress: STEM capacity building and STEM outreach in India: A report on a recent NSF sponsored GK-12 George Mason trip to India", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462420", "abstract": "", "authors": [], "tags": ["educational institutions", "international travel", "india", "gk-12", "us government", "fellows", "stem outreach", "stem capacity building", "science - general", "buildings", "interviews"]}, {"title": "Educational software tool for signals and systems theory", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462421", "abstract": "", "authors": [], "tags": ["linear — invariant and non invariant — systems", "visualization", "software tool", "signal theory", "fourier transforms", "software tools", "infinite dimensions — countable or continuous", "operators", "spectral analysis", "vectors"]}, {"title": "Global engineering: Cyber security, BRICs, and culture", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462422", "abstract": "", "authors": [], "tags": ["educational institutions", "global engineering", "engineering education", "springs", "knowledge engineering", "brics", "cyber security", "cultural differences", "economics", "business"]}, {"title": "Workshop: Teaching computer security literacy to the masses: A practical approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462423", "abstract": "", "authors": [], "tags": ["security education", "educational institutions", "security literacy", "conferences", "software", "computer security", "computers"]}, {"title": "The role of Social Networking Sites in e-learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462424", "abstract": "", "authors": [], "tags": ["personalised environment", "teaching and learning", "facebook", "social networking sites", "collaboration", "security", "electronic learning", "interaction", "interviews"]}, {"title": "Work in progress: Phenomenographic perspective on engineering students' experience of interdisciplinary learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462425", "abstract": "", "authors": [], "tags": ["educational institutions", "phenomenography", "concrete", "engineering students", "interdisciplinary learning", "topology", "encountering others", "interviews"]}, {"title": "Work in progress: Understanding migration patterns of engineering undergraduates: The impact of course grades on student major choice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462426", "abstract": "", "authors": [], "tags": ["major choice", "educational institutions", "migration", "grades", "logic gates", "engineering students", "economics", "persistence", "usa councils"]}, {"title": "Pedagogical architectures to support the process of teaching and learning of computer programming", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462427", "abstract": "", "authors": [], "tags": ["cooperative authoring", "programming profession", "problem solving", "education", "computer architecture", "cscl", "learning of computer programming", "pedagogical architecture", "computer languages", "computers"]}, {"title": "Student and instructor experiences in the inverted classroom", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462428", "abstract": "", "authors": [], "tags": ["watches", "instructor experiences", "inverted classroom", "education", "student experiences", "industries", "software engineering education", "software engineering", "materials", "interviews"]}, {"title": "Towards a framework for designing and analyzing CS learning environments", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462430", "abstract": "", "authors": [], "tags": ["robots", "educational institutions", "programming profession", "context"]}, {"title": "Work in progress: How engineering students define innovation", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462431", "abstract": "", "authors": [], "tags": ["first-year engineering", "educational institutions", "technological innovation", "encoding", "engineering students", "creativity", "innovation", "context"]}, {"title": "Work in progress: Preliminary survey results on the first year of the Bologna process in engineering education in Spain", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462432", "abstract": "", "authors": [], "tags": ["bologna process", "collaborative work", "educational institutions", "chapters", "communities", "eees", "engineering education", "ieee education society"]}, {"title": "Feedback effects: Comparing the change resulting from peer and TA feedback to student solutions of Model-Eliciting Activities", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462434", "abstract": "", "authors": [], "tags": ["analysis of variance", "educational institutions", "synthetic aperture sonar", "correlation", "mathematical model", "training"]}, {"title": "Work in progress: Developing an Innovation Self-efficacy survey", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462435", "abstract": "", "authors": [], "tags": ["educational institutions", "technological innovation", "self-efficacy", "engineering education", "organizations", "psychology", "assessment", "innovation", "context", "industries"]}, {"title": "The effect of feedback on modeling in an authentic process development project", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462436", "abstract": "", "authors": [], "tags": ["inductors", "biological system modeling", "laboratories", "model development", "virtual laboratory", "engineering education", "mathematical model", "qualitative research", "kinetic theory", "materials", "context", "feedback"]}, {"title": "What are the implications for teaching? An analysis of how educational implications are represented in engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462437", "abstract": "", "authors": [], "tags": ["educational institutions", "educational implications", "communities", "human computer interaction", "engineering education", "encoding", "writing", "rhetoric of science"]}, {"title": "Work in progress: Integrating game design and development into undergraduate biology education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462438", "abstract": "", "authors": [], "tags": ["game design", "educational institutions", "games", "genetics", "game development", "software engineering", "biology undergraduate education", "computer science"]}, {"title": "Special session: What do student-generated diagrams say about their understanding?: developmental trajectories of model-based reasoning in engineering students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462439", "abstract": "", "authors": [], "tags": ["cognition", "model-based reasoning", "think aloud protocols", "educational institutions", "communities", "biomedical engineering", "inference mechanisms", "diagrams", "problem-solving", "expert — novice", "usa councils"]}, {"title": "Work in progress: Who answered first? — A trivia game utilizing timed electronic classroom response systems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462440", "abstract": "", "authors": [], "tags": ["trivia", "educational institutions", "classroom games", "games", "classroom technology", "databases", "programming environments", "classroom applications", "matlab", "time factors", "classroom response systems", "clickers"]}, {"title": "When students choose competencies: Insights from the competency-specific engineering portfolio studio", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462441", "abstract": "", "authors": [], "tags": ["portfolio", "programming", "educational institutions", "portfolios", "sstudio", "humans", "engineering education", "lead", "competency", "interviews"]}, {"title": "Understanding engineering transfer students: Demographic characteristics and educational outcomes", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462442", "abstract": "", "authors": [], "tags": ["statistics", "electric shock", "educational institutions", "databases", "engineering students", "higher education", "engineering", "switches", "stem", "transfer students", "sociology", "persistence", "student retention"]}, {"title": "Work in progress: Engaging faculty for program improvement via EvalTools®: A new software model", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462443", "abstract": "", "authors": [], "tags": ["program evaluation", "educational institutions", "quality assurance", "springs", "instruments", "collaboration", "software tools", "abet", "faculty engagement", "evaltools", "vectors"]}, {"title": "Work in progress: Real world relevant security labware for mobile threat analysis and protection experience", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462444", "abstract": "", "authors": [], "tags": ["educational institutions", "labware", "mobile security", "mobile handsets", "mobile communication", "security", "mobile computing", "real world relevant", "materials"]}, {"title": "How does academic preparation influence how engineering students solve problems?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462445", "abstract": "", "authors": [], "tags": ["statistics", "first year engineering", "calculus", "problem solving", "engineering students", "academic preparation", "sociology", "problem-solving", "frequency measurement"]}, {"title": "An educational visual prototyping environment for real-time imaging", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462446", "abstract": "", "authors": [], "tags": ["algorithm design and analysis", "computer vision", "graphical user interface", "usability", "visualization", "noise", "education", "monitoring"]}, {"title": "Work in progress: Mesoscopic analysis of engineering education scholarship in electrical and Computer Engineering, 2002–2011", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462447", "abstract": "", "authors": [], "tags": ["mesoscopic analysis", "engineering education research", "ece", "technological innovation", "electrical and computer engineering", "engineering education", "scholarships", "collaboration", "market research", "computers"]}, {"title": "Applying philosophical inquiry: Bringing future engineering education researchers into the Philosophy of Engineering Education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462449", "abstract": "", "authors": [], "tags": ["professional development", "educational institutions", "chapters", "philosophy", "communities", "engineering education research", "presses", "history", "engineering education", "epistemology", "graduate education"]}, {"title": "Implementation of enhanced guided notes to promote students' metacognitive self-regulated learning strategies while learning electric circuit concepts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462450", "abstract": "", "authors": [], "tags": ["self-regulated learning", "metacognition", "educational institutions", "enhanced guided notes", "electric circuit", "engineering students", "knowledge acquisition", "problem-solving", "monitoring", "materials"]}, {"title": "Examining student constructed explanations of thermodynamics using lexical analysis", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462451", "abstract": "", "authors": [], "tags": ["educational institutions", "text analysis", "engineering education", "biochemistry", "lexical analysis", "software", "bloom's taxonomy", "assessment", "thermodynamics"]}, {"title": "Work in progress: Implementation of enhanced guided notes and collaborative note-taking in learning electric circuit concepts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462452", "abstract": "", "authors": [], "tags": ["metacognition", "educational institutions", "social network services", "engineering education", "electric circuit", "collaboration", "collaborative note-taking", "enhanced guided notes", "standards", "tablet computers", "materials", "social networks"]}, {"title": "A semantic enrichment experience in the early childhood context", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462453", "abstract": "", "authors": [], "tags": ["linked open data", "knowledge based systems", "resource description framework", "early childhood education and care", "pediatrics", "semantics", "diseases", "education", "semantic enrichment", "monitoring"]}, {"title": "Helping engineering students develop skills in content-based problem solving workshops outside classrooms", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462454", "abstract": "", "authors": [], "tags": ["peer-led", "educational institutions", "conferences", "content-based", "silicon", "problem solving", "engineering students", "equations", "outside classrooms", "problem-solving"]}, {"title": "Special session: An interactive exploration of Gender and engineering: Unpacking the experience", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462455", "abstract": "", "authors": [], "tags": ["educational institutions", "communities", "technology", "engineering students", "engineering", "licenses", "gender", "stem", "materials", "context"]}, {"title": "Accessibility evaluation improvement using Case Based Reasoning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462456", "abstract": "", "authors": [], "tags": ["cognition", "guidelines", "case based reasoning", "libraries", "manuals", "html", "manual evaluation", "wcag 2.0", "web content accessibility", "web pages", "automatic evaluation", "context"]}, {"title": "Student self-efficacy in introductory Project-Based Learning courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462457", "abstract": "", "authors": [], "tags": ["educational institutions", "self-efficacy", "physiology", "laboratories", "physics", "knowledge engineering", "first-year engineering curriculum", "course scaffolding", "project-based learning", "writing", "interviews"]}, {"title": "Tradeoffs implementing digital control systems for electrical engineering course projects", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462458", "abstract": "", "authors": [], "tags": ["ball-and-beam system", "laboratories", "transfer functions", "laboratory experiences", "control systems education", "potentiometers", "matlab", "microcontroller applications", "digital control"]}, {"title": "Work in progress: Analysis of change in engineering construct knowledge", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462459", "abstract": "", "authors": [], "tags": ["teacher professional development", "pre-college engineering", "educational institutions", "interview analysis", "engineering education", "encoding", "knowledge engineering", "k-6", "standards", "engineering constructs", "interviews"]}, {"title": "Work in progress: Modeling employer assessments: Using professionalism in computer science courses", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462460", "abstract": "", "authors": [], "tags": ["educational institutions", "senior capstone", "professionalism", "seminars", "computational modeling", "cs1", "standards", "materials", "computer science"]}, {"title": "Science Bound: A success story for STEM Education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462461", "abstract": "", "authors": [], "tags": ["engineering profession", "cities and towns", "educational institutions", "diversity", "employee welfare", "k-12 stem", "pre-engineering", "summer enrichment programs", "market research", "industries"]}, {"title": "Work-in-progress: Exploring the essential nature of engineering education through philosophical inquiry", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462462", "abstract": "", "authors": [], "tags": ["cognition", "educational institutions", "ontologies", "conferences", "presses", "rhetorical criticism", "engineering education", "argumentation", "philosophy of engineering education", "ontology", "epistemology"]}, {"title": "Lessons learned implementing and optimizing Guided Discovery modules", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462463", "abstract": "", "authors": [], "tags": ["gravity", "educational institutions", "pulleys", "materials", "vectors"]}, {"title": "Work in progress: A model for facilitating problem based learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462464", "abstract": "", "authors": [], "tags": ["cognition", "accreditation", "reflection", "facilitation", "engineering education", "problem-based learning", "context", "interviews"]}, {"title": "Critical questions of engineering students by gender and ethnicity", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462465", "abstract": "", "authors": [], "tags": ["engineering profession", "computer science", "critcal engineering questions", "educational institutions", "ethnicity", "retention", "survey", "intentional advisiing", "recruitment", "engineering students", "organizations", "gender", "mathematics", "industries"]}, {"title": "Work in progress: Building information literacy assessment", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462466", "abstract": "", "authors": [], "tags": ["educational institutions", "outcome", "information literacy", "libraries", "engineering students", "mechanical engineering", "abet", "assessment", "project management", "civil engineering"]}, {"title": "First-year engineering students' peer feedback on open-ended mathematical modeling problems", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462467", "abstract": "", "authors": [], "tags": ["first-year engineering", "complexity theory", "educational institutions", "model-eliciting activites", "mathematical model", "mathematical modeling", "peer feedback", "standards", "interviews"]}, {"title": "Work in progress: STEM-based computing educational resources on the web", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462468", "abstract": "", "authors": [], "tags": ["learning resources", "educational institutions", "games", "computational modeling", "supplemental materials", "computational thinking", "stem", "planning", "materials", "computers"]}, {"title": "Development of a design task to assess students' understanding of human-centered design", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462469", "abstract": "", "authors": [], "tags": ["computer science", "reflection", "human-centered design", "calendars", "visualization", "testing", "education", "design task", "assessment", "interviews"]}, {"title": "Assessment of a frugal, virtual and green computing lab infrastructure of the future", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462470", "abstract": "", "authors": [], "tags": ["operating systems", "virtualization", "laboratories", "security", "servers", "computers"]}, {"title": "Managing student outcomes in a totally asynchronous learning environment: Lessons learned", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462471", "abstract": "", "authors": [], "tags": ["educational institutions", "schedules", "electronic mail", "springs", "on-line learning", "asynchronous learning", "logistics", "graduate engineering education", "materials", "statistics education"]}, {"title": "Work in progress: Understanding professional competency formation in a service-learning context from an alumni perspective", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462472", "abstract": "", "authors": [], "tags": ["communities", "service-learning", "professional competence", "engineering education", "alumni research", "electronic mail", "sociology", "mixed methods", "context", "interviews"]}, {"title": "Special session: Raising P-20 engineers — Nurturing creativity and curiosity by getting STEAMd", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462473", "abstract": "", "authors": [], "tags": ["art", "educational institutions", "technological innovation", "conferences", "curiosity", "steamd", "engineering education", "psychology", "engineering teaching kits", "p-20 engineering education", "mindset", "creativity"]}, {"title": "Work in progress: Creativity, mindset, and implications for engineering design instruction", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462474", "abstract": "", "authors": [], "tags": ["art", "educational institutions", "technological innovation", "engineering design", "engineering education", "springs", "psychology", "mindset", "creativity"]}, {"title": "Work in progress: Audio reflections provide evidence of metacognition during students' problem solving attempts", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462475", "abstract": "", "authors": [], "tags": ["reflection", "first year engineering", "metacognition", "think-aloud", "protocols", "problem solving", "engineering students", "problem-solving", "planning", "monitoring"]}, {"title": "Work in progress: ACTIVATE: Advancing computing and technology interest and innovation through teacher education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462477", "abstract": "", "authors": [], "tags": ["professional development", "educational institutions", "conferences", "java", "computational thinking", "programming profession", "outreach"]}, {"title": "Work in progress: Teaching game design and robotics together: A natural marriage of computing and engineering design in a first-year engineering course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462478", "abstract": "", "authors": [], "tags": ["conferences", "games", "educational robots", "projoect-based learning", "problem solving", "computing for engineers", "education", "robotics", "game design", "common engineering core", "programming profession"]}, {"title": "Work in progress: A semantic annotation scheme for Concept Maps", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462479", "abstract": "", "authors": [], "tags": ["abstracts", "concept maps", "metadata", "semantics", "learning object", "databases", "software", "education", "semantic annotation", "standards", "context"]}, {"title": "What are we teaching in cyber competitions?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462480", "abstract": "", "authors": [], "tags": ["security education", "programming", "educational institutions", "robots", "organizations", "computer security", "cyber", "competitions", "computers"]}, {"title": "The effect of university research experiences on middle level math and science instructors perceptions", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462481", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "communities", "research experience", "middle level", "community of practice", "teacher perceptions", "instruments", "materials", "mathematics"]}, {"title": "Work in progress: Supporting Latino and English Language Learners' written communication skills: A research-based pedagogical intervention", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462482", "abstract": "", "authors": [], "tags": ["reflection", "educational institutions", "communities", "electronic mail", "latinos in engineering", "effective writing", "project-based learning", "writing", "english language learners (ells)", "interviews"]}, {"title": "Work in progress: Building bridges in our backyards: Engineering, service learning, and our elder neighbors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462483", "abstract": "", "authors": [], "tags": ["educational institutions", "communities", "engineering design", "aging", "service learning", "community", "organizations", "sociology", "context", "buildings"]}, {"title": "Special session: Connecting with community: Empathy, experience, and engineering with elders", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462484", "abstract": "", "authors": [], "tags": ["joining processes", "educational institutions", "communities", "humans", "broad competencies", "aging", "empathetic engineering", "bridges", "interdisciplinary", "materials"]}, {"title": "The students are unstable! Cluster analysis of motivation and early implications for educational research and practice", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462485", "abstract": "", "authors": [], "tags": ["self-determination", "educational institutions", "motivation", "correlation", "market research", "cluster analysis", "engineering students", "clustering algorithms", "materials", "context"]}, {"title": "Increasing student commitment in introductory programming learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462486", "abstract": "", "authors": [], "tags": ["non-majors", "educational institutions", "learning to program", "pedagogy", "motivation", "multimedia communication", "informatics", "tutorials", "programming profession", "context"]}, {"title": "Work in progress: Teaching computational thinking in middle and high school", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462487", "abstract": "", "authors": [], "tags": ["educational institutions", "fault tree analysis", "fault trees", "reliability", "logic gates", "software", "computational thinking", "chemistry", "computers"]}, {"title": "Work in progress: Management of online assessments as a replacement for exams", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462488", "abstract": "", "authors": [], "tags": ["measurement", "examiniation stress", "australia", "abstracts", "least squares approximation", "examinations", "instruction compliance", "stress", "software", "online assessment", "monitoring"]}, {"title": "The impact of a scientific computing prerequisite on student performance in a linear systems course", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462489", "abstract": "", "authors": [], "tags": ["convolution", "programming", "fourier series", "c programming", "numerical analysis", "springs", "scientific computing", "systems", "linear systems", "fourier analysis", "frequency domain analysis", "signals", "materials"]}, {"title": "Work in progress: Educational program approach of device fabrication and its analysis for engineering experiments", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462490", "abstract": "", "authors": [], "tags": ["fabrication", "semiconductor device measurement", "device fabrication process", "mosfet", "educational institutions", "saw transversal filter", "decice analysis", "enginireeing experiment", "transversal filters", "surface acoustic waves", "mosfet circuits"]}, {"title": "A Scratch-based CS0 course for at-risk computer science majors", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462491", "abstract": "", "authors": [], "tags": ["retention", "programming", "educational institutions", "scratch", "algebra", "cs0", "programming environments", "computer languages"]}, {"title": "Work in progress: Evaluation of an online education portal from the user's perspective: An empirical investigation of a photovoltaics (PV) engineering learning portal, pveducation.org", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462492", "abstract": "", "authors": [], "tags": ["photovoltaic systems", "atmospheric measurements", "particle measurements", "survey development", "learning portal effectiveness evaluation", "engineering education", "instruments", "pv engineering education", "portals"]}, {"title": "Work in progress: Faculty perceptions of project-enhanced learning in early engineering education: Barriers and benefits", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462493", "abstract": "", "authors": [], "tags": ["problem based learning", "educational institutions", "communities", "engineering science", "engineering education", "logic gates", "project-enhanced learning", "materials", "interviews"]}, {"title": "Workshop: Project-enhanced learning in engineering science education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462494", "abstract": "", "authors": [], "tags": ["abstracts", "educational institutions", "conferences", "engineering education", "thermodynamics", "usa councils"]}, {"title": "Flexible virtual environments for teaching and learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462495", "abstract": "", "authors": [], "tags": ["xml", "production", "runtime", "virtual environments", "tailorability", "prototypes", "software", "computer architecture", "flexible virtual environments", "distance learning"]}, {"title": "Characterizing communication instruction in computer science and engineering programs: Methods and applications", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462496", "abstract": "", "authors": [], "tags": ["engineering profession", "computer science)", "educational institutions", "communication across the curriculum", "situated learning", "documentation", "software engineering", "computer science"]}, {"title": "Work in progress: Enhancement of student learning via recorded worked-out examples and in-class team based problem solving", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462497", "abstract": "", "authors": [], "tags": ["production", "multimedia", "problem solving", "mathematical model", "education", "electric circuits", "equations", "assessment", "problem-solving", "materials", "computers"]}, {"title": "Work in progress: Development of a metacognition scaffold in STEM/P-6 engineering context: MCinEDP", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462498", "abstract": "", "authors": [], "tags": ["metacognition", "educational institutions", "scaffolding", "engineering design", "adaptation models", "context", "problem-solving", "monitoring", "buildings", "k-6"]}, {"title": "Civil and geological engineering service-learning projects as part of a Pre-Engineering Education Collaborative", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462499", "abstract": "", "authors": [], "tags": ["educational institutions", "geology", "communities", "pre-engineering education", "laboratories", "concrete", "collaboration", "service learning", "constructivist philosophy"]}, {"title": "A cross-cultural comparison study: The effectiveness of schema training modules among Hispanic students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462500", "abstract": "", "authors": [], "tags": ["statistics", "ontological schema training", "educational institutions", "heat transfer", "training", "microfluidics", "cultural differences", "sociology", "quantitative analysis", "thermodynamics"]}, {"title": "Designing technology for resource-constrained environments: Three approaches to a multidisciplinary capstone sequence", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462501", "abstract": "", "authors": [], "tags": ["ultrasonic imaging", "educational institutions", "seminars", "human computer interaction", "capstone", "prototypes", "resource-constrained environments", "springs", "multidisciplinary", "sociology", "ictd"]}, {"title": "Identifying the impact of the SPIRIT program in student knowledge, attitudes, and perceptions toward computing careers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462502", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "computing attitudes", "outreach programs", "youth interest", "stem", "biology", "information technology", "programming profession", "computers"]}, {"title": "Work in progress: Student-directed learning: An approach to sustainability and engineering education", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462503", "abstract": "", "authors": [], "tags": ["educational institutions", "sustainability", "technological innovation", "engineering education", "green buildings", "materials", "lenses"]}, {"title": "// TODO: Help students improve commenting practices", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462504", "abstract": "", "authors": [], "tags": ["semantics", "best practices", "java", "documentation", "open source software"]}, {"title": "Computer science learning made interactive — A one-week alice summer computing workshop for K-12 teachers", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462505", "abstract": "", "authors": [], "tags": ["educational institutions", "conferences", "computer science education", "information systems education", "computer and information science education", "computers", "curriculum", "materials", "curriculum development", "computer science"]}, {"title": "Collaborating Interaction Design into Engineering Projects in Community Service (EPICS)", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462506", "abstract": "", "authors": [], "tags": ["interaction design", "reflection", "educational institutions", "communities", "community engagement", "service-learning", "interdisciplinary collaboration", "collaboration", "engineering students", "tablet computers"]}, {"title": "Work in progress: An interactive online educational support system considering real-world human relationships of students", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462507", "abstract": "", "authors": [], "tags": ["educational institutions", "active learning", "on-line system", "games", "humans", "half-anonymity", "avatars", "educational game", "time factors"]}, {"title": "Work in progress: The NAE Grand Challenges, high school curricula and Graduate student research", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462508", "abstract": "", "authors": [], "tags": ["educational institutions", "us government", "knowledge engineering", "science - general", "context", "computers"]}, {"title": "A program to increase female engineering and science enrollments through NSF STEM scholarships", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462509", "abstract": "", "authors": [], "tags": ["engineering profession", "educational institutions", "employee welfare", "enrollments", "mentoring", "scholarships", "silicon carbide", "engineering", "planning", "monitoring", "female", "science"]}, {"title": "Work in progress: A case study of the types and frequencies of conflict in engineering design dyads", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462510", "abstract": "", "authors": [], "tags": ["educational institutions", "engineering design", "water pollution", "encoding", "teamwork", "engineering students", "conflict", "context"]}, {"title": "Exploring student understanding of parallelism using concept maps", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462511", "abstract": "", "authors": [], "tags": ["programming", "educational institutions", "parallel computing", "concept maps", "parallel processing", "concurrent computing", "parallelism", "computer architecture", "concurrency", "conceptual understanding", "computers"]}, {"title": "Work in progress-HOMER: An educational tool to learn about the design of renewable energy systems at the undergraduate level", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462512", "abstract": "", "authors": [], "tags": ["dh-hemts", "helium", "electricity"]}, {"title": "Team learning developing interdisciplinary project teams", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462513", "abstract": "", "authors": [], "tags": ["cross-disciplinary", "business", "educational institutions", "self-efficacy", "engineering education", "springs", "collaboration", "context", "multi-disciplinary teams"]}, {"title": "Work in progress: Learning flow-of-control with FlipLogic: A game-based approach", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462514", "abstract": "", "authors": [], "tags": ["learning games", "children", "games", "programming languages", "computer languages", "programming profession", "syntactics", "usa councils", "computers"]}, {"title": "Work in progress: A multi-strategy model for promoting high school students interest in STEM", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462515", "abstract": "", "authors": [], "tags": ["cities and towns", "educational institutions", "communities", "hybrid learning", "solid modeling", "engineering education", "research", "practice", "online learning component", "stem", "multi-strategy", "mathematics", "hybrid laguardia youth center for engineering excellence (h-lycee)"]}, {"title": "Work in progress: Application design on touch screen mobile computers (TSMC) to improve autism instruction", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462516", "abstract": "", "authors": [], "tags": ["autism therapy", "medical treatment", "computer aided instruction", "cognitive deficits", "instructional technology", "cognitive information processing", "interrupters", "autism", "psychology", "variable speed drives", "application design", "touch screen mobile computers", "information processing", "computers"]}, {"title": "The effect of interleaving an alternate task during tutoring and testing", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462517", "abstract": "", "authors": [], "tags": ["computer programming", "programming", "alternating tasks", "protocols", "online learning", "software tutor", "software", "psychology", "switches", "problem-solving", "computers"]}, {"title": "Work in progress: Entrepreneurship in education: Faculty beliefs, teaching practices, and student learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462518", "abstract": "", "authors": [], "tags": ["technology entrepreneurship", "educational institutions", "product development", "innovation management", "engineering education", "entrepreneurship education", "springs", "engineering students"]}, {"title": "Work in progress: A quantitative study of effectiveness in group learning", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462519", "abstract": "", "authors": [], "tags": ["correlation", "electronic mail", "testing", "collaboration", "education", "histograms", "information technology"]}, {"title": "Workshop: It's more than coding- using video scenarios to engage students in computing", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462520", "abstract": "", "authors": [], "tags": ["computing education", "educational institutions", "cs2", "ethics", "problem solving", "online tools ethics", "cs1", "computational thinking", "video-based learning", "entrepreneurship", "problem-solving", "programming profession", "educational videos"]}, {"title": "Work in progress: Enhancing broader communication among courses linked with prerequisites", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462521", "abstract": "", "authors": [], "tags": ["educational institutions", "physics", "calculus", "active feedback", "prerequisites", "mechanical engineering", "advising", "vectors"]}, {"title": "Work in progress: In their own words — How “changemakers” talk about change", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462522", "abstract": "", "authors": [], "tags": ["educational institutions", "change agents", "engineering education", "humans", "collaboration", "knowledge engineering", "change knowledge", "radically transparent research", "usa councils", "transforming stem education"]}, {"title": "Work in progress: The effects of mobile learning on inquiry-based instruction", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462523", "abstract": "", "authors": [], "tags": ["educational institutions", "mobile learning", "mobile handsets", "mobile communication", "inquiry-based instruction", "performance evaluation", "software engineering", "citizen science", "computer science"]}, {"title": "Work in progress: On entrance test criteria for CS and IT UG programs", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462524", "abstract": "", "authors": [], "tags": ["phase change materials", "educational institutions", "correlation", "java", "context"]}, {"title": "Work in progress: Using writing-to-learn methods to improve conceptual knowledge in engineering statics", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462525", "abstract": "", "authors": [], "tags": ["conceptual knowledge", "procedural knowledge", "educational institutions", "engineering education", "writing-to-learn", "conceptual understanding", "knowledge engineering", "statics", "writing", "mathematics", "interviews"]}, {"title": "Work in progress: International teacher development: Engineering into the classroom in the Dominican Republic", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462526", "abstract": "", "authors": [], "tags": ["educational institutions", "conferences", "international", "engineering education", "training", "rocks", "teacher workshops", "ieee", "solids"]}, {"title": "Work in progress: What do engineering students do with non-academic information as they address authentic socio-technical problems?", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462527", "abstract": "", "authors": [], "tags": ["educational institutions", "global engineering", "problem-oriented learning", "communities", "employment", "information literacy", "social context", "knowledge engineering", "engineering students", "documentation", "community service-learning", "technical communication", "context"]}, {"title": "Work in progress: A developmental approach to better problem solving: A model for bridging the Alverno Gap", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462528", "abstract": "", "authors": [], "tags": ["developmental", "accreditation", "educational institutions", "problem solving skills", "engineering education", "cultural differences", "problem-solving", "context", "industries"]}, {"title": "Bologna vs non-Bologna academic outcome in BEng Mechanical Engineering within EHEA", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462529", "abstract": "", "authors": [], "tags": ["design engineering", "collaborative work", "educational institutions", "statistical analysis", "europe", "mechanical engineering"]}, {"title": "Analizing students performance in an EHEA BEng Industrial Design Engineering degree", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462530", "abstract": "", "authors": [], "tags": ["design engineering", "classroom activities", "ehea adaptation", "educational institutions", "autonomous activities", "formative assessment", "physics", "europe", "monitoring", "mathematics"]}, {"title": "Author index", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462532", "abstract": "", "authors": [], "tags": [""]}, {"title": "[Copyright notice]", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462533", "abstract": "", "authors": [], "tags": [""]}, {"title": "Table of contents", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462535", "abstract": "", "authors": [], "tags": [""]}, {"title": "Technical sessions table of contents", "link": "https://doi.ieeecomputersociety.org/10.1109/FIE.2012.6462536", "abstract": "", "authors": [], "tags": [""]}]