[{"title": "A bouquet of measures to promote computer science in middle & high schools", "link": "https://dl.acm.org/doi/10.1145/1999747.1999749", "abstract": "Computer science faces the same problem worldwide: too few women in computing, low enrollment and high failure rates in university programs. There is growing consciousness which has led to various ideas and programs to deal with these problems. My talk will introduce a set of measures which we have implemented at RWTH Aachen University to tackle the problem on different levels. Therefore, I will present our successful program go4IT! of robotic courses for girls in 5th and 6th grade and some empirical results of how these influence their interest in STEM topics. Currently we are developing follow-up measures based on Android and GUI programming on smartphones. These measures cumulate into our newly founded Computer Science Junior Academy InfoSphere as out-of-school educational lab. There we offer a variety of learning modules which can last between two hours and a few days. Complete school classes can book InfoSphere modules or interested pupils of different ages can collaborate on self-organized projects. We have implemented various learning programs for multi-modal devices such as multi-touch tables and smartphones in order to introduce different topics of computer science. Our vision for these educational labs is the enhancement to different disciplines which bring together learners of all ages from K-12, students, researchers and professionals for lifelong learning and vocational training.", "authors": [{"name": "Ulrik Schroeder", "affiliation": "RWTH Aachen University, Aachen, Germany"}], "tags": ["k-12 outreach"]}, {"title": "Technology for teaching the rest of us", "link": "https://dl.acm.org/doi/10.1145/1999747.1999750", "abstract": "The motivated student is easy to teach. You facilitate learning and get out of the way. It's much more challenging to teach the student who is less motivated, or who needs knowledge to support their main interest. Think of the graphics designer who chooses to learn scripting to make their job easier, but doesn't want to learn to \"program\" and whose many (simple) mistakes cost valuable time. Think of the secondary-school business teacher who wants to teach computer science, but who doesn't want to learn to be a professional programmer. The number of people who need some knowledge of a domain may be much greater than those who need expertise in that domain. Providing learning opportunities tailored to the needs and interests of the learner, potentially motivating that interest where necessary, is a great and important challenge in an increasingly technological society. My talk will describe characteristics of these challenges and suggest where computing technologies and computing education research insights may provide solutions.", "authors": [{"name": "Mark Guzdial", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["unmotivated learners"]}, {"title": "Security injections: modules to help students remember, understand, and apply secure coding techniques", "link": "https://dl.acm.org/doi/10.1145/1999747.1999752", "abstract": "With our global reliance on software, secure and robust programming has never been more important. Yet academic institutions have been slow to add secure coding to the curriculum. We present a model using checklist-based security injection modules to increase student awareness and ability to apply secure coding principles, specifically - identify, understand, and correct key security issues in code. The model is evaluated by mapping assessment questions to the cognitive dimension of the revised Bloom's taxonomy. Experiments with students in four sections of CS0 and CS1 show that students using our modules perform significantly better at remembering, understanding and applying secure coding concepts. Students exposed to the modules also show increased ability to write code to address specific security issues.", "authors": [{"name": "Blair Taylor", "affiliation": "Towson University, Towson, MD, USA"}, {"name": "Siddharth Kaza", "affiliation": "Towson University, Towson, MD, USA"}], "tags": ["security education", "secure coding", "information security curriculum development", "checklists", "computer science curriculum"]}, {"title": "The design and coding of greedy algorithms revisited", "link": "https://dl.acm.org/doi/10.1145/1999747.1999753", "abstract": "In this paper we argue that the most typical instruction method used to teach greedy algorithms is inadequate at achieving certain learning goals and we present several contributions to alleviate this situation. Our first group of contributions highlights the role of selection functions and proposes separate treatment in their discovery and proof of optimality. For discovery, we outline some interesting cases of selection functions and for proofs, we examine the role of counterexamples. Furthermore, we argue that their separation provides more opportunities for instructional activities. Our second group of contributions concerns coding greedy algorithms. We discuss the role and adequacy of the template in current use, and also the role of sorting candidates and how to implement sorting.", "authors": [{"name": "J. Ángel Velázquez-Iturbide", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}], "tags": ["computer science education", "algorithms", "greedy algorithms"]}, {"title": "Measuring static quality of student code", "link": "https://dl.acm.org/doi/10.1145/1999747.1999754", "abstract": "In this paper we report about a large-scale measurement programme concerning the static quality of student-written Java code. The goal of the programme is two-fold: we investigate what metrics are useful for measuring static quality in an educational setting, and we investigate what conclusions can be drawn from the measurement results.", "authors": [{"name": "Jacob Brunekreef", "affiliation": "Fontys Hogeschool, Eindhoven, Netherlands"}, {"name": "Dennis M. Breuker", "affiliation": "Amsterdam University of Applied Sciences / Hogeschool van Amsterdam, Amsterdam, Netherlands"}, {"name": "Jan Derriks", "affiliation": "Amsterdam University of Applied Sciences / Hogeschool van Amsterdam, Amsterdam, Netherlands"}], "tags": ["software quality", "software metrics", "measurement programme"]}, {"title": "Awakening Rip Van Winkle: modernizing the computer science web curriculum", "link": "https://dl.acm.org/doi/10.1145/1999747.1999756", "abstract": "The world of web development has experienced a great deal of change over the past decade. The importance and complexity of web development is currently not adequately reflected in the ACM Computer Science 2008 Curriculum, nor in most reported computer science programs. This paper examines published literature on teaching the web since 2001 and argues that the computer science curriculum needs to be woken up and modernized in regards to the importance of web development. The paper critiques the approach of teaching web development topics within a single course. It articulates a wide variety of web development topics that need to be covered in any contemporary computer science program and which are often absent in other published accounts of this course. The paper concludes by arguing that a multi-course stream in web development can help the students integrate the discrete pieces of knowledge garnered during their undergraduate education.", "authors": [{"name": "Randy W. Connolly", "affiliation": "Mount Royal University, Calgary, AB, Canada"}], "tags": ["pedagogy", "cs education", "web development"]}, {"title": "Experiences in implementing a studio component into a course for novice web developers", "link": "https://dl.acm.org/doi/10.1145/1999747.1999757", "abstract": "This paper discusses an educational experience aimed at producing better computer-based projects by including in the assessment process an art appreciation-like critique component. In a way that at times parallels the constructive criticism of work done by art students we asked our participants to critique their classmates as well as themselves. New elements of assessment such as aesthetics, user-engagement, naturalness, completeness, and unrealized potential of the projects appeared in the discourse. Although it is very early to extrapolate results, our conclusion is that a noticeable improvement of the overall quality of the final products as well as a higher level of collaboration, participation, and student satisfaction resulted from this approach.", "authors": [{"name": "Rebecca Grasser", "affiliation": "Lakeland Community College, Kirtland, OH, USA"}], "tags": ["studio-based learning and instruction", "web programming", "design crits", "novice programmers"]}, {"title": "A tool to support the web accessibility evaluation process for novices", "link": "https://dl.acm.org/doi/10.1145/1999747.1999758", "abstract": "The Accessibility Evaluation Assistant (AEA) is designed to assist novice auditors in the process of an accessibility evaluation of websites. The tool has been incorporated into an undergraduate computing module in Accessibility and Adaptive Technologies. It takes a structured walkthrough approach to guide the novice through a series of checks for established web accessibility principles with the goal of conducting a comprehensive accessibility evaluation. An initial evaluation of the AEA with 38 students confirms its potential for supporting the development of skills in auditing of websites for accessibility.", "authors": [{"name": "Steve Green", "affiliation": "Teesside University, Middlesbrough, United Kingdom"}, {"name": "Chrstopher Bailey", "affiliation": "Teesside University, Middlesbrough, United Kingdom"}, {"name": "Elaine Pearson", "affiliation": "Teesside University, Middlesbrough, United Kingdom"}], "tags": ["web accessibility guidelines", "accessibility education.", "web accessibility evaluation"]}, {"title": "Relationship between text and action conceptions of programming: a phenomenographic and quantitative perspective", "link": "https://dl.acm.org/doi/10.1145/1999747.1999760", "abstract": "Phenomenographic research studies have identified different understandings of the concepts class and object by novice programmers. Aspects of understanding include a focus on artefacts of text, syntax and structure (text), as active agents in a program (action) and as models of an external reality (model). We explore the hypothesis that these aspects of conceptual understanding form a hierarchy in which mastery of the text aspect is a necessary precondition for understanding objects as active agents and the action aspect is a precondition for model understandings. We use empirical data from the final examination of an introductory programming course to test the relationship between the text and action aspects. Our findings do not support the hypothesis of a hierarchy but rather suggest that text and action understandings develop in parallel.", "authors": [{"name": "Mike Lopez", "affiliation": "Manukau Institute of Technology, Auckland, New Zealand"}, {"name": "Amitrajit Sarkar", "affiliation": "Christchurch Polytechnic Institute of Technology, Christchurch , New Zealand"}, {"name": "Anna Eckerdal", "affiliation": "Uppsala University, Uppsala , Sweden"}, {"name": "Mikko-Jussi Laakso", "affiliation": "University of Turku, Turku, Finland"}], "tags": ["hierarchy", "critical aspects", "text and action", "novice programming", "phenomenographic outcome space"]}, {"title": "Automated checks on UML diagrams", "link": "https://dl.acm.org/doi/10.1145/1999747.1999761", "abstract": "Automated checks for software artefacts like UML diagrams used in automated assessment or tutoring systems do often rely on direct comparisons between a solution and a sample solution. This approach has drawbacks regarding flexibility in face of different possible solutions which are quite common in modeling tasks. This paper presents an alternative technique for checking UML class diagrams based on graph queries which promises to be more flexible.", "authors": [{"name": "Michael Goedicke", "affiliation": "University of Duisburg-Essen, Essen, Germany"}, {"name": "Michael Striewe", "affiliation": "University of Duisburg-Essen, Essen, Germany"}], "tags": ["automated tutoring", "intelligent tutoring systems", "diagram analysis"]}, {"title": "AGUIA/J: a tool for interactive experimentation of objects", "link": "https://dl.acm.org/doi/10.1145/1999747.1999762", "abstract": "Learning and teaching object-oriented programming are still perceived as being difficult tasks. This paper presents AGUIA/J, a pedagogical tool for interactive experimentation and visualization of object-oriented Java programs. The approach is based on having a graphical environment for experimenting a set of user-developed classes where objects of such classes can be created and controlled interactively. The main innovative aspects of the tool comprise the visualization of objects in widgets that take different forms according to their classes and state, a mechanism to address the query-command separation principle, and the capability of runtime adaptation of the objects in the workbench to new versions of their classes. An experiment using AGUIA/J as courseware in pilot lab classes has resulted in higher approval rates for the involved students, as well as significantly lower drop-out rates.", "authors": [{"name": "André L. Santos", "affiliation": "Instituto Universitário de Lisboa (ISCTE-IUL), Lisbon, Portugal"}], "tags": ["pedagogy", "object-oriented programming", "interactive environments"]}, {"title": "Intelligent systems development in a non engineering curriculum", "link": "https://dl.acm.org/doi/10.1145/1999747.1999764", "abstract": "Much of computer system development today is programming in the large - systems of millions of lines of code distributed across servers and the web. At the same time, microcontrollers have also become pervasive in everyday products, economical to manufacture, and represent a different level of learning about system development. Real world systems at this level require integrated development of custom hardware and software.\nHow can academic institutions give students a view of this other extreme - programming on small microcontrollers with specialized hardware? Full scale system development including custom hardware and software is expensive, beyond the range of any but the larger engineering oriented universities, and hard to fit into a typical length course. The course described here is a solution using microcontroller programming in high level language, small hardware components, and the Arduino open source microcontroller. The results of the hands-on course show that student programmers with limited hardware knowledge are able to build custom devices, handle the complexity of basic hardware design, and learn to appreciate the differences between large and small scale programming.", "authors": [{"name": "Emily A. Brand", "affiliation": "Loyola University Chicago, Chicago, IL, USA"}, {"name": "William L. Honig", "affiliation": "Loyola University Chicago, Chicago, IL, USA"}, {"name": "Matthew Wojtowicz", "affiliation": "Loyola University Chicago, Chicago, IL, USA"}], "tags": ["arduino course", "microcontroller course", "embedded systems"]}, {"title": "Design of innovative integrated circuits in education", "link": "https://dl.acm.org/doi/10.1145/1999747.1999765", "abstract": "Teaching practical ASIC design, one faces a lot of problems, such as high manufacturing costs, long workflow, and heterogeneous previous knowledge of the students. On one hand, it is difficult to find topics that motivate students and, at the same time, are not too complex. On the other hand, the industry requires students who are trained not only theoretically, but also have practical experience in team work and project management. We regard these problems as a challenge and are going to create a concept of a project-oriented ASIC design course that focuses on teaching hard and soft skills. In this paper, we describe our concept for a student project work, which leaves to the students a lot of degrees of freedom in the design process and offers the possibility to realize an own idea as integrated circuit.", "authors": [{"name": "Matthias Mielke", "affiliation": "Institute of Microsystems Technology, University of Siegen, Siegen, Germany"}, {"name": "André Schäfer", "affiliation": "Institute of Microsystems Technology, University of Siegen, Siegen, Germany"}, {"name": "Rainer Brück", "affiliation": "Institute of Microsystems Technology, University of Siegen, Siegen, Germany"}], "tags": ["education", "motivation", "ic design", "project work"]}, {"title": "Preparing students for future architectures with an exploration of multi- and many-core performance", "link": "https://dl.acm.org/doi/10.1145/1999747.1999766", "abstract": "The recent progression of modern computer architectures from serial to multi-core to many-core has raised numerous questions about the placement of parallel computing topics in undergraduate computer science curricula. While several papers have explored how programming and algorithms courses might introduce parallel programming topics, there has been very little discussion of the changes needed in computer organization and architecture coursework to help students understand key issues about the behavior of these platforms. To increase the relevance of these courses and to tackle more modern architectural issues, we propose extending the performance coverage of a traditional computer organization course to include an exploration of the quantitative characterization of a program's performance on a variety of architectural platforms, including modern GPU hardware.\nIn this paper, we outline the changes made to the Computer Organization and Design course at University of Wisconsin -- Eau Claire. These modifications included a 3 week unit on the basics of parallel and GPU architectures, along with a tiered project on program optimization.", "authors": [{"name": "Daniel J. Ernst", "affiliation": "University of Wisconsin - Eau Claire, Eau Claire, WI, USA"}], "tags": ["gpgpu", "computer organization", "curriculum design"]}, {"title": "A study in engaging female students in computer science using role models", "link": "https://dl.acm.org/doi/10.1145/1999747.1999768", "abstract": "An effective approach to engaging young women to take computing in higher education is to provide examples of successful female computer scientists. Can a print publication that combines core computing concepts with inspiring stories of women in the field be effective? In this paper, we describe a campaign that distributed a 60-page booklet on women in computing to UK secondary schools. We analyse the initial response from teachers, and draw some general conclusions from the project. Teachers expressed strong enthusiasm for the booklet, and also report the desire for recruitment and retention of girls in their computing programmes. They had confidence in the potential for this booklet to inspire young women to take computing.", "authors": [{"name": "Paul Curzon", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Chrystie Myketiak", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Peter W. McOwan", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Jonathan Black", "affiliation": "Queen Mary University of London, London, United Kingdom"}], "tags": ["teachers", "public engagement", "girls", "k-12", "outreach", "gender issues", "recruitment", "representation", "diversity", "cs4fn."]}, {"title": "Kinesthetic learning of computing via \"off-beat\" activities", "link": "https://dl.acm.org/doi/10.1145/1999747.1999769", "abstract": "To broaden participation in computing requires exposing students to a variety of experiences. CS Unplugged promotes learning through kinesthetic activities. This paper identifies three types of learning (1) problem solving, (2) creative construction, and (3) open-ended invention, that lend themselves to activities that engage middle school students in physical movement to learn computing. Via surveys and a personality traits activity \"True Colors\" we examined whether self-identified personality types were predisposed to particular kinesthetic learning activities. Our results suggest that personality type as defined by True Colors does not predict selection of an activity type. Furthermore, the students in our summer Interactive Journalism Institute were significantly more predisposed to pick open-ended invention. These results suggest directions in which K-12 computing curriculum should take to reach the broadest constituency.", "authors": [{"name": "Meredith Stone", "affiliation": "The College of New Jersey, Ewing, NJ, USA"}, {"name": "Ursula Wolz", "affiliation": "The College of New Jersey, Ewing, NJ, USA"}, {"name": "Michael Milazzo", "affiliation": "g8four, Mountain Brook, AL, USA"}], "tags": ["kinesthetic learning", "scratch", "computational thinking", "interactive journalism", "broadening participation in cs", "cs unplugged"]}, {"title": "A technology-assisted scavenger hunt for introducing K-12 students to sensor networks", "link": "https://dl.acm.org/doi/10.1145/1999747.1999770", "abstract": "Sensor networks serve as a powerful recruiting vehicle to excite and engage students in socially-relevant applications of computing. In this paper, we describe a technology-assisted scavenger hunt for introducing young learners --- from grade school through high school--- to sensor networks and computer science. The desired outcome is to expand students' content knowledge and positively impact their impressions of the discipline. We describe the outreach program and present promising evaluation results across three pilots involving 5th graders, 7th graders, and 11th graders.", "authors": [{"name": "Yvon Feaster", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Sally K. Wahba", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Jason O. Hallstrom", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["computer science outreach", "experimental evaluation", "high school curriculum", "sensor networks"]}, {"title": "Does lecture capture make a difference for students in traditional classrooms", "link": "https://dl.acm.org/doi/10.1145/1999747.1999772", "abstract": "The College of Computing and Digital Media (CDM) at DePaul University has recorded thousands of courses using an in-house system called Course Online (COL) since 2001. These recordings are available not only to students enrolled in online CDM courses, but also to students in traditional classrooms at CDM. In this study we analyzed survey responses and grade data to determine whether traditional students found COL recordings to be a valuable substitutional tool and whether the recordings had any impact on student performance. We found that a large majority of traditional CDM students find the recordings useful and believe that they improve performance. Somewhat counter to the students' perceptions, we found that there were no large differences in performance prior to the introduction of COL recordings and after COL recordings began to be available.", "authors": [{"name": "Mary Jo Davidson", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Amber Settle", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Lucia Dettori", "affiliation": "DePaul University, Chicago, IL, USA"}], "tags": ["student performance", "student perception", "retention", "lecture capture systems"]}, {"title": "Impact of an e-learning platform on CSE lectures", "link": "https://dl.acm.org/doi/10.1145/1999747.1999773", "abstract": "This article presents a comprehensive summary and recommendations towards the use of IREEL, an e-learning platform designed for network studies in CSE courses, based on our hands-on experience in a large hybrid undergraduate/postgraduate course at the UNSW. We found that the tool was well received by the students for understanding key concepts, especially when compared to legacy tools used in labs. Furthermore we show that our tool was able to handle a very large number of experiments in a relatively short amount of time.", "authors": [{"name": "Jun Yao", "affiliation": "UNSW, Sydney, Australia"}, {"name": "Salil Kanhere", "affiliation": "UNSW, Sydney, Australia"}, {"name": "Guillaume Jourjon", "affiliation": "NICTA, Sydney, Australia"}], "tags": ["e-learning", "networking", "cse lecture"]}, {"title": "Evaluating how students would use a collaborative linked learning space", "link": "https://dl.acm.org/doi/10.1145/1999747.1999774", "abstract": "Personal interaction with learning materials, (re-)arranging learning resources in a semantically meaningful way is important for comprehension and personal knowledge construction. Current learning systems only enable learners to add simple digital ink or text notes. How would users work with a system for collaboratively augmenting and semantically connecting learning materials with related knowledge resources? This paper presents user studies conducted with both students and educators to elicit users' acceptance, needs and preferences regarding such a learning system.", "authors": [{"name": "Guido Rößling", "affiliation": "TU Darmstadt, Darmstadt, Germany"}, {"name": "Michael Hartle", "affiliation": "TU Darmstadt, Darmstadt, Germany"}, {"name": "Kai Michael Höver", "affiliation": "TU Darmstadt, Darmstadt, Germany"}, {"name": "Max Mühlhäuser", "affiliation": "TU Darmstadt, Darmstadt, Germany"}], "tags": ["web-based learning", "study", "collaborative learning", "user requirements", "clls"]}, {"title": "Efficient and playful tools to teach Unix to new students", "link": "https://dl.acm.org/doi/10.1145/1999747.1999776", "abstract": "Teaching Unix to new students is a common tasks in many higher schools. This paper presents an approach to such course where the students progress autonomously with the help of the teacher. The traditional textbook is complemented with a wiki, and the main thread of the course is a game, in the form of a treasure hunt. The course finishes with a lab exam, where students have to perform practical manipulations similar to the ones performed during the treasure hunt. The exam is graded fully automatically.\nThis paper discusses the motivations and advantages of the approach, and gives an overall view of the tools we developed. The tools are available from the web, and open-source, hence re-usable outside the Ensimag.", "authors": [{"name": "Matthieu Moy", "affiliation": "Grenoble-INP, Grenoble, France"}], "tags": ["unix", "education", "treasure hunt", "exam"]}, {"title": "Creativity room 5555: evoking creativity in game design amongst CS students", "link": "https://dl.acm.org/doi/10.1145/1999747.1999777", "abstract": "This paper highlights the importance of computer-free meeting places for Computer Science (CS) students participating in game design courses in the sense of learning spaces. Such environments have the potential of countering possible negative attitudes of CS students towards creative processes. During a game design course we offered a unique meeting room that offered playful and creative elements. Furthermore, the room had to be rearranged by the participants of the course. We describe the course and analyze it through observations and three formal surveys. Both the results and the quality of resulting prototypes indicate that CS students strongly benefit in their creative processes from working in individually arranged playful environments.", "authors": [{"name": "Jonas Schild", "affiliation": "University of Duisburg-Essen, Duisburg, Germany"}, {"name": "Timo Göttel", "affiliation": "University of Hamburg, Hamburg, Germany"}], "tags": ["soft skills", "game design course", "creativity"]}, {"title": "Discovering logic through comics", "link": "https://dl.acm.org/doi/10.1145/1999747.1999778", "abstract": "This paper describes a new experimental course introduced in the Spring of 2010 at Carnegie Mellon University in Qatar. Discovering Logic is an introduction to logic for Computer Science majors in their freshman year. It targets students who have had little or no exposure to logic and has the primary objective of 1) preparing them for sophomore classes which require proficiency with understanding formal statements expressed in English, elementary reasoning skills, and a sense of mathematical rigor. The course is structured as to achieve two additional objectives: 2) develop the students' communication skills, and 3) give them some historical depth into Computer Science and logic. This led to a somewhat unconventional approach that used a comic book, Logicomix, as the course textbook and that empowered the students to be active agents in the learning process through presentations and numerous open discussions. Preliminary analysis hints at an improved performance in follow-up courses, indicating that it may be achieving its primary objective.", "authors": [{"name": "Iliano Cervesato", "affiliation": "Carnegie Mellon University, Doha, Qatar"}], "tags": ["logicomix", "communication skills", "computational thinking", "comic books", "logic", "first-year of college", "history of computer science"]}, {"title": "Integrating google technology in artificial intelligence", "link": "https://dl.acm.org/doi/10.1145/1999747.1999780", "abstract": "The use of Google technology in artificial intelligence courses gives new opportunities to focus the academic topics and learning objectives in order to meet the needs of students and computer science curricula. With the integration of Google developer toolkits, we can transform the class in order to use industry software tools as a motivating topic and as the domain for real-world software projects. This paper describes the methodology and motivating results using Google developer toolkits in teaching and practicing computer applications, which are based on artificial intelligence theory and techniques.", "authors": [{"name": "Stefan Klink", "affiliation": "Karlsruhe Institute of Technology, Karlsruhe, Germany"}, {"name": "Elena Sánchez-Nielsen", "affiliation": "Universidad de La Laguna, La Laguna, Spain"}], "tags": ["google technology", "multiagent systems", "artificial intelligence"]}, {"title": "Interactive tools in the graphics classroom", "link": "https://dl.acm.org/doi/10.1145/1999747.1999781", "abstract": "Computer graphics is a fun course for both teachers and students. The topics are filled with interesting images and animations, there is a wealth of support material available, and students are motivated to express creativity in projects. There are also underlying math concepts and algorithms that some students find challenging to fully understand. At our institution, we teach a computer graphics course to junior and senior-level computer science majors as an elective. To assist their understanding of fundamental concepts and algorithms, we created and employed a collaborative learning approach using locally developed interactive tools during each lecture. The Think-Pair-Share model was used to facilitate collaborative interaction between students. The results of this approach were measured through in-class feedback questions and student performance on individual exam questions. Students enjoyed using the tools, highly rating them on the feedback forms, but were less enthusiastic about the classroom methodology used to present them. These results along with lessons learned will be addressed.", "authors": [{"name": "Dino Schweitzer", "affiliation": "USAF Academy, USAFA, CO, USA"}, {"name": "Lauren Scharff", "affiliation": "USAF Academy, USAFA, CO, USA"}, {"name": "Jeff Boleng", "affiliation": "USAF Academy, USAFA, CO, USA"}], "tags": ["collaborative learning", "think-pair-share", "computer graphics education", "classroom visualization"]}, {"title": "Using the SCORE software package to analyse novice computer graphics programming", "link": "https://dl.acm.org/doi/10.1145/1999747.1999782", "abstract": "This paper presents the SCORE (Student Coding Observation and Recording Engine) software package designed to capture and analyse student coding processes. The package consists of an Eclipse [1] plug-in to gather observational data while students code a programming task, and an analysis tool that allows researchers to visualise, categorise and annotate changes in code. Because the SCORE package supports code text level analysis it enables more in-depth understanding of student programming and problem solving approaches than meta-data or program output analysis tools. SCORE also provides features to assist the analysis of Computer Graphics programs. An example analysis of a student's Computer Graphics assignments demonstrates how SCORE was used to reveal the dominant role of general programming issues in the early assignment, whereas spatial programming issues persisted throughout both assignments.", "authors": [{"name": "Matthew Bower", "affiliation": "Macquarie University, Sydney, Australia"}, {"name": "Manolya Kavakli-Thorne", "affiliation": "Macquarie University, Sydney, Australia"}, {"name": "Maximilian Rudolf Albrecht Wittmann", "affiliation": "Macquarie University, Sydney, Australia"}], "tags": ["observational research", "computer science education", "computer graphics education", "program analysis", "analysis software"]}, {"title": "Evaluating a web-based information system for managing master of science summer projects", "link": "https://dl.acm.org/doi/10.1145/1999747.1999784", "abstract": "We describe the design of a web-based information system for monitoring MSc summer projects in the School of Electronics and Computer Science at the University of Southampton, and a mixed method quasi-experimental study involving 290 MSc project students, 19 monitors, and 69 supervisors in electronics and computer science, using the system over a period of 17 weeks. Statistically significant results presented here are: Students making heavy use of the system achieved higher marks on their project dissertation, while no such correlation was found with marks for other parts of their MSc. Likewise, student's monitor activity is significantly correlated with their own activity and dissertation mark. These results suggest that educational information and project management systems positively affect student achievement and academic staff involvement is crucial for these systems to be successful. Future work includes a more detailed analysis of success factors and their impact on student performance.", "authors": [{"name": "Andrew M. Gravell", "affiliation": "University of Southampton, Southampton, United Kingdom"}, {"name": "Till Rebenich", "affiliation": "University of Southampton, Southampton, United Kingdom"}, {"name": "Thanassis Tiropanis", "affiliation": "University of Southampton, Southampton, United Kingdom"}], "tags": ["information systems", "e-learning", "project management", "time management", "impact study"]}, {"title": "A study of video-based versus text-based labs for a management information systems course", "link": "https://dl.acm.org/doi/10.1145/1999747.1999785", "abstract": "In this paper we study key differences between video-based and text-based instructions by developing and testing an interactive website for delivering lab material in our Management Information Systems course. In a face-to-face lab setting, we tracked the performance and surveyed the impressions of 80 students where approximately half received video instructions while the other half received text instructions. The results indicate no statistically significant difference in students' correctness in answering lab questions, but slight differences in completion time and impression. We discuss our results and suggest ways to use video instruction effectively based on our results and observations.", "authors": [{"name": "Michelle Conway", "affiliation": "Siena College, Loudonville, NY, USA"}, {"name": "Jami Cotler", "affiliation": "Siena College, Loudonville, NY, USA"}, {"name": "Eric Breimer", "affiliation": "Siena College, Loudonville, NY, USA"}, {"name": "Robert Yoder", "affiliation": "Siena College, Loudonville, NY, USA"}], "tags": ["computer lab activities", "instruction", "automated feedback", "management information systems", "blended learning", "web-based labs", "video-based"]}, {"title": "Effects of team-based learning on a CS1 course", "link": "https://dl.acm.org/doi/10.1145/1999747.1999787", "abstract": "Many active learning techniques have been used and described over the years, including team-based learning (TBL). While this technique is well established, it is only recently that analyses that compare it to other teaching techniques have been reported. In this paper, we evaluate the impact of team-based learning on two major concerns for computer science instructors: the drop/attrition rates, and students' success in CS1. The results show some major improvements both in terms of the drop rate and students' success, as measured by final exam grades. For example, the number of students obtaining 50% or more on the final exam has increased from 54% to 75.5%. Moreover, the drop rate has decreased from more than 30% to 6.4%.", "authors": [{"name": "Patricia Lasserre", "affiliation": "UBC Okanagan, Kelowna, BC, Canada"}, {"name": "Carolyn Szostak", "affiliation": "UBC Okanagan, Kelowna, BC, Canada"}], "tags": ["cs1", "team-based learning", "active learning", "success rate", "drop rate"]}, {"title": "Experience report: a multi-classroom report on the value of peer instruction", "link": "https://dl.acm.org/doi/10.1145/1999747.1999788", "abstract": "Peer Instruction (PI) has a significant following in physics, biology, and chemistry education. Although many CS educators are aware of PI as a pedagogy, the adoption rate in CS is low. This paper reports on four instructors with varying motivations and course contexts and the value they found in adopting PI. Although there are many documented benefits of PI for students (e.g. increased learning), here we describe the experience of the instructor by looking in detail at one particular question they posed in class. Through discussion of the instructors' experiences in their classrooms, we support educators in consideration of whether they would like to have similar classroom experiences. Our primary findings show instructors appreciate that PI assists students in addressing course concepts at a deep level, assists instructors in dynamically adapting their class to address student misunderstandings and, overall, that PI encourages students to be engaged in conversations which help build technical communication skills. We propose that using PI to engage students in these activities can effectively support training in analysis and teamwork skills.", "authors": [{"name": "Cynthia Bailey Lee", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "Leo Porter", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "Daniel Zingaro", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Quintin Cutts", "affiliation": "University of Glasgow, Glasgow, Scotland UK"}, {"name": "Beth Simon", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}], "tags": ["classroom response", "peer instruction", "cs1", "active learning.", "clickers", "prs"]}, {"title": "CoMoTo: the collaboration modeling toolkit", "link": "https://dl.acm.org/doi/10.1145/1999747.1999789", "abstract": "We are excited to introduce CoMoTo -- the Collaboration Modeling Toolkit -- a new, web-based application that expands and enhances well-known software similarity detection systems. CoMoTo is an end-to-end data management, analysis, and visualization system whose purpose is to assist instructors of courses requiring programming exercises to monitor and investigate the extent of student collaboration, both allowed and illicit. We describe CoMoTo's interface, which was designed to facilitate scrutiny of collaboration data projected along student, course, assignment, etc. attributes, and to allow for interactive visualization of pairwise similarity measures via a dynamic graph. We also elaborate on the details of CoMoTo's implementation. Finally, we briefly discuss two use cases that foreshadow CoMoTo's broad utility in student code analysis, not only for plagiarism detection, but also for investigating early student coding styles, and for evaluating software similarity detection systems, themselves.", "authors": [{"name": "Cinda Heeren", "affiliation": "UIUC, Urbana, IL, USA"}, {"name": "Jon Tedesco", "affiliation": "UIUC, Urbana, IL, USA"}, {"name": "Charlie Meyer", "affiliation": "UIUC, Urbana, IL, USA"}, {"name": "Eric Shaffer", "affiliation": "UIUC, Urbana, IL, USA"}], "tags": ["program similarity", "pedagogy"]}, {"title": "A marking language for the oto assignment marking tool", "link": "https://dl.acm.org/doi/10.1145/1999747.1999791", "abstract": "Marking programming assignments involves a lot of work, and with large classes, the feedback provided to students through marking is often rather limited and late.\nOto is a customizable and extensible marking tool that provides support for the submission and marking of assignments. Oto aims at reducing the marking workload and, also, at providing timely feedback to students.\nIn this paper, we present Oto's new marking language and give an overview of its implementation as a Domain-Specific Language.", "authors": [{"name": "Guy Tremblay", "affiliation": "Université du Québec à Montréal, Montréal, PQ, Canada"}, {"name": "Paul Lessard", "affiliation": "Université du Québec à Montréal, Montréal, PQ, Canada"}], "tags": ["automated marking", "scripting", "educational software", "domain-specific language"]}, {"title": "Supporting student-generated free-response questions", "link": "https://dl.acm.org/doi/10.1145/1999747.1999792", "abstract": "Although a number of existing systems support student-generated multiple choice questions, such questions tend to focus on lower-order cognitive skills. Free response questions are frequently used to evaluate higher-order thinking, but supporting student-generated free-response questions is challenging. StudySieve is a web-based tool that extends student-generated questions to the free-response domain.\nWe report on the use of StudySieve for reviewing core content in three large undergraduate Computer Science courses. Students produce more content than required, provide feedback to their peers and report that they learn from question authoring, question answering, seeing the answers produced by their peers and evaluating those answers.", "authors": [{"name": "Beryl Plimmer", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Daniel Bertinshaw", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["constructive evaluation", "studysieve", "question-generation", "student-generated", "free-response", "contributing student pedagogy", "peer-review"]}, {"title": "Automated assessment of short free-text responses in computer science using latent semantic analysis", "link": "https://dl.acm.org/doi/10.1145/1999747.1999793", "abstract": "In the last few decades, much research has focused on the evaluation and assessment of students' knowledge. The idea that computers can now be used to aid assessment is appealing. While implementing automatic marking of multiple choice questions is trivial, most educators agree that such form of assessment provides only limited insight into students' knowledge. Due to this limitation, teachers prefer to use unstructured questions in assessments. These questions, however, are much more complicated to mark as the semantic meaning of a response is more important than any of the individual keywords. Latent Semantic Analysis (LSA) has a remarkable ability to infer meaning from a text in this way. This paper describes the design, implementation and evaluation of an automatic marking system based on LSA and designed to grade paragraph responses to exam questions. In addition to presenting the algorithm and the theoretical basis of the system, we describe the tests that were conducted to test its efficacy. The tests included comparing the marks for several computer science courses exams generated by the system with the original grades awarded by a human examiner. The various settings of the system are studied to understand their effect on the accuracy. Using this understanding, along with trial and error, good configurations for each question are found. Under ideal configurations the system is capable of generating marks with correlations above 0.80 compared to the human examiner's grades. This is considered an acceptable variance. Generating these ideal configurations is nontrivial but possible by designing effective ways to extract appropriate settings from features of the data. If there is enough training data the system easily performs at rates that match the inter-correlation between human markers.", "authors": [{"name": "Richard Klein", "affiliation": "University of the Witwatersrand, Johannesburg, South Africa"}, {"name": "Mayya Tokman", "affiliation": "University of California Merced, Merced, CA, USA"}, {"name": "Angelo Kyrilov", "affiliation": "University of the Witwatersrand, Johannesburg, South Africa"}], "tags": ["e-learning", "e-assessment", "automated grading", "latent semantic analysis", "automated assessment"]}, {"title": "WeScheme: the browser is your programming environment", "link": "https://dl.acm.org/doi/10.1145/1999747.1999795", "abstract": "We present a programming environment called WeScheme that runs in the Web browser and supports interactive development. WeScheme programmers can save programs directly on the Web, making them accessible from everywhere. As a result, sharing of programs is a central focus that WeScheme supports seamlessly. The environment also leverages the existing presentation media and program run-time support found in Web browsers, thus making these easily accessible to students and leveraging their rapid engineering improvements. WeScheme is being used successfully by students, and is especially valuable in schools that have prohibitions on installing new software or lack the computational demands of more intensive programming environments.", "authors": [{"name": "Danny Yoo", "affiliation": "Worcester Polytechnic Institute, Worcester, MA, USA"}, {"name": "Kathi Fisler", "affiliation": "Worcester Polytechnic Institute, Worcester, MA, USA"}, {"name": "Emmanuel Schanzer", "affiliation": "Harvard University, Cambridge, MA, USA"}, {"name": "Shriram Krishnamurthi", "affiliation": "Brown University, Providence, RI, USA"}], "tags": ["web", "programming environments"]}, {"title": "Habits of programming in scratch", "link": "https://dl.acm.org/doi/10.1145/1999747.1999796", "abstract": "Visual programming environments are widely used to introduce young people to computer science and programming; in particular, they encourage learning by exploration. During our research on teaching and learning computer science concepts with Scratch, we discovered that Scratch engenders certain habits of programming: (a) a totally bottom-up development process that starts with the individual Scratch blocks, and (b) a tendency to extremely fine-grained programming. Both these behaviors are at odds with accepted practice in computer science that encourages one: (a) to start by designing an algorithm to solve a problem, and (b) to use programming constructs to cleanly structure programs. Our results raise the question of whether exploratory learning with a visual programming environment might actually be detrimental to more advanced study.", "authors": [{"name": "Michal Armoni", "affiliation": "Weizmann Institute of Science, Rehovot, Israel"}, {"name": "Mordechai Ben-Ari", "affiliation": "Weizmann Institute of Science, Rehovot, Israel"}, {"name": "Orni Meerbaum-Salant", "affiliation": "Weizmann Institute of Science, Rehovot, Israel"}], "tags": ["scratch", "middle schools", "habits"]}, {"title": "From concrete to abstract?: problem domain in the learning of introductory programming", "link": "https://dl.acm.org/doi/10.1145/1999747.1999797", "abstract": "A good deal of research on learning introductory programming have been carried out along the past years based on a generalization to mature individuals of Piaget's theory which states that learning among childrens progresses from concrete to abstract. In this research, we set up two problem domains -- a concrete and an abstract one -- along with specific programming languages and compilers. We experimentally investigated how these domains were used by two groups of undergraduate students without previous programming knowledge. Results suggest that the type of domain (either concrete or abstract), when taken in and on itself, does not affect the learning of introductory programming. On the other hand, the previous knowledge students have about the domain does influence learning.", "authors": [{"name": "Osvaldo Luiz Oliveira", "affiliation": "Faculty of Campo Limpo Paulista, Campo Limpo Paulista (SP), Brazil"}, {"name": "Ana Maria Monteiro", "affiliation": "Faculty of Campo Limpo Paulista, Campo Limpo Paulista (SP), Brazil"}, {"name": "Norton Trevisan Roman", "affiliation": "University of São Paulo, São Paulo, Brazil"}], "tags": ["cs1", "languages", "empirical research", "introductory programming", "computer programming education"]}, {"title": "Draw a social network", "link": "https://dl.acm.org/doi/10.1145/1999747.1999799", "abstract": "We investigate the effect of graph theory instruction on the representations of social networks by grade six students. In this quasi-experimental study, treatment groups participated in graph theory lessons as part of their mathematics class. In evaluating student responses to pre and posttests we observed that students shifted in their approach to representing a social network problem, from less to more abstract - starting with complex vertices (superfluous detail) and planar graphs (no crossed edges) toward simple vertices and non-planar graphs.", "authors": [{"name": "Ulrike Stege", "affiliation": "University of Victoria, Victoria, BC, Canada"}, {"name": "Sarah Carruthers", "affiliation": "University of Victoria, Victoria, BC, Canada"}, {"name": "Todd Milford", "affiliation": "University of Victoria, Victoria, BC, Canada"}, {"name": "Timothy Pelton", "affiliation": "University of Victoria, Victoria, BC, Canada"}], "tags": ["middle school curriculum", "social networks"]}, {"title": "CS education re-kindles creativity in public schools", "link": "https://dl.acm.org/doi/10.1145/1999747.1999800", "abstract": "Creativity is an important aspect of industry and education. The lack of creativity in current students has become a concern for educators. Through the process of implementing the Scalable Game Design project to teach computer science through game authoring, fostered/increased creativity occurred in public middle schools. Despite some structural limitations of the US educational system, creativity among the participating students was recognized. This paper describes a unique solution to fostering creativity while teaching game design in the limiting public school environment.", "authors": [{"name": "Alexander Repenning", "affiliation": "University of Colorado, Boulder, CO, USA"}, {"name": "Kyu Han Koh", "affiliation": "University of Colorado, Boulder, CO, USA"}, {"name": "Vicki E. Bennett", "affiliation": "University of Colorado, Boulder, CO, USA"}], "tags": ["middle school programming", "game design", "cs education", "scalable game design", "creativity"]}, {"title": "A pre-college professional development program", "link": "https://dl.acm.org/doi/10.1145/1999747.1999801", "abstract": "In this paper, we describe the results of a four-year collaborative project conducted among six higher education institutions and their partner pre-college school systems across the US. The primary goal of the project was to offer professional development to middle and high school teachers to enable those teachers to create modules and courses to excite their students about computing. The project used Alice, a software program that utilizes 3-D visualization methods, as a medium to create a high-level of interest in computer graphics, animation, and storytelling among middle and high school students, to build understanding of object-based programming. More than 100 middle and high school teachers participated in the project, with approximately 80% of those reporting that they had used what they learned during summer workshops in their classrooms during the subsequent years.", "authors": [{"name": "Dan Lewis", "affiliation": "Santa Clara University, Santa Clara, CA, USA"}, {"name": "Susan Rodger", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Pam Lawhead", "affiliation": "University of Mississippi, University, MS, USA"}, {"name": "Stephen Cooper", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Madeleine Schep", "affiliation": "Columbia College, Columbia, SC, USA"}, {"name": "RoxAnn Stalvey", "affiliation": "College of Charleston, Charleston, SC, USA"}, {"name": "Wanda Dann", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["professional development", "alice", "pre-college"]}, {"title": "GUIGraph: editing live object diagrams for GUI generation enables new pedagogy in CS1/2", "link": "https://dl.acm.org/doi/10.1145/1999747.1999803", "abstract": "The GUIGraph software tool supports a new pedagogy, motivates students, and solves early user-interface issues. Regardless of the type of curriculum, it can provide an initial, intuitive introduction to object-oriented thinking, even before coding is discussed. By editing a UML-like object diagram, the student creates and links virtual Java Swing objects representing a user-interface, and can instantly view and manipulate its realization. GUIGraph is unique in that the student specifies an object structure to be created, equivalent to writing complex source code. When requested, GUIGraph generates the Java source code of an abstract class that constructs the object structure. The student then completes the coding of a concrete class that implements its application specific abstract methods. The functionality of the application is cleanly separated from its user-interface, which helps build design intuition, and iterative refinement of the user-interface is supported by regenerating the abstract class.", "authors": [{"name": "Duane Buck", "affiliation": "Otterbein University, Westerville, OH, USA"}], "tags": ["pedagogy", "user-interface", "object-graph"]}, {"title": "Toward replicating handmade algorithm visualization behaviors in a digital environment: a pre-study", "link": "https://dl.acm.org/doi/10.1145/1999747.1999804", "abstract": "Low fidelity algorithm visualizations (AV) made manually using simple art supplies are believed to have several pedagogical advantages over high fidelity visualizations generated by computer. Our research thus aims to introduce the kind of paper-and-pen, handmade AV construction experience into a computer-based environment. We videotaped ten students constructing handmade visualizations of their chosen algorithms to determine user behaviors we need to translate into an AV system. Eight key operational behaviors are identified, which leads to further derived operational behaviors. Based on the pre-study, we propose three new lo-fi AV design requirements. Implementation of a browser-based AV system that supports these operational behaviors and meets these design requirements is underway.", "authors": [{"name": "Guido Rößling", "affiliation": "TU Darmstadt, Darmstadt, Germany"}, {"name": "Ming-Han Lee", "affiliation": "TU Darmstadt, Darmstadt, Germany"}], "tags": ["low fidelity av", "pen-and-paper av", "computer science education", "effortlessness", "algorithm visualization"]}, {"title": "Improving compilers education through symbol tables animations", "link": "https://dl.acm.org/doi/10.1145/1999747.1999805", "abstract": "This paper presents the evaluation of an educational tool focused on the visualization of the symbol table in the context of a compiler course. In a first evaluation we used simulation exercises and tested basic concepts of symbol tables. We detected efficiency improvements, students who used the tool completed the exercises with the same grading and significantly faster than the students who did not use the tool. In addition students' opinion was positive. In a second evaluation we used more active tasks, and tested students' skills on writing parser specifications regarding symbol table management. We have detected significant improvements. Students who used the tool outperformed those who did not use the tool in a 22%.", "authors": [{"name": "Jesús Ángel Velázquez-Iturbide", "affiliation": "Rey Juan Carlos University, Madrid, Spain"}, {"name": "Jaime Urquiza-Fuentes", "affiliation": "Rey Juan Carlos University, Madrid, Spain"}, {"name": "Francisco Manso", "affiliation": "Rey Juan Carlos University, Madrid, Spain"}, {"name": "Manuel Rubio-Sánchez", "affiliation": "Rey Juan Carlos University, Madrid, Spain"}], "tags": ["compiler visualization", "symbol table", "evaluation"]}, {"title": "Understanding the syntax barrier for novices", "link": "https://dl.acm.org/doi/10.1145/1999747.1999807", "abstract": "Mastering syntax is one of the earliest challenges facing the novice programmer. Problem solving and algorithms are the focus of many first year programming classes, leaving students to learn syntax on their own while they practice writing code. In this paper we investigate the frequency with which students encounter syntax errors during a drill and practice activity. We find that students struggle with syntax to a greater extent than we anticipated, even when writing short fragments of code.", "authors": [{"name": "Ewan Tempero", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Jacob Hendrickx", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["constructive evaluation", "syntax", "java", "student-generated exercises", "drill and practice", "assessment", "codewrite"]}, {"title": "Understanding novice programmer difficulties via guided learning", "link": "https://dl.acm.org/doi/10.1145/1999747.1999808", "abstract": "Learning to program is known to be problematic for a significant number of students as evidenced by high failure rates reported by Computer Science schools. Students either fail to comprehend a range of fundamental programming concepts or carry misunderstandings and misconceptions about programming well into the semester, leading to summative assessment failures. Multiple choice questions in summative assessments are a popular choice of instrument to test novice learners of programming, yet during their formative stages such questions are typically used in the traditional \"practice\" or \"rote learning\" contexts, leaving gaps in understanding of programming concepts. In this paper we report the use of multiple choice exercises in a guided learning approach, within the learning context of novice programmers who are typically first-time university students of a Computer Science program. In addition to the use of multiple choice questions for practice, we propose a guided learning tool to identify cognitive lapses in learning programming. We report results of a pilot study that uses a partially-completed guided learning tool, to prevent students at the outset from falling into the cognitive traps that often ensnare the novice programmer.", "authors": [{"name": "Shuhaida Mohamed Shuhidan", "affiliation": "RMIT University, Melbourne, Australia"}, {"name": "Margaret Hamilton", "affiliation": "RMIT University, Melbourne, Australia"}, {"name": "Daryl D'Souza", "affiliation": "RMIT University, Melbourne, Australia"}], "tags": ["bloom's taxonomy", "novice programmer", "programming"]}, {"title": "Continual and explicit comparison to promote proactive facilitation during second computer language learning", "link": "https://dl.acm.org/doi/10.1145/1999747.1999809", "abstract": "This paper describes a Continual And Explicit Comparison (CAEC) approach to overcoming proactive inhibition and amplifying proactive facilitation in a second year Java course. The approach utilizes continual and explicit comparison to students' prior learning (in this case C++ programming knowledge) in early stages of learning the new language in order to more rapidly build understanding and more definitively form concept boundaries between the two languages. The majority of students felt the approach supported learning of the second language (proactive facilitation) without causing any interference with second language learning (i.e. minimal proactive inhibition). Some students also indicated that the approach enhanced their understanding of the first language (retroactive facilitation) and overwhelmingly agreed that the approach did not interfere with their understanding of the first language (i.e. minimal retroactive inhibition). Students also indicated that their Java programming ability and their enjoyment of programming increased during the period that the continual and explicit comparison approach was applied.", "authors": [{"name": "Annabelle McIver", "affiliation": "Macquarie University, Sydney, Australia"}, {"name": "Matt Bower", "affiliation": "Macquarie University, Sydney, Australia"}], "tags": ["java", "second language", "proactive facilitation", "pedagogy", "c++"]}, {"title": "Computational thinking: what it might mean and what we might do about it", "link": "https://dl.acm.org/doi/10.1145/1999747.1999811", "abstract": "Computational thinking has been promoted in recent years as a skill that is as fundamental as being able to read, write, and do arithmetic. However, what computational thinking really means remains speculative. While wonders, discussions and debates will likely continue, this article provides some analysis aimed to further the understanding of the notion. It argues that computational thinking is likely a hybrid thinking paradigm that must accommodate different thinking modes in terms of the way each would influence what we do in computation. Furthermore, the article makes an attempt to define computational thinking and connect the (potential) thinking elements to the known thinking paradigms. Finally, the author discusses some implications of the analysis.", "authors": [{"name": "Chenglie Hu", "affiliation": "Carroll University, Waukesha, WI, USA"}], "tags": ["thinking model", "computation", "computational thinking", "computing education"]}, {"title": "Beyond good and evil impacts: rethinking the social issues components in our computing curricula", "link": "https://dl.acm.org/doi/10.1145/1999747.1999812", "abstract": "It is by now widely accepted that social and professional issues are an important part of any computer science curriculum. The approach taken in most social issues courses is to articulate the social impacts of different computer technologies and then apply macro-ethical theories to those impacts. This paper argues that this approach has a number of drawbacks. First, it is based on a technological deterministic style of social explanation that has been in disrepute in the academic social sciences for decades. Second, it uses an algorithmic approach to ethics that simplifies the social complexity and the uncertainty that is the reality of socio-technological change. It concludes by suggesting that the alternative to the ethical evaluation of impacts is to focus the course instead on the social context; that is, on clarifying and unpacking the complexity involved in the relationship between technology and society.", "authors": [{"name": "Randy W. Connolly", "affiliation": "Mount Royal University, Calgary, AB, Canada"}], "tags": ["impacts", "computer ethics", "social issues", "cs education", "pedagogy"]}, {"title": "Computing student practices of cheating and plagiarism: a decade of change", "link": "https://dl.acm.org/doi/10.1145/1999747.1999813", "abstract": "Cheating in undergraduate computing courses is an ongoing and widespread concern. In this paper we report an investigation of changes over the last decade in computing students' attitudes towards cheating practices, the extent of cheating behavior, and factors which influence cheating at an Australian university. A comparative analysis of data from surveys in 2000 and 2010 of undergraduate students in a School of Information Technology found that students in 2010 considered cheating less acceptable and the practice of cheating was reportedly lower. These results are discussed in terms of measures that have been taken to address this problem.", "authors": [{"name": "Martin Dick", "affiliation": "RMIT University, Melbourne, Australia"}, {"name": "Judy Sheard", "affiliation": "Monash University, Melbourne, Australia"}], "tags": ["cheating", "plagiarism", "undergraduate students"]}, {"title": "\"Computer science and nursery rhymes\": a learning path for the middle school", "link": "https://dl.acm.org/doi/10.1145/1999747.1999815", "abstract": "We have tried to introduce some ideas and way of thinking of computer science through a set of extra-curricular activities on nursery rhymes. In this paper we discuss our experience in an Italian middle school. The chosen subject is naturally connected to what the pupils see, or listen to, in the primary school as well as in their home. Starting from this material which is familiar to them, the pupils are guided to explore the \"computational paradigm\". This is accomplished through gradual steps, where they are solicited to observe, to analyze, to devise models and, eventually, to develop simple programs in Logo. Our work is an attempt to suggest a different perspective on computation, since most of the opportunities for the pupils to interact with the new technologies tend to reinforce a view that relegates all the computing sphere to a merely instrumental role.", "authors": [{"name": "Doranna Di Vano", "affiliation": "Scuola Media Statale \"Via Petrarca\", Udine, Italy"}, {"name": "Claudio Mirolo", "affiliation": "University of Udine, Udine, Italy"}], "tags": ["variables", "interdisciplinarity", "control structures", "k-12 curricula", "programming", "middle school"]}, {"title": "Experimental evaluation of BeadLoom game: how adding game elements to an educational tool improves motivation and learning", "link": "https://dl.acm.org/doi/10.1145/1999747.1999816", "abstract": "The Virtual Bead Loom (VBL) is a Culturally Situated Design Tool that successfully teaches students middle school math concepts while they learn about and create their own Native American bead artifacts. We developed BeadLoom Game to augment VBL with game elements that encourage players to apply the computational thinking skills of iteration and layering while optimizing the number of steps they take to solve a puzzle. In our prior work, we showed that BeadLoom Game is effective at teaching Cartesian coordinates, iteration, and layering. In this study, we use a switching replications experimental design to compare performance of BeadLoom Game with the VBL. Our results from two summer camps, one for middle school and one for college-bound high school students, show that through the addition of game based objectives, BeadLoom Game teaches Cartesian coordinates as well as the VBL but also teaches the computational thinking practices of iteration and layering.", "authors": [{"name": "Shaun Pickford", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Tiffany Barnes", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Dustin Culler", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Antoine Campbell", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Acey Kreisler Boyce", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}], "tags": ["education", "evaluation", "motivation", "game development"]}, {"title": "Teaching CS unplugged in the high school (with limited success)", "link": "https://dl.acm.org/doi/10.1145/1999747.1999817", "abstract": "CS Unplugged is a set of active learning activities designed to introduce fundamental computer science principles without the use of computers. The program has gained significant momentum in recent years, with proponents citing deep engagement and enjoyment benefits. With these benefits in mind, we initiated a one-year outreach program involving a local high school, using the CS Unplugged program as the foundation. To our disappointment, the results were at odds with our enthusiasm --- significantly. In this paper, we describe our approach to adapting the CS Unplugged materials for use at the high school level, present our experiences teaching it, and summarize the results of our evaluation.", "authors": [{"name": "Sally K. Wahba", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Luke Segars", "affiliation": "UC Berkeley, Berkeley, CA, USA"}, {"name": "Yvon Feaster", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Jason O. Hallstrom", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["cs unplugged", "experimental evaluation", "high school curriculum", "computer science outreach"]}, {"title": "A scheme for improving ICT units with critically low student satisfaction", "link": "https://dl.acm.org/doi/10.1145/1999747.1999819", "abstract": "Unit evaluations across many Australian universities indicate that close to 10% of units in Information and Communication Technology (ICT) and Engineering disciplines are flagged as needing critical attention, and as such these faculties often struggle to meet university and national targets on educational performance. Further, ICT and Engineering repeatedly have the highest student dropout rates. This paper reports on the efficacy of activities undertaken to improve teaching quality and student satisfaction. Specifically, this paper outlines a Peer Assisted Teaching Scheme (PATS) as a process that was embedded in the Faculty of Information Technology (FIT) at Monash University to build peer assistance capacity in the faculty to improve student satisfaction of units in need of critical attention.", "authors": [{"name": "Jason Ceddia", "affiliation": "Monash University, Melbourne, Australia"}, {"name": "Angela Carbone", "affiliation": "Monash University, Melbourne, Australia"}, {"name": "Jessica Wong", "affiliation": "Monash University, Melbourne, Australia"}], "tags": ["action research", "teaching strategy", "ict education", "education quality in ict"]}, {"title": "Combining multiple pedagogies to boost learning and enthusiasm", "link": "https://dl.acm.org/doi/10.1145/1999747.1999820", "abstract": "This paper describes the pedagogy we applied in a 5-week class, in which students taught themselves (and each other) a new language, new OS, GUI programming, and simple networking for collaborative games. They learned communication, negotiation, collaboration, presentation and teamwork skills; and project design and iterative development. We had four goals: increased learning, enthusiasm about CS, confidence in technical ability and communication skills. To achieve these goals, we decided to rely solely on the integration of teaching techniques that we believed would be highly effective: collaborative teams, student presentations, student critique of work, open-ended projects of student design, iterative process, journal re-ection, and motivation through helping others. The students had to learn about each technique through discussion, modeling, and moderated practice. We focused on this process learning and trusted that the technical material would come from solving the (unspecified) assignments. This focus left no time for traditional teaching activities. We present quantitative and qualitative results from a student survey and the students' re-ective journals. Students reported learning at a greater rate than in other CS courses while maintaining (and in some cases acquiring) a high level of enthusiasm and confidence.", "authors": [{"name": "Lori Pollock", "affiliation": "University of Delaware, Newark, DE, USA"}, {"name": "Terry Harvey", "affiliation": "University of Delaware, Newark, DE, USA"}], "tags": ["studio-based classroom", "service learning", "collaborative learning", "problem-based learning", "reflective journaling"]}, {"title": "A cooperative learning-based strategy for teaching relational algebra", "link": "https://dl.acm.org/doi/10.1145/1999747.1999821", "abstract": "This paper presents the design, implementation, and assessment of a cooperative learning-based teaching strategy to introduce relational algebra in an undergraduate database course. It has been implemented in four course sections across two semesters. The strategy was assessed from both students and teachers perspective. Assessment results show that between 78% and 92% of the students considered that the group work enriched their learning, providing support for the use of cooperative learning. Also, the results from a homework and an exam on the subject show an improvement on the students' learning of relational algebra.", "authors": [{"name": "Arturo Camacho", "affiliation": "Universidad de Costa Rica, San José, Costa Rica"}, {"name": "Alexandra Martinez", "affiliation": "Universidad de Costa Rica, San José, Costa Rica"}], "tags": ["cooperative learning", "database", "active learning", "relational algebra", "experience report"]}, {"title": "Open source contribution as an effective software engineering class project", "link": "https://dl.acm.org/doi/10.1145/1999747.1999823", "abstract": "Software engineering courses often include a semester project designed to give students experience with real-world programming challenges and to expose them to phases of the software development cycle not covered in other classes. One means of engaging students in realistic programming challenges is to make participation in open source development a part of the semester project.\nThis paper describes an assignment in which students contribute to an open source project. The project is designed to immerse students in the open source community and expose them to the work flow and design strategies of a large project. Students work in small groups and decide both which open source community to contribute to and which specific contributions they will make. They can choose to focus on implementation of new features over software maintenance or can focus on documentation and design over both. The assignment contains a proposal phase that allows the instructor to ensure that students are exposed to a healthy cross section of the development cycle.", "authors": [{"name": "Robert Marmorstein", "affiliation": "Longwood University, Farmville, VA, USA"}], "tags": ["real-world projects", "open source", "team programming", "software maintenance", "software engineering"]}, {"title": "Extreme apprenticeship method: key practices and upward scalability", "link": "https://dl.acm.org/doi/10.1145/1999747.1999824", "abstract": "Programming is a craft that can be efficiently learned from people who already master it. Our previous work introduced a teaching method we call Extreme Apprenticeship (XA), an extension to the cognitive apprenticeship model. XA is based on a set of values that emphasize doing and best programming practices, together with continuous feedback between the master and the apprentice. Most importantly, XA is individual instruction that can be applied even in large courses. Our initial experiments (n = 67 and 44) resulted in a significant increase in student achievement level compared to previous courses. In this paper, we reinforce the validity of XA by larger samples (n = 192 and 147) and a different lecturer. The results were similarly successful and show that the application of XA can easily suffer if the core values are not fully adhered to.", "authors": [{"name": "Matti Luukkainen", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Jaakko Kurhila", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Matti Paksula", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Arto Vihavainen", "affiliation": "University of Helsinki, Helsinki, Finland"}], "tags": ["cognitive apprenticeship", "programming education", "best practises", "continuous feedback", "instructional design"]}, {"title": "The academic enhancement program in introductory CS: a workshop framework description and evaluation", "link": "https://dl.acm.org/doi/10.1145/1999747.1999825", "abstract": "The Academic Enhancement Program (AEP) is a student focused proactive intervention initiated in 2006 by the School of Computing Science and the Student Learning Commons at Simon Fraser University to provide academic self-regulation skills. This program has been offered as a required component in selected first year courses since 2008. In this paper we provide a description and evaluation of AEP 101 - a two-hour workshop delivered in a first year programming course. The workshop material includes a proposed framework to address academic challenges in general, with specific emphasis on learning processes required for CS. Statistical evaluations provide evidence of students' interest and appreciation for the workshop. In addition, some statistically detectable correlations between workshop satisfaction, academic attitudes, and academic performance are described.", "authors": [{"name": "Rylan Egan", "affiliation": "Memorial University of Newfoundland, St. John's, NF, Canada"}, {"name": "Diana Cukierman", "affiliation": "Simon Fraser University, Burnaby, BC, Canada"}, {"name": "Donna McGee Thompson", "affiliation": "Simon Fraser University, Burnaby, BC, Canada"}], "tags": ["self-regulation", "learning outcomes", "cs education research", "experience report", "learning taxonomies", "study strategies"]}, {"title": "Getting CS undergraduates to communicate effectively", "link": "https://dl.acm.org/doi/10.1145/1999747.1999827", "abstract": "In the last decade or so, the ACM, the IEEE and other organizations have acknowledged that there is a problem with the way communication is taught in the Computer Science curriculum: the writing, speaking, and presentation skills students learn in the classroom do not match what is expected of them in the workplace. The proposed solution, adopted by many undergraduate colleges, was to add a technical communication course to the CS curriculum. This does not appear to be enough, as mainstream accreditation boards are still emphasizing the need for improvement of communication skills instruction in their recent reports and recommendations. For the last two years, we have experimented with a complementary transversal approach where many \"traditional CS\" courses in our program have added a communication component to their syllabus, while at the same time our technical communication course has been revamped to expose students to realistic practices as promoted by situated learning theory. The results, so far anecdotal, point to improved student performance and attitude across several communication dimensions, in particular writing and presentation. We plan to develop this experiment by spreading it across more classes and by starting to collect rigorous measurements of students' communication performance.", "authors": [{"name": "Thierry Sans", "affiliation": "Carnegie Mellon University, Doha, Qatar"}, {"name": "Andreas Karatsolis", "affiliation": "Carnegie Mellon University, Doha, Qatar"}, {"name": "Khaled Harras", "affiliation": "Carnegie Mellon University, Doha, Qatar"}, {"name": "Nael Abu-Ghazaleh", "affiliation": "Carnegie Mellon University, Doha, Qatar"}, {"name": "Yonina Cooper", "affiliation": "Carnegie Mellon University, Doha, Qatar"}, {"name": "Kemal Oflazer", "affiliation": "Carnegie Mellon University, Doha, Qatar"}, {"name": "Iliano Cervasato", "affiliation": "Carnegie Mellon University, Doha, Qatar"}], "tags": ["curriculum alignment", "applied communication", "situated learning"]}, {"title": "Undergraduate research: a case study", "link": "https://dl.acm.org/doi/10.1145/1999747.1999828", "abstract": "This paper describes a one semester research course for undergraduates of computing programs. Students formulate a research proposal, conduct research and write a full paper. They present the results at a one-day student conference. On the one hand we offer the students a lot of structure and support; on the other hand an important feature of the course is that they are in control of their own research. A key aspect of the pedagogical approach is that the students are supervised in small teams by experienced staff. The results of evaluations show that the students are positive about the course. One of the main findings is that they feel well prepared to conduct research in the graduate program.", "authors": [{"name": "Betsy van Dijk", "affiliation": "University of Twente, Enschede, Netherlands"}, {"name": "Gerrit van der Hoeven", "affiliation": "University of Twente, Enschede, Netherlands"}, {"name": "Herman Koppelman", "affiliation": "University of Twente, Enschede, Netherlands"}], "tags": ["undergraduate research"]}, {"title": "Bringing undergraduate students closer to a real-world information retrieval setting: methodology and resources", "link": "https://dl.acm.org/doi/10.1145/1999747.1999829", "abstract": "We describe a pilot experiment to update the program of an Information Retrieval course for Computer Science undergraduates. We have engaged the students in the development of a search engine from scratch, and they have been involved in the elaboration, also from scratch, of a complete test collection to evaluate their systems. With this methodology they get a whole vision of the Information Retrieval process as they would find it in a real-world setting, and their direct involvement in the evaluation makes them realize the importance of these laboratory experiments in Computer Science. We show that this methodology is indeed reliable and feasible, and so we plan on improving and keep using it in the next years, leading to a public repository of resources for Information Retrieval courses.", "authors": [{"name": "Mónica Marrero", "affiliation": "University Carlos III of Madrid, Leganés, Spain"}, {"name": "Julián Urbano", "affiliation": "University Carlos III of Madrid, Leganés, Spain"}, {"name": "Diego Martín", "affiliation": "University Carlos III of Madrid, Leganés, Spain"}, {"name": "Jorge Morato", "affiliation": "University Carlos III of Madrid, Leganés, Spain"}], "tags": ["education", "evaluation", "experiment", "information retrieval"]}, {"title": "AnimalSense: combining automated exercise evaluations with algorithm animations", "link": "https://dl.acm.org/doi/10.1145/1999747.1999831", "abstract": "Exercises with an automatic evaluation can be helpful for students, if they cover meaningful tasks and are sufficiently challenging. We have designed an exercise system that combines exercise tasks with automatic evaluation and integrated algorithm animation. The paper describes the current status and sample tasks our system can handle.", "authors": [{"name": "Guido Rößling", "affiliation": "Technische Universität Darmstadt, Darmstadt, Germany"}, {"name": "Mihail Mihaylov", "affiliation": "Technische Universität Darmstadt, Darmstadt, Germany"}, {"name": "Jerome Saltmarsh", "affiliation": "Queensland University of Technology, Brisbane, Australia"}], "tags": ["cs1", "exercise", "automatic evaluation", "support", "animation"]}, {"title": "Using run time traces in automated programming tutoring", "link": "https://dl.acm.org/doi/10.1145/1999747.1999832", "abstract": "Running test cases against a student's solution of a programming assignment is one of the easiest ways to generate feedback. If black-box tests are used, students may have difficulties to retrace the complete system behaviour and to find erroneous programming statements. This paper discusses the use of automated trace generation for assisting students in this task. Both manual and automated trace interpretation is discussed and evaluated by examples.", "authors": [{"name": "Michael Goedicke", "affiliation": "University of Duisburg-Essen, Essen, Germany"}, {"name": "Michael Striewe", "affiliation": "University of Duisburg-Essen, Essen, Germany"}], "tags": ["automated tutoring", "intelligent tutoring systems", "trace analysis"]}, {"title": "A proposal for automatic evaluation in a compiler construction course", "link": "https://dl.acm.org/doi/10.1145/1999747.1999833", "abstract": "Experience in teaching the subject of Language Processors within the degree for Technical Engineering Computer Science, highlights the difficulties developing a compiler, for both students and instructors. The former because they are often disoriented when they are unable to get some feedback on their work and the latter because of the amount of effort and time involved to perform the evaluation. This paper presents a system for assisting evaluation using test cases, aligned with the trends of European Higher Education Area ongoing evaluation methodology. This approach is implemented in four phases where different problems are faced. The first phase consists of designing a test case set, accurate enough to discern whether the student successfully absorbed the different concepts and contents of the subject. The second phase involves the implementation of a runtime environment for the designed tests, so that many of the tasks required by the teaching staff can be automated. In the third phase, automatic assessment, according to different criteria is implemented. The fourth phase is the report of the results of the previous execution like straightforward feedback for both students and teachers", "authors": [{"name": "Emilio Julio Lorenzo", "affiliation": "UNED University, Madrid, Spain"}, {"name": "Javier Velez", "affiliation": "UNED University, Madrid, Spain"}, {"name": "Anselmo Peñas", "affiliation": "UNED University, Madrid, Spain"}], "tags": ["compiler automatic assessment feedback"]}, {"title": "Evaluation framework underpinning the digital divas programme", "link": "https://dl.acm.org/doi/10.1145/1999747.1999835", "abstract": "In Australia, as elsewhere, women's participation rates in Information Technology (IT) have been low. IT is the generic term used to refer to the many courses in the Computer Science, and Information Systems disciplines. While there have been a number of intervention programmes implemented aimed at encouraging women into IT and retaining them once there, few have included evaluations of the efficacy of the intervention. Thus little is known about the factors contributing to the success, or lack of success, of the interventions, or of the medium and longer term impacts for the participants. In this paper we briefly describe an intervention programme implemented with girls in the high school years. We present an evaluation framework providing a detailed overview of the aims and processes involved in the evaluation of the programme. Data for the evaluation were embedded within the data gathering methods associated with the research on the intervention itself.", "authors": [{"name": "Catherine Lang", "affiliation": "Swinburne University of Technology, Hawthorn, Australia"}, {"name": "Julie Fisher", "affiliation": "Monash University, Melbourne, Australia"}, {"name": "Annemieke Craig", "affiliation": "Deakin University, Geelong, Australia"}, {"name": "Helen Forgasz", "affiliation": "Monash University, Melbourne, Australia"}], "tags": ["evaluation", "intervention", "k-12 education", "student attitudes", "gender and diversity"]}, {"title": "The impact of IMPACT: assessing students' perceptions after a day of computer exploration", "link": "https://dl.acm.org/doi/10.1145/1999747.1999836", "abstract": "Declining enrollments in computer science are a cause of great concern. There has been a 30% decline in enrollments in US computer science bachelor programs over the previous decade and more than a 50% decline in the enrollment of women in computer science [20]. Some research suggests this is due to the negative perceptions high school students hold of computer science [6,16]. IMPACT is a unique way of attracting excellent students to the major by inviting students and their teachers to a day of exploration and competition hosted by our college. The aim of our research is to investigate how the students' attitudes change and to assess the impact of this daylong event. This paper will demonstrate that IMPACT increases awareness of computer science and changes the perceptions of the students who attend the event.", "authors": [{"name": "Timoth Lederman", "affiliation": "Siena College, Loudonville, NY, USA"}, {"name": "Mary Anne L. Egan", "affiliation": "Siena College, Loudonville, NY, USA"}], "tags": ["preconceptions", "perceptions of computer science", "gender studies", "recruitment", "impact"]}, {"title": "Female students' experiences of programming: it's not all bad!", "link": "https://dl.acm.org/doi/10.1145/1999747.1999837", "abstract": "Programming has been cited as a barrier for female students to enjoy and pursue computing as a career or at higher education. However, there are examples of good practice, which demonstrate that programming can act as a bridge rather than a barrier. As a result of surveying 103 students and interviewing 60 students from 3 different UK higher education institutions and this paper demonstrates that female students can enjoy programming and take it further for their careers.", "authors": [{"name": "Reena Pau", "affiliation": "University of Southampton, Southampton, United Kingdom"}, {"name": "Marcus Grace", "affiliation": "University of Southampton, Southampton, United Kingdom"}, {"name": "John Woollard", "affiliation": "University of Southampton, Southampton, United Kingdom"}, {"name": "Wendy Hall", "affiliation": "University of Southampton, Southampton, United Kingdom"}], "tags": ["women in computing"]}, {"title": "A medical motif for teaching computer graphics in context", "link": "https://dl.acm.org/doi/10.1145/1999747.1999839", "abstract": "In conjunction with Eurographics 2009 and SIGGRAPH, a working group explored the nature and role of teaching computer graphics in context. One issue identified in that forum was acquiring the resources necessary to embed a real-world context into a computer graphics course. This work describes an infrastructure subset for embedding a medical motif into a senior-level computer graphics course.", "authors": [{"name": "James Wolfer", "affiliation": "Indiana University South Bend, South Bend, IN, USA"}], "tags": ["education", "medical", "computer graphics"]}, {"title": "Courseware: student learning via FOSS field trips", "link": "https://dl.acm.org/doi/10.1145/1999747.1999840", "abstract": "Many faculty members understand the potential for computing students to learn via participation in Free and Open Source Software (FOSS) projects. However, there are few resources for introducing students (and faculty members) to FOSS projects. This tip presents several \"FOSS field trip\" assignments that allow students to explore and learn about FOSS projects.", "authors": [{"name": "Gregory W. Hislop", "affiliation": "Drexel University, Philadelphia, PA, USA"}, {"name": "Heidi J.C. Ellis", "affiliation": "Western New England University, Springfield, MA, USA"}], "tags": ["open source software", "student learning", "computing education"]}, {"title": "Infandango: automated grading for student programming", "link": "https://dl.acm.org/doi/10.1145/1999747.1999841", "abstract": "Infandango1 is an open source web-based system for automated grading of Java code submitted by students. Uploaded Java files are compiled and run against a set of unit tests on a central server, with results being stored in a database. Students gain near-instant feedback on the correctness of their code, and instructors are able to monitor the progress of students in the class.", "authors": [{"name": "Michael J. Hull", "affiliation": "University of Edinburgh, Edinburgh, United Kingdom"}, {"name": "Daniel Powell", "affiliation": "University of Edinburgh, Edinburgh, United Kingdom"}, {"name": "Ewan Klein", "affiliation": "University of Edinburgh, Edinburgh, United Kingdom"}], "tags": ["sphinx", "automatic grading", "java", "django", "restructured-text"]}, {"title": "Scheduling and student performance", "link": "https://dl.acm.org/doi/10.1145/1999747.1999842", "abstract": "We present data showing strong correlation between students' time management and a successful outcome on programming assignments. Students who spread their work over more time will produce a better result without additional expenditure of total effort. We examined performance of students who sometimes did well and sometimes did poorly, and found that their good performance occurred on the projects where they displayed better time management. While these results will not surprise most instructors, hard data is more compelling than intuition when trying to train students to use good time management.", "authors": [{"name": "Stephen H. Edwards", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Clifford A. Shaffer", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["time management", "student performance", "scheduling"]}, {"title": "Try a little history", "link": "https://dl.acm.org/doi/10.1145/1999747.1999843", "abstract": "This presentation describes ways in which teachers could use computing history to enrich topics in their courses. Computing history can be a very effective tool to teach computing courses. Using history as a pedagogical technique contributes to students' understanding and their life-long learning experiences. History also encourages students to appreciate better the subject at hand and enables them to gain a better sense of the nature of inquiry surrounding their area of study that includes the human dimension.", "authors": [{"name": "John Impagliazzo", "affiliation": "Hofstra University, Hempstead, NY, USA"}], "tags": ["course enhancement", "computing history", "computing education"]}, {"title": "Best practices in teaching mobile application development", "link": "https://dl.acm.org/doi/10.1145/1999747.1999844", "abstract": "This paper presents best practices for teaching mobile application development across the Computing curricula. While the focus is on the BlackBerry smartphone, the best practices can be used when teaching application development for other mobile platforms. The best practices are supported by the freely available CMER Academic Kit for integrating mobile devices into the Computer Science Curriculum.", "authors": [{"name": "Qusay H. Mahmoud", "affiliation": "University of Guelph, Guelph, ON, Canada"}], "tags": ["mobile application development", "blackberry", "teaching computer programming", "mobile devices", "programming for fun", "teaching tools"]}, {"title": "A mobile web-based approach to introductory programming", "link": "https://dl.acm.org/doi/10.1145/1999747.1999845", "abstract": "In this paper an approach for teaching introductory programming courses using mobile web-based technologies is introduced. This approach focuses on using standard Web technologies, such as HTML, JavaScript, and Cascading Style Sheets to make teaching computer programming fun, especially for users of mobile devices. This approach is supported by the CMER Academic Kit for integrating mobile devices into the Computer Science Curriculum.", "authors": [{"name": "Qusay H. Mahmoud", "affiliation": "University of Guelph, Guelph, ON, Canada"}], "tags": ["mobile application development", "blackberry", "teaching computer programming", "mobile devices", "programming for fun", "teaching tools"]}, {"title": "Two kinesthetic learning activities: turing machines and basic computer organization", "link": "https://dl.acm.org/doi/10.1145/1999747.1999847", "abstract": "Kinesthetic learning \"is a learning style in which learning takes place by the student actually carrying out a physical activity, rather than listening to a lecture or merely watching a demonstration.\"[2] Activities that incorporate kinesthetic learning are called KLAs. There is a rich set of opportunities for using KLAs in computer science education[3]. This report describes two KLAs; one which is used to convey basic computer organization/stored-program architectures, and the other to convey the basics of Turing machines.", "authors": [{"name": "Michael Goldweber", "affiliation": "Xavier University, Cincinnati, OH, USA"}], "tags": ["in-class exercises", "kinesthetic learning activities"]}, {"title": "Teaching computer architecture with a graphical PC simulator", "link": "https://dl.acm.org/doi/10.1145/1999747.1999848", "abstract": "We have developed a full system x86 simulator for teaching computer architecture, with graphical interfaces allowing the internal components of the simulated computer to be observed and modified at runtime, and utilities for designing and simulating custom processors. In this presentation we show how we used the simulator in our computer organization and computer architecture classes to teach assembly programming, I/O, and processor design.", "authors": [{"name": "Manoj Franklin", "affiliation": "University of Maryland, College Park, MD, USA"}, {"name": "Michael David Black", "affiliation": "American University, Washington, DC, USA"}], "tags": ["simulator", "x86"]}, {"title": "A Java implementation of the myro API for using personal robots in CS1", "link": "https://dl.acm.org/doi/10.1145/1999747.1999850", "abstract": "Myro is popular Python-based API for controlling personal robots used in many CS1 courses around the world. This paper describes the author's implementation of the Myro API in Java.", "authors": [{"name": "Douglas E. Harms", "affiliation": "DePauw University, Greencastle, IN, USA"}], "tags": ["ipre", "java", "cs1 curricula", "personal robots"]}, {"title": "Changes to JFLAP to increase its use in courses", "link": "https://dl.acm.org/doi/10.1145/1999747.1999851", "abstract": "JFLAP is software for experimenting with formal languages and automata theory. In this Tips and Techniques session we describe the recent changes to JFLAP to make it more usable in an automata theory course.", "authors": [{"name": "Susan H. Rodger", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Jonathan Su", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Henry Qin", "affiliation": "Duke University, Durham, NC, USA"}], "tags": ["formal languages", "cyk parser", "jflap", "pumping lemma", "automata"]}, {"title": "Merlin-Mo, an interactions analysis system for Moodle", "link": "https://dl.acm.org/doi/10.1145/1999747.1999852", "abstract": "We present Merlin-Mo, a complete interactions analysis system that fits into any running Moodle LMS and provides teachers with all the information they need about how their students are working within the course. The system provides with both: self configured interfaces, for easy data gathering, and a wide variety of data representations, including statistical and interactive visualizations.", "authors": [{"name": "J. Ángel Velázquez-Iturbide", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Madrid, Spain"}, {"name": "Raquel Hijón-Neira", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Madrid, Spain"}], "tags": ["lms", "e-learning", "interactions analysis", "moodle", "visualization"]}, {"title": "UWA Java tools: harnessing software metrics to support novice programmers", "link": "https://dl.acm.org/doi/10.1145/1999747.1999854", "abstract": "Many attributes of program quality can be measured automatically. UWA Java Tools is a collection of automatic software measurement tools configured for novice Java programmers. Measurement tools are used in industry to increase productivity and improve software quality. Our research demonstrates how such tools can benefit teaching and learning in programming courses.", "authors": [{"name": "Patrick Doran Wu", "affiliation": "The University of Western Australia, Perth, Australia"}, {"name": "Rachel Cardell-Oliver", "affiliation": "The University of Western Australia, Perth, Australia"}], "tags": ["software metrics"]}, {"title": "Using greenfoot in teaching inheritance in CS1", "link": "https://dl.acm.org/doi/10.1145/1999747.1999855", "abstract": "In the Open University of Israel CS1 course, there are eight assignments contributing various percentages to the overall course assessment. The concepts of inheritance and polymorphism are covered in assignment 5. In the fall semester of 2009, assignment 5 was changed to demonstrate these topics using the Greenfoot environment. Here we describe this assignment and its rationale.", "authors": [{"name": "Shay Tavor", "affiliation": "The Open University of Israel, Raanana, Israel"}, {"name": "Tamar Vilner", "affiliation": "The Open University of Israel, Raanana, Israel"}, {"name": "Ela Zur", "affiliation": "The Open University of Israel, Raanana, Israel"}], "tags": ["inheritance and polymorphism", "cs1", "games", "visualization"]}, {"title": "Animation projects in CS1 from scheme to Java", "link": "https://dl.acm.org/doi/10.1145/1999747.1999856", "abstract": "Scheme animation projects are transformed into Java projects.", "authors": [{"name": "Mirela Djordjević", "affiliation": "Manhattanville College, Purchase, NY, USA"}], "tags": ["java programming", "introductory programming course", "computer science for liberal arts"]}, {"title": "Outreach programs to promote computer science and ict to high school and middle school students", "link": "https://dl.acm.org/doi/10.1145/1999747.1999858", "abstract": "No abstract available.", "authors": [{"name": "Annemieke Craig", "affiliation": "Deakin University, Geelong, Australia"}, {"name": "Reyyan Ayfer", "affiliation": "Bilkent University, Ankara, Turkey"}, {"name": "Catherine Lang", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}, {"name": "Mary Anne L. Egan", "affiliation": "Siena College, Loudonville, NY, USA"}, {"name": "Jane Prey", "affiliation": "Microsoft Research, Redmond, WA, USA"}], "tags": ["gender studies", "outreach programs", "recruitment"]}]