[{"title": "Never too early to begin: computer science for high-school students", "link": "https://dl.acm.org/doi/10.1145/2325296.2325298", "abstract": "Computer science and technology innovated over the past sixty years, have revolutionized science, the economy and societal interactions. Inherently CS constitutes a new science combining mathematics, logic, information theory and electronics, on par with physics, chemistry and the life sciences. It is appropriate to educate students in the fundamentals of this science. The curriculum should emphasize the scientific content rather than provide mere training in some programming language.", "authors": [{"name": "Michael O. Rabin", "affiliation": "Harvard University and Hebrew University, Jerusalem, Israel"}], "tags": ["high school education"]}, {"title": "Alan turing and the other theory of computation", "link": "https://dl.acm.org/doi/10.1145/2325296.2325299", "abstract": "The two major traditions of the Theory of Computation, each asking claim to similar motivations and aspirations, have for the most part run a parallel non-intersecting course. On one hand, we have the tradition arising from logic and computer science addressing problems with more recent origins, using tools of combinatorics and discrete mathematics. On the other hand, we have numerical analysis and scientific computation emanating from the classical tradition of equation solving and the continuous mathematics of calculus. Both traditions are motivated by a desire to understand the essence of computation, of algorithm; both aspire to discover useful, even profound, consequences. While the logic and computer science communities are keenly aware of Alan Turing's seminal role in the former (discrete) tradition of the theory of computation, most remain unaware of Alan Turing's role in the latter (continuous) tradition, this notwithstanding the many references to Turing in the modern numerical analysis/computational mathematics literature. In this talk I recognize Turing's work in the foundations of numerical computation. I also indicate its role in complexity theory today, and how it provides a unifying concept for the two major traditions in the Theory of Computation.", "authors": [{"name": "Lenore Blum", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["complexity theory", "numerical computation"]}, {"title": "Standing on the shoulders of a giant: one person's experience of turing's impact", "link": "https://dl.acm.org/doi/10.1145/2325296.2325300", "abstract": "The talk will briefly describe three of Turing's major achievements, in three different fields: computability, biological modeling and artificial intelligence. Interspersed with this, I will explain how each of them directly motivated and inspired me to carry out a variety of research projects over a period of 30 years, the results of which can all be viewed humbly as extensions and generalizations of Turing's pioneering and ingenious insights.", "authors": [{"name": "David Harel", "affiliation": "The Weizmann Institute of Science, Rehovot, Israel"}], "tags": ["ai", "biological modeling", "turing", "computability"]}, {"title": "Activities, affordances and attitude: how student-generated questions assist learning", "link": "https://dl.acm.org/doi/10.1145/2325296.2325302", "abstract": "Recent research has focused on tools that support the creation, review and sharing of student-generated content for peer learning. However, we know little about the student perspective of such activities. In this paper, we identify what students believe is most helpful for their learning by analysing open-ended comments from students engaged in creating, answering and reviewing exam-style questions generated by their peers. Students report learning about content and appropriate standards of work, both individually and through interaction with peer generated resources.", "authors": [{"name": "Beryl Plimmer", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Robert Sheehan", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["question-generation", "studysieve", "student-generated", "free-response", "contributing student pedagogy", "peer-review", "constructive evaluation"]}, {"title": "Maximizing learning and guiding behavior in free play user generated content environments", "link": "https://dl.acm.org/doi/10.1145/2325296.2325303", "abstract": "Providing users the ability to create their own unique content in educational software and games can be highly effective at motivating the users to use and reuse the system. It is especially popular with students who self identify as creative or wanting to do their own thing rather than a prescribed activity. Due to the popularity of user generated content modes, some users may ignore other modes the software has to offer and only create new original content. Therefore it is important to maximize the learning potential and effectively guide user behavior in a constructivist free play environment. However, in doing so it is vital that we do not hamper the creative freedom of the user, the very reason users enjoy content creation. Here we present effective strategies for meeting these goals, provide an example implementation, and present results of a study using the example.", "authors": [{"name": "Shaun Pickford", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Acey Boyce", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Tiffany Barnes", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Antoine Campbell", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Dustin Culler", "affiliation": "Univeristy of North Carolina at Charlotte, Charlotte, NC, USA"}], "tags": ["education", "evaluation", "motivation", "game development"]}, {"title": "Lectures abandoned: active learning by active seminars", "link": "https://dl.acm.org/doi/10.1145/2325296.2325304", "abstract": "Traditional lecture-based courses are widely criticized for being less effective in teaching. The question is of course what should replace the lectures and various active learning techniques have been suggested and studied. In this paper, we report on our experiences of redesigning a software engineering course in software architecture to employ a range of active learning techniques. The course was constrained by the study administration's traditional assignment of a three hour lecturing slot and as such we had to make techniques that fitted this imposed constraint. Our contribution is active seminars as a replacement of traditional lectures, an activity template for the contents of active seminars, an account on how storytelling supported the seminars, as well as reports on our and the students' experiences.", "authors": [{"name": "Henrik Bærbak Christensen", "affiliation": "Aarhus University, Aarhus, Denmark"}, {"name": "Aino Corry", "affiliation": "Aarhus University, Aarhus, Denmark"}], "tags": ["education", "software architecture", "curriculum design"]}, {"title": "Infusing computational thinking into the middle- and high-school curriculum", "link": "https://dl.acm.org/doi/10.1145/2325296.2325306", "abstract": "In recent years there have been significant efforts to revamp undergraduate and K-12 curricula to emphasize computational thinking, a term popularized by Jeannette Wing in 2006. We describe work introducing and enhancing computational thinking activities and assessments in the middle- and high-school curriculum at the University of Chicago Lab Schools. In total six courses were altered as a part of the Computational Thinking across the Curriculum Project: middle-school and high-school computer science, and high-school Latin, graphic arts, English, and history. We detail the modifications to the curriculum and discuss the successes and challenges of the project.", "authors": [{"name": "Baker Franke", "affiliation": "The University of Chicago Laboratory Schools, Chicago, IL, USA"}, {"name": "Frances Spaltro", "affiliation": "The University of Chicago Laboratory Schools, Chicago, IL, USA"}, {"name": "Cynthia Jurisson", "affiliation": "The University of Chicago Laboratory Schools, Chicago, IL, USA"}, {"name": "Colin Rennert-May", "affiliation": "The University of Chicago Laboratory Schools, Chicago, IL, USA"}, {"name": "Brian Wildeman", "affiliation": "The University of Chicago Laboratory Schools, Chicago, IL, USA"}, {"name": "Amber Settle", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Ruth Hansen", "affiliation": "The University of Chicago Laboratory Schools, Chicago, IL, USA"}], "tags": ["computer science", "middle school", "k-12", "latin", "history", "english", "graphic arts", "high school", "computational thinking"]}, {"title": "Pseudo abstract composition: the case of language concatenation", "link": "https://dl.acm.org/doi/10.1145/2325296.2325307", "abstract": "Composition is a fundamental problem solving heuristic. In computer science, it primarily appears in program design with concrete objects such as language constructs. It also appears in more abstract forms in higher-level courses. One such form is that of language concatenation in the Computational Models course. This concatenation involves the composition of two specifications of infinite sets (source languages) into a third one, and requires both abstraction and non-deterministic conception. In this paper, we illuminate behaviors of advanced high school students, with such composition. Students who encountered difficulties offered pseudo solutions, which enclosed only \"surface\" features and observations. We orderly display their solutions, discuss them, and offer suggestions for educators to cope with this phenomenon.", "authors": [{"name": "Ronnie Alankry", "affiliation": "Tel-Aviv University, Tel-Aviv, Israel"}, {"name": "David Ginat", "affiliation": "Tel-Aviv University, Tel-Aviv, Israel"}], "tags": ["computational models", "abstraction", "composition", "concatenation", "non-determinism"]}, {"title": "Teaching graph algorithms to children of all ages", "link": "https://dl.acm.org/doi/10.1145/2325296.2325308", "abstract": "We report on our experiences in teaching graph theory and algorithms to school children, aged 5 to 17. Our objectives were to demonstrate that children can discover quite complex mathematical concepts, and are able to work with abstractions and use computation reasoning from quite an early age. We provide details of our incremental approach, which can be used with students of a wide range of abilities. Also, we comment on the importance of problem based learning where the algorithms are presented as possible solutions to games or puzzles. Finally, we conclude with a number of important observations with regard to the introduction of computer science into schools.", "authors": [{"name": "J. Paul Gibson", "affiliation": "Telecom Sud Paris, Evry, France"}], "tags": ["abstraction", "k-12 education", "problem based learning", "modelling", "computational thinking"]}, {"title": "Forming project groups while learning about matching and network flows in algorithms", "link": "https://dl.acm.org/doi/10.1145/2325296.2325310", "abstract": "The matching problem in bipartite graphs is the basis for many applications that have become especially prominent with the advent of online markets that connect two entities (e.g., job-seekers and employers). Its algorithmic basis is the max-flow problem in networks, a topic that is often covered in introductory algorithms texts and courses.\nSeparately, the Computer Science education literature is abundant with examples which indicate that the quality of the experience in the implementation of programming tasks is enhanced when done in groups.\nIn this paper, we describe the application of a network-flow-based matching algorithm in bipartite graphs to form project groups in the algorithms course at the Colorado School of Mines (CSM). This activity simultaneously provides students with an immersive experience in a bipartite matching application. We present a small exploratory study on the effectiveness of the activity.", "authors": [{"name": "Dinesh Mehta", "affiliation": "Colorado School of Mines, Golden, CO, USA"}, {"name": "Tina Kouri", "affiliation": "Colorado School of Mines, Golden, CO, USA"}, {"name": "Irene Polycarpou", "affiliation": "Colorado School of Mines, Golden, CO, USA"}], "tags": ["group formation", "group learning", "matching", "algorithms", "bipartite graphs"]}, {"title": "Refinement of an experimental approach tocomputer-based, active learning of greedy algorithms", "link": "https://dl.acm.org/doi/10.1145/2325296.2325311", "abstract": "Some years ago we presented a novel approach to the active learning of greedy algorithms. The approach was two-fold: an experimental method and the interactive assistant GreedEx that supports it. In this paper we present a refinement of the different elements of our approach, based on our experience of 5 years using and evaluating it in a course on algorithms. Firstly, usability evaluations were conducted to check the adequacy of GreedEx to its intended aims, so they guided the evolution of GreedEx. Secondly, the analysis of students' reports allowed us to identify unexpected misconceptions, which convinced us of the necessity of several didactic interventions. Our findings suggest that we succeeded both in obtaining an attractive and effective tool and in removing severe students' misconceptions. We consider that the paper is interesting to CS education researchers because of its specific contributions to the teaching of algorithms, and also as an example of a multifaceted, medium-term CS education research.", "authors": [{"name": "J. Ángel Velázquez-Iturbide", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Spain"}], "tags": ["active learning", "greedy algorithms", "misconceptions", "usability", "computer science education", "visualization"]}, {"title": "Digging for algorithmic nuggets in the land of polyominoes", "link": "https://dl.acm.org/doi/10.1145/2325296.2325312", "abstract": "This paper seeks to demonstrate that tiling with polyominoes, almost entirely neglected by textbooks on algorithms, can provide valuable examples of applications of algorithm design techniques, some of which are not easy to illustrate by examples from other domains.", "authors": [{"name": "Anany Levitin", "affiliation": "Villanova University, Villanova, PA, USA"}], "tags": ["polyominoes", "algorithm design techniques"]}, {"title": "The empirically refined competence structure model for embedded micro- and nanosystems", "link": "https://dl.acm.org/doi/10.1145/2325296.2325314", "abstract": "Teaching the development of embedded micro- and nanosystems needs a well structured foundation. In this paper, we show how we refined our normative competence structure model (NCSM) to an empirical competence structure model (ECSM) by incorporating the results of a survey of German experts in the field of embedded systems. In addition, we introduce a course concept for a new internship which takes the results of the ECSM into account.", "authors": [{"name": "Dietmar Fey", "affiliation": "Chair of Computer Science 3, University of Erlangen-Nürnberg, Erlangen-Nürnberg, Germany"}, {"name": "Andre Schäfer", "affiliation": "Institute of Microsystems Technology, University of Siegen, Siegen, Germany"}, {"name": "Rainer Brück", "affiliation": "Institute of Microsystems Technology, University of Siegen, Siegen, Germany"}, {"name": "Sigrid Schubert", "affiliation": "Didactics of Informatics and E-Learning, University of Siegen, Siegen, Germany"}, {"name": "Steffen Büchner", "affiliation": "Didactics of Informatics and E-Learning, University of Siegen, Siegen, Germany"}, {"name": "Bruno Kleinert", "affiliation": "Chair of Computer Science 3, University of Erlangen-Nürnberg, Erlangen-Nürnberg, Germany"}, {"name": "Harald Schmidt", "affiliation": "Chair of Computer Science 3, University of Erlangen-Nürnberg, Erlangen-Nürnberg, Germany"}, {"name": "Steffen Jaschke", "affiliation": "Didactics of Informatics and E-Learning, University of Siegen, Siegen, Germany"}], "tags": ["systems engineering education", "competence development", "embedded systems"]}, {"title": "Supporting operating systems projects using the μMPS2 hardware simulator", "link": "https://dl.acm.org/doi/10.1145/2325296.2325315", "abstract": "We live in a multicore world. In spite of this observation, none of the available system emulators designed for undergraduate education and for use in operating systems courses support multiprocessors. This paper presents μMPS2, a pedagogically undergraduate-appropriate multiprocessor system emulator/architecture. Using μMPS2 educators now have the ability to structure realistic operating system projects to maximize student exposure to the ubiquitous parallelism and concurrency present in current computing devices.", "authors": [{"name": "Tomislav Jonjic", "affiliation": "Department of Computer Science, Bologna, Italy"}, {"name": "Michael Goldweber", "affiliation": "Xavier University, Cincinnati, OH, USA"}, {"name": "Renzo Davoli", "affiliation": "University of Bologna, Bologna, Italy"}], "tags": ["multiprocessors", "emulation", "operating systems"]}, {"title": "Integrating data-intensive cloud computing with multicores and clusters in an HPC course", "link": "https://dl.acm.org/doi/10.1145/2325296.2325316", "abstract": "This paper presents the design and implementation of a new High-Performance Computing (HPC) course. This course amalgamates the emerging trend of data-intensive cloud computing with the dominant innovation of multicore computing and the important legacy of cluster computing. While others have reported the development of novel HPC courses, we are the first, to our knowledge, to report an upper-level HPC course that introduces the increasingly popular data-intensive cloud computing paradigm - integrally with the better-established shared memory and message-passing models. This course is entirely based on free digital reading resources and open source software. The course's design rationale and implementation - including the use of open source software tools and reading resources - may be beneficial for educators who need to design HPC courses or modules, and especially for those who wish to cover data-intensive cloud computing.", "authors": [{"name": "Atanas Radenski", "affiliation": "Chapman University, Orange, CA, USA"}], "tags": ["mpi", "cloud computing", "mapreduce", "openmp", "aws"]}, {"title": "All syntax errors are not equal", "link": "https://dl.acm.org/doi/10.1145/2325296.2325318", "abstract": "Identifying and correcting syntax errors is a challenge all novice programmers confront. As educators, the more we understand about the nature of these errors and how students respond to them, the more effective our teaching can be. It is well known that just a few types of errors are far more frequently encountered by students learning to program than most. In this paper, we examine how long students spend resolving the most common syntax errors, and discover that certain types of errors are not solved any more quickly by the higher ability students. Moreover, we note that these errors consume a large amount of student time, suggesting that targeted teaching interventions may yield a significant payoff in terms of increasing student productivity.", "authors": [{"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Ewan Tempero", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["assessment", "java", "drill and practice", "syntax errors", "codewrite"]}, {"title": "Code comprehension problems as learning events", "link": "https://dl.acm.org/doi/10.1145/2325296.2325319", "abstract": "Code comprehension problems have been shown to be effective assessment items in computer science education. In this paper we present qualitative and quantitative results of a study evaluating the effectiveness of code comprehension questions with feedback as learning events. Students taking an introductory programming course that satisfies a university requirement interacted with an online tutoring system using code comprehension problems about simple array algorithms as a part of a homework assignment. Students answered the problems in their own words first, before selecting a multiple choice option from the system.\nBoth the open-ended and multiple-choice responses were collected and analyzed. Results indicate that code comprehension questions with appropriate feedback can be learning events. The use of open-ended and multiple choice responses to the same question is also shown to be useful in refining distracter items for future assessment. Recommendations from this study can be applied not only to tutoring systems, but also to the type of interactions used in worked examples in class lecture and textbook production.", "authors": [{"name": "Sharon Carver", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Mark Stehlik", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Leigh Ann Sudol-DeLyser", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["code comprehension", "worked examples", "tutoring system", "feedback"]}, {"title": "An open-ended environment for teaching Java in context", "link": "https://dl.acm.org/doi/10.1145/2325296.2325320", "abstract": "Teaching programming in context, i.e. having students learning how to program by manipulating artifacts of a familiar domain (e.g. images, card games), has demonstrated convincing results in terms of raising student retention and interest in CS. This paper presents a pedagogical environment for teaching Java in context that is extensible with respect to the domains it supports. Instructors model domains and develop visualization widgets for rendering their objects. In turn, students use the environment to visualize and manipulate objects of the domain when solving exercises. The advantage and originality of the proposed environment is that it embodies an open-ended platform for creating diverse contexts at a low cost, standing as an enabler for widening the spectrum of abstractions for programming in context.", "authors": [{"name": "André L. Santos", "affiliation": "ISCTE-IUL, Lisbon, Portugal"}], "tags": ["contextualized programming", "java", "object-oriented programming"]}, {"title": "On teaching arrays with test-driven learning in WebIDE", "link": "https://dl.acm.org/doi/10.1145/2325296.2325322", "abstract": "Test-driven development (TDD) has been shown to reduce defects and to lead to better code, but can it help beginning students learn basic programming topics, specifically arrays? We performed a controlled experiment where we taught arrays to two CS0 classes, one using WebIDE, an intelligent tutoring system that enforced the use of Test-Driven Learning (TDL) methods, and one using more traditional static methods and a development environment that instructed, but did not enforce the use of TDD. Students who used the TDL approach with WebIDE performed significantly better in assessments and had significantly higher opinions of their experiences than students who used traditional methods and tools.", "authors": [{"name": "Michael Hilton", "affiliation": "California Polytechnic State University, San Luis Obispo, CA, USA"}, {"name": "David S. Janzen", "affiliation": "California Polytechnic State University, San Luis Obispo, CA, USA"}], "tags": ["computer science education", "CS1", "intelligent tutor", "CS0"]}, {"title": "JUG: a JUnit generation, time complexity analysis and reporting tool to streamline grading", "link": "https://dl.acm.org/doi/10.1145/2325296.2325323", "abstract": "The JUnit Generation (JUG) system provides fast, semiautomated feedback to students. It uses a Java-like script to generate unit tests and time complexity tests, then runs those tests to generate reports. The goals for JUG are improved feedback for students, and decreased preparation and grading time for instructors and grading assistants.", "authors": [{"name": "Robert Pastel", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Christopher Brown", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Bill Siever", "affiliation": "Northwest Missouri State University, Maryville, MO, USA"}, {"name": "John Earnest", "affiliation": "Michigan Technological University, Houghton, MI, USA"}], "tags": ["evaluation", "automated testing", "generative programming"]}, {"title": "Exploring influences on student adherence to test-driven development", "link": "https://dl.acm.org/doi/10.1145/2325296.2325324", "abstract": "Test-Driven Development (TDD) is a software development process with a test-first approach that shows promise for improving code quality. Our research addresses concerns raised in both academia and industry about a lack of motivation or acceptance in adopting TDD. In a CS2 class, we used an automated testing tool and post-class surveys to observe patterns of behavior in testing as well as changes in attitudes. We found significant positive outcomes for students following TDD. We also identified obstacles deterring students from adhering to TDD and discuss reasons and possible remedies.", "authors": [{"name": "Stephen H. Edwards", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Kevin Buffardi", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["web-cat", "software engineering", "adherence", "test-driven development (tdd)", "extreme programming", "automated testing", "affect", "agile", "procrastination", "junit"]}, {"title": "Statistical evidence of the correlation between mental ability to compute and student performance in undergraduate courses", "link": "https://dl.acm.org/doi/10.1145/2325296.2325326", "abstract": "In recent years, many studies have suggested the hypothesis that mental ability to compute is essential for many activities and is as fundamental as reading, writing and arithmetic. This work provides mathematical arguments to verification of this hypothesis. Assuming a precise statement of what is to compute, based on the model of computation \"Turing Machine\", we found experimentally the existence of a correlation, statistically significant, between mental ability to compute and student performance in four different university courses.", "authors": [{"name": "Osvaldo Luiz Oliveira", "affiliation": "Faculty of Campo Limpo Paulista, Campo Limpo Paulista (SP), Brazil"}], "tags": ["computing education", "empirical research", "model of computation", "computational thinking"]}, {"title": "Grade inflation, what students value, and the necessity of suffering", "link": "https://dl.acm.org/doi/10.1145/2325296.2325327", "abstract": "This paper questions whether there is a conflict between the academic and business interests of a university in combating grade inflation. A survey of online Master's degree students in Computing at a British university was carried out. It examined variations in the perceived value of a degree or the university's perceived reputation as a result of a number of possible changes aimed at reducing the sacrifices involved in gaining a degree; making it less likely that students would fail modules or their degree; and reducing the degree dropout rate to almost zero. The conclusion is that students saw such changes as reducing the value of their degree. The research suggests that in certain circumstances, academic and business interests can be aligned in opposing grade inflation.", "authors": [{"name": "Paul Kingsley", "affiliation": "University of Liverpool & Laureate Online Interactive Education, Liverpool & Amsterdam, United Kingdom "}, {"name": "Taly Sharon", "affiliation": "University of Liverpool & Laureate Online Interactive Education, Liverpool & Amsterdam, United Kingdom "}], "tags": ["online education", "perceived value", "failure rates", "sacrifice", "grade inflation", "higher education", "dropout rates"]}, {"title": "Instructor-centric source code plagiarism detection and plagiarism corpus", "link": "https://dl.acm.org/doi/10.1145/2325296.2325328", "abstract": "Existing source code plagiarism systems focus on the problem of identifying plagiarism between pairs of submissions. The task of detection, while essential, is only a small part of managing plagiarism in an instructional setting. Holistic plagiarism detection and management requires coordination and sharing of assignment similarity -- elevating plagiarism detection from pairwise similarity to cluster-based similarity; from a single assignment to a sequence of assignments in the same course, and even among instructors of different courses.\nTo address these shortcomings, we have developed Student Submissions Integrity Diagnosis (SSID), an open-source system that provides holistic plagiarism detection in an instructor-centric way. SSID's visuals show overviews of plagiarism clusters throughout all assignments in a course as well as highlighting most-similar submissions on any specific student. SSID supports plagiarism detection workflows; e.g., allowing student assistants to flag suspicious assignments for later review and confirmation by an instructor with proper authority. Evidence is automatically entered into SSID's logs and shared among instructors.\nWe have additionally collected a source code plagiarism corpus, which we employ to identify and correct shortcomings of previous plagiarism detection engines and to optimize parameter tuning for SSID deployment. Since its deployment, SSID's workflow enhancements have made plagiarism detection in our faculty less tedious and more successful.", "authors": [{"name": "Jonathan Y.H. Poon", "affiliation": "National University of Singapore, Singapore, Singapore"}, {"name": "Yee Fan Tan", "affiliation": "KAI Square, Singapore, Singapore"}, {"name": "Min-Yen Kan", "affiliation": "National University of Singapore, Singapore, Singapore"}, {"name": "Kazunari Sugiyama", "affiliation": "National University of Singapore, Singapore, Singapore"}], "tags": ["plagiarism assessment", "similarity", "corpus studies", "plagiarism detection", "user interface", "programming"]}, {"title": "Enriching introductory programming courses with non-intuitive probability experiments component", "link": "https://dl.acm.org/doi/10.1145/2325296.2325330", "abstract": "Probability theory is branch of mathematics that plays one of the central roles, not only in computer science, but also in science at large. We present a way to integrate non-intuitive probability experiments into introductory programming courses. We consider a set of the probability problems in which the intuitive approach leads to the wrong solution. These problems are based on interesting scenarios, attractive to students, and could be successfully \"translated\" into programming assignments. We present and discuss numerical simulations and verification of the correct solution through the computational approach. The proposed enrichment provides opportunity to engage students in experimental problem solving. Surprising computational results enhance students' curiosity and interest. This component promotes active involvement in the course. In addition, these problems provide an opportunity to make a connection between mathematics and computer science topics. Such non-intuitive answers may be remembered by students and may promote better understanding in the basic probability course they take later", "authors": [{"name": "Yana Kortsarts", "affiliation": "Widener University, Chester, PA, USA"}, {"name": "Yulia Kempner", "affiliation": "Holon Institute of Technology, Holon, Israel"}], "tags": ["introductory programming", "non-intuitive probability"]}, {"title": "A study on students' behaviours and attitudes towards learning to program", "link": "https://dl.acm.org/doi/10.1145/2325296.2325331", "abstract": "Learning difficulties in introductory programming courses are well known to teachers and students. Although several types of causes for those difficulties can be pointed out, in this work we focused on student related issues, namely their study methods and attitudes towards learning to program. We found a strong correlation between students' results and their personal perceptions of competence during the course. This result raises the need for teachers to consider this issue when devising the pedagogical approaches to use in introductory programming courses.", "authors": [{"name": "Anabela Jesus Gomes", "affiliation": "University of Coimbra and Polytechnic Institute of Coimbra, Coimbra, Portugal"}, {"name": "Alvaro Nuno Santos", "affiliation": "University of Coimbra and Polytechnic Institute of Coimbra, Coimbra, Portugal"}, {"name": "António José Mendes", "affiliation": "University of Coimbra, Coimbra, Portugal"}], "tags": ["programming learning", "study methods and attitudes", "learning difficulties"]}, {"title": "Initial results of using an intelligent tutoring system with Alice", "link": "https://dl.acm.org/doi/10.1145/2325296.2325332", "abstract": "This paper describes the initial steps taken towards incorporating an intelligent tutoring system (ITS) into Alice. After initially describing an ITS, the paper focuses on the development of several tutorials for teaching specific introductory programming concepts that have been created using stencils. Initial results concerning usability and effectiveness of these stencil-based tutorials are provided.", "authors": [{"name": "Stephen Cooper", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Luo Si", "affiliation": "Purdue University, West Lafayette, IN, USA"}, {"name": "Yoon Jae Nam", "affiliation": "Stanford University, Stanford, CA, USA"}], "tags": ["intelligent tutoring system", "tutorial", "alice"]}, {"title": "Student reactions to classroom lecture capture", "link": "https://dl.acm.org/doi/10.1145/2325296.2325334", "abstract": "This paper evaluates the benefits and drawbacks of lecture recording, which aspects of lectures and lecture capture systems are most used, and what additional features and functions would make the experience more effective. We evaluated 4 computer science courses recorded during spring 2011 using our comprehensive lecture capture system PAOL and presented with webMANIC. We discuss the results of student surveys and focus groups and compare these with prior surveys that investigated how students reacted to the availability of online lecture content and how they used these resources in large- and small-scale deployments with both home-grown and commercial lecture capture technologies. The primary motivation for this study was to analyze how lecture capture fits in the context of computer science curricula and pedagogy and about how we can enhance our systems to be more educationally effective.", "authors": [{"name": "Colin C. Roache", "affiliation": "Hampshire College, Amherst, MA, USA"}, {"name": "W. Richards Adrion", "affiliation": "University of Massachusetts, Amherst, MA, USA"}, {"name": "Paul E. Dickson", "affiliation": "Hampshire College, Amherst, MA, USA"}, {"name": "Alec C. Goebel", "affiliation": "Hampshire College, Amherst, MA, USA"}, {"name": "David I. Warshow", "affiliation": "Hampshire College, Amherst, MA, USA"}], "tags": ["automatic capture", "video creation", "evaluation", "image processing", "indexing", "lecture recording"]}, {"title": "Beyond PDF and ePub: toward an interactive textbook", "link": "https://dl.acm.org/doi/10.1145/2325296.2325335", "abstract": "This paper describes a new and unique vision for electronic textbooks. It incorporates a number of active components such as video, code editing and execution, and code visualization as a way to enhance the typical static electronic book format. In addition, the textbook is created with an open source authoring system that has been developed to allow the instructor to customize the content of the active and passive parts of the text. Initial results of a semester long trial are presented as well.", "authors": [{"name": "Bradley N. Miller", "affiliation": "Luther College, Decorah, IA, USA"}, {"name": "David L. Ranum", "affiliation": "Luther College, Decorah, IA, USA"}], "tags": ["sphinx", "ebook", "cs1"]}, {"title": "The future of teaching programming is on mobile devices", "link": "https://dl.acm.org/doi/10.1145/2325296.2325336", "abstract": "From paper to computers, the way that we have been writing down thoughts and performing symbolic computations has been constantly evolving. Teaching methods closely follow this trend, leveraging existing technology to make teaching more effective and preparing students for their later careers with the available technology. Right now, in 2012, we are in the middle of another technology shift: instead of using PCs and laptops, mobile devices are becoming more prevalent for most everyday computing tasks. In fact, never before in human history were incredibly powerful and versatile computing devices such as smartphones available and adopted so broadly. We propose that computer programming, and thus the teaching of programming, can and should be done directly on the mobile devices themselves, without the need for a separate PC or laptop to write code. Programming on smartphones that we carry around with us at all times means instant gratification for students, as they can show their games and applications to their friends, and it means that students can do their homework or additional practicing at all times. We describe TouchDevelop, a novel mobile programming environment, and call out challenges that need to be overcome and opportunities that it creates.", "authors": [{"name": "Nikolai Tillmann", "affiliation": "Microsoft Research, Redmond, WA, USA"}, {"name": "Jonathan de Halleux", "affiliation": "Microsoft Research, Redmond, WA, USA"}, {"name": "Michal Moskal", "affiliation": "Microsoft Research, Redmond, WA, USA"}, {"name": "Arjmand Samuel", "affiliation": "Microsoft Research, Redmond, WA, USA"}, {"name": "Tao Xie", "affiliation": "North Carolina State University, Raleigh, NC, USA"}, {"name": "Judith Bishop", "affiliation": "Microsoft Research, Redmond, WA, USA"}, {"name": "Manuel Fahndrich", "affiliation": "Microsoft Research, Redmond, WA, USA"}], "tags": ["cloud", "type inference", "mobile devices", "touchscreen", "evolution"]}, {"title": "Evaluation of a collaborative instructional framework for programming learning", "link": "https://dl.acm.org/doi/10.1145/2325296.2325338", "abstract": "Our work lies within the collaborative approach to learning CS1. We developed an instructional framework for collaborative learning (named CIF) that is oriented by educational objectives at the analysis level of Bloom's taxonomy. Moreover, the framework is supported by a platform (named MoCAS) of collaborative tools delivered with mobile devices. In this paper an experiment is presented to evaluate the educational effectiveness of CIF and MoCAS vs. three different learning approaches. We selected a topic representative of analysis tasks, namely scope of identifiers. The experiment was conducted with four groups, respectively using a classical lecture format, a collaborative approach, the CIF framework, and CIF plus the MoCAS tool. The experiment obtains statistically significant results, showing enhanced learning with the joint use of CIF and MoCAS.", "authors": [{"name": "Luis Miguel Serrano Cámara", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Spain"}, {"name": "Jesús Ángel Velázquez-Iturbide", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Spain"}, {"name": "Maximiliano Paredes Velasco", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Spain"}], "tags": ["evaluation", "cs1", "mobile devices", "bloom taxonomy", "computer supported collaborative learning (cscl)"]}, {"title": "Capstone project: fair, just and accountable assessment", "link": "https://dl.acm.org/doi/10.1145/2325296.2325339", "abstract": "Fair, just and accountable assessment for the individual student in the capstone project requires establishing criteria beyond the final project output to meet the objectives of the capstone project experience. Current research is limited and requires solutions that are not subjective, enable formative and summative assessment with student input and are not onerous on supervisors and/or students. This paper draws on input from highly experienced academics supervising capstone projects in ICT, critically reviews recent publications pertaining to capstone project assessment and current capstone students opinions. The outcome of this input led to the development, trial and evaluation of a toolkit to assist supervisors in both formative and summative assessment of capstone projects.", "authors": [{"name": "Graham Farrell", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}, {"name": "Paul Kindler", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}, {"name": "Vivienne Farrell", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}, {"name": "Gilbert Ravalli", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}, {"name": "David Hall", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}], "tags": ["assessment", "tcs", "peer", "project", "group", "capstone", "IT", "team"]}, {"title": "Comparing the effectiveness of different educational uses of program animations", "link": "https://dl.acm.org/doi/10.1145/2325296.2325340", "abstract": "In this paper we study two different approaches to using program animations with educational aims: their construction by students -a constructivist and active approach- and their vision -a less active approach. In addition, we compare both approaches to a traditional teaching methodology where animations are not used. We have conducted an experiment with functional program animations using an existing IDE with visualization features called WinHIPE. We have analyzed the results in terms of Bloom's Taxonomy and the complexity of the topics covered. We have detected learning improvements in high levels of Bloom's Taxonomy, namely analysis and synthesis. Moreover, our results show that program animations are unnecessary for simple topics, support the joint use of vision and construction tasks in medium-complexity topics, and recommend vision tasks together with the typical methodology but without the use of animations in the most complex topics.", "authors": [{"name": "Jaime Urquiza-Fuentes", "affiliation": "Universidad Rey Juan Carlos, Móstoles (Madrid), Spain"}, {"name": "J. Ángel Velázquez-Iturbide", "affiliation": "Universidad Rey Juan Carlos, Móstoles (Madrid), Spain"}], "tags": ["program visualization", "program animation", "evaluation", "engagement levels", "funtional programming"]}, {"title": "Pros and cons for teaching courses in the classroom and online simultaneously", "link": "https://dl.acm.org/doi/10.1145/2325296.2325342", "abstract": "In adding an online delivery option to an existing graduate program in computer science, important choices include (1) synchronous or asynchronous delivery and (2) for synchronous delivery, whether to deliver classroom and online teaching simultaneously. This paper describes the decisions made in adding an online option to an MSCS program, which now is maturing. The factors in favor of and against simultaneous delivery are discussed in detail and the conclusions reached for one particular program are described, including experience gained in the process and an open-source software system developed to support this form of delivery.", "authors": [{"name": "John Mark Pullen", "affiliation": "George Mason University, Fairfax, VA, USA"}], "tags": ["internet distance education", "synchronous", "asynchronous"]}, {"title": "SpecCheck: automated generation of tests for interface conformance", "link": "https://dl.acm.org/doi/10.1145/2325296.2325343", "abstract": "Grading code in large introductory programming classes is fraught with difficulties. In particular, students deviate from the required specification---and these deviations in turn break instructors' test code, delay feedback, hurt grades, and drive instructors to create oppressive homework policies. We present a system called SpecCheck for automatically generating tests that inform students of these deviations before they submit their homework. Our system inspects a instructor's reference implementation of a homework and produces tests to validate student code for interface conformance. It aids in conditioning code for faster grading but avoids the hazards introduced by some autograders. We present the tool and an experience report of its effectiveness in a large first-semester programming course.", "authors": [{"name": "Chris Johnson", "affiliation": "University of Wisconsin, Eau Claire, Eau Claire, WI, USA"}], "tags": ["automated grading", "interface conformance", "large classes"]}, {"title": "PETCHA: a programming exercises teaching assistant", "link": "https://dl.acm.org/doi/10.1145/2325296.2325344", "abstract": "This paper presents a tool called Petcha that acts as an automated Teaching Assistant in computer programming courses. The ultimate objective of Petcha is to increase the number of programming exercises effectively solved by students. Petcha meets this objective by helping both teachers to author programming exercises and students to solve them. It also coordinates a network of heterogeneous systems, integrating automatic program evaluators, learning management systems, learning object repositories and integrated programming environments. This paper presents the concept and the design of Petcha and sets this tool in a service oriented architecture for managing learning processes based on the automatic evaluation of programming exercises. The paper presents also a case study that validates the use of Petcha and of the proposed architecture.", "authors": [{"name": "José Paulo Leal", "affiliation": "CRACS & INESC-Porto LA, Faculty of Sciences, University of Porto, Porto, Portugal"}, {"name": "Ricardo Alexandre Peixoto Queirós", "affiliation": "CRACS & INESC-Porto LA & DI-ESEIG/IPP, Porto, Portugal"}], "tags": ["automatic evaluation", "learning objects", "interoperability", "teaching assistant", "programming exercises"]}, {"title": "Spaghetti for the main course?: observations on the naturalness of scenario-based programming", "link": "https://dl.acm.org/doi/10.1145/2325296.2325346", "abstract": "Scenario-based programming is an approach to software development which calls for developing independent software modules to describe different behaviors that a system should or should not follow, and then coordinating the interwoven execution of these modules at run time. We show that patterns previously shown to exist in programs written in the Scratch environment, which is not specifically scenario oriented, by children who did not have other training, and were not guided to write in a scenario-based manner, are also characteristic to scenario-based programming. These patterns include extremely fine-grain decomposition and bottom-up development. This result suggests that scenario-based programming concepts are \"natural\" in some ways. Thus, with an appropriate environment and a matching set of tools, scenario-based programming concepts could have an important role in early-stage computer-programming curricula.", "authors": [{"name": "Assaf Marron", "affiliation": "Weizmann Institute of Science, Rehovot, Israel"}, {"name": "Michal Gordon", "affiliation": "Weizmann Institute of Science, Rehovot, Israel"}, {"name": "Orni Meerbaum-Salant", "affiliation": "Weizmann Institute of Science, Rehovot, Israel"}], "tags": ["rule based systems", "live sequence charts", "bpj", "habits", "aspect-oriented programming", "scenario-based programming", "lsc", "natural programming", "scratch", "behavioral programming"]}, {"title": "A new curriculum for junior-high in computer science", "link": "https://dl.acm.org/doi/10.1145/2325296.2325347", "abstract": "Israel's Ministry of Education has launched a unique program to enhance science - technology education. It is a six year program for grades seven through twelve. The program introduces a new curriculum in computer science for junior-high school students. The computer science curriculum focuses on developing computational thinking. The purpose of this paper is to describe that curriculum and the preliminary evaluation of students' achievements.", "authors": [{"name": "Iris Zur Bargury", "affiliation": "The Ministry of Education, Tel Aviv, Israel"}], "tags": ["computer science", "curriculum", "algorithmic thinking", "junior-high schools", "education", "computational thinking"]}, {"title": "Outreach for improved student performance: a game design and development curriculum", "link": "https://dl.acm.org/doi/10.1145/2325296.2325348", "abstract": "We present a curriculum for computer science outreach using Game Maker. This curriculum has been adapted over six iterations of a 10-week, middle school apprenticeship on Game Design and Development. Through multiple iterations we have adjusted for many of the issues one could expect to encounter when running a similar outreach program. While many outreach curricula are independent from coursework, our video game design curriculum is targeted to address generalized student learning objectives (Math and English Language Arts) and designed for integration into middle school classrooms. We demonstrate that students' language arts and math classroom performance have improved with participation in this apprenticeship.", "authors": [{"name": "Samantha Finkelstein", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Tiffany Barnes", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Acey Boyce", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Katelyn Doran", "affiliation": "University of North Carolina at Charlotte, Charlotte, NC, USA"}], "tags": ["education", "middle school", "game design and development"]}, {"title": "CS1001.py: a topic-based introduction to computer science", "link": "https://dl.acm.org/doi/10.1145/2325296.2325350", "abstract": "We describe the curriculum, initial experience, and preliminary evaluation of an introductory CS course for students taking CS as their single or double major. The course is taught during the first or second semester of the first year of studies. It is centered around eleven to thirteen topics, offering a wide cover of major CS subjects. Many of these topics are not covered in \"traditional\" introductory CS courses, and some of them are not even covered through the standard undergraduate curricula. Examples: digital image representation and processing, error correction and detection codes, hashing (including Cuckoo hashing), and text compression.\nThe programming language used in the course is Python. The students are exposed to all standard programming language constructs (commands, assignments, functions, conditionals, iterations, recursion, etc.) and basic data types (e.g. integers, floating-point numbers, lists, dictionaries, and sets), as well as less basic constructs, like higher order functions, lambda expressions, classes and methods, and iterators.\nWe have set a dual learning outcome: the students are expected to acquire a good knowledge and proficiency of programming and understanding short programs. We also expect them to get a broad view of central subjects in Computer Science.", "authors": [{"name": "Benny Chor", "affiliation": "Tel-Aviv University, Tel-Aviv, Israel"}, {"name": "Rani Hod", "affiliation": "Tel-Aviv University, Tel-Aviv, Israel"}], "tags": ["experience report (preliminary)", "cs1: introduction to computer science", "curriculum issues", "topic based course"]}, {"title": "Are children capable of learning image processing concepts?: cognitive and affective aspects", "link": "https://dl.acm.org/doi/10.1145/2325296.2325351", "abstract": "Many children are making extensive use of technological devices such as cellphones, digital cameras and music players. Are these children attracted to learning the computer principles on which these devices are based? Are they qualified to learn computer science concepts in an in-depth fashion? This study aimed at examining the case of teaching an advanced computer science course in image processing to middle school students. During the stage of learning the theory, the students exhibited rather low motivation; later, when they were involved in preparing individual projects on image processing, they demonstrated greater interest and success in learning the subject matter.", "authors": [{"name": "Khaled Asad", "affiliation": "Alqasemi Academic College of Education & Ben-Gurion University of the Negev, Baqa-El-Gharbia, Israel "}, {"name": "Moshe Barak", "affiliation": "Ben-Gurion University of the Negev, Beer-Sheva , Israel"}], "tags": ["image processing", "contextual learning", "instructional approaches", "computer science education", "project-based learning"]}, {"title": "OpenIRS-UCM: an open-source multi-platform for interactive response systems", "link": "https://dl.acm.org/doi/10.1145/2325296.2325352", "abstract": "Interactive Response Systems (IRS) have been gaining acceptance within the educational community in recent years and a clear proof is the growing number of commercial systems available today in the market. However, most solutions are based on systems which are closed, rigid and dependent on proprietary keypad or platform. We have developed OpenIRS-UCM, a free teaching tool for interactive polling that solves these drawbacks. It is an open source software so it allows the development of new functions by anybody. It has a friendly interface that anyone without high computer skills can use. It enables the coexistence of several commercial clickers simultaneously with smart-phones, tablets or other modern electronic devices. It is developed in Java, thus its use is not restricted to systems based on Microsoft Windows and it is independent of any proprietary software.\nThe excellent acceptance of this teaching tool at University Complutense of Madrid has encouraged the creation of a repository that holds all the source code and executables files, in order to facilitate its widespread use.", "authors": [{"name": "Daniel Chaver", "affiliation": "Complutense University of Madrid, Madrid, Spain"}, {"name": "Jose Antonio Lopez-Orozco", "affiliation": "Complutense University of Madrid, Madrid, Spain"}, {"name": "Christian Tenllado", "affiliation": "Complutense University of Madrid, Madrid, Spain"}, {"name": "Fernando Castro", "affiliation": "Complutense University of Madrid, Madrid, Spain"}, {"name": "Carlos Garcia Sanchez", "affiliation": "Complutense University of Madrid, Madrid, Spain"}, {"name": "Jose Ignacio Gomez", "affiliation": "Complutense University of Madrid, Madrid, Spain"}], "tags": ["educational technology", "virtual polling", "free student response systems", "multi-clickers"]}, {"title": "A method to construct counterexamples for greedy algorithms", "link": "https://dl.acm.org/doi/10.1145/2325296.2325353", "abstract": "Problem solving is the focus of any algorithm design course. Being able to construct counterexamples is a critical part of the problem solving process. We address the following question: Is there a teachable approach to construct counterexamples? We present a technique, called the Anchor Method, that could prove useful in constructing counterexamples for greedy algorithms. The basic idea of the method is to get insight about the structure of a counterexample by weakening the greedy algorithm. We show the applicability of the method by constructing counterexamples for some classic problems in graph theory. We also investigate the teachability of the technique through experiments.", "authors": [{"name": "Jagadish M", "affiliation": "IIT Bombay, Mumbai, India"}, {"name": "Sridhar Iyer", "affiliation": "IIT Bombay, Mumbai, India"}], "tags": ["problem-solving", "counterexamples", "greedy algorithms"]}, {"title": "Integrating AI and machine learning in software engineering course for high school students", "link": "https://dl.acm.org/doi/10.1145/2325296.2325354", "abstract": "This paper describes a unique software engineering curriculum for high-school students that includes subjects in artificial intelligence and machine learning. The students in the course deal with the implementation of solutions to riddles and games (complex algorithmic problems), use the DrRacket functional programming language as a tool that supports their comprehension and thorough understanding of blind search algorithms, informed search algorithms, search games trees and machine learning algorithms. During their studies, the students engage in self-learning, collaborative learning and peer teaching. At the end of the course, each student writes a final research project which integrates the main aspects that have been learned in the course.", "authors": [{"name": "Dorit Lickerman", "affiliation": "Leo Baeck Education Center, Haifa, Israel"}, {"name": "Ahuva Sperling", "affiliation": "Leo Baeck Education Center, Haifa, Israel"}], "tags": ["machine learning", "k-12", "artificial intelligence", "project based learning", "computer science education"]}, {"title": "An interactive functional programming tutor", "link": "https://dl.acm.org/doi/10.1145/2325296.2325356", "abstract": "We introduce an interactive tutor that supports the stepwise development of simple functional programs. Using this tutor, students receive feedback about whether or not they are on the right track, can ask for a hint when they are stuck, and get suggestions about how to refactor their program. Our tutor generates this semantically rich feedback from model solutions, using advanced concepts from software technology. We show how a teacher can add an exercise to the tutor, and fine-tune feedback. We report on an experiment in which we used our tutor.", "authors": [{"name": "Alex Gerdes", "affiliation": "Open Universiteit Nederland, Heerlen, Netherlands"}, {"name": "Johan Jeuring", "affiliation": "Utrecht University, Utrecht, Netherlands"}, {"name": "Bastiaan Heeren", "affiliation": "Open Universiteit Nederland, Heerlen, Netherlands"}], "tags": ["haskell", "functional programmiing", "tutoring"]}, {"title": "V-lab: a cloud-based virtual laboratory platform for hands-on networking courses", "link": "https://dl.acm.org/doi/10.1145/2325296.2325357", "abstract": "For computer-network education, hands-on laboratories are essential in addition to lectures. Existing laboratory solutions are usually expensive to build, configure and maintain, while still lacking reusability, flexibility and scalability. This paper presents a cloud-based virtual laboratory education solution, called V-Lab, where instructors can use an interactive web GUI to configure computer network testbeds based on a set of dedicated virtual computers interconnected through VLAN-based virtual networks. The established virtual network system can be accessed by students via remote access using standard Secure Shell (SSH), Virtual Network Computing (VNC), or Remote Desktop Protocol (RDP). By using a flexible and re-configurable design, V-Lab greatly reduces the effort needed to establish and maintain a physical laboratory, while providing a secure and reliable environment that encourages students to use the resources based on their own schedule. V-Lab also helps re-design laboratory curriculum to focus on six educational factors, and the survey results show that V-Lab system is easy to use and setup and has satisfactory performance and reliability. It is also indicated that V-Lab helps students understand and solve real-world problems with sufficient laboratory resources and improved efficiency.", "authors": [{"name": "Wei-Tek Tsai", "affiliation": "Arizona State University, Tempe, AZ, USA"}, {"name": "Le Xu", "affiliation": "Arizona State University, Tempe, AZ, USA"}, {"name": "Dijiang Huang", "affiliation": "Arizona State University, Tempe, AZ, USA"}], "tags": ["virtual cloud computing", "hands-on laboratory", "computer networks"]}, {"title": "Serious toys: teaching the binary number system", "link": "https://dl.acm.org/doi/10.1145/2325296.2325358", "abstract": "The binary number system is the lingua franca of computing, requisite to myriad areas, from hardware architecture and data storage to wireless communication and algorithm design. Given its significance to such a broad range of computing topics, it is not surprising that the binary number system plays a prominent role in K-12 outreach efforts. It is even less surprising that the topic is often viewed as a dreary introduction to the discipline. Motivated by these observations and the potential of binary arithmetic to connect future students to a wide spectrum of computing topics, we have developed a new approach to teaching binary arithmetic in the K-12 curriculum. The approach relies on the use of a \"serious toy\", an embedded hardware platform designed to teach the binary number system while engaging visual and kinesthetic learners. We describe the design of the curriculum module and the supporting toy and detail our experiences using the approach in three independent outreach efforts. The results are largely positive, supporting our supposition that teaching the binary number system can achieve strong content understanding and improved attitudes toward the discipline.", "authors": [{"name": "Jason O. Hallstrom", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Farha Ali", "affiliation": "Lander university, Greenwood, SC, USA"}, {"name": "Yvon Feaster", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["computer science outreach", "high school curriculum", "binary numbers", "experimental evaluation"]}, {"title": "Bio1 as CS1: evaluating a crossdisciplinary CS context", "link": "https://dl.acm.org/doi/10.1145/2325296.2325360", "abstract": "We present the curriculum, deployment, and initial evaluation of a course, BioCS1, designed to serve as an introductory course in both biology and CS. Co-taught by professors in both fields, BioCS1 interweaves fundamental biology and computational topics in a manner similar to contextual approaches to CS1. In contrast to other contextual approaches, however, BioCS1 emphasizes both CS and its context equally. The results suggest that such cross-disciplinary collaborations can thrive at the introductory level, just as they have later in the curriculum.", "authors": [{"name": "Ran Libeskind-Hadas", "affiliation": "Harvey Mudd College, Claremont, CA, USA"}, {"name": "Eliot Bush", "affiliation": "Harvey Mudd College, Claremont, CA, USA"}, {"name": "Zachary Dodds", "affiliation": "Harvey Mudd College, Claremont, CA, USA"}], "tags": ["contextualized cs", "contextual peers", "CS1", "biology1"]}, {"title": "A study of stereotype threat in computer science", "link": "https://dl.acm.org/doi/10.1145/2325296.2325361", "abstract": "A controlled study was conducted to detect stereotype threat on harder topics in introductory Computer Science. Students in the control group were asked to identify their demographic information before taking the test whereas students in the experimental group were asked to do so after completing the test. So, the control group was indirectly reminded of stereotypes before taking the test, when it could affect performance on the test, whereas the experimental group was reminded after the test when it could not affect test performance.\nTests on two different loops were used, along with a partial cross-over design: a random group of students served as the control group on one test, and the experimental group on the other and vice versa. Mixed factor ANOVA analysis of the data showed that all the students scored significantly higher when not reminded of stereotypes before the test regardless of sex or race. In addition, average/below-average students scored significantly higher when not reminded of stereotypes before the test, again, regardless of sex or race. So, on harder topics in Computer Science, stereotype threat affects all the students, and in particular, the less-prepared students. In light of this, some suggestions are offered for avoiding stereotype threat during tests.", "authors": [{"name": "Amruth N. Kumar", "affiliation": "Ramapo College of New Jersey, Mahwah, NJ, USA"}], "tags": ["online testing", "computer science i", "stereotype threat"]}, {"title": "What do computer scientists do?: a survey of CS and non-CS liberal arts faculty", "link": "https://dl.acm.org/doi/10.1145/2325296.2325362", "abstract": "We asked all of the liberal arts faculty who advise undergraduates on course selection at the 14 colleges in the Associated Colleges of the Midwest a series of questions regarding their perceptions of the personality traits of Computer Science (CS) students, topics they think are covered in CS classes, and their overall impressions of CS. Our goal was to assess empirically the hypotheses that (1) many non-CS faculty do not really know what computer science is, and (2) many non-CS faculty are unaware of the differences between CS and Information Technology (IT). We received over 250 survey responses, which revealed that, among non-CS faculty, only 9% disagree or are neutral that CS should even be part of a liberal arts curriculum, but 32% think CS students learn to administer computers and computer networks, while 34% believe that CS students are taught to use Microsoft products in the classroom. However, over 95% of non-CS faculty also recognize the importance of both programming and algorithms to the study of computer science. The overall data suggests that a majority of non-CS faculty in the Associated Colleges of the Midwest have a a basic understanding of CS, while the remainder have an overly broad definition of CS (i.e. they think that CS includes IT).", "authors": [{"name": "Jaime Spacco", "affiliation": "Knox College, Galesburg, IL, USA"}, {"name": "Hannah Fidoten", "affiliation": "Knox College, Galesburg, IL, USA"}], "tags": ["cs education research", "cs education", "survey"]}, {"title": "Novices' perceptions and experiences of a mobile social learning environment for learning of programming", "link": "https://dl.acm.org/doi/10.1145/2325296.2325364", "abstract": "In this paper we report programming novices' perceptions and experiences of a Mobile Social Learning Environment (MSLE) designed to support the learning of programming through enabling increased novice-to-novice interactions. By capturing and analysing such interactions early it is hoped that instructors may identify misunderstandings and misconceptions of novice programmers, and provide timely feedback to alleviate novices' misunderstandings. The MSLE incorporates the use of mobile devices as well as the access to dedicated social networking sites. Novices from three different universities, each with different modes of delivery, participated in this research. Novices' perceived advantages of the MSLE include among other things instant access to discussions, increased interactions, instant feedback in a student-student context, and the ability to share ideas and views anytime, anywhere. Novices have experienced increased interactions among themselves and improved engagement with learning in the MSLE. Novices were able to form learning communities and able to share knowledge and ideas about programming language with each other. Some novices were able to provide assistance to others, hence indirectly, strengthening their own knowledge of programming. The cost of mobile devices and Internet charges on the other hand were perceived as disadvantages of a MSLE. Small screens, lack of programming applications for smart phones, laptops' battery life and distractions from other internet media were some of negative experiences observed by novices who used the MSLE.", "authors": [{"name": "Mercy Maleko", "affiliation": "RMIT University, Melbourne 3001, Australia"}, {"name": "Margaret Hamilton", "affiliation": "RMIT University, Melbourne 3001, Australia"}, {"name": "Daryl D'Souza", "affiliation": "RMIT University, Melbourne 3001, Australia"}], "tags": ["social learning", "mobile learning", "facebook", "novice programmer", "social networking", "interactions"]}, {"title": "Choosing a study mode in blended learning", "link": "https://dl.acm.org/doi/10.1145/2325296.2325365", "abstract": "Education providers aim to meet today's education requirements by employing, among other things, education technology solutions that increase flexibility. This has also happened with the master's level mathematical information technology degree directed to adults. In the degree program, lecture videos brought in together with face-to-face teaching provide good opportunities for flexible educational arrangements. Education with the help of videos can be arranged in such a way that students themselves will be able to choose their study mode in accordance with their needs. When students themselves can choose their study modes, many different ways to take advantage of the flexibility provided are created. It seems that students with different participation styles achieve the aims for their study progress in different ways. The purpose of this paper is to profile students with different study modes, the profiling being based on a structured questionnaire. In this way we try to find out what are the factors that affect the study mode. Our investigation focuses on both the effect of internal factors, such as motivation, and the effect of external factors, such as distance and time limitations, in the choice of a study method.", "authors": [{"name": "Mikko Myllymäki", "affiliation": "University of Jyväskylä, Kokkola, Finland"}, {"name": "Ismo Hakala", "affiliation": "University of Jyväskylä, Kokkola, Finland"}], "tags": ["student profile", "study mode", "lecture video", "blended learning"]}, {"title": "cs4fn: a flexible model for computer science outreach", "link": "https://dl.acm.org/doi/10.1145/2325296.2325366", "abstract": "There are a variety of initiatives to attract secondary school students to computer science. cs4fn is one such project. It combines a magazine, website and live shows, telling stories about computer science in spirited and creative ways. Here we focus on the use of the magazine and, using sociolinguistic discourse analysis, we analyze comments from students and teachers to understand why they have requested (free) subscriptions to the magazine and how they plan to use it. Our analysis shows that both students and teachers are attracted to the flexibility that cs4fn provides, and use it in a variety of learning contexts. We find that the flexibility of the magazine makes it a valuable tool to engage students and teachers and that they use it to further enthuse others (i.e., other students and teachers). We suggest that cs4fn magazine is a powerful form of outreach and that this approach can be widely disseminated within computer science and other academic disciplines, raising the profile of computing to both students and teachers, and spreading enthusiasm for computer science.", "authors": [{"name": "Laura R. Meagher", "affiliation": "UK Technology Development Group, Fife, United Kingdom"}, {"name": "Jonathan Black", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Peter W. McOwan", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Chrystie Myketiak", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Paul Curzon", "affiliation": "Queen Mary University of London, London, United Kingdom"}], "tags": ["k-12", "public engagement", "cs4fn", "recruitment", "teachers", "outreach", "diversity"]}, {"title": "Anatomy, dissection, and mechanics of an introductory cyber-security course's curriculum at the United States naval academy", "link": "https://dl.acm.org/doi/10.1145/2325296.2325367", "abstract": "Due to the high priority of cyber-security education, the United States Naval Academy rapidly developed and implemented a new cyber-security course that is required for all of its first-year students. During the fall semester in 2011, half of the incoming class (about 600 students) took the course through a total of 31 sections offered by 16 instructors from a variety of disciplines and backgrounds. In the following spring semester, the remaining half of the first-year students will take the course. This paper explains the motivation that instigated and drove course development, the curriculum, teaching mechanics implemented, personnel required, as well as challenges and lessons learned from the first offering of the course. The information contained in this paper will be useful to those thinking of implementing a technical course required of all students at the same level in an institution (in our case first-year students) and particularly those interested in implementing such a course in cyber security.", "authors": [{"name": "Justin Monroe", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Christopher Brown", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Rita Doerr", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Steven Simon", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Donald Needham", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "John Schultz", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "David Stahl", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Stephen Schall", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Raymond Greenlaw", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Chris Hoffmeister", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Frederick Crabbe", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Andrew Phillips", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Anthony Pollman", "affiliation": "USNA, Annapolis, MD, USA"}, {"name": "Sarah Standard", "affiliation": "USNA, Annapolis, MD, USA"}], "tags": ["active learning", "naval academy", "freshmen-required", "computer security awareness", "networks", "cyberspace policy review", "cyber-security education", "information assurance"]}, {"title": "Fuzzy OOP: expanded and reduced term interpretations", "link": "https://dl.acm.org/doi/10.1145/2325296.2325368", "abstract": "We display a novel perspective of novice OOP difficulties. In a thorough study of 120 undergraduates, in their first OOP course, we noticed a variety of misconceptions and difficulties with a wide range of basic terms and notions. Careful analysis revealed a recurring phenomenon, of fuzzy OOP conceptions, which derive from expansion and reduction of basic term features. Novices tended to expand and/or reduce properties not only of terms such as \"class\" and \"object\", but also of terms such as \"static\", \"access\", and \"instance\". Particular misconceptions were of the forms: \"One vs. Many\". We display a detailed categorization of our findings, in an ordered hierarchical structure, and discuss its cognitive characteristics.", "authors": [{"name": "Noa Ragonis", "affiliation": "Beit Berl College and Technion, Beit Berl, Israel"}, {"name": "David Ginat", "affiliation": "Tel-Aviv University, Tel-Aviv, Israel"}, {"name": "Ronit Shmallo", "affiliation": "Shamoon College of Engineering and Tel-Aviv University, Tel-Aviv, Israel"}], "tags": ["reduction", "computer science education", "expansion", "object-oriented programming"]}, {"title": "Formal learning groups in an introductory CS course: a qualitative exploration", "link": "https://dl.acm.org/doi/10.1145/2325296.2325369", "abstract": "In this paper we present an exploratory study on students' learning experiences with formal learning groups in an introductory Computer Science course. To provide insights into ways to make learning groups productive in this setting, we report on the properties of learning groups that students indicated as more or less effective for various reasons. Additionally, we explore the impact of specific learning group characteristics such as the ratio of male to female students, length of time in the group, and inclusion of students with varying levels of knowledge and experience.", "authors": [{"name": "Irene Polycarpou", "affiliation": "Colorado School of Mines, Golden, CO, USA"}, {"name": "Cyndi Rader", "affiliation": "Colorado School of Mines, Golden, CO, USA"}, {"name": "Julie Krause", "affiliation": "Colorado School of Mines, Golden, CO, USA"}], "tags": ["introduction to computer science", "gender", "formal learning groups", "collaborative learning", "computer science education"]}, {"title": "Competitive evaluation in a video game development course", "link": "https://dl.acm.org/doi/10.1145/2325296.2325371", "abstract": "The importance of the video game and interactive entertainment industries has continuously increased in recent years. Academia has introduced computer game development in its curricula. In the case of the University of Cadiz, a non-compulsory course about \"Video Game Design\" is offered to Computer Science students. In the artificial intelligence lesson, students play a competition to earn part of their grade. Each student individually implements a strategy to play a predefined board-game. The different strategies compete in a software environment that implements it. Grading this part of the course depends on the results obtained in the competition. Additionally, before running the competition, students have to read the source code written by their classmates and bet a part of their grade on other teams' results. This way, they elaborate a critical analysis of the source code written by other programmers: a very valuable skill in the professional world. Students that are not so proficient in coding are still rewarded if they demonstrate they can do a good analysis of the source code written by others.", "authors": [{"name": "José Tomás Tocino", "affiliation": "University of Cádiz, Cádiz, Spain"}, {"name": "Antonio García-Domínguez", "affiliation": "University of Cádiz, Cádiz, Spain"}, {"name": "Juan Manuel Dodero", "affiliation": "University of Cádiz, Cádiz, Spain"}, {"name": "Manuel Palomo-Duarte", "affiliation": "University of Cádiz, Cádiz, Spain"}, {"name": "Antonio Balderas", "affiliation": "University of Cádiz, Cádiz, Spain"}], "tags": ["competition", "video game development", "artificial intelligence", "expert system programming"]}, {"title": "User interface evaluation by novices", "link": "https://dl.acm.org/doi/10.1145/2325296.2325372", "abstract": "This study examines the extent to which novice computing students with minimal computer science coursework and no training in user interface (UI) evaluation consider UI concepts such as usability, user experience, and the context in which software will be used when evaluating an interface. In analyzing the responses of 149 novice computer science students who were asked to evaluate two interfaces for converting temperatures between Fahrenheit and Celsius, we observed that students generally considered usability and user experience factors, but were less likely to consider context. For educators, this exact task could be given to a class in order to initiate discussion of user-centered design; the study also provides a framework for structuring the discussion. More generally, the results of this study provide insight into some opportunities and challenges in teaching good interface design and evaluation skills.", "authors": [{"name": "Tzu-Yi Chen", "affiliation": "Pomona College, Claremont, CA, USA"}, {"name": "Robert McCartney", "affiliation": "University of Connecticut, Storrs, CT, USA"}, {"name": "Gary Lewandowski", "affiliation": "Xavier University, Cincinnati, OH, USA"}, {"name": "Tammy VanDeGrift", "affiliation": "University of Portland, Portland, OR, USA"}, {"name": "Dennis Bouvier", "affiliation": "Southern Illinois University, Edwardsville, Edwardsville, IL, USA"}, {"name": "Kate Sanders", "affiliation": "Rhode Island College, Providence, RI, USA"}], "tags": ["commonsense computing", "user interface evaluation", "novice"]}, {"title": "MyTuringTable: a teaching tool to accompany Turing's original paper on computability", "link": "https://dl.acm.org/doi/10.1145/2325296.2325373", "abstract": "MyTuringTable is a Turing Machine simulator designed to help students read and understand Turing's seminal 1937 paper on computability. We discuss our reasons for developing the tool, and report on its use in a \"Great Ideas in Computer Science\" course for the Air Force Academy Cadet Scholars program.", "authors": [{"name": "Dino Schweitzer", "affiliation": "US Air Force Academy, USAFA, CO, USA"}, {"name": "Barry Fagin", "affiliation": "US Air Force Academy, USAFA, CO, USA"}], "tags": ["computer science education", "turing machines", "educational software", "history of computing"]}, {"title": "Integrating the teaching of algorithmic patterns into computer science teacher preparation programs", "link": "https://dl.acm.org/doi/10.1145/2325296.2325375", "abstract": "The concept of patterns appears in the teaching of computer science in three main forms: algorithmic patterns, design patterns, and pedagogical patterns. A pattern is the identification of an abstract structure that can be further used in other, different contexts. This paper refers to algorithmic patterns as a tool that may be applied in computer science problem-solving processes, suggests an activity aimed at imparting algorithmic patterns to prospective computer science teachers, and presents part of an investigation of prospective teachers' understanding of algorithmic patterns. The main findings of the research support the inclusion of this topic in computer science teacher preparation programs, present the aspects of the concept for which the prospective teachers show meaningful understanding, and expose difficulties they experience when coping with patterns and composing recursion patterns. The focus is on abstract abilities demonstrated by computer science prospective teachers in the different stages of the activity.", "authors": [{"name": "Noa Ragonis", "affiliation": "Beit Berl College, Beit Berl, Israel"}], "tags": ["abstraction", "algorithmic patterns", "methods of teaching computer science course", "computer science teacher preparation", "recursion.", "computer science education", "k-12 instruction"]}, {"title": "μPython: non-majors programming from the very first lecture", "link": "https://dl.acm.org/doi/10.1145/2325296.2325376", "abstract": "We wanted to give first-year non-major students experience programming very early, right from the first lecture. To support this endeavor, we built a web-based subset of Python, called ¼Python. It allowed immediate use by students, overcame a number of practical constraints, and gave a gradual introduction and transition into the full version of Python.\nOur data demonstrate that ¼Python has a miniscule impact on the server side, running easily on a desktop computer. A student survey shows an overwhelmingly positive response to programming in the first class; it also shows that a lot of students were using ¼Python to try examples from lecture, that they thought ¼Python was helpful for learning Python, and that they liked being able to write Python code within their browser.", "authors": [{"name": "John Aycock", "affiliation": "University of Calgary, Calgary, AB, Canada"}], "tags": ["programming", "python", "non-majors"]}, {"title": "Engaging computer science in traditional education: the ECSITE project", "link": "https://dl.acm.org/doi/10.1145/2325296.2325377", "abstract": "Engaging Computer Science in Traditional Education (ECSITE, pronounced \"excite\") is a 5-year program that began in 2009 to bring computer science into traditional K-12 classrooms. Rather than seeking to draw students into computing courses, we bring computing into the courses that students are already taking. To date, these have included art, biology, health education, mathematics, and social studies courses as well as a Native American focus program. Middle school and high school students are introduced to computational thinking and computer science concepts including algorithms, graph theory, and simulations in interdisciplinary contexts, mirroring the ways in which computing technologies are utilized in research and industry. Teachers report that students increase their understanding and perception of computer science, and that participating K-12 teachers increase their knowledge about computing and will continue to include the computational curriculum after their involvement with ECSITE.", "authors": [{"name": "Clayton Lewis", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Dirk Grunwald", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Jessica A. Feld", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Debra S. Goldberg", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Sarah Hug", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}], "tags": ["computational thinking", "k-12 instruction", "interdisciplinary curriculum"]}, {"title": "A systematic approach to teaching abstraction and mathematical modeling", "link": "https://dl.acm.org/doi/10.1145/2325296.2325378", "abstract": "The need for undergraduate CS students to create and understand mathematical abstractions is clear, yet these skills are rarely taught in a systematic manner, if they are taught at all. This paper presents a systematic approach to teaching abstraction using rigorous mathematical models and a web-based reasoning environment. It contains a series of representative examples with varying levels of sophistication to make it possible to teach the ideas in a variety of courses, such as introductory programming, data structures, and software engineering. We also present results from our experimentation with these ideas over a 3-year period at our institution in a required course that introduces object-based software development, following CS2.", "authors": [{"name": "Joseph E. Hollingsworth", "affiliation": "Indiana University Southeast, New Albany, IN, USA"}, {"name": "Murali Sitaraman", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Charles T. Cook", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Svetlana Drachova", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Jason O. Hallstrom", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Joan Krone", "affiliation": "Denison University, Granville, OH, USA"}, {"name": "David P. Jacobs", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["abstraction", "mathematical modeling", "contract programming", "formal methods", "interface specifications"]}, {"title": "The new CSTA K--12 computer science standards", "link": "https://dl.acm.org/doi/10.1145/2325296.2325380", "abstract": "In this panel, we describe the new CSTA K-12 Computer Science Standards, their organization, and their hoped-for impact.", "authors": [{"name": "Steven Cooper", "affiliation": "Stanford University, Palo Alto, CA, USA"}, {"name": "Barbara Boucher Owens", "affiliation": "Southwestern University, Georgetown, TX, USA"}, {"name": "Judith Gal-Ezer", "affiliation": "Open University of Israel, Raanana, Israel"}, {"name": "Chris Stephenson", "affiliation": "Computer Science Teachers Assoc., New York, NY, USA"}], "tags": ["k-12 curriculum", "computer science education"]}, {"title": "Computer science as a community involvement activity", "link": "https://dl.acm.org/doi/10.1145/2325296.2325381", "abstract": "In the proposed panel we discuss the efforts made by the academy and industry to bring computer science (CS) to audience that is not exposed to CS education, not represented in the CS workforce or not accessible due to lack in technological solutions.", "authors": [{"name": "Assaf Zaritsky", "affiliation": "Tel Aviv University, Tel Aviv, Israel"}, {"name": "Ohad Barzilay", "affiliation": "Tel Aviv University, Tel Aviv, Israel"}], "tags": ["computer science unplugged", "students", "volunteering", "engaging computer science", "community involvement"]}, {"title": "Assessing the benefits of integrating social issues components in the computing curriculum", "link": "https://dl.acm.org/doi/10.1145/2325296.2325382", "abstract": "The inclusion of social issues, including ethical and professional topics, in computing curricula has become commonplace two decades after being incorporated into the ACM Computing Curricula. However, authors of academic papers and conference presentations often concentrate on integrating the broader issues of societal impact and best practices into computing curricula, while neglecting the assessment of their benefits. This panel explores how the institutions of the panelists include social issues in projects and the curriculum as a whole, and additionally how they assess the benefits of doing so. Special attention is given to an appreciation of the social good emanating from the use of community-based and non-profit organizations in student projects. Additionally, ways to assess the effectiveness of these approaches are presented in an effort to help meet model curriculum guidelines and accreditation requirements.", "authors": [{"name": "Barbara Boucher Owens", "affiliation": "Southwestern University, Georgetown, TX, USA"}, {"name": "Paul Leidig", "affiliation": "Grand Valley State University, Allendale, MI, USA"}, {"name": "Michael Goldweber", "affiliation": "Xavier University, Cincinnati, OH, USA"}], "tags": ["assessment", "social issues", "community-based projects", "curriculum"]}, {"title": "Programming studio: advances and lessons learned", "link": "https://dl.acm.org/doi/10.1145/2325296.2325384", "abstract": "In [1] we previously described an innovative approach to teaching programming fundamentals to undergraduate students in a course called Programming Studio. This required program is designed to be given shortly after CS2. We teach topics such as high quality code design, proper problem de-composition and methods of code documentation, as well as practical subjects such as correct usage of various types of version control and a variety of programming languages that are not usually introduced in other CS courses. Here we build on what was previously written with the new methods of assessment, types of assignments, and the lessons learned from expanding the course from less than 75 students to nearly 150 students.", "authors": [{"name": "Michael Woodley", "affiliation": "University of Illinois, Urbana, IL, USA"}, {"name": "Charlie Meyer", "affiliation": "University of Illinois, Urbana, IL, USA"}], "tags": ["programming", "undergraduate education"]}, {"title": "Sample courseware for introductory OO programming", "link": "https://dl.acm.org/doi/10.1145/2325296.2325385", "abstract": "In this paper, we describe a programming assignment for first semester computer science students that requires them to apply object-oriented (OO) programming and design skills in order to successfully complete their work. The students work in an interactive 3D environment that gives them immediate visual feedback.", "authors": [{"name": "Rikki Fletcher", "affiliation": "California State University, San Marcos, San Marcos, CA, USA"}, {"name": "Rocio Guillen", "affiliation": "California State University, San Marcos, San Marcos, CA, USA"}], "tags": ["object-oriented-programming", "oo design", "cs0", "computational thinking"]}, {"title": "A web-based problem solving tool for introductory computer science", "link": "https://dl.acm.org/doi/10.1145/2325296.2325386", "abstract": "We present a \"Problem Solving Tutor\" - a web-based educational tool for learning through problem solving. The tool contains more than 1,400 problems, mainly introductory programming problems, math and logic puzzles. All problems are interactive and the system gives students immediate feedback on their performance. The tool makes individual predictions of problem solving times and therefore is able to recommend each student a problem of suitable difficulty.", "authors": [{"name": "Radek Pelánek", "affiliation": "Faculty of informatics, Brno, Czech Rep"}, {"name": "Petr Jarusek", "affiliation": "Faculty of informatics, Brno, Czech Rep"}], "tags": ["problem solving", "computer science education", "intelligent tutoring systems"]}, {"title": "Techniques at the intersection of computing and music", "link": "https://dl.acm.org/doi/10.1145/2325296.2325387", "abstract": "Our work on Performamatics aims to enhance students' computational thinking (CT) by engaging them in fundamental concepts that unite computing and music. Our approach leverages students' near universal interest in music as a context for rich CT experiences. The techniques we share are used in a General Education course open to students in any major called Sound Thinking, which is now being offered for the fourth time.", "authors": [{"name": "Jesse M. Heines", "affiliation": "Univ. of Massachusetts Lowell, Lowell, MA, USA"}, {"name": "S. Alex Ruthmann", "affiliation": "Univ. of Massachusetts Lowell, Lowell, MA, USA"}, {"name": "Gena R. Greher", "affiliation": "Univ. of Massachusetts Lowell, Lowell, MA, USA"}], "tags": []}, {"title": "Nintendo® DS projects to learn computer input-output", "link": "https://dl.acm.org/doi/10.1145/2325296.2325388", "abstract": "Being the Input/Output subsystem an important topic in the area of Computer Architecture [1], in this work we propose a Project-Based Learning (PBL) methodology enhanced by the use of a Nintendo® DS machine. The use of both, methodology and platform, is endorsed by students' comments, the projects themselves and the scores obtained in the subject.", "authors": [{"name": "Edurne Larraza-Mendiluze", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Javier Muguerza", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Karlos Santiago", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Nestor Garay-Vitoria", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Jose Ignacio Martín", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Jose Francisco Lukas", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Iratxe Soraluze", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Txelo Ruiz-Vazquez", "affiliation": "University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}], "tags": ["education", "input/output", "game console", "project based learning"]}, {"title": "Using professional and ethical themes", "link": "https://dl.acm.org/doi/10.1145/2325296.2325389", "abstract": "This presentation describes ways in which teachers could use computing professionalism and ethics to enrich topics in their courses. These enrichment techniques could become a very effective extension to teaching computing courses. Using professionalism as a pedagogical technique could contribute to the better understanding of course material and to the foundations of lifelong learning experiences of students. Professional extensions and ethics also encourage students to appreciate the subject at hand and foster a sense of natural inquiry surrounding their area of study that includes the human dimension.", "authors": [{"name": "John L. Impagliazzo", "affiliation": "Hofstra University, Hempstead, AA, APO AA"}], "tags": []}, {"title": "Breadth first search (animation and obstacle avoidance)", "link": "https://dl.acm.org/doi/10.1145/2325296.2325390", "abstract": "A simple, motivating first year assignment which animates a Breadth First Search solution to a graphical obstacle avoidance problem is presented.", "authors": [{"name": "Arnold Rosenbloom", "affiliation": "University of Toronto at Mississauga, Mississauga, ON, Canada"}], "tags": ["data structures", "queues", "visualization", "algorithms"]}, {"title": "Teaching labs on pseudorandom number generation", "link": "https://dl.acm.org/doi/10.1145/2325296.2325392", "abstract": "This presentation describes our approach to teaching pseudorandom number generation (PRNG) in CS labs. We use PRNG at two universities as an example of an application of sequential circuitry in our digital logic courses. Our goal is for our students to have meaningful assignments, and to relate digital logic not only to the larger CS curriculum, but to the students' lives. This also us a motivation to discuss \"what is randomness?\", security issues relating to seeding and encryption, and why and how we use randomness in computing.", "authors": [{"name": "Elizabeth Patitsas", "affiliation": "University of Toronto, Toronto, ON, Canada"}], "tags": ["digital logic", "labs", "computer science education"]}, {"title": "Best practices for time-management of student groups with heterogeneous effort", "link": "https://dl.acm.org/doi/10.1145/2325296.2325393", "abstract": "The daily work of an engineer in industry is affected by project work; often more than one project at a time. Consequently, time and self-management is an important part of the education of future engineers and scientists. Students of electrical engineering and computer science at the University of Siegen have a student project work in their curricula to deepen hard skills and to learn soft skills, like teamwork, organization and time-management. Often these groups consist of students with heterogeneous requirements in terms of working hours. In this contribution, the authors present a good practice for time-management of groups with heterogeneous working-time.", "authors": [{"name": "André Schäfer", "affiliation": "Institute of Microsystem Technology, University of Siegen, Siegen, Germany"}, {"name": "Rainer Brück", "affiliation": "Institute of Microsystem Technology, University of Siegen, Siegen, Germany"}, {"name": "Matthias Mielke", "affiliation": "Institute of Microsystem Technology, University of Siegen, Siegen, Germany"}], "tags": ["time management", "heterogeneous working-time", "project work"]}, {"title": "Developing contexts for teaching Java using AGUIA/J", "link": "https://dl.acm.org/doi/10.1145/2325296.2325394", "abstract": "Teaching programming in context, i.e. having exercises dealing with artifacts of a familiar domain (e.g. images, card games), has demonstrated convincing results in terms of raising student retention and interest in CS. This session addresses the development of contexts for Java by means of AGUIA/J plugins.", "authors": [{"name": "André L. Santos", "affiliation": "ISCTE-IUL, Lisbon, Portugal"}], "tags": ["java", "contextualized programming", "object-oriented programming"]}, {"title": "The presenter first design approach", "link": "https://dl.acm.org/doi/10.1145/2325296.2325395", "abstract": "Presenter First is a design technique that combines the Model-View-Presenter design pattern with the concept of \"user stories.\" We have found that Presenter First helps students decompose their programming projects into manageable tasks.", "authors": [{"name": "Zachary Kurmas", "affiliation": "Grand Valley State University, Allendale, MI, USA"}], "tags": ["model-view-presenter", "presenter first"]}, {"title": "A hardware simulator for teaching CPU design", "link": "https://dl.acm.org/doi/10.1145/2325296.2325396", "abstract": "This presentation describes a GUI-based tool for teaching CPU design to computer architecture students. A datapath builder allows microarchitecture building blocks, such as registers, ALUs, and multiplexors, to be laid out and wired together. A control builder allows a control state machine to be developed for the datapath. Because the processor design is simulated within a full PC emulator, student-designed processors can use emulated devices, such as drives, video, and I/O ports. A tutorial teaches students to use the simulator to build and simulate a pipelined RISC processor.", "authors": [{"name": "Michael Black", "affiliation": "American University, Washington, DC, USA"}], "tags": ["processor", "simulator", "x86"]}, {"title": "Introvert educators: techniques to be effective in the traditional face-to-face CS classroom", "link": "https://dl.acm.org/doi/10.1145/2325296.2325397", "abstract": "This purpose of this session is two-fold: first, to consider an initial set of strategies that introvert educators could adopt (and then adapt) in order to be effective in the traditional face-to-face computer science classroom; and, then, to initiate research (and dialogue) about educator personality types, in general, and their associated best teaching practice, since, just as preferred learning style depends on the personality of the learner, best teaching practices should be determined based (among other things) upon the personality type of the instructor.", "authors": [{"name": "Karina Vashta Assiter", "affiliation": "Wentworth Institute of Technology, Boston, MA, USA"}], "tags": ["computer science education", "pedagogy", "personality types"]}]