[{"title": "Science, technology and innovation: a key driver for economic growth", "link": "https://dl.acm.org/doi/10.1145/1822090.1822091", "abstract": "In present times, science, technology, and innovation (STI) is indispensable for prosperity and welfare as a key instrument for sustainable, smart, and inclusive growth. The low levels of public R&D funds, industrial R&D, and demand for innovation alongside rising global competitive pressure on sectors with high exports in 2002 were overcome by the instigation of an STI impetus in Turkey. This presentation considers the major strategies that are determined and implemented in Turkey to make a leap forward in the field of STI. The launch of the conceptualization of Turkish Research Area (TARAL) in 2004 set into motion a mobilization with which the private and public sectors, together with NGOs, strategically focus and collaborate on R&D and innovation (RDI). As the first plan aimed to springboard the country towards the long-term expectations that are foreseen for the year 2023 based on Vision 2023, the National Science and Technology Policies Implementation Plan (BTP-UP) was established for the five year strategy timeframe of 2005-2010. BTP-UP (2005-2010) was instrumental in diversifying the policy mix that is being utilized by the TARAL actors for RDI capacity-building. Furthermore, programs for human resources for science and technology and science and society, in addition to defense and space research programs were put under the auspices of the Prime Minister.\nThe harmonization of top-down and bottom-up approaches combined with high-level leadership during the development phase of the national strategies gave rise to a swift mobilization of financial resources for TARAL and paved the way for the realization of triggering mechanisms, which include Industrial R&D and innovation grants, R&D tax incentives, and R&D and innovation-based public supply. The swift STI impetus towards becoming an ever-more dynamic system towards TARAL objectives indicate that Turkey is taking fast-paced strides to reach the major targets of raising Gross Domestic Expenditure on R&D to 2% of GDP and full-time equivalent R&D personnel to 150,000 by 2013.", "authors": [{"name": "Nüket Yeti_", "affiliation": "Tübitak, Ankara, Turkey"}], "tags": ["sti for economic growth"]}, {"title": "Who's missing from the room", "link": "https://dl.acm.org/doi/10.1145/1822090.1822092", "abstract": "This interactive session will provide a brief overview of the gender diversity situation including directions and potential best practices. Did you ever wonder why there are only 18% women studying computing in the US but 50% in many Middle Eastern countries? Where else are there women in the classroom and do they continue equal representation in the workforce? From the work in the United States; the current studies begun in Brazil; and brief overview of other countries, why are certain places successful in certain levels but not at others? What are the lessons we can learn from our neighbors? It is hoped that the audience will provide information about their particular countries and ask provocative questions to the audience at large.", "authors": [{"name": "Jane Prey", "affiliation": "Microsoft Research, Redmond, USA"}], "tags": ["gender diversity", "women in computing"]}, {"title": "Session details: Course design", "link": "https://dl.acm.org/doi/10.1145/3251953", "abstract": "No abstract available.", "authors": [{"name": "Don Goelman", "affiliation": "Villanova University"}], "tags": []}, {"title": "Challenges with teaching HCI early to computer students", "link": "https://dl.acm.org/doi/10.1145/1822090.1822094", "abstract": "The introductory course on human-computer interaction (HCI) and usable systems, taught early for the computer science and computer engineering education programs, has suffered from bad course evaluations. To investigate the students' beliefs and values in relation to the subject matter and the course, focus groups were used. The results indicate challenges with a lack of maturity and motivation among the students and that they wrongly perceive the subject matter as trivial. An approach for dealing with the challenges in the form of a course re-design is presented and implemented. The evaluation of the new course showed that it worked well and was greatly appreciated.", "authors": [{"name": "Johan Aberg", "affiliation": "Linkopings universitet, Linkoping, Sweden"}], "tags": ["usable systems", "usability", "human-computer interaction", "education"]}, {"title": "Service learning in introductory computer science", "link": "https://dl.acm.org/doi/10.1145/1822090.1822095", "abstract": "Academic service-learning (ASL) focuses on clearly aligning course learning objectives with community needs and has evolved into a highly effective pedagogical approach across the spectrum of disciplines and institutional types. Unfortunately, there are not many examples of its use in computer science. If service learning is incorporated into computer science, it is generally in the upper level courses where students have a larger skill set. This paper presents an academic service-learning approach in an introductory computer science course. This is important on multiple fronts. With the declining enrollments, especially among females, coupled with students' desire to make a difference in their world, we need to insert this pedagogical approach as early into the curriculum as possible. We will show an example of what can be done in an introductory course and discuss the positive effects on female enrollments.", "authors": [{"name": "Mathew Johnson", "affiliation": "Siena College, Loudonville, NY, USA"}, {"name": "Mary Anne L. Egan", "affiliation": "Siena College, Loudonville, NY, USA"}], "tags": ["CS1", "service learning", "gender gap in computing", "undergraduate projects"]}, {"title": "From phenomenography study to planning teaching", "link": "https://dl.acm.org/doi/10.1145/1822090.1822096", "abstract": "A phenomenographic study uncovers variations in the way that the subjects are aware of a phenomenon. In the categories of description that represent the variations in awareness there are features that, through their variation, define the characteristics of the categories. Teaching seeks to foster a change in the way that the learner is aware of a phenomenon through opening up a space of learning. This paper outlines the way that the outcome spaces from a phenomenographic study can be used to plan a teaching programme that utilises variations in the features. It discusses a strategy for teaching programming based on a phenomenographic study of practitioner conceptions of an object-oriented program. The strategy covers features related to the nature of an object-oriented program.", "authors": [{"name": "Errol Thompson", "affiliation": "University of Birmingham, Birmingham, United Kingdom"}], "tags": ["object-oriented programming", "teaching strategy", "phenomenography"]}, {"title": "Session details: Software tools", "link": "https://dl.acm.org/doi/10.1145/3251954", "abstract": "No abstract available.", "authors": [{"name": "Guido Rößling", "affiliation": "Technical University of Darmstadt"}], "tags": []}, {"title": "The SOM family: virtual machines for teaching and research", "link": "https://dl.acm.org/doi/10.1145/1822090.1822098", "abstract": "This paper introduces the SOM (Simple Object Machine) family of virtual machine (VM) implementations, a collection of VMs for the same Smalltalk dialect addressing students at different levels of expertise. Starting from a Java-based implementation, several ports of the VM to different programming languages have been developed and put to successful use in teaching at both undergraduate and graduate levels since 2006. Moreover, the VMs have been used in various research projects. The paper documents the rationale behind each of the SOM VMs and results that have been achieved in teaching and research.", "authors": [{"name": "Stefan Marr", "affiliation": "Vrije Universiteit Brussel, Brussels, Belgium"}, {"name": "Arvid Heise", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Michael Haupt", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Matthias Kleine", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Arne Bergmann", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Tobias Pape", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Gregor Gabrysiak", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Robert Hirschfeld", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Robert Krahn", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}], "tags": ["virtual machine", "teaching", "research", "architecture"]}, {"title": "JavaSpaces NetBeans: a linda workbench for distributed programming course", "link": "https://dl.acm.org/doi/10.1145/1822090.1822099", "abstract": "In this paper we introduce the JavaSpaces NetBeans IDE (JSN) which integrates the JavaSpaces technology, an implementation of Linda principles in Java, with the NetBeans IDE. JSN is a didactic tool for practical assignments during distributed programming courses. It hides advanced aspects of JavaSpaces configuration and lets students focus on interprocess coordination. An important component of JSN is a distributed debugger which can help to make concurrent programming classes easier to understand and more compelling.", "authors": [{"name": "Jacek Sroka", "affiliation": "University of Warsaw, Warsaw, Poland"}, {"name": "Magdalena Dukielska", "affiliation": "Google Switzerland GmbH, Zurich, Switzerland"}], "tags": ["distributed debugger", "distributed programming", "linda", "netbeans", "integrated development environment", "javaspaces"]}, {"title": "Enbug: when debuggers go bad", "link": "https://dl.acm.org/doi/10.1145/1822090.1822100", "abstract": "We have developed a tool, enbug, that intentionally induces errors into software in a controlled fashion. The robustness of students' code can be challenged by presenting exotic failure scenarios for testing, without Herculean efforts on the part of teaching assistants or instructors. Enbug also has applications in computer security and secure software courses, by being able to inject specific flaws into existing software for students to locate and exploit. The implementation of enbug is an example of tool reuse, through the automated (ab)use of a debugger.", "authors": [{"name": "Daniel Medeiros Nunes de Castro", "affiliation": "University of Calgary, Calgary, AB, Canada"}, {"name": "John Aycock", "affiliation": "University of Calgary, Calgary, AB, Canada"}, {"name": "David Williams-King", "affiliation": "University of Calgary, Calgary, AB, Canada"}], "tags": ["debuggers", "testing", "aspect-oriented programming", "education"]}, {"title": "Session details: Diversity", "link": "https://dl.acm.org/doi/10.1145/3251955", "abstract": "No abstract available.", "authors": [{"name": "Yaakov Varol", "affiliation": "University of Nevada Reno"}], "tags": []}, {"title": "A sub-saharan comparative study of university students' attitudes towards computer programming", "link": "https://dl.acm.org/doi/10.1145/1822090.1822102", "abstract": "Previous research conducted by the author investigated the socio-political backgrounds of South African female students studying computer-related university programmes and found that socio-political factors, in particular the role of a dominant female household head and aggressive governmental affirmative action, had had a significant effect on the girls' levels of confidence and subsequently on their decision to study computer-related courses. Based on this insight, the researcher undertook to look further into gender diversity with respect to self-perceived general computer confidence and self-perceived ability to program a computer. An investigation into gender differences in students studying computer programming courses at her university has now been followed by an investigation into students from very similar disadvantaged socio-economic backgrounds from two other sub-Saharan universities in Namibia and Tanzania. The results of the survey confirm that there were more gender similarities than differences in these students' general computer self-efficacy and their confidence in their programming ability. However, there were significant differences in the female and male students' perceptions of computing gender stereotyping.", "authors": [{"name": "Cecille J. Marsh", "affiliation": "Walter Sisulu University, East London, South Africa"}], "tags": ["computer programming", "gender and computing", "gender stereotyping", "computer self-efficacy"]}, {"title": "Creating digital divas: scaffolding perception change through secondary school and university alliances", "link": "https://dl.acm.org/doi/10.1145/1822090.1822103", "abstract": "Over the last 20 years much has been done to encourage female students to choose computing courses and computing careers. Some instances of positive effects have been reported, yet the proportional disparity in gender in this discipline continues to grow. This paper reports on a program called 'Digital Divas'. Digital Divas aims to scaffold positive perceptions around computing in the early years of secondary school by involving female students in upbeat computing experiences over a semester. It introduces university undergraduates to the secondary classroom to provide informal role models and mentors, as well as interactions with young computing professionals. This classroom environment enables computer applications to be more strongly linked with future careers. The commitment to a semester length unit was influential in changing perceptions about girls and computing, and the program was supported by the wider school community. We posit that this type of curriculum intervention is needed and has the potential to build technical human capital in female students.", "authors": [{"name": "Annemieke Craig", "affiliation": "Deakin University, Geelong, Australia"}, {"name": "Julie Fisher", "affiliation": "Monash University, Caulfield, Australia"}, {"name": "Helen Forgasz", "affiliation": "Monash University, Clayton, Australia"}, {"name": "Catherine Lang", "affiliation": "Swinburne University of Technology, Hawthorn, Australia"}], "tags": ["gender and diversity", "student attitudes", "k-12 education"]}, {"title": "Inspiring women undergraduates", "link": "https://dl.acm.org/doi/10.1145/1822090.1822104", "abstract": "This paper describes the conception, motivation, organization, and evaluation of a national, one-day event for women students of computing: the BCSWomen Lovelace Colloquium. The aim of this paper is to demonstrate that such events have value for women students of computing. We hope to show that through introducing these undergraduate women to high profile role models we can inspire them, and that through providing the students with a forum for presenting their own work, we can be inspired by them ourselves. We believe this is a successful and economical model for an event which could be re-used in other countries or regions.", "authors": [{"name": "Roger D. Boyle", "affiliation": "University of Leeds, Leeds, United Kingdom"}, {"name": "Hannah M. Dee", "affiliation": "INPG, Grenoble, France"}], "tags": ["motivation", "women in computing", "gender issues"]}, {"title": "Session details: Curriculum issues", "link": "https://dl.acm.org/doi/10.1145/3251956", "abstract": "No abstract available.", "authors": [{"name": "Michael Kölling", "affiliation": "University of Kent"}], "tags": []}, {"title": "Analysis of computer science related curriculum on LDA and Isomap", "link": "https://dl.acm.org/doi/10.1145/1822090.1822106", "abstract": "A good curriculum is crucial for a successful university education. When developing a curriculum, topics, such as natural science, informatics, and so on are set first, course syllabi are written accordingly. However, the topics actually by the courses are not guaranteed to be identical to the initially set topics. To find out if the actual topics are covered by the developed course syllabi, we developed a method of systematically analyzing syllabi that uses latent Dirichlet allocation (LDA) and Isomap. We applied this method to the syllabi of MIT and those of the Open University, and verified that the method is effective.", "authors": [{"name": "Takayuki Sekiya", "affiliation": "Information Technology Center, the University of Tokyo, 3-8-1 Komaba, Meguro, Tokyo, Japan "}, {"name": "Kazunori Yamaguchi", "affiliation": "Information Technology Center, the University of Tokyo, 3-8-1 Komaba, Meguro, Tokyo, Japan "}, {"name": "Yoshitatsu Matsuda", "affiliation": "Department of Integrated Information Technology, Aoyama Gakuin University, 5-10-1 Fuchinobe, Sagamihara, , Japan "}], "tags": ["isomap", "curriculum analysis", "curriculum", "syllabus", "LDA"]}, {"title": "Individual and group seminars and workshops in the computer science curriculum", "link": "https://dl.acm.org/doi/10.1145/1822090.1822107", "abstract": "The Open University of Israel (OUI) is an institution of higher learning which has an open admission policy and is based primarily on distance learning. The OUI offers several Computer Science programs. In order to complete the requirements in each of the undergraduate CS programs, the students are required to take at least one workshop or seminar. The aim of the seminar/workshop is to introduce students to advanced CS theoretical or practical topics. Students investigate an advanced topic, prepare and submit a final paper or project, and present their study in a lecture to faculty members and students.\nWe detected a problem that a relatively large number of students fail to complete the seminar/workshop requirement. In an attempt to deal with this problem, we conducted a study in order to better understand the reasons for this failure. In the paper we present some statistics regarding the completion of the seminars/workshop requirement, the correlation between this completion and other factors, such as: the number of credits earned by the student and the average grade achieved by the student before enrolling in the seminar/workshop.", "authors": [{"name": "Tamar Benaya", "affiliation": "The Open University of Israel, Raanana, Israel"}, {"name": "Daphna Shahak", "affiliation": "The Openu University of Israel, Raanana, Israel"}, {"name": "Ela Zur", "affiliation": "The Openu University of Israel, Raanana, Israel"}, {"name": "Maya Herman", "affiliation": "The Open University of Israel, Raanana, Israel"}], "tags": ["education", "workshops", "seminars", "computer science"]}, {"title": "Developing verification-driven learning cases", "link": "https://dl.acm.org/doi/10.1145/1822090.1822108", "abstract": "We have proposed a verification-driven learning model that facilitates students' involvement in real-world computing tasks starting from their early computing courses and continuing throughout their entire computing studies. The initial purpose of the verification-driven learning model is to enrich the context of lessons, courses, and the CS programs, especially in the early stage of students' learning. Verification-driven learning cases can serve to supplement other teaching approaches such as process-oriented learning model. Students' independent practice of verification will encourage them to consider the real-world applications throughout the simulation.", "authors": [{"name": "Shireesha Tankashala", "affiliation": "University of New Orleans, New Orleans, LA, USA"}, {"name": "Aditya Kallem", "affiliation": "University of New Orleans, New Orleans, LA, USA"}, {"name": "Rushikesh Kale", "affiliation": "University of New Orleans, New Orleans, LA, USA"}, {"name": "Shengru Tu", "affiliation": "University of New Orleans, New Orleans, LA, USA"}, {"name": "Sehun James Oh", "affiliation": "University of New Orleans, New Orleans, LA, USA"}], "tags": ["verification-driven learning", "TDL", "software verification"]}, {"title": "Session details: Laboratory tools", "link": "https://dl.acm.org/doi/10.1145/3251957", "abstract": "No abstract available.", "authors": [{"name": "Barbara Owens", "affiliation": "Southwestern University"}], "tags": []}, {"title": "ComTest: a tool to impart TDD and unit testing to introductory level programming", "link": "https://dl.acm.org/doi/10.1145/1822090.1822110", "abstract": "Research has noticed that imparting TDD-like testing to an early computing curriculum is challenging because it increases technical and cognitive load for the students. This paper addresses the challenge with a software-based solution constructed to facilitate the process of writing tests. The solution allows using a compact while efficient syntax for formulating tests, writing tests into JavaDoc comments, thus close to the source code that implements intended functionalities, and automates the generation of actual test code. The constructed solution -- the ComTest tool -- has now been used in four introductory level programming course offerings. The paper presents the tool and concludes with initial lessons learned.", "authors": [{"name": "Jonne Itkonen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Vesa Lappalainen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Sami Kollanus", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Ville Isomöttönen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}], "tags": ["tools", "TDD", "unit testing", "education"]}, {"title": "SAMtool, a tool for deducing and implementing loop patterns", "link": "https://dl.acm.org/doi/10.1145/1822090.1822111", "abstract": "This paper presents a proposal aimed at active learning of iterative design in CS1. Two main contributions are made: first, a novel approach to tackle iterative algorithms design problems based on inductive reasoning, sequential access models and algorithmic schemes; second, a web tool called SAMTool (Sequential Access Model Tool) to support this approach. Students use SAMTool in three stages: (1) to obtain problem-dependent code to solve an iterative problem (2) to define an algorithmic scheme in a sequential access model; (3) to generate a program starting from a problem, an algorithmic scheme, a programming language and a sequence in the chosen programming language. The effectiveness of SAMTool as a tool to enhance learning has been demonstrated through empirical evaluation on a course with 114 undergraduate students. In a controlled study, programming students trained in the use of SAMTool were found to make fewer errors than a control group, which suggests that our approach helps students to construct iterative algorithms correctly.", "authors": [{"name": "José Luis Fernández Alemán", "affiliation": "Universidad de Murcia, Espinardo, Murcia, Spain"}, {"name": "Youssef Oufaska", "affiliation": "Universidad de Murcia, Espinardo, Murcia, Spain"}], "tags": ["programming", "web tool", "e-learning"]}, {"title": "PhidgetLab: crossing the border from virtual to real-world objects", "link": "https://dl.acm.org/doi/10.1145/1822090.1822112", "abstract": "Teaching pupils the ideas behind objects in programming languages can be difficult since these concepts are mostly abstract and not comprehensible at first sight. Etoys as a visual programming environment counters such issues by introducing visible objects and simple tiles for programming them. However, all of these objects can only be experienced virtually on the screen. This paper presents PhidgetLab, a programming environment for electronic components (Phidgets) realised on top of the Etoys environment. PhidgetLab helps crossing the border from virtual to real-world objects. Pupils interact with tangible objects that are seamlessly connected to the digital world. PhidgetLab was evaluated in a case study with 22 pupils, following the principles of the Design Thinking methodology and comprised the realisation of five prototypes within a short period of time.", "authors": [{"name": "Philipp Tessenow", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Lysann Kessler", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Michael Haupt", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Michael Perscheid", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Thomas Klingbeil", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Stephanie Platz", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Frank Schlegel", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}, {"name": "Robert Hirschfeld", "affiliation": "Hasso-Plattner-Institut, University of Potsdam, Potsdam, Germany"}], "tags": ["phidgetlab", "squeak", "etoys", "phidgets", "design thinking"]}, {"title": "Session details: Online learning", "link": "https://dl.acm.org/doi/10.1145/3251958", "abstract": "No abstract available.", "authors": [{"name": "Monica McGill", "affiliation": "Bradley University"}], "tags": []}, {"title": "LOMOLEHEA: learning object model for online learning based on the european higher education area", "link": "https://dl.acm.org/doi/10.1145/1822090.1822114", "abstract": "The European Higher Education Area (EHEA), currently under implementation, has forced universities to gradually change all their processes, both teaching and administrative. This has had a great impact on the associated technologies that support those processes. Therefore, the design and definition of all processes related to teaching online must be reviewed, and learning objects are no exception. Thus, in this article we present a proposal for a Learning Objects Model for Online Learning (LOMOLEHEA) based on the European Higher Education Area, which allows the implementation of the different levels of a learning object. We demonstrate that the use of an online course's content structure, favors the creation of learning objects with in didactic units, which in turn improves organization in so far as it is highly reusable. Therefore, it is important for teachers to be familiar with the use of structures or templates that support the use of didactic units and give a uniform pattern to the contents in learning management systems.", "authors": [{"name": "Felipe Cocón", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Madrid, Spain"}, {"name": "Eugenio Fernández", "affiliation": "Universidad de Alcalá, Alcalá de Henares, Madrid, Spain"}], "tags": ["metadata", "learning object modeling"]}, {"title": "Online education experiences: information technologies certificate program at METU", "link": "https://dl.acm.org/doi/10.1145/1822090.1822115", "abstract": "This study presents IDE_A-ITCP, a Turkish nationwide Information Technologies Certificate Program, which is based on synchronous and asynchronous communication methods over the Internet, offered by cooperation of the Middle East Technical University Computer Engineering Department and Continuing Education Center. This online certificate program started in May 1998 and is still active with its 13th group of participants. The program includes eight fundamental courses of the Computer Engineering Department curriculum and is comprised of four semesters spanning nine months. The main aim of this program is to train the participants in the IT field to meet the demands in the field of computer technologies in Turkey. In the present study, the history, infrastructure, and educational aspects of IDE_A are discussed in detail.", "authors": [{"name": "Özgür Kaya", "affiliation": "Middle East Technical University, Ankara, Turkey"}, {"name": "Ahmet Saçan", "affiliation": "Drexel University, Philadelphia, USA"}, {"name": "Erman Yükseltürk", "affiliation": "Middle East Technical University, Ankara, Turkey"}, {"name": "Adnan Yazici", "affiliation": "Middle East Technical University, Ankara, Turkey"}], "tags": ["computer engineering education", "online information technologies certificate program", "online education"]}, {"title": "Evaluation of automatic classroom capture for computer science education", "link": "https://dl.acm.org/doi/10.1145/1822090.1822116", "abstract": "Our research into automatic recording of the complete classroom experience has led to the development of many software systems, one of which captures an image stream of all content presented on a computer. We have just completed a first deployment of this computer capture system in which 3 separate courses were recorded for an entire semester with the content being presented to students within 24 hours of the class meeting time. This system has been envisioned as a component of a complete lecture capture system but a component with real value even when used as a stand alone. In this paper we discuss student feedback to this computer capture system, revision of system functionality, and thoughts on the usefulness of capturing computer content in computer science courses in general.", "authors": [{"name": "W. Richards Adrion", "affiliation": "University of Massachusetts, Amherst, MA, USA"}, {"name": "Paul E. Dickson", "affiliation": "Hampshire College, Amherst, MA, USA"}, {"name": "David T. Arbour", "affiliation": "University of Massachusetts, Amherst, MA, USA"}, {"name": "Amanda Gentzel", "affiliation": "Westminster College, New Wilmington, PA, USA"}], "tags": ["lecture recording", "indexing", "evaluation", "image processing", "automatic capture"]}, {"title": "Session details: Theoretical overtures", "link": "https://dl.acm.org/doi/10.1145/3251959", "abstract": "No abstract available.", "authors": [{"name": "Lillian Cassel", "affiliation": "Villanova University"}], "tags": []}, {"title": "Computer lab work on theory", "link": "https://dl.acm.org/doi/10.1145/1822090.1822118", "abstract": "This paper describes an attempt to introduce computer lab exercises on NP-completeness proofs in a class already containing computer lab exercises on algorithms and data structures. In the article we are interested in the answer of the following question: Can the students feel that their understanding of theoretical computer science is improved by performing a computer lab exercise on the subject?\nThe class is mandatory for students in a computer science program, and is taken by about 130 students each year. Theory of NP-completeness proofs with reductions has previous years been examined on an individual assignment with written solutions handed in and later explained orally by the student to a teacher. The new assignment is performed as a computer lab exercise where students are working in small groups of two. This exercise is placed before the individual assignment, and is examined first by running automated test cases and later by an oral presentation in lab to a teacher.\nAn improvement can be observed of the students' average results since the new assignment was introduced.\nThis is not enough to prove the benefit of using the new assignment. However, the responses to questionnaires at course evaluations show that almost all students think that the assignment really gave them better understanding of polynomial reductions in NP completeness proofs. The students' result on the new assignment corresponds closely to their results on the following individual assignment. Seemingly, the new assignment predicts accurately who is going to pass the following assignment.", "authors": [{"name": "Viggo Kann", "affiliation": "School of Computer Science and Communication, KTH, Stockholm, Sweden"}, {"name": "Emma Enström", "affiliation": "School of Computer Science and Communication, KTH, Stockholm, Sweden"}], "tags": ["computer lab work", "reductions", "learning theoretical computer science"]}, {"title": "Tail recursive programming by applying generalization", "link": "https://dl.acm.org/doi/10.1145/1822090.1822119", "abstract": "The design of many tail recursive algorithms can involve thinking about the status of variables and parameters, and how these change with execution flow. In other words, tail recursion is closely related to iteration and imperative programming. However, it is possible to derive tail recursive functions by exclusively using concepts inherent in recursion, such as declarative programming, induction, or problem decomposition. This paper proposes a simple methodology for designing tail recursion functions by using a declarative approach and the concept of function generalization. We have carried out an evaluation of the technique with second and third-year computer science students. Results suggest that this new point of view improves students' ability to design tail recursive programs, helps them understand the distinction between the imperative and declarative paradigms, and may reinforce their programming skills in general. Furthermore, students found the methodology easy to learn and apply, simpler than more sophisticated formal methods, and described it as fast and methodic or mechanical, as it involves a sequence of well-defined steps.", "authors": [{"name": "Manuel Rubio-Sánchez", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}], "tags": ["generalization", "tail recursion", "recursion", "formal methods", "nested recursion", "design of algorithms"]}, {"title": "Mental models of recursion: investigating students' understanding of recursion", "link": "https://dl.acm.org/doi/10.1145/1822090.1822120", "abstract": "Mental models of recursion provide some idea into a student's understanding of recursion. However there has been concern regarding whether viable trace mental models of recursion show students' true understanding of recursion. We have conducted an investigation to further examine the understanding of recursion of students with viable trace mental models. The investigation looked at students' understanding of the termination of a recursive function, their descriptive mental models and their ability to generate a recursive function. This research provides evidence to show that trace methods are essentially mechanical processes that can allow students with little understanding of recursion to correctly evaluate a recursive function but that students do not fully understand recursion and in particular have difficulties with the passive flow. Based on the results of the study, this paper discusses possible changes that can be made to our teaching in order to more eectively teach recursion to first year students.", "authors": [{"name": "Ian Sanders", "affiliation": "University of the Witwatersrand, Johannesburg, South Africa"}, {"name": "Tamarisk Lurlyn Scholtz", "affiliation": "University of the Witwatersrand, Johannesburg, South Africa"}], "tags": ["mental models", "recursion"]}, {"title": "Session details: Reflections", "link": "https://dl.acm.org/doi/10.1145/3251960", "abstract": "No abstract available.", "authors": [{"name": "Ulrich Kiesmueller", "affiliation": "University of Erlangen-Nuremberg"}], "tags": []}, {"title": "Comparison of OOP first and OOP later: first results regarding the role of comfort level", "link": "https://dl.acm.org/doi/10.1145/1822090.1822122", "abstract": "This paper is the second part of an empirical comparison of objects-first vs. objects-later. Here we focus on the role of the emotional climate, connected to the different approaches. The study was carefully designed to align the two approaches so that the comparison is focused on the main difference; that is the different sequence in which topics are taught: object oriented topics from the beginning or not.\nThe study with duration of one year was carried out in a secondary school. Both groups showed a high comfort level, the same increase in learning gain, but perceived the difficulty of topics differently. We discuss pedagogical implications.", "authors": [{"name": "Carsten Schulte", "affiliation": "Freie Universität Berlin, Berlin, Germany"}, {"name": "Albrecht Ehlert", "affiliation": "OSZ Informations- und Medizintechnik, Berlin, Germany"}], "tags": ["comfort level", "emotional climate", "objects first", "empirical study", "objects later", "CS ED research", "pedagogy"]}, {"title": "A study on student performance in first year CS courses", "link": "https://dl.acm.org/doi/10.1145/1822090.1822123", "abstract": "Novice students often find it difficult to learn programming. Consequently this leads to high failure and high dropout rates. We must ask ourselves if these problems are caused by specific programming issues or if there are other courses that struggle with the same problem. This paper presents a study that involved Computer Science freshmen. The study tried to evaluate the connection of academic results between the first programming course and other first year courses. Subsequently the idea was to encourage teachers to dialogue about teaching and learning strategies concerning courses where the students' results are related, in order to share problems and solutions. Students were also submitted to a learning style test, in order to identify the influence of its dimensions in the obtained results.", "authors": [{"name": "António José Mendes", "affiliation": "University of Coimbra, Pólo II, 3030 Coimbra, Portugal"}, {"name": "Anabela Jesus Gomes", "affiliation": "Engineering Institute of Coimbra , Rua Pedro Nunes, 3030 Coimbra , Portugal"}], "tags": ["learning difficulties", "programming learning", "learning styles"]}, {"title": "Self-predicted and actual performance in an introductory programming course", "link": "https://dl.acm.org/doi/10.1145/1822090.1822124", "abstract": "Students in a large introductory programming course were asked twice to predict their scores on the final exam: once at the beginning of a six-week module, and once at the end. In between, students in only one of the two lecture streams recorded subjective confidence in their answers to individual questions on weekly quizzes. Students' predictions were moderately correlated with their scores. Students who attended more quizzes had not only higher exam scores, but improved their predictions more than those who attended fewer quizzes. Practice recording confidence on individual quiz questions did not yield significantly more improvement in exam predictions. Several findings from previous work are confirmed, including that women were significantly more underconfident than men.", "authors": [{"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "John Hamer", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Helen C. Purchase", "affiliation": "University of Glasgow, Glasgow, Scotland Uk"}, {"name": "Dana B. Dahlstrom", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["gender", "confidence", "learning", "metacognition"]}, {"title": "Session details: Computational thinking", "link": "https://dl.acm.org/doi/10.1145/3251961", "abstract": "No abstract available.", "authors": [{"name": "Annemieke Craig", "affiliation": "Deakin University"}], "tags": []}, {"title": "A framework for computational thinking across the curriculum", "link": "https://dl.acm.org/doi/10.1145/1822090.1822126", "abstract": "We describe a framework for implementing computational thinking in a broad variety of general education courses. The framework is designed to be used by faculty without formal training in information technology in order to understand and integrate computational thinking into their own general education courses. The framework includes examples of computational thinking in a variety of general education courses, as well as sample in-class activities, assignments, and other assessments for the courses. The examples in the different courses are related and differentiated using categories taken from Denning Great Principles of Computing, so that similar types of computational thinking appearing in different contexts are brought together. This aids understanding of the computational thinking found in the courses and provides a template for future work on new course materials. Specific examples of computational thinking in the design category are provided in the context of three distinct courses.", "authors": [{"name": "Ljubomir Perković", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Sungsoon Hwang", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Joshua Jones", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Amber Settle", "affiliation": "DePaul University, Chicago, IL, USA"}], "tags": ["great principles of computing", "computational thinking", "general education"]}, {"title": "Helping students build a mental model of computation", "link": "https://dl.acm.org/doi/10.1145/1822090.1822127", "abstract": "Introductory computer science classes are known for having a high attrition rate. Some authors believe this is due to students' difficulties in establishing a mental model of computation. We present a tool designed to assist students in actively building a mental model of computation, and evaluate its use in an introductory programming class. We show use of the tool leads to 40% increase in course completion and that the students believe the tool helps them understand programming.", "authors": [{"name": "Steven Kollmansberger", "affiliation": "South Puget Sound Community College, Olympia, WA, USA"}], "tags": ["online tutoring", "active learning", "program tracing"]}, {"title": "File references, trees, and computational thinking", "link": "https://dl.acm.org/doi/10.1145/1822090.1822128", "abstract": "We study student understanding of the use of a tree structure in the context of an introductory web development course. In particular, we analyze student answers as they use a tree structure to construct file references in web pages. More fundamentally, our study initiates a bottom-up study of computational thinking by identifying the computational thinking mistakes that students make when they are learning resource referencing for web development. Our preliminary results suggest that students do not necessarily learn abstract concepts (like trees) and abstract rules of reasoning (composing relative and absolute tree paths) by just working with folders and composing file references alone.", "authors": [{"name": "Ljubomir Perković", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Amber Settle", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Craig S. Miller", "affiliation": "DePaul University, Chicago, IL, USA"}], "tags": ["file referencing", "computational thinking", "tree structures", "web development"]}, {"title": "Session details: Social networking", "link": "https://dl.acm.org/doi/10.1145/3251962", "abstract": "No abstract available.", "authors": [{"name": "James Paterson", "affiliation": "Glasgow Caledonian University"}], "tags": []}, {"title": "Effect of media richness on user acceptance of blogs and podcasts", "link": "https://dl.acm.org/doi/10.1145/1822090.1822130", "abstract": "Effective communication has long been recognised as a key element in problem solving and decision making within and among organisations including educational institutions. With the advent of Web 2.0 technologies, the communication choices have also been expanded. Media Richness Theory (MRT) has long been used to examine the effect of traditional and new media on decision making. However, less is known about media richness of Web 2.0 technologies. This paper attempts to examine the media richness capabilities of two popular Web 2.0 technologies, blogs and podcasts, and its effect on user acceptance of these two technologies in Computer Science education. A theoretical model is presented using MRT and technology acceptance model (TAM). Students enrolled in Bachelor / Master of Computer Science programs participated in an online survey that helped in evaluating the proposed model. The study findings confirm the significant effect of media richness on user acceptance of blogs and podcasts but contradict MRT as rich medium (podcast) exerted weaker influence on user acceptance as compared to lean medium (blog).", "authors": [{"name": "Yun Yang", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}, {"name": "Nauman Saeed", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}, {"name": "Suku Sinnappan", "affiliation": "Swinburne University of Technology, Melbourne, Australia"}], "tags": ["CS education", "MRT", "TAM", "blogs", "podcasts", "PLS"]}, {"title": "SNAG: using social networking games to increase student retention in computer science", "link": "https://dl.acm.org/doi/10.1145/1822090.1822131", "abstract": "One of the primary goals of attending academic conferences is professional networking, yet even though this interaction can increase one's feeling of community within a field, conference attendees are not interacting as much as they could be. Similarly, it's known that students who do not feel as if they are part of a larger academic community are less likely to participate in extracurricular activities and organizations, lowering retention rates. To combat both of these problems, we present SNAG (Social Networking and Games). SNAG is a suite of mobile and Internet games which aim to facilitate social networking between members of a group, and can be used in either a conference setting or within a university. This paper focuses on one specific game, Snag'em, and discusses our evaluation for our SNAG games.", "authors": [{"name": "Katelyn Doran", "affiliation": "UNC Charlotte, Charlotte, NC, USA"}, {"name": "Tiffany Barnes", "affiliation": "UNC Charlotte, Charlotte, NC, USA"}, {"name": "Sandhya Rani Charugulla", "affiliation": "UNC Charlotte, Charlotte, NC, USA"}, {"name": "Andrew Hicks", "affiliation": "UNC Charlotte, Charlotte, NC, USA"}, {"name": "Eve Powell", "affiliation": "UNC Charlotte, Charlotte, NC, USA"}, {"name": "Samantha L. Finkelstein", "affiliation": "UNC Charlotte, Charlotte, NC, USA"}], "tags": ["games", "social networking", "diversity"]}, {"title": "Developing tools to encourage reflection in first year students blogs", "link": "https://dl.acm.org/doi/10.1145/1822090.1822132", "abstract": "The pedagogical basis of a project aimed at encouraging students to engage in reflective activities using blogs to document their learning experiences is described. It also gives some details of the practical implementation of this work. Activities which scaffold the process are discussed, together with a description of some difficulties that arise when the informal aspects of blogging conflict with the desire to use the reflective work as formal evidence of learning in a personal development portfolio.", "authors": [{"name": "Roger McDermott", "affiliation": "The Robert Gordon University, Aberdeen, United Kingdom"}, {"name": "Gordon Eccleston", "affiliation": "The Robert Gordon University, Aberdeen, United Kingdom"}, {"name": "Garry Brindley", "affiliation": "The Robert Gordon University, Aberdeen, United Kingdom"}], "tags": ["PDP", "reflection", "blogs", "graduate attributes", "feedback", "collaborative learning"]}, {"title": "Session details: Educational quality", "link": "https://dl.acm.org/doi/10.1145/3251963", "abstract": "No abstract available.", "authors": [{"name": "Roger Boyle", "affiliation": "University of Leeds"}], "tags": []}, {"title": "Measuring of and reacting to learners' progress in logic programming courses", "link": "https://dl.acm.org/doi/10.1145/1822090.1822134", "abstract": "To be able to support learners adequately in logic programming courses, it is crucial to know about their current level of competency during the learning process. Based on this, the course can be adapted and individual support can be given. In a traditional lecture the learning process is often a black box for the teacher, so there is no possibility to incorporate it. This paper describes how an architecture consisting of an online programming environment, private blogs and a reporting application can be used to solve the problem and shows how it was applied in the context of university lectures.", "authors": [{"name": "Stefan Friese", "affiliation": "University of Duisburg-Essen, Essen, Germany"}], "tags": ["learning process evaluation", "reflection", "programming language education"]}, {"title": "Student self-assessment in a programming course using bloom's revised taxonomy", "link": "https://dl.acm.org/doi/10.1145/1822090.1822135", "abstract": "This study presents a simple student self-assessment tool that can be used to motivate learning and to follow a student's progress. The tool is a survey questionnaire that uses Bloom's Revised Taxonomy as the base for its scale. The results show that students can place their knowledge along the taxonomy-based scale quite well, and they feel that it could help their learning. It also provides the teacher with a more objective basis for measuring the level of knowledge gained than the general scales. The scale is designed for a programming course, but with modifications it can be used in other classes too.", "authors": [{"name": "Kari Smolander", "affiliation": "Lappeenranta University of Technology, Lappeenranta, Finland"}, {"name": "Satu Alaoutinen", "affiliation": "Lappeenranta University of Technology, Lappeenranta, Finland"}], "tags": ["bloom's revised taxonomy", "self-assessment", "programming"]}, {"title": "Learning (through) recursion: a multidimensional analysis of the competences achieved by CS1 students", "link": "https://dl.acm.org/doi/10.1145/1822090.1822136", "abstract": "In this paper I will discuss an investigation intended to address the learning of recursion in a multidimensional perspective, where the dimensions correspond to different types of competence relevant to programming. One such dimension is the understanding of the computation model, that I have assessed under the methodology proposed by Goetschi et al. (2003). Moreover, I have tried to analyze and correlate other learning dimensions, such as the ability to establish relations in the problem domain, to deal with recursive structures, as well as to develop basic abstraction skills. One of my objectives is indeed to gain a better understanding of the major sources of difficulties that students face. In essence, my investigation lends further support to previous related findings on mental models. However, a consistent model of recursive computations, although implied by the ability to use recursion in problem-solving, does not seem to be sufficient for the achievement of higher-level skills.", "authors": [{"name": "Claudio Mirolo", "affiliation": "University of Udine, Udine, Italy"}], "tags": ["programming learning", "mental models", "recursion"]}, {"title": "Session details: Introductory courses", "link": "https://dl.acm.org/doi/10.1145/3251964", "abstract": "No abstract available.", "authors": [{"name": "Michal Armoni", "affiliation": "Weizmann Institute of Science"}], "tags": []}, {"title": "Using alice in CS1: a quantitative experiment", "link": "https://dl.acm.org/doi/10.1145/1822090.1822138", "abstract": "We present the results of a 2-semester study of using the 3-D graphical programming environment Alice to introduce programming fundamentals during the first two weeks of CS1.\nOne cohort of students was taught basic programming constructs via traditional pseudocode, while a second group used Alice. A student survey was collected, along with performance metrics on a common quiz and first exam.\nStudents using Alice scored lower than those taught with pseudocode on common performance metrics and responded less-favorably to Alice in a survey. Anecdotal evidence of using Alice with younger students was more positive.", "authors": [{"name": "Ryan Garlick", "affiliation": "University of North Texas, Denton, TX, USA"}, {"name": "Ebru Celikel Cankaya", "affiliation": "University of North Texas, Denton, TX, USA"}], "tags": ["CS0", "pedagogy", "alice", "retention", "CS1"]}, {"title": "An unusual CS 1 with high standards and confirming results", "link": "https://dl.acm.org/doi/10.1145/1822090.1822139", "abstract": "Our department has opted not to do the \"usual\" CS 1 course. We discuss the features of the resulting course, and how they are evaluated by our students. While several elements are unusual, evaluations have shown them to be very successful and popular with our students. We hope this report will inspire other educators to \"think outside the box in CS 1\".", "authors": [{"name": "Guido Rößling", "affiliation": "TU Darmstadt, Darmstadt, Germany"}, {"name": "Max Mühlhäuser", "affiliation": "TU Darmstadt, Darmstadt, Germany"}], "tags": ["java", "game programming", "moodle", "scheme", "CS1"]}, {"title": "Teaching abstraction in introductory courses", "link": "https://dl.acm.org/doi/10.1145/1822090.1822140", "abstract": "Abstraction is viewed as a key concept in computer science. It is not only an important concept but also one that is difficult to master. This paper focuses on the problems that novices experience when they first encounter this concept. Three assignments from introductory courses are analyzed, to understand why abstraction is difficult for novices. This analysis leads to a number of guidelines that can be used by instructors to support novices learning abstraction.", "authors": [{"name": "Betsy van Dijk", "affiliation": "University of Twente, Enschede, Netherlands"}, {"name": "Herman Koppelman", "affiliation": "Open University in the Netherlands, Heerlen, Netherlands"}], "tags": ["abstraction level", "recursion", "abstraction", "computer science", "pedagogy"]}, {"title": "Session details: Cyber learning", "link": "https://dl.acm.org/doi/10.1145/3251965", "abstract": "No abstract available.", "authors": [{"name": "Mohamad Neilforoshan", "affiliation": "Stockton College"}], "tags": []}, {"title": "Reflecting on online learning designs using observed behavior", "link": "https://dl.acm.org/doi/10.1145/1822090.1822142", "abstract": "Educators, as designers of resources, experiences, and environments for learning, make judgments and assumptions about learners and how design choices will affect them. While some uncertainties can be resolved through the design process, others must be addressed experientially, through action (implementation or enactment) punctuated by reflection. Online learning designs, since they are often motivated by broad, asynchronous accessibility, offer both unique challenges and opportunities for design reflection. The challenges tend to concern greater diversity among larger learner populations, and therefore a need to account for greater potential variance in learner experiences. The opportunities arise from the nature of the medium, where use can be passively observed through interactions between learners and the learning environment. In this paper, we address the use of observed behavior as a lens for design reflection on a large corpus of online learning resources focusing on cybersecurity for adult learners.", "authors": [{"name": "Carin Neitzel", "affiliation": "Vanderbilt University, Nashville, TN, USA"}, {"name": "Julie Johnson", "affiliation": "Vanderbilt University, Nashville, TN, USA"}, {"name": "Larry Howard", "affiliation": "Vanderbilt University, Nashville, TN, USA"}], "tags": ["inquiry-based learning", "self-regulated learning", "design reflection", "instructional design patterns", "learning environments"]}, {"title": "Cyberspace meets brick and mortar: an investigation into how students engage in peer to peer feedback using both cyberlearning and physical infrastructures", "link": "https://dl.acm.org/doi/10.1145/1822090.1822143", "abstract": "Cyberlearning infrastructures are increasingly being integrated into physical classrooms and are often used by online classes as an outright replacement for the physical classroom. In Spring 2009, The Educational Game Design Class, taught at the University of Colorado Boulder, employed a cyberlearning infrastructure enabling students to run and even download classmate assignment submissions before the homework deadline. This cyberlearning infrastructure, called the Scalable Game Design Arcade, also allowed students to give feedback on other students' assignments. Analysis of data from the Scalable Game Design Arcade indicates that students used the online infrastructure to play and appraise fellow students' games. Interestingly however, data suggests that most students preferred to give feedback verbally in-person during class; data also indicates that in-class feedback was the most effective in terms of getting students to improve and resubmit their assignments.", "authors": [{"name": "Ashok R. Basawapatna", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Alexander Repenning", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}], "tags": ["peer to peer interaction", "cyberlearning infrastructure", "physical classroom", "scalable game design", "programming education", "computational thinking", "open classroom", "traditional learning", "agentsheets", "scalable game design arcade"]}, {"title": "e-Lectures to support blended instruction in multimedia programming course", "link": "https://dl.acm.org/doi/10.1145/1822090.1822144", "abstract": "This study explores students' attitudes regarding the use of e-lectures for introducing a blended mode of instruction in a multimedia programming course. In the context of a sixth-month course we supplemented students with e-lectures, available asynchronously from the course website. Most e-lectures presented multimedia programming techniques already been taught in the laboratory; but two of them presented more advanced topics completely new to the students. The results of a questionnaire-based evaluation showed that the students were quite positive about the use of e-lectures as a supporting material to the traditional laboratory course. The e-lectures helped them to better comprehend multimedia programming concepts and procedures, and to develop their projects successfully. However, the e-lectures on new subjects did not support all students effectively to advance their project. Also, half of the students stated that that they would still prefer to attend the traditional face-to-face laboratory sessions than being supported from distance using e-lectures as primary learning material. Developing e-lectures may have certain benefits for programming courses, however shifting such a course toward a blended mode entails more complex issues that demand further exploration.", "authors": [{"name": "Vasiliki Ragazou", "affiliation": "Aristotle University of Thessaloniki , Thessaloniki , Greece"}, {"name": "Stavros Demetriadis", "affiliation": "Aristotle University of Thessaloniki , Thessaloniki , Greece"}, {"name": "Maria Amarlariotou", "affiliation": "Aristotle University of Thessaloniki , Thessaloniki , Greece"}, {"name": "Anastasios Karakostas", "affiliation": "Aristotle University of Thessaloniki , Thessaloniki , Greece"}], "tags": ["blended learning", "e-lectures", "multimedia programming"]}, {"title": "Session details: Robots", "link": "https://dl.acm.org/doi/10.1145/3251966", "abstract": "No abstract available.", "authors": [{"name": "Errol Thompson", "affiliation": "University of Birmingham"}], "tags": []}, {"title": "Robotics and intelligent systems for social and behavioral science undergraduates", "link": "https://dl.acm.org/doi/10.1145/1822090.1822146", "abstract": "In this article, we share our experiences offering an original course entitled Intelligent Systems targeted at undergraduate social and behavioral science students. Intelligent Systems provides a rigorous introduction to robotics and surveys selected topics in artificial intelligence. This course is tailored to students with little mathematical background and no programming experience. We offer best practices and information from successful course components and ideas for tailoring course content to social and behavioral science students.\nThe motivation for this course comes from the wide interdisciplinary appeal of robotics and artificial intelligence. They have been leveraged to improve recruitment to the major and to expose students in other disciplines to computational thinking. However, no offerings of CS0 that exclusively cater to the large social and behavioral science population are available that focus on intelligent systems. Robots and AI systems are affordable and accessible to this group of students. We propose our solution to this problem and argue for offering multiple, interdisciplinary CS0 offerings.", "authors": [{"name": "Tom Armstrong", "affiliation": "Wheaton College, Norton, MA, USA"}], "tags": ["interdisciplinary", "recruitment", "robotics", "curricula", "multidisciplinary", "artificial intelligence", "social and behavioral sciences", "intelligent systems", "retention"]}, {"title": "Creativity and intrinsic motivation in computer science education: experimenting with robots", "link": "https://dl.acm.org/doi/10.1145/1822090.1822147", "abstract": "This paper describes our teaching experiment at the University of Helsinki, where the aim was to investigate a possibility to provide a learning environment supporting a combination of creativity, intrinsic motivation and the use of robots to bring constructionism into computer science (CS) education. To put the ideas into practice we developed a pilot course targeted at intermediate-level CS students. The learning objectives were not strict, but instead the attendees could participate in setting them and also take part in designing future uses of robots in CS1 and CS2 courses. There was no teaching in the traditional sense, but instead we arranged workshops based on creativity-enhancing working methods.", "authors": [{"name": "Matti Lattu", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Mikko Apiola", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Tomi A. Pasanen", "affiliation": "Tumaini University, Iringa University College, Iringa, Tanzania"}], "tags": ["open learning environment", "motivation", "robotics", "constructionism", "creativity"]}, {"title": "Using personal robots in CS1: experiences, outcomes, and attitudinal influences", "link": "https://dl.acm.org/doi/10.1145/1822090.1822148", "abstract": "We employed a context-based teaching strategy using personal robots in an introductory computer science course. The purpose of this paper is twofold. First we describe our experiences using the IPRE (Institute for Personal Robots in Education) program to teach CS1. We then present our results from an initial study of its effectiveness. We compare the same course taught with and without the use of robots. We found that students in the robot section spent extra time on class-related work that was not required. This work was self-directed and demonstrates increased intrinsic motivation and interest.", "authors": [{"name": "Stefanie A. Markham", "affiliation": "Georgia State University, Atlanta, GA, USA"}, {"name": "K. N. King", "affiliation": "Georgia State University, Atlanta, GA, USA"}], "tags": ["motivation", "education", "personal robot", "CS1", "python"]}, {"title": "Session details: Avant garde", "link": "https://dl.acm.org/doi/10.1145/3251967", "abstract": "No abstract available.", "authors": [{"name": "Catherine Lang", "affiliation": "Swinburne University of Technology"}], "tags": []}, {"title": "What did qubits ever do for me: an answer for CS2 students", "link": "https://dl.acm.org/doi/10.1145/1822090.1822150", "abstract": "We show how to teach and motivate small quantum computer programs as a supplemental topic in a CS2 data structures class. A traditional example such as Shor's factorization [8] could be used, but we focus instead on the area of quantum pseudo-telepathy games. Examples in this area require less mathematics than factorization and are easy to motivate with short proofs that the problems solved have no solutions in a world of classical computing. A CS2 class is a good location to present this work because of the matrix storage and manipulation that is required.", "authors": [{"name": "Robert Frohardt", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}, {"name": "Michael Main", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}, {"name": "Yingdan Huang", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}], "tags": ["quantum computing", "quantum pseudo-telepathy", "CS2"]}, {"title": "Experience report: CS1 for majors with media computation", "link": "https://dl.acm.org/doi/10.1145/1822090.1822151", "abstract": "Previous reports of a media computation approach to teaching programming have either focused on pre-CS1 courses or courses for non-majors. We report the adoption of a media computation context in a majors' CS1 course at a large, selective R1 institution in the U.S. The main goal was to increase retention of majors, but do so by replacing the traditional CS1 course directly (fully preparing students for the subsequent course). In this paper we provide an experience report for instructors interested in this approach. We compare a traditional CS1 with a media computation CS1 in terms of desired student competencies (analyzed via programming assignments and exams) and find the media computation approach to focus more on problem solving and less on language issues. In comparing student success (analyzed via pass rates and retention rates one year later) we find pass rates to be statistically significantly higher with media computation both for majors and for the class as a whole. We give examples of media computation exam questions and programming assignments and share student and instructor experiences including advice for the new instructor.", "authors": [{"name": "Dov Zazkis", "affiliation": "San Diego State University/University of California, San Diego, San Diego, CA, USA"}, {"name": "Leo Porter", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "Beth Simon", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "Päivi Kinnunen", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}], "tags": ["retention", "media computation", "CS1"]}, {"title": "When CS 1 is biology 1: crossdisciplinary collaboration as CS context", "link": "https://dl.acm.org/doi/10.1145/1822090.1822152", "abstract": "We present the curriculum, deployment, and initial evaluation of a course, BioCS1, designed to serve as CS1 and Biology1 for majors of either (or both) disciplines. Cotaught by professors in both fields, BioCS1 interweaves fundamental biology and computational topics in a manner similar to contextual approaches to CS1. In contrast to other contextual approaches, however, BioCS1 emphasizes both CS and its context equally. The results suggest that cross-disciplinary collaborations can succeed at the introductory level, as they have at later stages of the curriculum.", "authors": [{"name": "Eliot Bush", "affiliation": "Harvey Mudd College, Claremont, CA, USA"}, {"name": "Zachary Dodds", "affiliation": "Harvey Mudd College, Claremont, CA, USA"}, {"name": "Ran Libeskind-Hadas", "affiliation": "Harvey Mudd College, Claremont, CA, USA"}], "tags": ["biology 1", "CS 1", "contextual peers", "contextualized CS"]}, {"title": "Session details: K-12", "link": "https://dl.acm.org/doi/10.1145/3251968", "abstract": "No abstract available.", "authors": [{"name": "Julie Johnson", "affiliation": "Vanderbilt University"}], "tags": []}, {"title": "Using scalable game design to teach computer science from middle school to graduate school", "link": "https://dl.acm.org/doi/10.1145/1822090.1822154", "abstract": "A variety of approaches exist to teach computer science concepts to students from K-12 to graduate school. One such approach involves using the mass appeal of game design and creation to introduce students to programming and computational thinking. Specifically, Scalable Game Design enables students with varying levels of expertise to learn important concepts relative to their experience. This paper presents our observations using Scalable Game Design over multiple years to teach middle school students, college level students, graduate students, and even middle school teachers fundamental to complex computer science and education concepts. Results indicate that Scalable Game Design appeals broadly to students, regardless of background, and is a powerful teaching tool in getting students of all ages exposed and interested in computer science. Furthermore, it is observed that many student projects exhibit transfer enabling their games to explain complex ideas, from all disciplines, to the general public.", "authors": [{"name": "Ashok R. Basawapatna", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Kyu Han Koh", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Alexander Repenning", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}], "tags": ["computational thinking pattern", "scalable game design", "university programming education", "middle school programming", "transfer", "student observation"]}, {"title": "Broadening accessibility to computer science for K-12 education", "link": "https://dl.acm.org/doi/10.1145/1822090.1822155", "abstract": "Enrollments in computer science and computer engineering have decreased dramatically since the dot-com bubble burst in 2000 even though it is projected that nearly three quarters of all science and engineering jobs in the future will be in these fields. Meeting this demand will require a substantial effort to inspire and motivate students as early as in the elementary school years. The challenge is to provide motivational access to computer science training, particularly for females and minorities in disadvantaged areas.\nWe propose and present three approaches for broadening accessibility to software that teaches computer science fundamentals: (1) virtualization, (2) self-contained live CDs, and (3) web browser-based deployment. While the work is ongoing, initial results are quite promising. Next steps include a more formal and much wider deployment to 3rd-5th grade classes in ten elementary schools in rural Virginia.", "authors": [{"name": "Mark K. Gardner", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Wu-chun Feng", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["live CD", "storytelling alice", "K-12", "virtual computing"]}, {"title": "Enhancing K-12 education with alice programming adventures", "link": "https://dl.acm.org/doi/10.1145/1822090.1822156", "abstract": "This paper describes the integration of the Alice 3D virtual worlds environment into many disciplines in elementary school, middle school and high school. We have developed a wide range of Alice instructional materials including tutorials for both computer science concepts and animation concepts. To encourage the building of more complicated worlds, we have developed template Alice classes and worlds. With our materials, teachers and students are exposed to computing concepts while using Alice to create projects, stories, games and quizzes. These materials were successfully used in the summers 2008 and 2009 in training and working with over 130 teachers.", "authors": [{"name": "Maggie Bashford", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Susan H. Rodger", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Jenna Hayes", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Liz Liang", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Lana Dyck", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Henry Qin", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Deborah Nelson", "affiliation": "Duke University, Durham, NC, USA"}], "tags": ["virtual worlds", "K-12 education", "middle school", "alice", "introductory computer science"]}, {"title": "Session details: Software engineering", "link": "https://dl.acm.org/doi/10.1145/3251969", "abstract": "No abstract available.", "authors": [{"name": "Shengru Tu", "affiliation": "University of New Orleans"}], "tags": []}, {"title": "Evaluating the effectiveness of a pattern application support tool for novices", "link": "https://dl.acm.org/doi/10.1145/1822090.1822158", "abstract": "This paper presents our findings of an evaluation study conducted to gauge the effectiveness of a design pattern application tool (DPACoach) in providing the needed support to novices. The tool has been designed around the actual difficulties encountered by novices when applying pattern solution to a design problem. The data indicates improvement in novices' performance after they have been given the time to interact with DPACoach. Performance is measured in terms of their ability to select the right patterns, the number of application errors and the total time spend to complete pattern application tasks.", "authors": [{"name": "Sufian Idris", "affiliation": "Universiti Kebangsaan Malaysia, Bangi, Malaysia"}, {"name": "Masita Jalil", "affiliation": "Universiti Malaysia Terengganu, Kuala Terengganu, Malaysia"}, {"name": "Shahrul Azman Noah", "affiliation": "Universiti Kebangsaan Malaysia, Bangi, Malaysia"}], "tags": ["design patterns", "pattern application", "novices", "tool support"]}, {"title": "Experiences in software engineering courses using psychometrics with RAMSET", "link": "https://dl.acm.org/doi/10.1145/1822090.1822159", "abstract": "Lately Programming Psychology has opened up a vast area of study, where human, social and psychological factors of the programmer are studied in different computational areas. His behavior and how to relate with others are important aspects that influence performance of a developing team. In our daily work in education we have an obligation of shaping human resources to build a society with professionals participating in companies and corporations dedicated to industrial, social and economic development. Thus in searching for strategies to shape human resources and improve these group corporations we propose RAMSET a Role Assignment Methodology for Software Engineering Teams where we acknowledge the importance of relating personality with team roles, using sociometric techniques and psychometrics to aid in forming high performing teams for software development projects.", "authors": [{"name": "Luis G. Martínez", "affiliation": "Universidad Autonoma de Baja California, Tijuana, Mexico"}, {"name": "Guillermo Licea", "affiliation": "Universidad Autonoma de Baja California, Tijuana, Mexico"}, {"name": "Juan R. Castro", "affiliation": "Universidad Autonoma de Baja California, Tijuana, Mexico"}, {"name": "Antonio Rodríguez-Díaz", "affiliation": "Universidad Autonoma de Baja California, Tijuana, Mexico"}], "tags": ["software engineering", "personality", "empirical research", "psychometrics"]}, {"title": "Modeling with Plato: the unified modeling language in a cultural context", "link": "https://dl.acm.org/doi/10.1145/1822090.1822160", "abstract": "In this paper we present our experience in building and lecturing an interdisciplinary CS course aimed at teaching the Unified Modeling Language (UML) in a cultural context. Combining modeling concepts and ideas brought from philosophy and history of ideas we present a novel way to teach UML and modeling beyond its original environment. Course design, implementation and results are presented. Although the course was very experimental results were quite positive.", "authors": [{"name": "José-Javier Martínez", "affiliation": "University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Luis de-Marcos", "affiliation": "University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Fernando Flores", "affiliation": "Lund University, Lund, Sweden"}], "tags": ["unified modeling language (UML)", "modeling", "humanistic informatics"]}, {"title": "Session details: Collaboration", "link": "https://dl.acm.org/doi/10.1145/3251970", "abstract": "No abstract available.", "authors": [{"name": "Mary Anne Egan", "affiliation": "Siena College"}], "tags": []}, {"title": "Encouraging reading and collaboration using classroom salon", "link": "https://dl.acm.org/doi/10.1145/1822090.1822162", "abstract": "Classroom Salon (CLS) is a special web based platform developed to encourage active reading and annotation activities. Using special highlighting and commenting tools in CLS, students indicate their understanding of concepts. CLS groups student annotations and provides a number of visualizations that can be used to understand group agreements and disagreements and other patterns of social annotations. In this paper we present data from a pilot project conducted in a second semester data structures course. We found that there is strong correlation between student's ability to find errors in a document and their overall performance in class. We also found that the majority of students prefer reading others annotations and using them to further refine their comments and hence encouraging collaborative document reading activities.", "authors": [{"name": "Aaron Tan", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Ananda Gunawardena", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "David Kaufer", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["data structures", "reading comprehension", "annotations"]}, {"title": "Collaborative design of cross-disciplinary game minors based on the IGDA curriculum framework", "link": "https://dl.acm.org/doi/10.1145/1822090.1822163", "abstract": "Due to the recent creation of game degree programs at post-secondary institutions, peer-reviewed literature on the curriculum planning process for game degrees at post-secondary institutions pales in comparison to the literature available for more established fields of computer science. At Bradley University, departments across colleges have worked collaboratively to create two cross-disciplinary game minors. The minors have been carefully crafted to nurture the growth of both media designers and software developers while simultaneously providing experiences for the students to experience multi-disciplinary teamwork. This paper details the creation of these two innovative game minors with emphasis on three aspects of the curriculum planning process: 1) their interdependencies, 2) their structure for supporting both Design and software development students, and 3) their reliance on the International Game Developer Association's curriculum framework. In addition, the author provides a summary of issues and concerns that arose during the curriculum planning process.", "authors": [{"name": "Monica M. McGill", "affiliation": "Bradley University, Peoria, IL, USA"}], "tags": ["interactive media", "game", "education", "framework", "minor", "curriculum", "game development", "IGDA", "game design"]}, {"title": "Skills and knowledge for hire: leeds source-it", "link": "https://dl.acm.org/doi/10.1145/1822090.1822164", "abstract": "We present a pilot for a student consultancy service offering students the opportunity to work with internal and external clients on real life projects to learn and enhance transferable skills. The pilot ran for 18 months with a pool of 20 to 24 students working on 8 projects.\nWe compare in detail two case study projects for external clients and described issues and lessons learned. Participating student consultants' feedback is presented and analysed, in the context of managed development of professional skills. Finally we discuss the initial challenges running a student consultancy service as an extracurricular activity and comment on the value to the host university department.", "authors": [{"name": "Alison Marshall", "affiliation": "University of Leeds, Leeds, United Kingdom"}, {"name": "Roger Boyle", "affiliation": "University of Leeds, Leeds, United Kingdom"}, {"name": "Royce Neagle", "affiliation": "University of Leeds, Leeds, United Kingdom"}], "tags": ["real-world student experiences", "education", "management", "enterprise"]}, {"title": "Session details: Human factors", "link": "https://dl.acm.org/doi/10.1145/3251971", "abstract": "No abstract available.", "authors": [{"name": "Tony Clear", "affiliation": "Auckland University of Technology"}], "tags": []}, {"title": "Usability, engagement & development of a digital usability laboratory in a higher education environment", "link": "https://dl.acm.org/doi/10.1145/1822090.1822166", "abstract": "The paper provides an illustration of the complexities of developing a usability laboratory for mainly undergraduate and some external sources within a university environment. It also examines how undergraduate computing students engage with the concept of usability evaluation and with digital usability recording/analysis equipment; this is done in the context of a typical HCI module and when working on a final year independent project. General engagement, lab configurations, equipment and recording/analysis tools are discussed. Student engagement with the lab facilities is considered to be good and the lab is seen as an additional means of improving student engagement with usability evaluation and its practicalities. Brief reference is also made to the use of the lab for outside consultancy.", "authors": [{"name": "David Cox", "affiliation": "Southampton Solent University, Southampton, United Kingdom"}], "tags": ["recording", "user", "analysis", "lab", "HCI", "laboratory", "interaction", "computer", "participant", "human", "evaluation", "engagement", "usability"]}, {"title": "Online identification of learner problem solving strategies using pattern recognition methods", "link": "https://dl.acm.org/doi/10.1145/1822090.1822167", "abstract": "Learning and programming environments used in computer science education give feedback to the users by system messages. These are triggered by programming errors and give only \"technical\" hints without regard to the learners' problem solving process. To adapt the messages not only to the factual but also to the procedural knowledge of the learners, their problem solving strategies have to be identified automatically and in process. This article describes a way to achieve this with the help of pattern recognition methods. Using data from a study with 65 learners aged 12 to 13 using a learning environment for programming, a classification system based on hidden Markov models is trained and integrated in the very same environment. We discuss findings in that data and the performance of the automatic online identification, and present first results using the developed software in class.", "authors": [{"name": "Torsten Brinda", "affiliation": "Friedrich-Alexander-University of Erlangen-Nuremberg, Erlangen, Germany"}, {"name": "Ulrich Kiesmueller", "affiliation": "Friedrich-Alexander-University of Erlangen-Nuremberg, Erlangen, Germany"}, {"name": "Korbinian Riedhammer", "affiliation": "Friedrich-Alexander-University of Erlangen-Nuremberg, Erlangen, Germany"}, {"name": "Sebastian Sossalla", "affiliation": "Friedrich-Alexander-University of Erlangen-Nuremberg, Erlangen, Germany"}], "tags": ["computer science education", "secondary education", "pattern recognition", "tool-based analysis", "algorithms", "problem solving strategies"]}, {"title": "Session details: Upper level courses", "link": "https://dl.acm.org/doi/10.1145/3251972", "abstract": "No abstract available.", "authors": [{"name": "Laurence Merkle", "affiliation": "Wright State University"}], "tags": []}, {"title": "Undergraduate database instruction with MeTube", "link": "https://dl.acm.org/doi/10.1145/1822090.1822169", "abstract": "This paper describes the principles, implementation, and outcomes of a new undergraduate database course that uses a semester-long project, known as MeTube (a variation of the well-known YouTube system), to motivate and foster interest and creativity in students, while providing adequate complexity to introduce DBMS concepts and techniques. Included in our discussion are experiences in two course offerings, as well as detailed course assessment results.", "authors": [{"name": "Pradip K. Srimani", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "James M. Westall", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Timothy A. Davis", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "James Z. Wang", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["TEXNH", "MeTube", "DBMS", "problem-based instruction", "CPATH"]}, {"title": "Hands-on approach to teaching wireless sensor networks at the undergraduate level", "link": "https://dl.acm.org/doi/10.1145/1822090.1822170", "abstract": "Teaching wireless sensor networks (WSNs) at the undergraduate level is both challenging and rewarding. WSNs include low-level programming and debugging, power-aware operations, novel communication paradigms and interdisciplinary applications in real world environments. These characteristics enable the students to learn how to cope with complete systems, starting with hardware design and low-level programming throughout applications and data processing. They learn to recognize complex software-hardware cross-dependencies and to manage them successfully.\nIn this paper we share our experience from a new course on \"Introduction to Wireless Sensor Networks\" at the undergraduate level. The most important characteristic of the course is its hands-on approach. We believe this is crucial for fully understanding the complex nature of WSNs and their interdependencies with the environment in which they operate. The students were able to build a solid set of skills and expertise in WSNs by designing and implementing their own small-size real-world WSN deployment.", "authors": [{"name": "Anna Förster", "affiliation": "University of Lugano, Lugano, Switzerland"}, {"name": "Mehdi Jazayeri", "affiliation": "University of Lugano, Lugano, Switzerland"}], "tags": ["hands-on experience", "undergraduate", "teaching", "wireless sensor networks", "MSB430", "deployment"]}, {"title": "Session details: Visualization", "link": "https://dl.acm.org/doi/10.1145/3251973", "abstract": "No abstract available.", "authors": [{"name": "Henry Walker", "affiliation": "Grinnell College"}], "tags": []}, {"title": "Integrating categories of algorithm learning objective into algorithm visualization design: a proposal", "link": "https://dl.acm.org/doi/10.1145/1822090.1822172", "abstract": "Algorithm Visualization (AV) can be analyzed and evaluated through three properties: the symbol system, the interactivity, and the didactic structure. While the relationship between various symbol systems have been researched and efforts to increase learner and AV interaction are being made, the importance and potential of the didactic structure of AV is yet to be explored. In view of this deficiency, this paper proposes Categories of Algorithm Learning Objective (CALO) as a pedagogical framework for designing and structuring AV. Based on seven non-hierarchical learning objectives commonly found in CS education, CALO provides a conceptual framework for a more learner-centered design, as well as a shared language for educators, learners and designers for communication and evaluation.", "authors": [{"name": "Ming-Han Lee", "affiliation": "Technische Universität Darmstadt, Darmstadt, Germany"}, {"name": "Guido Rößling", "affiliation": "Technische Universität Darmstadt, Darmstadt, Germany"}], "tags": ["algorithm visualization", "AV design", "computer science education", "learning objective", "CALO"]}, {"title": "A platform for visualizing digital circuit synthesis with VHDL", "link": "https://dl.acm.org/doi/10.1145/1822090.1822173", "abstract": "This paper presents the VISUAL-VHDL platform for visualizing digital circuit synthesis based on the hardware description language VHDL. VISUAL-VHDL enables students to enter VHDL code and control an animation process, which shows step-by-step how the different language constructs are treated to synthesize a complete digital circuit. It also enables the visualization of the Quine-McCluskey algorithm, which is embedded in our tool to optimize the circuit resulting from synthesizing the VHDL code. The drag and drop schematic editor for entering and parameterizing digital circuits can be used by educators and students to effectively produce circuit diagrams.", "authors": [{"name": "Guido Rößling", "affiliation": "TU Darmstadt, Darmstadt, Germany"}, {"name": "Abdulhadi Shoufan", "affiliation": "TU Darmstadt, Darmstadt, Germany"}, {"name": "Zheng Lu", "affiliation": "TU Darmstadt, Darmstadt, Germany"}], "tags": ["VHDL", "digital circuit synthesis", "animation", "visualization"]}]