[{"title": "New technology, new learning?", "link": "https://dl.acm.org/doi/10.1145/2591708.2602688", "abstract": "There has been a lot of excitement recently about how new technologies can transform learning. MOOCs, the internet of education and flipped classrooms are the latest hotly debated ways of changing how students learn in the modern world. At the same time, a diversity of innovative learning apps has been developed for tabletops, tablets and phones, supporting new forms of learning -- mobile, collaborative and situated. New electronic toolkits and programming environments are also emerging intended to introduce new generations to coding and computation in creative and engaging ways -- that go way beyond Logo. Never before has there been so much opportunity and buzz to make learning accessible, immersive, interactive, exciting, provocative and enjoyable. To realize the true potential of these latest technological developments, however, requires designing interfaces and apps to not only match learner's needs but also to encourage collaboration, mindful engagement, conversational skills and the art of reflection.", "authors": [{"name": "Yvonne Rogers", "affiliation": "University College London, London, United Kingdom"}], "tags": ["human-computer interaction", "technologies to facilitate learning"]}, {"title": "Meeting the future challenges of education and digitization", "link": "https://dl.acm.org/doi/10.1145/2591708.2602689", "abstract": "Schools and education are of immense political importance, particularly for the upcoming election, both in the European union and for Sweden. The Pisa surveys show disappointing results for Sweden, and the Swedish Committee for Digitisation has analyzed IT education in the school sector and developed concrete proposals to provide the Swedish government with a basis for future educational policy making. This development also has a great impact on how higher education will need to evolve. Technology, in many ways, changes the playing field for education and life long learning, and thus the pedagogy and leadership upon which our education is based also needs to change. This talk discusses the current view of education and life long learning and brings provocative ideas to the table concerning the future of ICT in Education.", "authors": [{"name": "Jan Gulliksen", "affiliation": "Royal Institute of Technology, Stockholm, Sweden"}], "tags": ["future of ict in education"]}, {"title": "SPOC-supported introduction to programming", "link": "https://dl.acm.org/doi/10.1145/2591708.2591759", "abstract": "MOOCs (Massive Open Online Courses), which have taken higher education by storm, are an opportunity to elevate the quality of existing residential courses. We report about an experimental attempt during the Autumn 2013 semester at ETH Zurich, involving our \"Introduction to Programming\" course. We designed and implemented a MOOC infrastructure and used it as a SPOC (Small Private Online Course) to support and complement the existing course. The results reported in this article are encouraging for two reasons: first, the participation level was good, in spite of the fact that the online course was an optional addition to the residential course; second, students really liked the assessments (quizzes and programming exercises), in spite of the fact that assessments did not count towards the course final grade. The data we collected suggest that this may, at least in part, be due to a gamification aspect we introduced in the course: awarding virtual badges for obtaining full points in the quizzes.", "authors": [{"name": "Christian Estler", "affiliation": "ETH Zurich, Zurich, Switzerland"}, {"name": "Marco Piccioni", "affiliation": "ETH Zurich, Zurich, Switzerland"}, {"name": "Bertrand Meyer", "affiliation": "ETH Zurich, Zurich, Switzerland"}], "tags": ["cs1", "mooc", "spoc", "pedagogy"]}, {"title": "Teaching and learning with MOOCs: computing academics' perspectives and engagement", "link": "https://dl.acm.org/doi/10.1145/2591708.2591740", "abstract": "During the past two years, Massive Open Online Courses (MOOCs) have created wide interest in the academic world raising both enthusiasm for new opportunities for universities and many concerns for the future of university education. The discussion has mainly appeared in non-scientific forums, such as magazine articles, columns and blogs, making it difficult to judge wider opinions within academia. To collect more rigorous data we surveyed teachers, researchers, and academic managers on their opinions and experiences of MOOCs. In this paper, we present our analysis of responses from the computer science academic community (n=137). Their feelings about MOOCs are highly mixed. Content analysis of open-ended questions revealed that the most often mentioned positive aspects included affordances of MOOCs, freedom of time and location for studying, and the possibility to experience teaching from top-level international teachers/experts. The most common negative aspects included concerns about pedagogical designs of MOOCs, assessment practices, and lack of interaction with the teacher. About half the respondents claimed they had not changed their teaching as a result of MOOCs, a small number used MOOCs as learning resources and very few were engaging with MOOCs in any significant way.", "authors": [{"name": "Aletta Nylén", "affiliation": "Uppsala University, Uppsala, Sweden"}, {"name": "Anna Eckerdal", "affiliation": "Uppsala University, Uppsala, Sweden"}, {"name": "Judy Sheard", "affiliation": "Monash University, Caulfield East, VIC, Australia"}, {"name": "Lauri Malmi", "affiliation": "Aalto University, Helsinki, Finland"}, {"name": "Neena Thota", "affiliation": "University of Saint Joseph, Macau, S.A.R., Macao"}, {"name": "Päivi Kinnunen", "affiliation": "Aalto University, Helsinki, Finland"}], "tags": ["open learning", "distance learning", "computing academics", "pedagogy", "e-learning", "moocs massive open online courses"]}, {"title": "Augmenting PBL with large public presentations: a case study in interactive graphics pedagogy", "link": "https://dl.acm.org/doi/10.1145/2591708.2591727", "abstract": "We present a case study analyzing and discussing the effects of introducing the requirement of public outreach of original student work into the project-based learning of Advanced Graphics and Interaction (AGI) at KTH Royal Institute of Technology. We propose Expo-Based Learning as Project-Based Learning augmented with the constructively aligned goal of achieving public outreach beyond the course. We promote this outreach through three challenges: 1) large public presentations; 2) multidisciplinary collaboration; and 3) professional portfolio building. We demonstrate that the introduction of these challenges, especially the public presentations, had lasting positive impact in the intended technical learning outcomes of AGI with the added benefit of learning team work, presentation skills, timeliness, accountability, self-motivation, technical expertise, and professionalism.", "authors": [{"name": "Filip Kis", "affiliation": "KTH Royal Institute of Technology, Stockholm, Sweden"}, {"name": "Jonas Andrée", "affiliation": "KTH Royal Institute of Technology, Stockholm, Sweden"}, {"name": "Björn Thuresson", "affiliation": "KTH Royal Institute of Technology, Stockholm, Sweden"}, {"name": "Christopher Peters", "affiliation": "KTH Royal Institute of Technology, Stockholm, Sweden"}, {"name": "Joe Coppard", "affiliation": "Berghs School of Communication, Stockholm, Sweden"}, {"name": "Natalia Landazuri", "affiliation": "Karolinska Institutet, Stockholm, Sweden"}, {"name": "Mario Romero", "affiliation": "KTH Royal Institute of Technology, Stockholm, Sweden"}], "tags": ["graphics/visualization.", "active learning", "public impact", "project-based learning", "expo-based learning", "large public presentations", "cs education research", "outreach", "human-computer interaction"]}, {"title": "The state of play: a notional machine for learning programming", "link": "https://dl.acm.org/doi/10.1145/2591708.2591721", "abstract": "Comprehension of programming and programs is known to be a difficult task for many beginning students, with many computing courses showing significant drop out and failure rates. In this paper, we present a new notional machine design and implementation to help with understanding of programming and its dynamics for beginning learners. The notional machine offers an abstraction of the physical machine designed for comprehension and learning purposes. We introduce the notional machine and a graphical notation for its representation. We also present Novis, an implementation of a dynamic real-time visualiser of this notional machine, integrated into BlueJ.", "authors": [{"name": "Michael Kölling", "affiliation": "University of Kent, Canterbury, United Kingdom"}, {"name": "Michael Berry", "affiliation": "University of Kent, Canterbury, United Kingdom"}], "tags": ["program visualization", "novice programming", "novis"]}, {"title": "System for automatic generation of algorithm visualizations based on pseudocode interpretation", "link": "https://dl.acm.org/doi/10.1145/2591708.2591743", "abstract": "Algorithm visualization systems have not been as widely adopted by computer science educators as it might be expected from the firm belief that they can enhance computer science education. Two key impediments for widely adopting AV technology in mainstream computer science are: effectiveness and enhancements of learning with visualization and effort needed to create algorithm visualizations. In this paper, we present the interpretation based system capable of automatic creation of algorithm visualizations by interpreting unmodified algorithms written in pseudocode. Although system is interpreting unmodified source code (code without any annotations for triggering appropriate visualization routines), due to the ability to automatically detect interesting events system is able to create visualizations at a sufficiently high level of abstraction so that the emphasis is on algorithmic conceptually relevant principles. Providing users with full control over input data set and by accompanying animation with explanatory messages, highlighting currently executing pseudocode line and providing possibility to inspect variable values at any step visualizations created by our system that can enhance learning and help students mastering algorithms basic concepts.", "authors": [{"name": "Saša Mladenović", "affiliation": "Faculty of Science, University of Split, Split, Croatia"}, {"name": "Jure Mornar", "affiliation": "Siemens Convergence Creators d.o.o., Split, Croatia"}, {"name": "Andrina Granić", "affiliation": "Faculty of Science, University of Split, Split, Croatia"}], "tags": ["code interpretation", "pseudocode", "automatic animation generation", "algorithm visualization", "automatic interesting event detection"]}, {"title": "Selective hiding for improved algorithmic visualization", "link": "https://dl.acm.org/doi/10.1145/2591708.2591734", "abstract": "In order to benefit most from algorithm visualization (AV) technology students have to be meaningfully involved in the algorithm visualisation process. This may imply that they are invited to predict and implement (using an interactive visual learning environment) the operation-sequence of the studied algorithm. In such learning environments users become active players in the AV process. Students are invited to process algorithms (in terms of their high-level operations) created to be processed by computers. The study we have performed reveals latent deficiencies such AV systems might have. Compared to humans, computers are blind in many ways. Visualizing information that has extra meanings for human viewers can obstruct them in following strict computer algorithms. Research results show that wisely applied hiding may result in more effective algorithm visualization due to its higher epistemic fidelity.", "authors": [{"name": "Zoltan Katai", "affiliation": "Sapientia University, Târgu-Mure/Corunca, Romania"}], "tags": ["algorithm visualization", "epistemic fidelity.", "interactive learning environments", "constructivist approach"]}, {"title": "Failure rates in introductory programming revisited", "link": "https://dl.acm.org/doi/10.1145/2591708.2591749", "abstract": "Whilst working on an upcoming meta-analysis that synthesized fifty years of research on predictors of programming performance, we made an interesting discovery. Despite several studies citing a motivation for research as the high failure rates of introductory programming courses, to date, the majority of available evidence on this phenomenon is at best anecdotal in nature, and only a single study by Bennedsen and Caspersen has attempted to determine a worldwide pass rate of introductory programming courses.\nIn this paper, we answer the call for further substantial evidence on the CS1 failure rate phenomenon, by performing a systematic review of introductory programming literature, and a statistical analysis on pass rate data extracted from relevant articles. Pass rates describing the outcomes of 161 CS1 courses that ran in 15 different countries, across 51 institutions were extracted and analysed. An almost identical mean worldwide pass rate of 67.7% was found. Moderator analysis revealed significant, but perhaps not substantial differences in pass rates based upon: grade level, country, and class size. However, pass rates were found not to have significantly differed over time, or based upon the programming language taught in the course. This paper serves as a motivation for researchers of introductory programming education, and provides much needed quantitative evidence on the potential difficulties and failure rates of this course.", "authors": [{"name": "Frederick W.B. Li", "affiliation": "University of Durham, Durham, United Kingdom"}, {"name": "Christopher Watson", "affiliation": "University of Durham, Durham, United Kingdom"}], "tags": ["fail rates", "introductory programming", "cs1", "programming", "pass rates", "statistics", "failure rates"]}, {"title": "Effect of a 2-week scratch intervention in CS1 on learners with varying prior knowledge", "link": "https://dl.acm.org/doi/10.1145/2591708.2591733", "abstract": "A large CS1 class often needs to provide scaffolding for novices while keeping advanced learners engaged. Scratch has been shown to be suitable to address a diverse set of requirements. In this study, we determine whether a 2-week Scratch intervention in a CS1 course is useful from two perspectives: i) as a scaffold for novices to learn basic programming concepts and transition to C++, and ii) as a tool for advanced learners to remain engaged and do challenging work. We conducted a field study of 332 first-year undergraduate engineering students, two-thirds of whom were novices. We analyzed student performance on exams and Scratch projects. We administered a survey to determine student perceptions on the usefulness of Scratch. Some key findings of our study are: (i) Novices were able to catch-up to advanced learners in Scratch questions of the type 'Predict the output' and 'Debug the program', (ii) Projects by advanced learners reached 80% of the complexity of 'most loved projects' on the Scratch website, and (iii) 69% of students perceived Scratch to be useful for learning programming concepts and transitioning to C++.", "authors": [{"name": "Sridhar Iyer", "affiliation": "Indian Institute of Technology Bombay, Mumbai, India"}, {"name": "Sahana Murthy", "affiliation": "Indian Institute of Technology Bombay, Mumbai, India"}, {"name": "Shitanshu Mishra", "affiliation": "Indian Institute of Technology Bombay, Mumbai, India"}, {"name": "Sudeesh Balan", "affiliation": "Indian Institute of Technology Bombay, Mumbai, India"}], "tags": ["cs1", "novice learners", "advance learners", "scratch intervention"]}, {"title": "Think-pair-share in a large CS1 class: does learning really happen?", "link": "https://dl.acm.org/doi/10.1145/2591708.2591739", "abstract": "Think-pair-share (TPS) is a classroom active learning strategy in which students work on activities, first individually, then in pairs and finally as the whole class. TPS allows students to express their reasoning, reflect on their understanding and obtain prompt feedback on their learning. While TPS is recommended to foster classroom engagement and learning, there is a lack of research based evidence in computer science education on the benefits of TPS for learning. In this study, we investigate the learning effectiveness of TPS in a CS1 course. We performed a quasi-experimental study and found that students who learned via TPS performed significantly better on a post-test than students who learned the same concept via lecture. We also conducted a survey and focus group interviews to understand student perceptions of learning with TPS. The majority of students agreed that TPS activities helped improve their conceptual understanding. From an instructor's point of view, TPS was useful to address the challenges of a large class, such as students tuning out or getting distracted and was easy to implement even in a large class.", "authors": [{"name": "Aditi Kothiyal", "affiliation": "IIT Bombay, Mumbai, India"}, {"name": "Sahana Murthy", "affiliation": "IIT Bombay, Mumbai, India"}, {"name": "Sridhar Iyer", "affiliation": "IIT Bombay, Mumbai, India"}], "tags": ["active learning", "cs1", "learning", "large class", "think-pair-share", "experimental study"]}, {"title": "Assessing computational learning in K-12", "link": "https://dl.acm.org/doi/10.1145/2591708.2591713", "abstract": "As computing curricula continue to make their way into K-12 schools, the issue of assessing student learning of computational concepts remains a thorny one. This paper describes the multiple forms of assessments used in a 6-week middle school curriculum with the goal of capturing a holistic view of student learning. A key aspect of this research is the use of instruments developed and shared in prior research. Included among these were several questions used in an Israeli nationwide exam to test middle school student learning of programming in Scratch. This paper reports on the use of the curriculum in two studies conducted in a public US middle school classroom, and compares performances of these students with those reported by the Israeli Ministry of Education in their large-scale study. It also argues for multiple modes of assessment of computational learning in K-12 settings.", "authors": [{"name": "Stephen Cooper", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Shuchi Grover", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Roy Pea", "affiliation": "Stanford University, Stanford, CA, USA"}], "tags": ["computational thinking", "k-12 curriculum development.", "assessment", "computer science education", "computing education"]}, {"title": "Engaging high school students using chatbots", "link": "https://dl.acm.org/doi/10.1145/2591708.2591728", "abstract": "Chatbots have been used in different scenarios for getting people interested in CS for decades. However, their potential for teaching basic concepts and their engaging effect has not been measured. In this paper we present a software platform called Chatbot designed to foster engagement while teaching basic CS concepts such as variables, conditionals and finite state automata, among others. We carried out two experiences using Chatbot and the well known platform Alice: 1) an online nation-wide competition, and 2) an in-class 15-lesson pilot course in 2 high schools. Data shows that retention and girl interest are higher with Chatbot than with Alice, indicating student engagement.", "authors": [{"name": "María Cecilia Martínez", "affiliation": "Universidad Nacional de Córdoba/CONICET, Córdoba, Argentina"}, {"name": "Luciana Benotti", "affiliation": "FAMAF, Universidad Nacional de Córdoba/CONICET, Córdoba, Argentina"}, {"name": "Fernando Schapachnik", "affiliation": "Fundación Dr. Manuel Sadosky and Depto. de Computación, FCEyN, UBA, Buenos Aires, Argentina "}], "tags": ["cengagement", "chatbot", "computer science k-12 outreach", "gender", "experimental evaluation"]}, {"title": "Serious toys: three years of teaching computer science concepts in K-12 classrooms", "link": "https://dl.acm.org/doi/10.1145/2591708.2591732", "abstract": "Computational thinking represents a collection of structured problem solving skills that cross-cut educational disciplines. There is significant future value in introducing these skills as early as practical in students' academic careers. Over the past three years, we have developed, piloted, and evaluated a series of K-12 outreach modules designed to introduce fundamental computing concepts. We piloted two modules with more than 340 students, and evaluation results show that the modules are having a positive impact. We combined the two previously piloted modules with a newly developed module and piloted the combined program with over 170 students. Evaluation results again show that the combination is having a positive impact. In this paper, we summarize the program, discuss our experiences piloting it, and summarize key evaluation results. Our hope is to engender discussion and adoption of the materials at other institutions.", "authors": [{"name": "Farha Ali", "affiliation": "Lander University, Greenwood, SC, USA"}, {"name": "Yvon Feaster", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Jason O. Hallstrom", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Jiannan Zhai", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["algorithms", "binary numbers", "protocols", "networks", "sensor networks", "experimental evaluation", "k-12 curriculum", "outreach"]}, {"title": "The magic of algorithm design and analysis: teaching algorithmic skills using magic card tricks", "link": "https://dl.acm.org/doi/10.1145/2591708.2591745", "abstract": "We describe our experience using magic card tricks to teach algorithmic skills to first-year Computer Science undergraduates. We illustrate our approach with a detailed discussion on a card trick that is typically presented as a test to the psychic abilities of an audience. We use the trick to discuss concepts like problem decomposition, pre- and post-conditions, and invariants. We discuss pedagogical issues and analyse feedback collected from students. The feedback has been very positive and encouraging.", "authors": [{"name": "Alexandra Mendes", "affiliation": "York St John University, York, United Kingdom"}, {"name": "Joao F. Ferreira", "affiliation": "Teesside University & Universidade do Minho, Middlesbrough, United Kingdom"}], "tags": ["algorithms", "magic card tricks", "puzzles and games", "pre/post-conditions", "algorithmic problem solving", "hoare triples", "invariants"]}, {"title": "A method to prove query lower bounds", "link": "https://dl.acm.org/doi/10.1145/2591708.2591736", "abstract": "The query-model or decision-tree model is a computational model in which the algorithm has to solve a given problem by making a sequence of queries which have 'Yes' or 'No' answers. A large class of algorithms can be described on this model and we can also prove non-trivial lower bounds for many problems on this model.\nMany lower bounds on the query-model are proved using a technique called adversary argument. In CS courses, a common example used to illustrate the adversary argument is the following problem: Suppose there is an unweighted graph G with $n$ vertices represented by an adjacency matrix. We want to test if the graph is connected. How many entries in the adjacency matrix do we have to probe in order to test if the graph has this property (property being 'connectivity')? Each probe is considered as a query.\nSince the adjacency matrix has only n^2 entries, O(n^2) queries are sufficient. It is also known that Omega(n^2) queries are necessary. Proving this lower bound is more difficult and is done using the adversary argument.\nIn literature, we find that lower bound proofs of this problem rely too much on 'connectivity' property and do not generalize well. When the property being tested is changed, the proof changes significantly. Our contribution is a method that gives a systematic way of proving lower bounds for problems involving testing of many graph-properties. We did a pilot experiment and found that students were able to understand and apply our method.", "authors": [{"name": "Jagadish M.", "affiliation": "IIT Bombay, Mumbai, India"}, {"name": "Sridhar Iyer", "affiliation": "IIT Bombay, Mumbai, India"}], "tags": ["adversary arguments", "query complexity", "lower bounds"]}, {"title": "Problem-solving using the extremality principle", "link": "https://dl.acm.org/doi/10.1145/2591708.2591718", "abstract": "The extremality principle is one of the commonly used problem solving strategies. It involves looking at the extremal cases of a problem in order to obtain insight about the general structure. Though the principle is widely known, its use in designing algorithms is rarely discussed in CS literature. We present a methodology based on the extremality principle that is useful in solving a wide variety of algorithmic problems. We illustrate the effectiveness of the methodology by deriving solutions to three difficult problems. We believe that the key steps involved in our methodology can be taught to students as individual drills. We have anecdotal evidence for the teachability of the method.", "authors": [{"name": "Jagadish M.", "affiliation": "IIT Bombay, Mumbai, India"}, {"name": "Sridhar Iyer", "affiliation": "IIT Bombay, Mumbai, India"}], "tags": ["problem-solving", "extremality"]}, {"title": "MLSvisual: a visualization tool for teaching access control using multi-level security", "link": "https://dl.acm.org/doi/10.1145/2591708.2591730", "abstract": "Information security continues to be a pressing issue for industry and government. Perhaps the two most fundamental mechanisms for controlling access to information are cryptography and access control systems. This paper presents MLSvisual, a tool that helps students learn the multi-level(Bell-LaPadula) access control model. MLSvisual allows students to create, explore, and modify an MLS policy through a graphical visualization system. A query system can be used by students to test their understanding of a given policy. Instructors can utilize a test function in the tool to assign an exercise or quiz, with answers sent to them via email. We also present the results of an evaluation of MLSvisual within a senior-level course on information security. This evaluation received positive feedback and showed that MLSviusal helped the understanding of the Bell-LaPadula model and enhanced the course. We believe that this user-level tool will help instructors to teach this material more effectively, and make teaching this material more practical in resource-constrained environments.", "authors": [{"name": "Man Wang", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Chaoli Wang", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Ching-Kuang Shene", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Jean Mayo", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Steve Carr", "affiliation": "Western Michigan University, Kalamazoo, MI, USA"}], "tags": ["visualization", "security"]}, {"title": "Empowering faculty to embed security topics into computer science courses", "link": "https://dl.acm.org/doi/10.1145/2591708.2591741", "abstract": "Security illiteracy is a very common problem among Computer Science (CS) graduates entering the nation's digital workforce, which has contributed to a national cyber-infrastructure that could and should be more resilient to cyber-enemies than it is now. The Security Knitting Kit (SecKnitKit) project aims to improve security awareness, knowledge, and interest of undergraduate CS students by exposing them to computer security concepts and issues in their regular course of study. The project is developing, deploying, and disseminating a multi-faceted out-of-the-box instructional support system to empower non-security faculty. These are faculty who have no experience in teaching security but recognize the importance of security in today's world and want to broaden their teaching repertoire. This project enables them to weave relevant security topics traditional computer science courses seamlessly and effectively. The project is organized by the CS department at Tennessee Tech University (TTU) and supported by the National Science Foundation under grant DUE-1140864.", "authors": [{"name": "Ada Haynes", "affiliation": "Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Ambareen Siraj", "affiliation": "Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Joshua Tower", "affiliation": "Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Sheikh Ghafoor", "affiliation": "Tennessee Tech University, Cookeville, TN, USA"}], "tags": ["acm/ieee-cs 2013 curricula", "security education", "security"]}, {"title": "Student perceptions of the acceptability of various code-writing practices", "link": "https://dl.acm.org/doi/10.1145/2591708.2591755", "abstract": "This paper reports on research that used focus groups and a national online survey of computing students at Australian universities to investigate perceptions of acceptable academic practices in writing program code for assessment. The results indicate that computing students lack a comprehensive understanding of what constitutes acceptable academic practice with regard to writing program code. They are not clear on the need to reference code taken from other sources, or on how to do so. Where code from other sources is used, or inappropriate collaboration takes place between students, there appears to be a feeling that any academic misconduct is diminished or even nullified if the students subsequently work with the code to make it their own. These findings suggest a need for the development of standards that elucidate acceptable practices for computing, combined with ongoing education of computing students.", "authors": [{"name": "Angela Carbone", "affiliation": "Monash University, Melbourne, Australia"}, {"name": "Beth Cook", "affiliation": "University of Newcastle, Newcastle, Australia"}, {"name": "Chris Johnson", "affiliation": "Australian National University, Canberra, Australia"}, {"name": " Simon", "affiliation": "University of Newcastle, Newcastle, Australia"}, {"name": "Judy Sheard", "affiliation": "Monash University, Melbourne, Australia"}], "tags": ["computing education", "academic integrity", "non-text-based assessment"]}, {"title": "A historical examination of the social factors affecting female participation in computing", "link": "https://dl.acm.org/doi/10.1145/2591708.2591731", "abstract": "We present a history of female participation in North American CS, with a focus on the social forces involved. For educators to understand the status quo, and how to change it, we must understand the historical forces that have led us here. We begin with the female ''computers'' of the 19th century, then cover the rise of computing machines, establishment of CS, and a history of CS education with regard to gender. In our discussion of academic CS, we contemplate academic generations of female computer scientists and describe their differential experiences.", "authors": [{"name": "Steve Easterbrook", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Elizabeth Patitsas", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Michelle Craig", "affiliation": "University of Toronto, Toronto, ON, Canada"}], "tags": ["women in cs", "studies of cs", "computer science education"]}, {"title": "Cultural appropriation of computational thinking acquisition research: seeding fields of diversity", "link": "https://dl.acm.org/doi/10.1145/2591708.2591729", "abstract": "In this paper, we report the developments of a Computational Thinking Acquisition project carried out in pilot Brazilian schools. The project is a branch of a successful, more than a decade old project in the USA. We present and discuss the factors that led to specific cultural appropriation and diversification of the North American experience. In particular, we explain the kind of technology that has been developed in South America compared to the one developed and used in the USA, and propose that the lessons we have learned in the project's short history in Brazil can already seed the reflection of IT and Education researchers.", "authors": [{"name": "Carla F. Leitão", "affiliation": "Pontifical Catholic University of Rio de Janeiro (PUC-Rio), Rio de Janeiro, Brazil"}, {"name": "Luciana C. Salgado", "affiliation": "Pontifical Catholic University of Rio de Janeiro (PUC-Rio), Rio de Janeiro, Brazil"}, {"name": "Martha M. Serra", "affiliation": "Pontifical Catholic University of Rio de Janeiro (PUC-Rio), Rio de Janeiro, Brazil"}, {"name": "Clarisse S. de Souza", "affiliation": "Pontifical Catholic University of Rio de Janeiro (PUC-Rio), Rio de Janeiro, Brazil"}], "tags": ["programming", "computational thinking acquisition", "agentsheets"]}, {"title": "Apps for social justice: motivating computer science learning with design and real-world problem solving", "link": "https://dl.acm.org/doi/10.1145/2591708.2591751", "abstract": "In this paper, we describe a twelve-week Apps for Social Justice course that we taught at an after-school program. Students read social justice literature, identified local community needs, and went through a design process to create fully functional mobile applications to address these needs. Using Nasir and Hand's concept of practice-linked identities, we argue that an integrative approach to introducing computer science -- where CS principles are used in pursuit of meaningful community goals -- provides multiple opportunities for students to participate in software development while connecting these skills and dispositions to their own experiences and to larger social issues. Unlike a concepts-first approach, which introduces computer science ideas using small, often decontextualized examples, a practiced-based approach that builds on student experiences may foster a more motivating and meaningful learning environment.", "authors": [{"name": "Sarah J. Van Wart", "affiliation": "University of California at Berkeley, Berkeley, CA, USA"}, {"name": "Tapan S. Parikh", "affiliation": "University of California at Berkeley, Berkeley, CA, USA"}, {"name": "Sepehr Vakil", "affiliation": "University of California at Berkeley, Berkeley, CA, USA"}], "tags": ["app development", "social justice", "computer education pipeline", "apprenticeship", "hci"]}, {"title": "Things coming together: learning experiences in a software studio", "link": "https://dl.acm.org/doi/10.1145/2591708.2591720", "abstract": "We have evidence that the software studio provides learning that genuinely prepares students for professional practice. Learning that entails dealing with complex technical problems and tools. Learning that involves working effectively in groups. Learning that results in the building of students' self-confidence and the conviction that they can successfully deal with the challenges of modern software system development. Learning that allows the accomplishment of the more elusive professional competencies. In order for students to achieve this type of deep learning, they need time to immerse themselves in complex problems within a rich environment -- such as the software studio. The studio also enables each student group to develop and succeed according to their needs, and in different ways. The conclusions above arise from an ethnographic study in an undergraduate software studio prototype with two student groups and their mentors.", "authors": [{"name": "Andrea Connor", "affiliation": "University of Technology, Sydney, Sydney, Australia"}, {"name": "Julia Prior", "affiliation": "University of Technology, Sydney, Sydney, Australia"}, {"name": "John Leaney", "affiliation": "University of Technology, Sydney, Sydney, Australia"}], "tags": ["design practice", "software engineering education", "studio-based learning and instruction", "professional competencies", "groups", "ethnography", "graduate attributes"]}, {"title": "Understanding students' preferences of software engineering projects", "link": "https://dl.acm.org/doi/10.1145/2591708.2591753", "abstract": "Students in a maintenance-centric, introductory software engineering course were expected to understand, analyze and extend an open source software project of their choice, selected from a limited set of prepared applications. Students fell into two groups: those who chose a project based on its perceived and estimated difficulty, and those who chose a project based on the appeal of the subject matter. Students in both groups, however, cited value for themselves in terms of enhanced learning experience, and for users in terms of increased benefit, as reasons for their selection. These insights into students' thinking can guide future efforts in selecting projects that can simultaneously support the learning objectives as well as motivate the students, not only in software engineering but also in broader computing courses.", "authors": [{"name": "Thérèse Smith", "affiliation": "University of Connecticut, Storrs, CT, USA"}, {"name": "Swapna Gokhale", "affiliation": "University of Connecticut, Storrs, CT, USA"}, {"name": "Robert McCartney", "affiliation": "University of Connecticut, Storrs, CT, USA"}], "tags": ["student choice", "open source", "software engineering"]}, {"title": "Mobile application development classes for the mobile era", "link": "https://dl.acm.org/doi/10.1145/2591708.2591710", "abstract": "There are many flavors of upper division elective classes that cover subjects related to mobile technologies and application development. However, there is a general lack of publications discussing the philosophy, implementation, and results from these classes. When researching for a new upper division mobile application development elective class, based on our students' needs and state of the mobile technologies, we consulted the extensive online information, and drafted guidelines and desired learning outcomes. In the subsequent years, we implemented two versions of mobile application development classes based on the guidelines and learning outcomes. The first, focused on the development of practical mobile applications while the second studied design issues surrounding modern mobile applications and their development. Both classes are project based where students build mobile applications to demonstrate their understanding, and both classes were well received. This paper describes our efforts and the classes, summarizes the results from the classes, and discusses the merits of implementation vs. design based mobile application development classes.", "authors": [{"name": "Kelvin Sung", "affiliation": "University of Washington Bothell, Bothell, WA, USA"}, {"name": "Arjmand Samuel", "affiliation": "Microsoft, Redmond, WA, USA"}], "tags": ["upper division", "mobile computing", "elective", "application development", "computer science education"]}, {"title": "A teaching model for development of sensor-driven mobile applications", "link": "https://dl.acm.org/doi/10.1145/2591708.2591719", "abstract": "This paper concerns teaching computer science undergraduate students to develop sophisticated sensor-driven mobile applications, which students find interesting and motivating. Computer science students commonly adopt a trial-and-error application development process. However, indeterminacy inherent in sensor data makes the trial-and-error approach difficult, which frustrates students and impairs learning. In addition, the complexity of modern mobile devices' development environment and numerous APIs can further undo the motivating effect that these types of applications bring. To address these challenges, we propose a teaching model for sensor-driven mobile application development. The model features an application development process and a set of supporting tools and programs. The model provides a structured way for students to deal with the indeterminacy of sensor data and the complex development environments and results in a positive and supportive learning experience for the students. A case study of applying the model in an upper-level computer science elective course has shown it to be effective.", "authors": [{"name": "Kostadin Damevski", "affiliation": "Virginia State University, Petersburg, VA, USA"}, {"name": "Hui Chen", "affiliation": "Virginia State University, Petersburg, VA, USA"}], "tags": ["teaching model", "sensors-driven mobile applications"]}, {"title": "Students' performance on programming-related tasks in an informatics contest in Finland, Sweden and Lithuania", "link": "https://dl.acm.org/doi/10.1145/2591708.2591760", "abstract": "The ways in which informatics is covered in K-12 education vary among European countries. In Finland and Sweden, informatics is not included in the core curriculum, whereas, for example, in Lithuania, all students are exposed to some informatics concepts starting in the fifth grade. Bebras is an annually arranged international informatics contest for K-12 level, resulting in a large collection of data about contestants and their results. In this paper, we analyse contest data from the Finnish, Swedish and Lithuanian 2013 con- tests, focusing on students' performance on tasks related to algorithmic thinking. Our findings suggest that despite coming from different educational systems, students perform rather similarly on the tasks. The same tasks are difficult and the thinking behind picking an incorrect answer seems rather similar throughout the countries. The analysis also points out that there is a lack of easy questions -- this needs to be fixed in order to not risk scaring students away.", "authors": [{"name": "Timo Poranen", "affiliation": "University of Tampere, Tampere, Finland"}, {"name": "Valentina Dagiene", "affiliation": "Vilnius University, Vilnius, Lithuania"}, {"name": "Linda Mannila", "affiliation": "Åbo Akademi University; Linköping University, Turku (FIN); Linköping (SWE), Finland"}, {"name": "Lennart Rolandsson", "affiliation": "Royal Institute of Technology, Stockholm, Sweden"}, {"name": "Pär Söderhjelm", "affiliation": "Lund University, Lund, Sweden"}], "tags": ["programming", "data structures", "contests", "algorithmic thinking", "informatics education"]}, {"title": "Understanding differences among coding club students", "link": "https://dl.acm.org/doi/10.1145/2591708.2591716", "abstract": "Scholars and instructors have been carrying out a multitude of actions to increase students' interest in computer science during the past years. Still, there is a need for knowledge on how these attempts develop student interest. In this qualitative study, we construct illustrative categories out of students who have attended our K-12 coding club and game programming summer course activities. We found four categories: Inactivity, Lack of self-direction, Experimenting, and Professionalism. We also briefly project this abstraction onto a four-phase model of interest development.", "authors": [{"name": "Vesa Lappalainen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Ville Isomöttönen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Antti-Jussi Lakanen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}], "tags": ["k-12", "game programming", "recruitment", "outreach"]}, {"title": "Responses to adaptive feedback for software testing", "link": "https://dl.acm.org/doi/10.1145/2591708.2591756", "abstract": "As students learn to program they also learn basic software development methods and techniques, but educators do not often directly assess students' development processes or evaluate their adherence to specific techniques. However, automated grading systems provide opportunities to evaluate students' programming and provide feedback while the student is still in the process of developing. Consequently, automated adaptive feedback may help reinforce effective techniques and processes.\nThis paper describes an adaptive feedback system that uses strategic reinforcement techniques to reward and encourage incremental software testing. By analyzing changes in students' code after they receive the system's reinforcement, we investigated students' responses to the presence and absence of rewards. We found that after receiving rewards, students respond with more test code in their subsequent submission.", "authors": [{"name": "Kevin Buffardi", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Stephen H. Edwards", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["operant conditioning", "punishment", "instructional technolgy", "reinforcement", "adaptive feedback", "test-driven development (tdd)", "behavioral change", "automated assessment"]}, {"title": "Do student programmers all tend to write the same software tests?", "link": "https://dl.acm.org/doi/10.1145/2591708.2591757", "abstract": "While many educators have added software testing practices to their programming assignments, assessing the effectiveness of student-written tests using statement coverage or branch coverage has limitations. While researchers have begun investigating alternative approaches to assessing student-written tests, this paper reports on an investigation of the quality of student written tests in terms of the number of authentic, human-written defects those tests can detect. An experiment was conducted using 101 programs written for a CS2 data structures assignment where students implemented a queue two ways, using both an array-based and a link-based representation. Students were required to write their own software tests and graded in part on the branch coverage they achieved. Using techniques from prior work, we were able to approximate the number of bugs present in the collection of student solutions, and identify which of these were detected by each student-written test suite. The results indicate that, while students achieved an average branch coverage of 95.4% on their own solutions, their test suites were only able to detect an average of 13.6% of the faults present in the entire program population. Further, there was a high degree of similarity among 90% of the student test suites. Analysis of the suites suggest that students were following naïve, \"happy path\" testing, writing basic test cases covering mainstream expected behavior rather than writing tests designed to detect hidden bugs. These results suggest that educators should strive to reinforce test design techniques intended to find bugs, rather than simply confirming that features work as expected.", "authors": [{"name": "Zalia Shams", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Stephen H. Edwards", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["automated grading", "happy path", "mutation testing", "test quality", "software testing", "program assignments", "test coverage", "automated assessment"]}, {"title": "QR code programming tasks with automated assessment", "link": "https://dl.acm.org/doi/10.1145/2591708.2591761", "abstract": "In this paper, we present a novel method to support automated formative assessment of programming tasks. Whereas traditional automated assessment tools mainly apply textual comparison of test program output vs. model output, we present a method that applies graphical output in terms of QR (Quick Response) codes. In our approach, programming tasks are formulated in such a way that the correct output of the task is a QR code. The correctness of the solution can therefore be tested by scanning the QR code. Despite the simple form of the tasks, they can support automated assessment with instant feedback, multiple programming languages, and simple statistics of students' performance. In some cases, feedback about misconceptions can also be given automatically. Moreover, they fit well to game-like learning environments, because the output can be interpreted as an URL which can lead to new clues or puzzles in a game. This is very useful, for example, in alternate reality games.", "authors": [{"name": "Lasse Hakulinen", "affiliation": "Aalto University, Espoo, Finland"}, {"name": "Lauri Malmi", "affiliation": "Aalto University, Espoo, Finland"}], "tags": ["programming task", "automated assessment", "qr code"]}, {"title": "Intercultural computer science education", "link": "https://dl.acm.org/doi/10.1145/2591708.2591744", "abstract": "The issues of Intercultural education (IcE) and Computer Science (CSE) education are of paramount importance in the twenty-first century. In this paper we describe a sweeping initiative to infuse cultural diversity in CSE through art-based pedagogical tools. We present an online e-learning environment that has the potential to equally promote both IcE and CSE. The folkdance choreographies we have created illustrate, on the one hand, basic CS concepts (six different sorting algorithms) and, on the other hand, the cultural diversity of Transylvania (Romania). Our \"ALGO-RYTHMICS: science and art without ethnic borders\" project also illustrates how the concept of \"unity-in-diversity\" can be implemented in a science educational context: multicultural artistic performances promoting the cause of universal science. The study we performed revealed possible difficulties CS teachers may face when they are presenting scientific content in culturally diverse contexts (especially in regions with cultural tension). Research results revealed that students' culture related concepts and feelings may even influence the way they relate to the scientific content.", "authors": [{"name": "Zoltan Katai", "affiliation": "Sapientia University, Târgu-Mure/Corunca, Romania"}], "tags": ["algorithm visualizations", "multicultural education", "art and science", "multimedia.", "intercultural education", "computer science education", "multisensory education"]}, {"title": "Course development through student-faculty collaboration: a case study", "link": "https://dl.acm.org/doi/10.1145/2591708.2591723", "abstract": "Traditionally, faculty plan and implement courses with students as the target audience, based upon educational goals and objectives. With today's interest in active learning, faculty try to anticipate activities that will resonate with students. This paper presents a different model that utilizes faculty-student collaboration for course development -- in this case, creating an introductory C-based course on imperative problem solving with robots as an application theme. Basing development on course goals and objectives, a faculty member works with a development team of undergraduate students to structure course content, prepare materials (e.g., readings, laboratory exercises, projects), and test each element of the course. In subsequent semesters, students taking the course provide feedback on all materials, the development team updates materials, and the refinement process iterates. The resulting course meets goals and objectives, provides wonderful motivation, and highlights creativity and intellectual challenge within computer science as well as syntax, semantics, and core technical skills.\nThis paper builds upon a previous report (SIGCSE 2013 Proceedings, pp. 27-32), by highlighting the course development process and providing data that assess course effectiveness. The resulting course has been identified as an \"exemplar\" by CS Curricula 2013 (pp. 454-455, 458-459), providing a strong second course in a three-course, multi-paradigm introductory sequence that emphasizes a lab-based approach with collaborative learning. Course materials at co-author Walker's home page.", "authors": [{"name": "Dilan Ustek", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "Henry M. Walker", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "David Cowden", "affiliation": "Inkling, San Francisco, CA, USA"}, {"name": "Erik Opavsky", "affiliation": "Grinnell College, Grinnell, IA, USA"}], "tags": ["lab-based course", "robots", "collaborative learning", "modules", "course materials"]}, {"title": "Making group processes explicit to student: a case of justice", "link": "https://dl.acm.org/doi/10.1145/2591708.2591717", "abstract": "This article considers student learning about group work in the context of project courses where student groups work under realistic expectations. Based on the literature, justice is explicated as a group work concept and regarded as a professional skill that can be practiced. Preliminary student feedback on teaching through continuous discussions on justice are presented together with teacher experiences.", "authors": [{"name": "Ville Isomöttönen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}], "tags": ["group work skills", "justice", "project-based learning"]}, {"title": "A methodological approach to key competencies in informatics", "link": "https://dl.acm.org/doi/10.1145/2591708.2591742", "abstract": "Competencies in informatics have traditionally been fixed, defined, and identified either normatively by groups of experts or as derivations from educational standards of one of various external fields. This paper presents a novel approach, which is methodologically driven by Qualitative Content Analysis (QCA). My goal was to derive key competencies in informatics from previously established educational approaches in informatics. First I consulted a number of textbooks on didactics in informatics and compiled a list of possible candidates for competencies. The list was used as a QCA category set, by which six different educational approaches were analyzed. Every time a new competency was identified, it was added to the category set and a new iteration of the analyzing process was commenced using the newly enhanced list of competencies. Since the material for the analysis consisted of research documents of existing educational approaches for school education, the result was a collection of competencies with the property of maximal prevalence across the range of educational concepts. A final refinement step identified those competencies which have connections to all of the four main categories of informatics, namely theoretical informatics, technical informatics, practical informatics, and applied informatics. These competencies were termed \"Key Competencies in Informatics\".", "authors": [{"name": "Christina Dörge", "affiliation": "FOM University of Applied Sciences, 28359 Bremen, Germany"}], "tags": ["competencies", "methodology", "education", "didactics", "qualitative content analysis", "educational approaches and concepts", "key competencies"]}, {"title": "Weaving computing into all middle school disciplines", "link": "https://dl.acm.org/doi/10.1145/2591708.2591754", "abstract": "In order to get students interested in computing, we teach middle school teachers of different disciplines programming with Alice and work with them on integrating computing into their discipline. Alice provides an interface for novices to create animations easily and quickly, which is attractive to and fun for students. We have been developing Alice curriculum materials for integrating computing into middle school disciplines for six years. Although our target audience is middle school, our materials are used by teachers from elementary school to introductory college level. This paper describes our newest curriculum materials for several disciplines developed by both us and our teachers. Our newest curriculum materials include tutorials, sample projects, and challenges, which are projects with missing pieces. We also discuss our recent outreach efforts with middle school students.", "authors": [{"name": "Daniel MacDonald", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Michael Hoyle", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Michael Marion", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Susan H. Rodger", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Elizabeth Onstwedder", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Edwin Ward", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Dwayne Brown", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Bella Onwumbiko", "affiliation": "Duke University, Durham, NC, USA"}], "tags": ["introductory computer science", "alice", "k-12 education", "middle school", "virtual worlds"]}, {"title": "Early validation of computational thinking pattern analysis", "link": "https://dl.acm.org/doi/10.1145/2591708.2591724", "abstract": "End-user game design affords teachers a unique opportunity to integrate computational thinking concepts into their classrooms. However, it is not always apparent in game and simulation projects what computational thinking-related skills students have acquired. Computational Thinking Pattern Analysis (CTPA) enables teachers to visualize which of nine specific skills students have mastered in game design that can then be used to create simulations. CTPA has the potential to automatically recognize and calculate student computational thinking skills, as well as to map students' computational thinking skill progression, as they proceed through the curriculum. The current research furthers knowledge of CTPA by exploring its validity based on how its performance correlates to human grading of student games. Initial data from this validation study indicates that CTPA correlates well with human grading and that it can even be used to predict students' future achievement levels given their current skill progression, making CTPA a potentially invaluable computational thinking evaluation tool for teachers.", "authors": [{"name": "Ashok Basawapatna", "affiliation": "AgentSheets Inc., Boulder, CO, USA"}, {"name": "Kyu Han Koh", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}, {"name": "Alexander Repenning", "affiliation": "AgentSheets Inc., Boulder, CO, USA"}, {"name": "Hilarie Nickerson", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}], "tags": ["computational thinking", "computational thinking assessment", "end user programming", "computational thinking pattern analysis", "cyberlearning infrastructure"]}, {"title": "Guess my object: an 'objects first' game on objects' behavior and implementation with bluej", "link": "https://dl.acm.org/doi/10.1145/2591708.2591725", "abstract": "Introductory programming education following the Objects First approach introduces the concepts of object-oriented programming early on. Objects with state (fields) and behavior (methods) that offer services to their clients (via their public interface) and hide the way these services are implemented (in their implementation) are the building blocks of any larger object system. These basic properties of objects are so crucial for understanding object-oriented programming (and later on object-oriented design) that diverse approaches to teaching them should be offered. In this paper we introduce Guess My Object (GMO) as a new approach to getting in contact with objects early that can complement existing teaching approaches. In essence, GMO is a way of using BlueJ for an interactive round-based game, each consisting of two stages, behavior exploration and behavior implementation.", "authors": [{"name": "Axel W. Schmolitzky", "affiliation": "University of Hamburg, Hamburg, Germany"}, {"name": "Timo Göttel", "affiliation": "University of Hamburg, Hamburg, Germany"}], "tags": ["cs1", "gamification", "objects first"]}, {"title": "Game programming for improving learning experience", "link": "https://dl.acm.org/doi/10.1145/2591708.2591737", "abstract": "In Computer Science Education there is a tendency to implement active learning paradigms where students are the focus of the educational process. An instantiation of these learning methods are gaming environments. We present ProGames, a system for learning programming skills through a leveled set of visually-attractive and interactive programming games in Greenfoot, categorized by student's likes offering them solutions to sets of problems that they really enjoy or like most. The system has been evaluated during the academic course 2012-13 in three Computer Science Degrees and our results indicate that using ProGames had a most positive influence in the students learning. Moreover, the subjective opinion of students reflects that they really enjoyed working with the system and increased the engagement with the course.", "authors": [{"name": "Luís Carriço", "affiliation": "University of Lisbon, Lisbon, Portugal"}, {"name": "Celeste Pizarro-Romero", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}, {"name": "Ángel Velázquez-iturbide", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}, {"name": "Raquel B. Hijon-Neira", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}], "tags": ["game programming", "greenfoot", "introductory computing courses", "visual programming language", "programming teaching"]}, {"title": "Assessment process for a simulation-based training environment in global software development", "link": "https://dl.acm.org/doi/10.1145/2591708.2591747", "abstract": "Simulation has been applied in several Software Engineering fields, and is shown to be a useful method in industrial training. As part of our research work, we have used simulation to provide training in Global Software Development (GSD). We have developed a platform to strengthen GSD skills by simulating realistic settings in which learners interact with Virtual Agents of differing cultures. Thus, learners will experience multi-cultural problems and will develop specific GSD communication skills. The development of these skills must, however, be accurately assessed, bearing in mind that the training is aimed at learners with different characteristics and skills. In this paper we present an assessment process based on educational theory adapted to our simulation-based training environment. Methods to minimize the instructors' effort and tailor the assessment to specific training needs are proposed. The assessment process has been evaluated by 34 potential users. Results indicate that the assessment method yields meaningful results and proof of learning. Also that automated assessment can be achieved with minimal intervention from the instructor. Though tailored for GSD, this method could be applied to other domains, in both industry and academia.", "authors": [{"name": "John Noll", "affiliation": "University of Limerick, Limerick, Ireland"}, {"name": "Mario Piattini", "affiliation": "University of Castilla-La Mancha, Ciudad Real, Ireland"}, {"name": "Sarah Beecham", "affiliation": "University of Limerick, Limerick, Ireland"}, {"name": "Miguel Jiménez Monasor", "affiliation": "University of Limerick, Limerick, Ireland"}, {"name": "Aurora Vizcaíno", "affiliation": "University of Castilla-La Mancha, Ciudad Real, Spain"}], "tags": ["simulation", "education", "assessment", "global software development", "training"]}, {"title": "Towards identification and classification of core and threshold concepts in methodology education in computing", "link": "https://dl.acm.org/doi/10.1145/2591708.2591758", "abstract": "Research methodology is a quintessential component of science, but methods differ greatly between sciences. In computing, methods are borrowed from many fields, which causes difficulties to methodology education in computing. In our methodology courses in computing, we have observed a number of core and threshold concepts that affect students' success. This essay describes a work in progress towards understanding those core and threshold concepts in methodology education in computing, classified along two dimensions. We classify methodological concepts in terms of standard elements of research design in students' projects in computing, and in terms of their centrality and difficulty. We present examples of three types of troublesome knowledge concerning methodology: the strangeness and complexity of methodological concepts, misimpressions from everyday experience, and reasonable but mistaken expectations.", "authors": [{"name": "Sirkku Männikkö-Barbutiu", "affiliation": "Stockholm University, Kista, Sweden"}, {"name": "Danny Brash", "affiliation": "Stockholm University, Kista, Sweden"}, {"name": "Matti Tedre", "affiliation": "Stockholm University, Kista, Sweden"}, {"name": "Johannes Cronjé", "affiliation": "Cape Peninsula University of Technology, Cape Town, South Africa"}], "tags": ["research design", "methodology", "thesis work", "congruent design", "methodology education", "computer science education", "computing education"]}, {"title": "Leveraging open source principles for flexible concept inventory development", "link": "https://dl.acm.org/doi/10.1145/2591708.2591722", "abstract": "Concept Inventory (CI) assessments, which target high-level learning goals, have proven highly valuable for higher education research. These assessments have helped to evaluate pedagogical practices among individual instructors, both within and across institutions, and have hence elevated the level of discourse on education within the community. The success of CIs in physics has inspired similar developments in computer science, with a few CIs now developed for computer science courses. However, the development of a CI typically follows a burdensome process, requiring a significant investment to produce a single CI that may be difficult to deploy due to institutional curricular differences. Furthermore, as our field continues to be shaped by technological advances, a path to faster, more modular CI development is critical.\nThis paper proposes an alternative CI development model and continues the discussion within the community about the need for, and path to, concept inventories throughout the computer science curriculum. Specifically, we explore the implications of an open collaboration system for CI development that would mimic the principles common to open source software communities, which have regularly demonstrated their ability to produce high-quality results.", "authors": [{"name": "Kevin C. Webb", "affiliation": "Swarthmore College, Swarthmore, PA, USA"}, {"name": "Cynthia Taylor", "affiliation": "Oberlin College, Oberlin, OH, USA"}, {"name": "Leo Porter", "affiliation": "Skidmore College, Saratoga Springs, NY, USA"}], "tags": ["concept inventory", "assessment", "community discussion"]}, {"title": "Advanced data analytics education for students and companies", "link": "https://dl.acm.org/doi/10.1145/2591708.2591746", "abstract": "In this paper we introduce a regional education project and a positive experience of quick implementation of a new training package enabled by public funding from the European Social Fund. The project focuses on advanced data analytics (ADA) in business management.\nIn the project, advanced data analytics is taught to both students at University of Eastern Finland and to their potential employers at the local organizations. The university teaching favors effective teaching techniques instead of conventional teaching methods, and the same topics are taught to participants from local organizations as shorter versions. The organizations also have an important role in calibrating the teaching via discussions and maturity reviews.\nEven-though the project is regional there has been great nationwide interest in the project. This indicates the general need for improving know-how on ADA both at universities and in companies and organizations.", "authors": [{"name": "Virpi Hotti", "affiliation": "University of Eastern Finland, KUOPIO, Finland"}, {"name": "Mikko Kontio", "affiliation": "University of Eastern Finland, KUOPIO, Finland"}, {"name": "Maija Marttila-Kontio", "affiliation": "University of Eastern Finland, KUOPIO, Finland"}], "tags": ["data science education", "advanced data analytics education", "management", "advanced data analytics", "data science", "business intelligence"]}, {"title": "Peer instruction: a link to the exam", "link": "https://dl.acm.org/doi/10.1145/2591708.2591711", "abstract": "In computer science, the active learning pedagogical practice of Peer Instruction (PI) has been shown to improve final exam performance, reduce student failure rates, and improve student retention. PI consists of two major parts: group discussion and follow-up instructor intervention. We expect that PI performance as a whole will correlate with final exam performance, but it is unclear whether or how each piece of PI is involved in these relationships. In this work, we use isomorphic questions to isolate the effects of peer discussion and instructor intervention, and examine scores on a final exam and its code-writing and code-tracing questions. We find that both pieces of PI correlate with the final exam as a whole, code-tracing question (similar to PI questions), and code-writing question (not similar to PI questions). This is further evidence that both PI components are important to the success of PI.", "authors": [{"name": "Daniel Zingaro", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Leo Porter", "affiliation": "Skidmore College, Saratoga Springs, NY, USA"}], "tags": ["clickers", "final exam", "peer instruction"]}, {"title": "Comparing outcomes in inverted and traditional CS1", "link": "https://dl.acm.org/doi/10.1145/2591708.2591752", "abstract": "We compare a traditional CS1 offering with an inverted offering delivered the following year to a comparable student population. We measure student attitudes, grades, and final course outcomes and find that, while students in the inverted offering do not report increased enjoyment and are no more likely to pass, learning as measured by final exam performance increases significantly. This increase is not simply a function of a more onerous inverted offering, as students report spending similar time per week in the traditional and inverted offerings. Contrary to our hypotheses, however, we find no evidence that the the inverted offering disproportionally helps beginners or those not fully fluent in English.", "authors": [{"name": "Daniel Zingaro", "affiliation": "University of Toronto Mississauga, Mississauga, ON, Canada"}, {"name": "Jennifer Campbell", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Paul Gries", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Michelle Craig", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Diane Horton", "affiliation": "University of Toronto, Toronto, ON, Canada"}], "tags": ["cs1", "inverted classroom", "novice programming", "flipped classroom"]}, {"title": "CaptainTeach: multi-stage, in-flow peer review for programming assignments", "link": "https://dl.acm.org/doi/10.1145/2591708.2591738", "abstract": "Computing educators have used peer review in various ways in courses at many levels. Few of these efforts have applied peer review to multiple deliverables (such as specifications, tests, and code) within the same programming problem, or to assignments that are still in progress (as opposed to completed). This paper describes CaptainTeach, a programming environment enhanced with peer-review capabilities at multiple stages within assignments in progress. Multi-stage, in-flow peer review raises many logistical and pedagogical issues. This paper describes CaptainTeach and our experience using it in two undergraduate courses (one first-year and one upper-level); our analysis emphasizes issues that arise from the conjunction of multiple stages and in-flow reviewing, rather than peer review in general.", "authors": [{"name": "Shriram Krishnamurthi", "affiliation": "Brown University, Providence, RI, USA"}, {"name": "Joe Gibbs Politz", "affiliation": "Brown University, Providence, RI, USA"}, {"name": "Daniel Patterson", "affiliation": "Brown University, Providence, RI, USA"}, {"name": "Kathi Fisler", "affiliation": "WPI, Worcester, MA, USA"}], "tags": ["peer review", "testing", "learning environments"]}, {"title": "Enhancing syntax error messages appears ineffectual", "link": "https://dl.acm.org/doi/10.1145/2591708.2591748", "abstract": "Debugging is an important skill for novice programmers to acquire. Error messages help novices to locate and correct errors, but compiler messages are frequently inadequate. We have developed a system that provides enhanced error messages, including concrete examples that illustrate the kind of error that has occurred and how that kind of error could be corrected. We evaluate the effectiveness of the enhanced error messages with a controlled empirical study and find no significant effect.", "authors": [{"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Dave Carpenter", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["feedback", "novice", "error messages", "debugging", "programming", "syntax error", "errors"]}, {"title": "A qualitative think-aloud study of novice programmers' code writing strategies", "link": "https://dl.acm.org/doi/10.1145/2591708.2591762", "abstract": "This paper presents part of a larger long term study into the cognitive aspects of the early stages of learning to write computer programs Tasks designed to trigger learning events were used to provide the opportunity to observe student learning, in terms of the development and modification of cognitive structures or schemata, during think aloud sessions. A narrative analysis of six students' attempts to solve these tasks is presented. The students' progression in learning and attitudinal approaches to learning is examined and provides some insight into the cognitive processes involved in learning computer programming.", "authors": [{"name": "Jacqueline Whalley", "affiliation": "Auckland University of Technology, Auckland, New Zealand"}, {"name": "Nadia Kasto", "affiliation": "Auckland University of Technology, Auckland, New Zealand"}], "tags": ["vygotsky", "think aloud", "schemas", "novice programmers"]}, {"title": "Programming: reading, writing and reversing", "link": "https://dl.acm.org/doi/10.1145/2591708.2591712", "abstract": "In this paper, we look at the concept of reversibility, that is, negating opposites, counterbalances, and actions that can be reversed. Piaget identified reversibility as an indicator of the ability to reason at a concrete operational level. We investigate to what degree novice programmers manifest the ability to work with this concept of reversibility by providing them with a small piece of code and then asking them to write code that undoes the effect of that code. On testing entire cohorts of students in their first year of learning to program, we found an overwhelming majority of them could not cope with such a concept. We then conducted think aloud studies of novices where we observed them working on this task and analyzed their contrasting abilities to deal with it. The results of this study demonstrate the need for better understanding our students' reasoning abilities, and a teaching model aimed at that level of reality.", "authors": [{"name": "Donna Teague", "affiliation": "Queensland University of Technology, Brisbane, Australia"}, {"name": "Raymond Lister", "affiliation": "University of Technology, Sydney, Sydney, Australia"}], "tags": ["neo-piagetian theory", "think aloud", "programming", "novice programmers", "reversibility"]}, {"title": "Identifying computer science self-regulated learning strategies", "link": "https://dl.acm.org/doi/10.1145/2591708.2591715", "abstract": "Computer Science students struggle to develop fundamental programming skills and software development processes. Crucial to successful mastery is the development of discipline specific cognitive and metacognitive skills, including self-regulation. We can assist our students in the process of reflection and self-regulation by identifying and articulating successful self-regulated learning strategies for specific discipline contexts. However, in order to do so, we must develop an understanding of those discipline-specific strategies that are successful and can be readily adopted by students.\nIn this paper, we analyse student reflections from an introductory software development course, identifying the usage of self-regulated learning strategies that are either specific to the software development domain, or articulated in that context. This study assists in the understanding of how Computer Science students develop learning skill within the discipline, and provides examples to guide the development of scaffolding activities to assist learning development.", "authors": [{"name": "Rebecca Vivian", "affiliation": "University of Adelaide, Adelaide, SA, Australia"}, {"name": "Katrina Falkner", "affiliation": "University of Adelaide, Adelaide, SA, Australia"}, {"name": "Nickolas J.G. Falkner", "affiliation": "University of Adelaide, Adelaide, SA, Australia"}], "tags": ["computer science education", "self-regulation strategies"]}, {"title": "Motivational active learning: engaging university students in computer science education", "link": "https://dl.acm.org/doi/10.1145/2591708.2591750", "abstract": "Attracting and engaging computer science students to enhance their mathematical and algorithmic thinking skills are challenging tasks. In winter 2013 we introduced a new teaching format for a course, which combines theory in computer science with hands-on algorithmic challenges, mathematical thinking activities, and collaborative problem-solving. Therefore, we introduced the pedagogical model Motivational Active Learning (MAL), which is grounded in MIT's successful format for teaching physics, Technology-Enabled Active Learning (TEAL), and combines it with motivational strategies usually used by game designers. Results from the initial setup in class reveals that students indeed assessed the course structure as more interactive and motivating compared to other similar courses. In this paper we discuss the course design, issues, and the impact, and analyze the first results in detail.", "authors": [{"name": "Maria Riffnaller-Schiefer", "affiliation": "Graz University of Technology, Graz, Austria"}, {"name": "Johanna Pirker", "affiliation": "Graz University of Technology, Graz, Austria"}, {"name": "Christian Gütl", "affiliation": "Graz University of Technology, Graz, Austria"}], "tags": ["motivational learning", "active learning", "pedagogy", "gamification", "motivation", "interactive learning", "cs education", "game-based learning", "motivational active learning"]}, {"title": "Study on difficulties and misconceptions with modern type systems", "link": "https://dl.acm.org/doi/10.1145/2591708.2591726", "abstract": "Functional programming is often presented as an advantageous programming paradigm by its advocates, but many students and teachers consider it to be hard to learn. One particular hurdle in learning functional programming is mastering the modern type systems employed in these languages. In this article, we identify student difficulties with means of multiple choice questions embedded into the on-line materials of an introductory functional programming course. The most prevalent misconceptions were confusing with parametric polymorphism with subtyping, the assigning too much meaning to variables names, and confounding general language patterns with special cases.", "authors": [{"name": "Ville Tirronen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}], "tags": ["type systems", "experiment", "misconceptions", "functional programming"]}, {"title": "Interdisciplinary connections in a mobile computing and robotics course", "link": "https://dl.acm.org/doi/10.1145/2591708.2591735", "abstract": "Using robots and mobile devices in education can serve as a foundation for hands-on studies encompassing many different disciplines including computer and electrical engineering, computer science, mathematics, and physics. Educational robots and mobile technology have been shown to be successful in promoting student interest in these and other STEM (Science, Technology, Engineering, and Mathematics) disciplines. This paper describes an experience of using robotics and mobile computing in an upper-level Computer Science course. Our discussion focuses on leveraging the inherent symbiosis of these two topics to explore the connections between computing and other disciplines through experiential learning.", "authors": [{"name": "Stan Kurkovsky", "affiliation": "Central Connecticut State University, New Britain, CT, USA"}], "tags": ["mobile application development", "sphero", "mobile computing", "robotics", "android"]}, {"title": "Teaching a core CS concept through robotics", "link": "https://dl.acm.org/doi/10.1145/2591708.2591714", "abstract": "We implemented single-session workshops using the Thymio-II--a small, self-contained robot designed for young students, and VPL--a graphical software development environment based upon event handling. Our goal was to investigate if the students could learn this core computer science concept while enjoying themselves in the robotics context. A visual questionnaire was developed based upon the combined Bloom and SOLO taxonomies, although it proved difficult to construct a questionnaire appropriate for young students. We found that--despite the short duration of the workshop--all but the youngest students achieved the cognitive level of Unistructural Understanding, while some students achieved higher levels of Unistructural Applying. and Multistructural Understanding and Applying.", "authors": [{"name": "Fanny Riedo", "affiliation": "EPFL, Lausanne, Switzerland"}, {"name": "Jiwon Shin", "affiliation": "ETH Zurich, Zurich, Switzerland"}, {"name": "Roland Siegwart", "affiliation": "ETH Zurich, Zurich, Switzerland"}, {"name": "Morderchai Ben-Ari", "affiliation": "Weizmann Inst. Sci., Rehovot, Israel"}, {"name": "Stéphane Magnenat", "affiliation": "ETH Zurich, Zurich, Switzerland"}], "tags": ["aseba", "visual programming language", "robotics in education", "thymio", "event-action pair"]}, {"title": "Three views on motivation and programming", "link": "https://dl.acm.org/doi/10.1145/2591708.2591709", "abstract": "No abstract available.", "authors": [{"name": "Arto Vihavainen", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Amber Settle", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Juha Sorva", "affiliation": "Aalto University, Aalto, Finland"}], "tags": ["cs1", "programming", "visualization", "motivation", "recursion"]}, {"title": "ITiCSE: the next decade", "link": "https://dl.acm.org/doi/10.1145/2591708.2617812", "abstract": "This year marks the 19th ITiCSE conference. This panel will provide conference delegates, both frequent attendees and those new to ITiCSE the opportunity to reflect on the conference's success as one of the premier international com- puter science education conferences and to discuss potential future directions for the conference.", "authors": [{"name": "Alison Clear", "affiliation": "CPIT, Christchurch, New Zealand"}, {"name": "Arnold Pears", "affiliation": "Uppsala University, Uppsala, Sweden"}, {"name": "Ernesto Cuadros-Vargas", "affiliation": "Universidad Catolica San Pablo, Arequipa, Peru"}, {"name": "Cary Laxer", "affiliation": "Rose-Hulman Institute of Technology, terre haute, USA"}, {"name": "Lillian Cassel", "affiliation": "Villanova University, Philadelphia, USA"}, {"name": "Valentina Dagiene", "affiliation": "Vilnius University, Vilnius, Lithuania"}], "tags": ["iticse conference"]}]