[{"title": "The computing at school working group", "link": "https://dl.acm.org/doi/10.1145/2462476.2483794", "abstract": "The Computing at School (CAS) Working Group aims to promote the teaching of computer science at school. CAS was born out of our excitement with our discipline, combined with a serious concern that many students are being \"turned off\" computing by a combination of factors that have conspired to make the subject seem dull and pedestrian. Our goal is to put the excitement back into Computing at school.", "authors": [{"name": "Simon Peyton Jones", "affiliation": "Microsoft Research - Cambridge, Cambridge, United Kingdom"}], "tags": ["teaching cs in school"]}, {"title": "The fastest man on earth", "link": "https://dl.acm.org/doi/10.1145/2462476.2483795", "abstract": "Wing Commander Andy Green is a Royal Air Force fighter pilot and holder of the World Land Speed Record. He is \"The Fastest Man on Earth,\" and will attempt to break the record again in the new BLOODHOUND SuperSonic Car, which aims to exceed 1000 mph. This project is linked to a major education programme in schools across the country, which aims to inspire the next generation of young engineers and scientists, while setting the most remarkable Land Speed Record of all time.", "authors": [{"name": "Andy Green", "affiliation": "Royal Air Force, London, United Kingdom"}], "tags": ["educational communities"]}, {"title": "Kinetic: a learning environment within business", "link": "https://dl.acm.org/doi/10.1145/2462476.2483796", "abstract": "Kinetic Solutions was born from the vision of its two founders and with £0 of external investment. Despite many hard lessons learnt along the way and continued risks taken into new sectors and mar- kets, the company has grown year on year into an organisation with 70 employees, operating from offices in the UK, US and Australasia. The success of the business is down to continued innovation and by working with people that are not only passionate about our customers and products but want to continue to carry on learning and achieving. I believe that by recruiting and developing the skills of our team regardless of their background, it is this resultant collective collaboration and open discussion that provide the strongest routes to our growth and success.", "authors": [{"name": "Chris Wildsmith", "affiliation": "Kinetic Solutions, Cranfield, United Kingdom"}], "tags": ["lifelong learning"]}, {"title": "An informatics perspective on computational thinking", "link": "https://dl.acm.org/doi/10.1145/2462476.2483797", "abstract": "In this paper, we examine computational thinking and its connections to critical thinking from the perspective of in- formatics. We developed an introductory course for students in our College of Informatics, which includes majors rang- ing from journalism to computer science. The course cov- ered a set of principles of informatics, using both lectures and active learning sessions designed to develop informat- ics and computational thinking skills. The set of principles was drawn from a wide set of sources, and included broad principles like those of Denning and Loidl, as well as more limited principles related to topics like universal computa- tion and undecidability. We evaluated the change in both computational and critical thinking skills over the course of the semester, using a well-known validated critical thinking test and a computational thinking test of our own devising.", "authors": [{"name": "Maureen Doyle", "affiliation": "Northern Kentucky University, Highland Heights, KY, USA"}, {"name": "Zachary Hart", "affiliation": "Northern Kentucky University, Highland Heights, KY, USA"}, {"name": "Rudy Garns", "affiliation": "Northern Kentucky University, Highland Heights, KY, USA"}, {"name": "James Walden", "affiliation": "Northern Kentucky University, Highland Heights, KY, USA"}], "tags": ["informatics", "computational thinking"]}, {"title": "Computational thinking in educational activities: an evaluation of the educational game light-bot", "link": "https://dl.acm.org/doi/10.1145/2462476.2466518", "abstract": "Computational thinking is gaining recognition as an important skill set for students, both in computer science and other disciplines. Although there has been much focus on this field in recent years, it is rarely taught as a formal course within the curriculum, and there is little consensus on what exactly computational thinking entails and how to teach and evaluate it. To address these concerns, we have developed a computational thinking framework to be used as a planning and evaluative tool. Within this framework, we aim to unify the differing opinions about what computational thinking should involve. As a case study, we have applied the framework to Light-Bot, an educational game with a strong focus on programming, and found that the framework provides us with insight into the usefulness of the game to reinforce computer science concepts.", "authors": [{"name": "Lindsey Ann Gouws", "affiliation": "Rhodes University, Grahamstown, South Africa"}, {"name": "Peter Wentworth", "affiliation": "Rhodes University, Grahamstown, South Africa"}, {"name": "Karen Bradshaw", "affiliation": "Rhodes University, Grahamstown, South Africa"}], "tags": ["computer science education", "evaluation framework", "computational thinking"]}, {"title": "From theory to practice: NP-completeness for every CS student", "link": "https://dl.acm.org/doi/10.1145/2462476.2465582", "abstract": "NP-completeness is one of the most central concepts in computer science, and has been extensively applied in many diverse application areas. Despite this, students have problems grasping the concept and, more specifically, applying it to new problems. Independently, we have identified these problems at our universities in different countries and cultures. In an action research approach we have modified our courses and studied the effects. We here present some promising results. Our approach is mainly based on the idea of making more evident the fact that proving a new NP-completeness result is not at all different from designing a new algorithm. Based on this idea, we used tools typically used to teach algorithms (such as automatic program assessment and algorithm visualization systems), accompanied by other activities mainly devoted to augmenting the motivation to study computational complexity and forcing students to think and adopt a standpoint.", "authors": [{"name": "Pierluigi Crescenzi", "affiliation": "Università degli Studi di Firenze, Florence, Italy"}, {"name": "Emma Enström", "affiliation": "KTH Royal Institute of Technology, Stockholm, Sweden"}, {"name": "Viggo Kann", "affiliation": "KTH Royal Institute of Technology, Stockholm, Sweden"}], "tags": ["self-efficacy", "np-completeness", "algorithm visualization", "assessment"]}, {"title": "Design eye: an interactive learning environment based on the solo taxonomy", "link": "https://dl.acm.org/doi/10.1145/2462476.2462509", "abstract": "We describe the design of a web-based interactive learning environment that guides students' learning of visual aesthetics. With aesthetics, the whole is greater than the sum of its parts. However, initially we take an element-by-element approach that aligns well to the SOLO Taxonomy and software components. Using the colour element as an exemplar, we trialled our online learning environment with 36 undergraduate students undertaking a Human-Computer Interaction course. The results suggest that students enjoy and engage in the process, indicating the potential of our structured approach to learning visual aesthetics within Human Computer Interaction education.", "authors": [{"name": "Andrew Luxton-Reilly", "affiliation": "University of Auckland, Auckland, New Zealand"}, {"name": "Ian Warren", "affiliation": "University of Auckland, Auckland, New Zealand"}, {"name": "Safurah Abdul Jalil", "affiliation": "University of Auckland, Auckland, New Zealand"}, {"name": "Beryl Plimmer", "affiliation": "University of Auckland, Auckland, New Zealand"}], "tags": ["visual aesthetics", "HCI education", "user interface design"]}, {"title": "Interactive educational simulations for promoting the comprehension of basic compiler construction concepts", "link": "https://dl.acm.org/doi/10.1145/2462476.2462498", "abstract": "Evaluators 2.0 is an educational software system that lets instructors in introductory compiler construction courses generate interactive simulators from batteries of exercises concerning basic concepts in attribute grammars. The system also makes it possible to analyze the activities of the students who use these simulators. Students interact with the simulators generated to decide the evaluation order of semantic attributes in the attributed syntax trees, and they receive immediate feedback about the actions performed. Thus, these simulations help students to understand the fundamental concepts of the formalism of attribute grammars and of its underlying computational model. This paper describes the different software tools that constitute Evaluators 2.0 as well as the nature of the simulators generated, and also reports on different assessments of the system involving both instructors and students.", "authors": [{"name": "Mercedes Gómez-Albarrán", "affiliation": "Universidad Complutense de Madrid, Madrid, Spain"}, {"name": "José-Luis Sierra-Rodríguez", "affiliation": "Universidad Complutense de Madrid, Madrid, Spain"}, {"name": "Daniel Rodriguez-Cerezo", "affiliation": "Universidad Complutense de Madrid, Madrid, Spain"}], "tags": ["attribute grammar", "analysis tool", "authoring tool", "education in compiler construction", "interacttive educational simulation"]}, {"title": "Voice interactive learning: a framework and evaluation", "link": "https://dl.acm.org/doi/10.1145/2462476.2462489", "abstract": "Multi-channel access to information has gained interest in the past years. Yet, the usage of alternative modes of interaction has not been extended into mainstream e-learning systems. This paper illustrates how the elements of a multi-channel learning framework can be identified and used in practice to enable complementary aural access to visual-only web-based environments. To complement these findings, this research proposes an evaluation method that considers usability and didactic effectiveness parameters to support the assessment of voice interactive learning solutions, and allows for the exploration of the meaning and measure of enabling voice interaction in traditional Internet-based learning systems. The results obtained from developing and evaluating audio features with postgraduate students from the University of Oviedo, allow us to present an analysis of the benefits and implications of following the proposed approach, and better understand the influence of voice interaction in e-learning.", "authors": [{"name": "Víctor Álvarez-García", "affiliation": "University of Oviedo, Oviedo, Spain"}, {"name": "M. Riestra-González", "affiliation": "University of Oviedo, Oviedo, Spain"}, {"name": "MPuerto Paule-Ruiz", "affiliation": "University of Oviedo, Oviedo, Spain"}, {"name": "J. R. Pérez-Pérez", "affiliation": "University of Oviedo, Oviedo, Spain"}], "tags": ["voice interaction", "e-learning", "evaluation", "adaptation"]}, {"title": "Teaching and assessing programming fundamentals for non majors with visual programming", "link": "https://dl.acm.org/doi/10.1145/2462476.2462492", "abstract": "Visual programming tools and mobile device applications are a natural tool to engage university students; but, are they effective in teaching quantitative thinking skills to non computer science majors? Answering this question can be based on careful assessment of the learning outcomes.\nThis paper reports the results from teaching over 100 students mobile app development with App Inventor in a university core course. Results were measured using an assessment process motivated by Bloom's Taxonomy that included student self assessment, ratings by instructors, and comparisons of the two results. The categories in the assessment were mapped to specific levels of skills with various App Inventor components.\nResults presented here confirm App Inventor's effectiveness and ability to motivate students. App Inventor features and components that most impacted the student learning are noted.\nThe assessment results show the course was very successful particularly in the three assessment categories of Remembering, Understanding, and Application (Lower Order Thinking Skills) and acceptably successful in Analysis, Evaluating, and Creating (Higher Order Thinking Skills). The paper concludes with suggestions on continued improvement of the course content and additional App Inventor features that should become part of the assessment process.", "authors": [{"name": "William L. Honig", "affiliation": "Loyola University Chicago, Chicago, IL, USA"}], "tags": ["bloom's taxonomy", "app inventor", "mobile apps", "assessment"]}, {"title": "Programming process visualizer: a proposal of the tool for students to observe their programming process", "link": "https://dl.acm.org/doi/10.1145/2462476.2462493", "abstract": "We have developed a tool that enables learners to observe the process by which they program through visualization of data that are recorded in the source code editor. One purpose of the tool is to assist learners by using the Personal Software Process (PSP) to allow them to analyze the process by which they program by using the tool after completing a programming task. The proposed tool has functions for A) replaying a process using animation; B) automatic calculation of metrics; C) support for inputting subtasks; and D) process analysis report generation. An evaluation experiment was conducted with participants from the second-level introductory programming course at our university. The results were that 1) the accuracy of effort estimation dropped, although we clearly found that the reason for the drop was the difficulty of the second assignment; 2) according to a questionnaire, students reported both the effectiveness of the observation task and the effectiveness of the tool; and 3) there was large differences between students in terms of the description level of subtasks.", "authors": [{"name": "Ken Okada", "affiliation": "Keio University, Fujisawa, Japan"}, {"name": "Sanshiro Sakai", "affiliation": "Shizuoka University, Shizuoka, Japan"}, {"name": "Yoshiaki Matsuzawa", "affiliation": "Shizuoka University, Shizuoka, Japan"}], "tags": ["psp", "programing education", "visualize", "process"]}, {"title": "A hierarchical framework for mapping and quantitatively assessing program and learning outcomes", "link": "https://dl.acm.org/doi/10.1145/2462476.2462481", "abstract": "We have developed an outcome-based Hierarchical Quantitative Assessment (HQA) scheme that is comprehensive, open-ended, and recursive. Our web-based tool enables the user to structure sets of outcomes into levels, to define maps relating outcomes in adjacent levels, and to enter measures for the lowest level outcomes. The tool recursively calculates the transitive closure of the corresponding Directed Acyclic Graph, which induces relations among outcomes and weighted quantitative measures across levels. We used HQA to integrate our computing program outcomes and measures with those required for ABET CAC accreditation.", "authors": [{"name": "Joy Reed", "affiliation": "Armstrong Atlantic State University, Savannah, GA, USA"}, {"name": "Hong Zhang", "affiliation": "Armstrong Atlantic State University, Savannah, GA, USA"}], "tags": ["outcomes", "abet", "recursive", "assessment", "indirect measures", "direct measures"]}, {"title": "Concepts for mobile programming", "link": "https://dl.acm.org/doi/10.1145/2462476.2462483", "abstract": "Computer Science departments are beginning to recognize the importance of offering courses in mobile application development. This paper discusses underlying concepts that should be addressed in these courses. These concepts are grouped into six categories: User interface, Device cooperation, Hardware issues, Data handling, Application interaction, and Programming issues.", "authors": [{"name": "Aaron J. Gordon", "affiliation": "Metropolitan State University of Denver"}], "tags": ["mobile devices", "teaching computer programming", "curriculum", "mobile application development", "android", "ios"]}, {"title": "Mobile computing and robotics in one course: why not?", "link": "https://dl.acm.org/doi/10.1145/2462476.2465584", "abstract": "Robotic technology offers an excellent platform providing a hands-on learning environment for reinforcing theoretical topics in computer science, computer and electrical engineering, and mathematics. Robotics has been successfully used to promote student interest in computing and other STEM disciplines. However, students whose interest in computing may have been sparked or sustained by robots may be seeking more experience with robotics in the rest of the computing curriculum. This paper describes an effort to introduce robotics-related material into an existing upper-level course in mobile computing and discusses the rationale for such a pairing.", "authors": [{"name": "Stan Kurkovsky", "affiliation": "Central Connecticut State University, New Britain, CT, USA"}], "tags": ["sphero", "mobile computing", "robotics", "mobile application development", "android"]}, {"title": "Learning elsewhere: tales from an extracurricular game development competition", "link": "https://dl.acm.org/doi/10.1145/2462476.2462499", "abstract": "In response to students' overwhelming interest in game development and a cumbersome curriculum change process, we hosted at our large university a year-long extracurricular competition in which students designed and implemented video games. Monetary prizes were made possible by a private grant. Our goals were to give students a chance to learn outside of the classroom and to break down institutional barriers that pigeonhole students into compartmentalized skill sets. We believe the competition is worth repeating at our university and elsewhere, but several issues should be addressed first. In this experience report, we share our model for the competition and critique it based on student feedback.", "authors": [{"name": "Anson Call", "affiliation": "Iowa State University, Ames, IA, USA"}, {"name": "Chris Johnson", "affiliation": "University of Wisconsin, Eau Claire, Eau Claire, WI, USA"}, {"name": "Steve Herrnstadt", "affiliation": "Iowa State University, Ames, IA, USA"}], "tags": ["game development", "student competitions", "interdisciplinary collaboration"]}, {"title": "Introducing computing students to scientific experimentation", "link": "https://dl.acm.org/doi/10.1145/2462476.2462478", "abstract": "It is a truth universally acknowledged, at least by educators, that doing coursework is beneficial to students. Yet the coursework must be designed with the end-goal in mind: what is it, particularly, that we want students to learn. Equally important is the need to construct coursework in the context of the overall degree programme, to ensure that computing students develop all the skills they need to. This paper reports on coursework that required computing students, thus far accustomed to a predominantly engineering approach to computing, to carry out a scientific investigation. This coursework, and the use of a bespoke simulation engine, appears to have been a successful strategy in achieving the desired learning outcomes. Furthermore, there is some evidence to suggest that this kind of coursework would be particularly suitable for courses where students' intuitive and misguided thinking needs to be challenged.", "authors": [{"name": "Karen Renaud", "affiliation": "University of Glasgow, Glasgow, United Kingdom"}], "tags": ["computing science", "experimentation", "coursework"]}, {"title": "Using CloudSim to learn cloud computing architecture/system concepts in a graduate course", "link": "https://dl.acm.org/doi/10.1145/2462476.2462486", "abstract": "The recent expansion of the cloud computing paradigm has motivated educators to include cloud-related topics in computer science and computer engineering curricula. While programming and algorithm topics have been covered in different undergraduate and graduate courses, cloud architecture/system topics are still not usually studied in academic contexts. But design, deployment and management of datacenters, virtualization technologies for cloud, cloud management tools and similar issues should be addressed in current computer science and computer engineering programs. This work presents our approach and experiences in designing and implementing a curricular module covering all these topics. In this approach the utilization of a simulation tool, CloudSim, is essential to allow the students a practical approximation to the course contents.", "authors": [{"name": "Marta Beltrán", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}, {"name": "Antonio Guzmán", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}, {"name": "Marcos Palomero", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain"}], "tags": ["cloud computing", "curriculum design", "simulation"]}, {"title": "From cluster to cloud to appliance", "link": "https://dl.acm.org/doi/10.1145/2462476.2462491", "abstract": "We propose a client-side virtual machine (VM) as an alternative to on-campus clusters and off-campus clouds as a development environment for students in introductory courses. In Fall 2011, we deployed the CS50 Appliance, our own such VM, to 600 students on campus and, in Fall 2012, to 700 students on campus and 140,000 students online. We present in this work the results of that two-year experiment. The appliance itself is available as open source for others to adapt or adopt. Not only did the appliance enable us to provide students with simpler tools, among them a graphical editor without any latency, it also enabled us to provide more sophisticated tools too, including a web server and database server. Moreover, the appliance ensured that the course's workload no longer required constant Internet access, particularly of students abroad. And the appliance alleviated load on the course's servers, with execution of students' programs now distributed across students' own CPUs. Without the appliance (or more costly clusters or clouds), we certainly could not have accommodated as many as 140,000 students.\nBut some students' laptops, particularly netbooks, struggled under the appliance's weight. Even though designed to be lean, the appliance, like any VM, still consumes resources, particularly RAM. And unforeseen technical difficulties arose in both years, most, but not all, of which we redressed with mid-semester updates and documentation.\nOverall we have judged our deployment of an appliance a success, superior to past years' clusters and clouds. And we continue to refine the appliance for Fall 2013.", "authors": [{"name": "David J. Malan", "affiliation": "Harvard University, Cambridge, MA, USA"}], "tags": ["virtualization", "virtual machine"]}, {"title": "Teaching internationalization: internationally", "link": "https://dl.acm.org/doi/10.1145/2462476.2462482", "abstract": "This paper describes a foray into teaching internationalization by attempting to do a collaborative project between students in the United States and Poland. The project required Polish students to work with software developed by American students and to provide feedback to the Americans on how easy it was to understand and modify their code. Students communicated via email and online chats as well as in a live session facilitated by Google Hangout. The goals were to get students in both countries to appreciate the clarity needed to communicate and work with international colleagues and to have them experience the myriad issues involved in such collaborations. We report the details of the project we assigned, the processes we went through to set up the collaboration, and our successes and failures as we worked toward our goals.", "authors": [{"name": "Krzysztof Jassem", "affiliation": "Adam Mickiewicz University, PoznaD, Poland"}, {"name": "Jesse M. Heines", "affiliation": "University of Massachusetts Lowell, Lowell, MA, USA"}], "tags": ["json", "gui programming", "internationalization"]}, {"title": "Teaching spreadsheets to visually-impaired students in an environment similar to a mainstream class", "link": "https://dl.acm.org/doi/10.1145/2462476.2462477", "abstract": "Inclusive education at all levels, as required by the UN General Assembly, will increase the heterogeneity of classes noticeably. Computer science education has to change in order to ensure equal access and equal opportunities for all. In contrast to previous research, we developed and tested teaching methods suitable for both normal and visually-impaired / blind students using standard handicap-specific equipment (e.g. laptop and screen reader). Our results show that no additional software and hardware is necessary to reach a fair level of handling spreadsheets when the proposed teaching methods are used.", "authors": [{"name": "Dino Capovilla", "affiliation": "Technische Universität München, Munich, Germany"}, {"name": "Peter Hubwieser", "affiliation": "Technische Universität München, Munich, Germany"}], "tags": ["inclusive education", "spreadsheets", "visually-impaired", "blind"]}, {"title": "Teaching data structures with beSocratic", "link": "https://dl.acm.org/doi/10.1145/2462476.2465583", "abstract": "This paper describes a novel intelligent tutoring system called beSocratic, which targets question types that allow students to respond with free-form input but are able to be automatically evaluated and analyzed. Using beSocratic's GraphPad module, students are able to draw data structures using a mouse, touch, or a stylus. Once a student has completed a question, their final answer and a replay of their actions is uploaded to beSocratic's database. This allows teachers to replay student answers and identify common mistakes. In addition, beSocratic contains a set of post-analysis tools that utilize hidden Markov modeling to cluster student submissions with similar sequences of actions. Along with the modeling, beSocratic generates several visualizations to help teachers interpret the results. This can potentially help teachers identify students who are using the same strategies to answer questions. We have begun pilot-testing its use in computer science classrooms to teach student to properly construct splay trees. The splay tree activity teaches students to construct data structures using free-form drawing and the rotations needed for the splay operation. The activity concludes with an extended example where students must construct a splay tree from scratch. At each step, GraphPad evaluates how the students are performing and provides feedback. Students responded positively to the initial pilot study and we believe this warrants further investigation. beSocratic is free to use at beSocratic.clemson.edu.", "authors": [{"name": "Michael Klymkowsky", "affiliation": "University of Colorado, Boulder, Boulder, CO, USA"}, {"name": "Sam Bryfczynski", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Brian C. Dean", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Roy P. Pargas", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Melanie M. Cooper", "affiliation": "Michigan State University, East Lancing, MI, USA"}], "tags": ["intelligent tutors", "feedback", "splay trees", "data structures"]}, {"title": "Issues with a course that emphasizes self-direction", "link": "https://dl.acm.org/doi/10.1145/2462476.2462495", "abstract": "In this paper, we examine a master's level course that emphasizes self-direction on the part of students. The course is run by weekly group assignments and requires independent work such that only one mandatory classroom session is arranged each week. Our specific research interests are how students responded to the setting of this kind and whether they demonstrated self-direction during the course. We surveyed the students' view of the course, their group work experience, and their study habits, and analyzed the resultant survey data for themes. The results suggest that while the pass rate was considerably high and the course was regarded as well-organized by the students, there were several concerns related to whether we could prompt self-directed study habits.", "authors": [{"name": "Michael Cochez", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Ville Isomöttönen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Ville Tirronen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}], "tags": ["self-direction", "active learning"]}, {"title": "Scaffolding students' learning using test my code", "link": "https://dl.acm.org/doi/10.1145/2462476.2462501", "abstract": "As programming is the basis of many CS courses, meaningful activities in supporting students on their journey towards being better programmers is a matter of utmost importance. Programming is not only about learning simple syntax constructs and their applications, but about honing practical problem-solving skills in meaningful contexts. In this article, we describe our current work on an automated assessment system called Test My Code (TMC), which is one of the feedback and support mechanisms that we use in our programming courses. TMC is an assessment service that (1) enables building of scaffolding into programming exercises; (2) retrieves and updates tasks into the students' programming environment as students work on them, and (3) causes no additional overhead to students' programming process. Instructors benefit from TMC as it can be used to perform code reviews, and collect and send feedback even on fully on-line courses.", "authors": [{"name": "Matti Luukkainen", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Thomas Vikberg", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Arto Vihavainen", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Martin Pärtel", "affiliation": "University of Helsinki, Helsinki, Finland"}], "tags": ["testing", "programming", "situated learning", "extreme apprenticeship", "automatic assessment", "verification"]}, {"title": "Massive increase in eager TAs: experiences from extreme apprenticeship-based CS1", "link": "https://dl.acm.org/doi/10.1145/2462476.2462508", "abstract": "Incorporating students to participate as teaching assistants in our CS1 as early as during their second semester has started a snowball effect, in which more and more students want to be a part of the experience. We allow students to contribute and take responsibility in a context they see as meaningful for teaching. The students-as-teachers approach means that they are mentored by senior teachers in the actual teaching context, which guarantees enough peer and faculty support for students undertaking the task. A significant percentage of our students (ca. 20%) participate as teachers. This has brought us several benefits: (1) new students are welcomed to the learning community by other students as representatives of the institution, not just student organizations, (2) students understand and undertake the responsibility of being a teacher early, and (3) a massive number of eager TAs.", "authors": [{"name": "Jaakko Kurhila", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Matti Luukkainen", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Thomas Vikberg", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Arto Vihavainen", "affiliation": "University of Helsinki, Helsinki, Finland"}], "tags": ["cognitive apprenticeship", "extreme apprenticeship", "teaching assistants", "scaffolding"]}, {"title": "Peer instruction in computer science at small liberal arts colleges", "link": "https://dl.acm.org/doi/10.1145/2462476.2465587", "abstract": "Peer Instruction (PI) has been shown to be successful at improving pass-rates and improving retention of majors in large classes at large research-intensive institutions. At these institutions, students have been shown to learn from peer discussion in PI and both students and faculty have reported that they value PI in their classrooms. However, little is known about the effectiveness of PI in small classrooms at teaching-focused liberal arts colleges. This study evaluates results from seven lower-division classes and four upper-division classes taught at three different liberal arts institutions using PI. In these classes, PI experienced similar success as that reported at large-research intensive universities, both in terms of student learning from peer discussion and from student attitudinal surveys. Most notably, of 137 surveyed students, 91% recommend more faculty use PI in their classes.", "authors": [{"name": "Leo Porter", "affiliation": "Skidmore College, Saratoga Springs, NY, USA"}, {"name": "Saturnino Garcia", "affiliation": "University of San Diego, San Diego, CA, USA"}, {"name": "John Glick", "affiliation": "University of San Diego, San Diego, CA, USA"}, {"name": "Cynthia Taylor", "affiliation": "Oberlin College, Oberlin, OH, USA"}, {"name": "Andrew Matusiewicz", "affiliation": "Skidmore College, Saratoga Springs, NY, USA"}], "tags": ["peer instruction", "liberal arts colleges", "active learning"]}, {"title": "Industry-inspired guidelines improve students' pair programming communication", "link": "https://dl.acm.org/doi/10.1145/2462476.2462504", "abstract": "Novice pair programmers find communication within their pairs to be one of the greatest difficulties they face when starting to pair program. However, developers cannot pair program without a certain amount of communication. This research describes the development of an analytic coding scheme derived from the observation of the communication of expert pairs working in industry. Communication patterns identified from these expert pairs are being used to help novices learn to be more effective in their pair communication.", "authors": [{"name": "Mark Zarb", "affiliation": "University of Dundee, Dundee, United Kingdom"}, {"name": "Janet Hughes", "affiliation": "University of Dundee, Dundee, United Kingdom"}, {"name": "John Richards", "affiliation": "IBM T.J. Watson Research Center, New York, NY, USA"}], "tags": ["video analysis", "students", "pair programming", "communication", "collaboration"]}, {"title": "Assessment of programming: pedagogical foundations of exams", "link": "https://dl.acm.org/doi/10.1145/2462476.2465586", "abstract": "Previous studies of assessment of programming via written examination have focused on analysis of the examination papers and the questions they contain. This paper reports the results of a study that investigated how these final exam papers are developed, how students are prepared for these exams, and what pedagogical foundations underlie the exams. The study involved interviews of 11 programming lecturers. From our analysis of the interviews, we find that most exams are based on existing formulas that are believed to work; that the lecturers tend to trust in the validity of their exams for summative assessment; and that while there is variation in the approaches taken to writing the exams, all of the exam writers take a fairly standard approach to preparing their students to sit the exam. We found little evidence of explicit references to learning theories or models, indicating that the process is based largely on intuition and experience.", "authors": [{"name": "Margaret Hamilton", "affiliation": "RMIT University, Melbourne, Australia"}, {"name": "Judy Sheard", "affiliation": "Monash University, Caulfield East, Australia"}, {"name": " Simon", "affiliation": "University of Newcastle, Newcastle, Australia"}, {"name": "Daryl D'Souza", "affiliation": "RMIT University, Melbourne, Australia"}, {"name": "Angela Carbone", "affiliation": "Monash University, Caulfield East, Australia"}], "tags": ["programming pedagogy", "CS1", "examination papers", "assessment"]}, {"title": "Streamlining grading toward better feedback", "link": "https://dl.acm.org/doi/10.1145/2462476.2462506", "abstract": "CS50 is Harvard University's introductory course aimed at majors and non-majors alike. Each week, students complete programming assignments and have traditionally received feedback from staff in the form of comments on PDFs of their code. Staff have historically reported spending significant amounts of time grading because of bottlenecks that included generating PDF documents and manually emailing feedback to students. Because we preferred that staff spend less of their time on grading logistics and more time providing feedback and helping students online or in person, we set out to improve the efficiency of the grading process.\nIn Fall 2012, we developed and deployed CS50 Submit, a web-based utility through which staff can leave feedback for students via inline \"sticky notes.\" Following the introduction of CS50 Submit, staff reported grading for 10% fewer hours (i.e., 42 minutes) per week and 13% fewer minutes (i.e., 4 minutes) per student, even while providing as much or more feedback. Meanwhile, we observed significantly higher levels of engagement with the course's online discussion board among staff, suggesting a more favorable distribution of staff workload. With CS50 Submit, we have also been able to audit exactly how much time staff spent grading each week in order to identify additional bottlenecks.\nUsing CS50 Submit, we also observed that, on average, 9% of students each week never read their graders' comments, with a peak one week of 14%. The number of students who did not read feedback increased with time, which has led us to question whether asynchronous, textual comments are the most effective feedback mechanisms for students. In future terms, we plan to experiment with in-person, interactive means of delivering feedback to students.\nIn this paper, we present CS50 Submit and the insights it has yielded into the behavior of students and staff alike.", "authors": [{"name": "Tommy MacWilliam", "affiliation": "Harvard University, Cambridge, MA, USA"}, {"name": "David J. Malan", "affiliation": "Harvard University, Cambridge, MA, USA"}], "tags": ["assignment submission", "online feedback"]}, {"title": "A portable graphics library for introductory CS", "link": "https://dl.acm.org/doi/10.1145/2462476.2465590", "abstract": "For several decades, instructors who focus on introductory computer science courses have recognized the value of graphical examples. Supporting a graphics library that is appropriate for beginning students has become more difficult over time. This paper describes a new approach to building a graphics library that allows for multiple source languages and a wide range of target architectures and platforms. The key to this approach is using an interprocess pipe to communicate between a platform independent client library and a Java based process to perform the graphical operations specific to each platform.", "authors": [{"name": "Keith Schwarz", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Eric Roberts", "affiliation": "Stanford University, Stanford, CA, USA"}], "tags": ["libraries", "cs2", "graphics", "cs1"]}, {"title": "JSAV: the JavaScript algorithm visualization library", "link": "https://dl.acm.org/doi/10.1145/2462476.2462487", "abstract": "Learning abstract concepts in data structures and algorithms (DSA) courses is often difficult for students. To improve understanding of DSA topics, numerous algorithm visualization (AV) systems and stand-alone AVs have been developed, supporting a wide range of algorithms and different engagement strategies. Prior studies show that active engagement of students is necessary to make AVs educationally effective. In this paper, we introduce JSAV, a new JavaScript framework for creating engaging algorithm visualizations with active learning features. JSAV is meant to be used with HTML5-based online learning materials. We describe the special features of JSAV that support active learning, and discuss its potential for use in online education projects.", "authors": [{"name": "Clifford A. Shaffer", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Ville Karavirta", "affiliation": "Aalto University, Espoo, Finland"}], "tags": ["hypertextbook", "algorithm animation", "interactive courseware", "html5", "data structure and algorithm visualizations", "active electronic textbooks", "jsav"]}, {"title": "Producing multimedia pills to stimulate student learning and engagement", "link": "https://dl.acm.org/doi/10.1145/2462476.2462488", "abstract": "A student-centred learning approach (SCL) plays an essential role in the European Higher Education Area. Most students tend to reach a higher level of understanding in learning activities they developed themselves using this approach. In contrast, most of them tend to have a low awareness of learning activities carried out by other students. This results in many cases in not maintaining acceptable levels of performance, motivation and engagement, which, in turn, lead to poor attendance and students not dedicating enough time to acquire the required awareness and skills. In this paper, we research and apply a methodology focused on the design, production and assessment by students of multimedia pills as a key way of enhancing student learning and engagement. A multimedia pill is a video learning object created by students as a summary of the key concepts of the learning activities they developed. Four different dimensions are taken into account in the design and assessment of this pill: (1) functionality, (2) pedagogical aspects, (3) technical and legal principles, and (4) marketing strategy. The success of two computer science course projects is described. The results demonstrate students' appreciation of multimedia pills as a means of consuming, sharing and understanding new topics developed by other students, as well as, a significant way of improving students' performance and engagement.", "authors": [{"name": "Elena Sánchez-Nielsen", "affiliation": "Universidad de La Laguna, La Laguna, Spain"}], "tags": ["multimedia learning pills", "student experiments", "student-centred learning", "learning outcomes"]}, {"title": "Why does place matter?", "link": "https://dl.acm.org/doi/10.1145/2462476.2465595", "abstract": "In this paper, through the use of two vignettes, we present a viewpoint on the concepts of `space' and `place' in an computing context. The first vignette is about a Technicians' Room, where the computer support staff and network infrastructure of a school are located. Although the room's purpose is to provide computing services and technical support to the school, five students are frequently in the room during their free time. The second vignette illustrates an apprenticeship scheme to train computer support engineers. By utilising existing literature, we develop a model to aid in the description of the kinds of learning that occur in these places and argue that, by better understanding the role of space and place, we can improve our understanding of practice in an academic context.", "authors": [{"name": "Sally Fincher", "affiliation": "University of Kent, Canterbury, England UK"}, {"name": "Daniel Knox", "affiliation": "University of Kent, Canterbury, England UK"}], "tags": ["practice", "place", "space"]}, {"title": "On the differences between correct student solutions", "link": "https://dl.acm.org/doi/10.1145/2462476.2462505", "abstract": "We know that students solve problems in different ways, but we know little about the kinds of variation, or the degree of variation between these student generated solutions. In this paper, we propose a taxonomy that classifies the variation between correct student solutions in objective terms, and we show how the application of the taxonomy provides instructors with additional insight about the differences between student solutions. This taxonomy may be used to inform instructors in selecting examples of code for teaching purposes, and provides the possibility of automatically applying the taxonomy to existing solution sets.", "authors": [{"name": "Se-Young Yu", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Diana Kirk", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Ewan Tempero", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["novice", "programming", "variation", "taxonomy", "syntax"]}, {"title": "A study of the influence of code-tracing problems on code-writing skills", "link": "https://dl.acm.org/doi/10.1145/2462476.2462507", "abstract": "A study was conducted to find out whether solving code tracing problems helps improve code writing skills of students. Students were asked to answer a code writing quiz before and after a problem-solving session on code tracing. Increase in the score from pre-quiz to post-quiz was treated as improvement in code writing attributable to code tracing. Repeated measures ANOVA was used to analyze the data collected over three semesters. The results of the study are that whenever a statistically significant difference was observed between pre-quiz and post-quiz scores, post-quiz mean score was higher and standard deviation was smaller, confirming better student performance on post-quiz than on pre-quiz. The improvement in code writing pertained primarily to language syntax. The improvement was observed even among the students who scored 100% on code tracing problems. Finally, the students whose code writing skills improved due to code tracing had spent 10% more time on code tracing than the others.", "authors": [{"name": "Amruth N. Kumar", "affiliation": "Ramapo College of New Jersey, Mahwah, New Jersey, USA"}], "tags": ["code-writing", "code-tracing", "code-reading", "problem-solving"]}, {"title": "Using case studies to design and deliver technology-centered computing education courses: an innovative approach from an undergraduate information systems program in singapore", "link": "https://dl.acm.org/doi/10.1145/2462476.2462485", "abstract": "While the advantages of using case studies as an educational vehicle in computing education appear to be more than obvious, there is a very limited amount of research works or practice papers reporting on actual implementations of undergraduate or graduate computing courses which would be largely based on case studies. This conference contribution reports on selected best practices of course design and delivery implemented in one of the core courses of the Bachelor of Science (Information Systems Management) degree program (BSc (ISM)) offered by the School of Information Systems (SIS) at the Singapore Management University (SMU). Nearly all assessments, exercises, in-class activities and lectures of this selected course (Enterprise Web Solutions) are centered around one specific case study which has been written specifically for this course.\nThe paper reports on the practices implemented in this course to design and deliver all hands-on components of the course, it discusses the approach used to tie the lecture component of the course to the case study, and it briefly discusses the rationale of using a fictitious company for the case study of the course (instead of using a real company and real scenario). The paper concludes with a series of recommendations to course designers and educators in the computing education field who are involved in the design and delivery of technology-centered courses and who are interested in exploring the use of case studies in their courses. While the paper is describing best practices implemented within the frame of an Information Systems program, these practices are largely applicable to any other computing education field: computer science, computer engineering, software engineering, information technology, or informatics.", "authors": [{"name": "Ilse Baumgartner", "affiliation": "Singapore Management University, Singapore, Singapore"}], "tags": ["course design", "undergraduate information systems curriculum", "computing education", "case studies"]}, {"title": "Five years of taps on shoulders to PATS on backs in ICT", "link": "https://dl.acm.org/doi/10.1145/2462476.2465581", "abstract": "A concern for Information and Communication Technology [1] and Engineering disciplines in many Australian universities is the need to improve a high percentage of courses that students perceive as needing critical attention. Typically, courses in the Physical Sciences disciplines score low on student evaluations and repeatedly have the highest student dropout rates. This paper reports the results of a study investigating five years of changes in course evaluation results in one of Australia's Go8 universities that applied the Peer Assisted Teaching Scheme (PATS). PATS was initially trialed in the Faculty of Information Technology (FIT) at Monash University to improve teaching quality and student satisfaction through building peer assistance capacity. The focus of this study will be on student satisfaction, rather than education quality. PATS has evolved over this period through action research and has been supported by the Australian Government's Office for Learning and Teaching. Multiple changes have been made to the PATS process since its inception, and the quantitative improvements to courses taking part in PATS are reported. The paper concludes by showing that the course areas addressed by the PATS participants are indeed the areas of most concern to students.", "authors": [{"name": "Angela Carbone", "affiliation": "Monash University, Melbourne, Australia"}, {"name": "Belinda Ross", "affiliation": "Monash University, Melbourne, Australia"}, {"name": "Jason Ceddia", "affiliation": "Monash University, Melbourne, Australia"}], "tags": ["ict education", "action design research", "student satisfaction in ict", "teaching strategy"]}, {"title": "Capstone project online assessment tool without the paper work", "link": "https://dl.acm.org/doi/10.1145/2462476.2462484", "abstract": "The capstone project is the culmination of a student's academic learning, providing an opportunity to demonstrate and further their knowledge and their organisational, practical, theoretical and communication skills with valuable guidance from industry partners. From the perspective of both the student and the academic, fair, just and accountable assessment is the ideal, however often difficult to achieve. Previous research by the authors presented a paper based toolkit to assist supervisors in both formative and summative assessment of capstone projects that does not focus entirely on the final product. Trials of the toolkit demonstrated that although it provided an excellent measure of individual student contribution and achievement, it required an inordinate amount of work by both parties to be efficient and effective. To alleviate the workload and provide individual and comparative instant feedback, an online version of the TCS System, has been developed and tested by students and staff. This paper reviews and discusses the structure and benefits of the online system and the results of the software testing in relation to educational values.", "authors": [{"name": "Vivienne Farrell", "affiliation": "Swinburne University, Melbourne, Australia"}, {"name": "David Hall", "affiliation": "SUCCESS Swinburne University, Melbourne, Australia"}, {"name": "Paul Kindler", "affiliation": "RISO FICT, Melbourne, Australia"}, {"name": "Graham Farrell", "affiliation": "Swinburne University, Melbourne, Australia"}, {"name": "Gilbert Ravalli", "affiliation": "Swinburne University, Melbourne, Australia"}], "tags": ["peer", "online", "assessment", "capstone", "tcs", "computer science", "project", "team", "group"]}, {"title": "Project-based learning within a large-scale interdisciplinary research effort", "link": "https://dl.acm.org/doi/10.1145/2462476.2465588", "abstract": "The modern computing landscape increasingly requires a range of skills to successfully integrate complex systems. Project-based learning is used to help students build professional skills. However, it is typically applied to small teams and small efforts. In this paper, we describe our experience in engaging a large number of students in research projects within a multi-year interdisciplinary research effort. The projects expose the students to various disciplines in Electrical Engineering (circuit design, wireless communications, hardware prototyping), Computer Science (embedded systems, algorithm design, networking) and Applied Physics (thin-film battery design, solar cell fabrication). While a student project is usually focused on one discipline area, it requires interaction with at least two other areas. Over 4 years, 115 semester-long projects have been completed. The students were a diverse group of high school, undergraduate, and M.S. Computer Science, Computer Engineering, and Electrical Engineering students. Some of the approaches we have taken to facilitate student learning are real-world system development constraints, regular cross-group meetings, and extensive involvement of Ph.D. students in student mentorship and knowledge transfer. To assess our approaches, we conducted a survey among the participating students. The results demonstrate the effectiveness of our methods. For example, 70% of the students surveyed indicated that working on their research project improved their ability to function on multidisciplinary teams more than coursework, internships, or any other activity.", "authors": [{"name": "John Sarik", "affiliation": "Columbia University, New York City , NY, USA"}, {"name": "Ioannis Kymissis", "affiliation": "Columbia University, New York City , NY, USA"}, {"name": "Gil Zussman", "affiliation": "Columbia University, New York City , NY, USA"}, {"name": "Maria Gorlatova", "affiliation": "Columbia University, New York City , NY, USA"}, {"name": "Peter Kinget", "affiliation": "Columbia University, New York City , NY, USA"}], "tags": ["interdisciplinary learning", "wireless networking", "internet of things", "project-based learning", "embedded systems"]}, {"title": "A comparison of two iterations of a software studio course based on continuous integration", "link": "https://dl.acm.org/doi/10.1145/2462476.2465592", "abstract": "In previous work we introduced a software studio course in which seventy students used continuous integration practices to collaborate on a common legacy code base. This enabled students to experience the issues of realistically sized software projects, and learn and apply appropriate techniques to overcome them, in a course without significant extra staffing. Although the course was broadly successful in its goals, it received a mixed response from students, and our paper noted several issues to overcome. This paper considers experimental changes to the course in light of our previous findings, and additional data from the official student surveys. Two iterations of the course and their respective results are compared. Whereas our previous paper addressed the feasibility of such a course, this paper considers how the student experience can be improved. The paper also considers how such a course can be adapted for more heterogeneous cohorts, such as the introduction of an unknown number of design and database students, or the introduction of online students.", "authors": [{"name": "Jim Steel", "affiliation": "The University of Queensland, St Lucia, Australia"}, {"name": "William Billingsley", "affiliation": "NICTA, Brisbane, Australia"}], "tags": ["continuous integration", "software engineering", "experience report", "studio course"]}, {"title": "Commercial aspects of contract cheating", "link": "https://dl.acm.org/doi/10.1145/2462476.2462497", "abstract": "The process of contract cheating, the form of academic dishonesty where students outsource the creation of work on their behalf, has been recognised as a serious threat to the quality of academic awards. Unlike student plagiarism, this cheating behaviour is not currently detectable using automated tools.\nThis paper analyses the monetary value of contract cheating to the different parties who play a role in the contract cheating process. The main analysis is based on a corpus consisting of 14,438 identified attempts to cheat. The corpus was collected between March 2005 and July 2012. The corpus was formed as part of a manual contract cheating detection process identifying students using online agencies. These online agencies are web sites which enable students to contract cheat. The agencies usually benefit from this by receiving a percentage cut of the money raised from the contract cheating that they facilitate. This corpus is used as the basis of an attempt to quantify the monetary value of contract cheating to online agencies.\nOther parties exist who benefit from the contract cheating process. The paper identifies several such parties and gives examples of the monetary value of contract cheating to each of them. Most notably this includes the contractors who bid for the opportunity to produce work on behalf of the students. Further, the paper identifies the role of intermediary contractors. These are people who post assignment requests on agency sites but who are not themselves students. These intermediary contractors appear to benefit by first receiving requests to complete work for students and then re-outsourcing this work at a much lower cost than they were paid. The group of frequent workers, that is people who regularly work on student assignments and hence benefit financially, is also identified.\nThe paper concludes by presenting the changing trends in contract cheating that the authors have observed since they started working against this form of academic misconduct in 2005. Finally, recommendations for academics towards dealing with the issues posed by contract cheating are provided.", "authors": [{"name": "Robert Clarke", "affiliation": "Birmingham City University, Birmingham, United Kingdom"}, {"name": "Thomas Lancaster", "affiliation": "Birmingham City University, Birmingham, Uruguay"}], "tags": ["academic integrity", "plagiarism", "contract cheating"]}, {"title": "Exploring the effects of collaboration scripts embedded in a distributed pair programming system", "link": "https://dl.acm.org/doi/10.1145/2462476.2462500", "abstract": "Collaboration scripts provide an integrated framework aimed to foster fruitful collaboration in collaborative learning settings. Since pair programming is also a form of collaborative learning, we explored whether collaboration scripts can improve collaboration in distributed pair programming. For this purpose, we incorporated collaboration scripts in an existing distributed pair programming system. We conducted a pilot study to evaluate the new system by a group of students. Our goal was to examine students' perceptions of computer mediated scripted collaboration and furthermore to evaluate the effectiveness of adaptive role switching in students' participation. The study showed that students' attitude toward distributed pair programming and scripted collaboration was quite positive, however they prefer to distribute tasks by themselves which led half of them not to follow system's suggestions for role distribution.", "authors": [{"name": "Stelios Xinogalos", "affiliation": "University of Macedonia, Naoussa, Greece"}, {"name": "Maya Satratzemi", "affiliation": "University of Macedonia, Thessaloniki, Greece"}, {"name": "Despina Tsompanoudi", "affiliation": "University of Macedonia, Thessaloniki, Greece"}], "tags": ["distributed pair programming", "collaboration scripts"]}, {"title": "Investigation into the personal epistemology of computer science students", "link": "https://dl.acm.org/doi/10.1145/2462476.2465589", "abstract": "In this paper, we investigate the personal epistemology of computing students, that is, their conceptions of knowledge and learning. We review some models of personal epistemological development and describe one of the questionnaire tools that have been used to assess the epistemological beliefs of students studying in other disciplines. We describe an experiment that uses one of these tools, together with exploratory factor analysis, to determine the dimensions of epistemological beliefs of a cohort of computing students and compare the results with that reported in other contexts. The results, while not reproducing the details of previous work, do seem to suggest that there are indeed multiple dimensions to personal epistemology, and that these can be identified, to a large extent, with those recognised by other researchers. Finally, we make some observations about the importance of personal epistemology for learning in Computer Science and outline further work in this area.", "authors": [{"name": "Iain Pirie", "affiliation": "Robert Gordon University, Aberdeen, United Kingdom"}, {"name": "Åsa Cajander", "affiliation": "Uppsala University, Uppsala, Sweden"}, {"name": "Roger McDermott", "affiliation": "Robert Gordon University, Aberdeen, United Kingdom"}, {"name": "Cary Laxer", "affiliation": "Rose-Hulman Institute of Technology, Terre-Haute, IN, USA"}, {"name": "Mats Daniels", "affiliation": "Uppsala University, Uppsala, Sweden"}], "tags": ["personal epistemology", "learning", "pedagogy", "factor analysis", "epistemological beliefs"]}, {"title": "Assistance in computer programming learning using educational data mining and learning analytics", "link": "https://dl.acm.org/doi/10.1145/2462476.2462496", "abstract": "The learning of programming presents many difficulties for students. Nowadays, a number of software tools are available that enable students in programming courses to develop and exercise their knowledge and skills. However, these tools do not examine their work or provide students with indications on their learning process. In this paper we introduce a learning approach for programming based on the analysis of students' mistakes during practical lessons in programming subjects. This approach makes use of compiler messages to analyse their quantity and semantic value, and report the individual and comparative learning progress. This approach is illustrated in practice by a case study conducted in a class of undergraduate students of computer science. This study makes it possible to provide an analytic representation of reflective learning practice, giving us a better understanding on programming learning processes.", "authors": [{"name": "Juan Ramón Pérez-Pérez", "affiliation": "University of Oviedo, Oviedo, Spain"}, {"name": "Carlos Fernandez-Medina", "affiliation": "University of Oviedo, Oviedo, Spain"}, {"name": "M. del Puerto Paule-Ruiz", "affiliation": "University of Oviedo, Oviedo, Spain"}, {"name": "Víctor M. Álvarez-García", "affiliation": "University of Oviedo, Oviedo, Spain"}], "tags": ["programming errors", "integrated development environment", "learning analytics", "programming language", "e-learning", "eclipse plug-ins"]}, {"title": "Towards improving programming habits to create better computer science course outcomes", "link": "https://dl.acm.org/doi/10.1145/2462476.2465594", "abstract": "We examine a large dataset collected by the Marmoset system in a CS2 course. The dataset gives us a richly detailed portrait of student behavior because it combines automatically collected program snapshots with unit tests that can evaluate the correctness of all snapshots. We find that students who start earlier tend to earn better scores, which is consistent with the findings of other researchers. We also detail the overall work habits exhibited by students. Finally, we evaluate how students use release tokens, a novel mechanism that provides feedback to students without giving away the code for the test cases used for grading, and gives students an incentive to start coding earlier. We find that students seem to use their tokens quite effectively to acquire feedback and improve their project score, though we do not find much evidence suggesting that students start coding particularly early.", "authors": [{"name": "Jaime Spacco", "affiliation": "Knox College, Galesburg, IL, USA"}, {"name": "John Stamper", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Davide Fossati", "affiliation": "Carnegie Mellon University in Qatar, Doha, Qatar"}, {"name": "Kelly Rivers", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["novice programmers", "cs2", "computer science education"]}, {"title": "CodeSpells: embodying the metaphor of wizardry for programming", "link": "https://dl.acm.org/doi/10.1145/2462476.2465593", "abstract": "This paper addresses how CodeSpells uses the metaphor of wizardry, along with an embodied API to engage students in learning to program in Java. Giving novice programmers a concrete representation of code has been encouraged and shown to help students understand the concepts with more ease. There have been many attempts to improve the novice learning experience by providing: a visual programming language, a hardware component or an application that is more approachable. The benefit of this research is that students are better able to understand how abstract code effects the environment.\nWe build on this work through CodeSpells by immersing novices in the abstraction of code through embodiment to allow them to understand complex and abstract programming problems as if they were being affected by what they wrote. In this paper we present a new approach to novice programming environments, one that embodies the user and encourages a quick grasp of introductory concepts followed by a deep understanding through exploration.", "authors": [{"name": "Sarah Esper", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "William G. Griswold", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "Stephen R. Foster", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}], "tags": ["cs1", "embodiment", "metaphor", "computer science education"]}, {"title": "Making computing interesting to school students: teachers' perspectives", "link": "https://dl.acm.org/doi/10.1145/2462476.2466519", "abstract": "It is widely agreed that there is a need to excite more school students about computing. Considering teachers' views about student engagement is important to securing their support for any solution. We therefore present the results of a qualitative, questionnaire-based study on teachers' perceptions of the best ways to make the subject interesting. From 115 responses by UK computing teachers emerged a range of themes about the issues they felt were most important. We found that whilst their views reflected a range of approaches that are widely promoted in the literature and in national initiatives, there were also disconnects between teachers' views and wider discourses. Based on the results, we give specific recommendations for areas where more should be done to support teachers in making computing interesting to school students. Academics should do more to engage with teachers, especially if they wish to introduce deep computing principles in schools. Teachers expressed an interest in computing clubs in schools, but a strong support network for them is still needed. This may be an opportunity for businesses and universities to help support teachers.", "authors": [{"name": "Jo Brodie", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Paul Curzon", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Laura R. Meagher", "affiliation": "Technology Development Group, Dairsie, United Kingdom"}, {"name": "Jonathan Black", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Peter W. McOwan", "affiliation": "Queen Mary University of London, London, United Kingdom"}, {"name": "Chrystie Myketiak", "affiliation": "Queen Mary University of London, London, United Kingdom"}], "tags": ["universities", "teachers", "k-12", "clubs", "pipeline", "gender issues", "programming", "girls", "curriculum", "cs4fn", "survey", "geek", "public engagement", "unplugged", "recruitment", "schools", "computational thinking", "fun"]}, {"title": "High school students' perspective to university CS1", "link": "https://dl.acm.org/doi/10.1145/2462476.2465585", "abstract": "This paper presents a qualitative study of a school-university collaborative project where a game-themed CS1 course was offered as-is to high school students. Our specific interest was to explore the students' experiences with the university level course. Our analyses indicate that immediate and regular support was highly important for student performance, as support of this kind could mitigate issues related to students' orientation towards the high workload of the course. Students who showed academic interest were likely to pass, whereas students lacking self-direction or work efficiency were likely to drop out. Both passed and drop-outs found the course to be a good learning experience. The game theme of the course was in most cases found highly motivating and fun, while it was not a necessity for the majority of the students. This information can be utilized by higher education instructors who plan to carry out university courses in cooperation with high schools.", "authors": [{"name": "Antti-Jussi Lakanen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Ville Isomöttönen", "affiliation": "Department of Mathematical Information Technology, University of Jyväskylä, Finland"}], "tags": ["game programming", "recruitment", "k-12", "outreach"]}, {"title": "A nationwide exam as a tool for improving a new curriculum", "link": "https://dl.acm.org/doi/10.1145/2462476.2462479", "abstract": "Israel's Ministry of Education has decided to strengthen the STEM studies, including computer science (CS). A new curriculum for CS for junior high, which focuses on developing computational thinking, was developed, implemented, and evaluated. The evaluation contains a nationwide test at the end of each year. This paper describes the 2012 nationwide exam and its evaluation.", "authors": [{"name": "Iris Zur-Bargury", "affiliation": "The Ministry of Education, Tel Aviv, Israel"}, {"name": "Dvir Lanzberg", "affiliation": "Open University, Raanana, Israel"}, {"name": "Bazil Pârv", "affiliation": "bparv@cs.ubbcluj.ro, Cluj-Napoca, Romania"}], "tags": ["stem learning", "problem solvingy", "computing educationy", "technology", "k-12 curricula", "computer science", "computational thinking"]}, {"title": "Serious toys II: teaching networks, protocols, and algorithms", "link": "https://dl.acm.org/doi/10.1145/2462476.2462502", "abstract": "Networking concepts have been in use for centuries. The human body is a network of organs that must coordinate to survive. The postal service is an example of a network that connects individuals world-wide. It is only natural that networks play an important role in computing --- from networks of sensors collecting and recording data, to social networks, to the most complex network of all, the Internet. Observing the importance of networking concepts in computing, we have developed the second in a series of \"serious toys\" to use in the K-12 curriculum. In this case, the toy is an embedded hardware device designed to enhance a lecture titled \"Learning Networks, Protocols, and Algorithms\", by engaging visual and kinesthetic learners. In this paper, we describe our curriculum module and its use in an outreach program involving six middle school classes. We conclude with a summary of evaluation results that show the program produced positive results in terms of content understanding and attitudes toward Computer Science.", "authors": [{"name": "Yvon Feaster", "affiliation": "Clemson Universtiy, Clemson, SC, USA"}, {"name": "Farha Ali", "affiliation": "Lander University, Greenwood, SC, USA"}, {"name": "Jason O. Hallstrom", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Jiannan Zhai", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["experimental evaluation", "protocols", "computer science outreach", "algorithms", "middle school curriculum", "networks"]}, {"title": "Evaluating student understanding of core concepts in computer architecture", "link": "https://dl.acm.org/doi/10.1145/2462476.2462490", "abstract": "Many studies have demonstrated that students tend to learn less than instructors expect in CS1. In light of these studies, a natural question is: to what extent do these results hold for subsequent, upper-division computer science courses? In this paper we describe our work in creating high-level concept questions for an upper-division computer architecture course. The questions were designed and agreed upon by subject-matter and teaching experts to measure desired minimum proficiency of students post-course. These questions were administered to four separate computer architecture courses at two different institutions: a large public university and a small liberal arts college. Our results show that students in these courses were indeed not learning as much as the instructors expected, performing poorly overall: the per-question average was only 56%, with many questions showing no statistically significant improvement from pre-course to post-course. While these results follow the trend from CS1 courses, they are still somewhat surprising given that the courses studied were taught using research-based pedagogy that is known to be effective across the CS curriculum. We discuss implications of our findings and offer possible future directions of this work.", "authors": [{"name": "Hung-Wei Tseng", "affiliation": "University of California, San Diego, La Jolla, CA, USA"}, {"name": "Saturnino Garcia", "affiliation": "University of San Diego, San Diego, CA, USA"}, {"name": "Daniel Zingaro", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Leo Porter", "affiliation": "Skidmore College, Saratoga Springs, NY, USA"}], "tags": ["computer architecture", "curriculum", "assessment"]}, {"title": "Using network packet generators and snort rules for teaching denial of service attacks", "link": "https://dl.acm.org/doi/10.1145/2462476.2465580", "abstract": "Teaching ethical hacking techniques is fundamental to security education and allows students to better understand the ways in which computer and network systems fail. This paper discusses the implementation of comprehensive offensive hands-on lab exercises about four common Denial of Service (DoS) attacks. Moreover, the paper discusses the implementation of a defense technique against the DoS attacks using Snort tool, as an intrusion detection system. The impact of offering the exercises on the student performance in terms of achieving the course outcomes is also discussed. Although a significant improvement in the student performance has been observed, a major ethical concern has been identified when teaching ethical hacking techniques. As a consequence, the paper lists a number of steps that should be taken by schools and educators to reduce the liability of teaching ethical hacking techniques in information security curriculum.", "authors": [{"name": "Latifa Alketbi", "affiliation": "United Arab Emirates University, College of IT, Al Ain, Uae"}, {"name": "Zouheir Trabelsi", "affiliation": "United Arab Emirates University, College of IT, Al Ain, Uae"}], "tags": ["information security curriculum", "dos attacks", "snort rules", "ethical concern", "ethical hacking", "course outcomes assessment.", "school liability"]}, {"title": "Concept specification maps: displaying content structures", "link": "https://dl.acm.org/doi/10.1145/2462476.2462503", "abstract": "In introductory courses there are topics with a huge amount of concepts and interdependencies between them. Especially in the course materials the relevant definitions or specifications are widely spread. This paper presents a semi-automatic way of text analysis to display the structure of concepts in literature such as textbooks. Therefore we searched for text paragraphs that contain a definition or specification of a given concept. From the results we built a graphical representation, containing \"definition-nodes\" that show the logical structure of those concepts. We call it a Concept Specification Map. Furthermore we show an application of the method on five textbooks of introductory courses into object-oriented programming. We present the results of the analysis and draw some conclusions on their influence regarding introductory courses.", "authors": [{"name": "Marc Berges", "affiliation": "Technische Universität München, 85748 Garching, Germany"}, {"name": "Peter Hubwieser", "affiliation": "Technische Universität München, 85748 Garching, Germany"}], "tags": ["cs1", "concept structures", "semi-automatic analysis", "graphical representation", "textbooks"]}, {"title": "Applying software engineering in CS1", "link": "https://dl.acm.org/doi/10.1145/2462476.2462480", "abstract": "This paper introduces a method for incorporating software engineering concepts into the computer science curriculum earlier by using a structured project in CS1. The project is designed such that it must be completed using phases of a software development cycle. This approach provides the students earlier exposure to software engineering and grounds software engineering practice throughout the curriculum. With a better understanding of and appreciation for the software development process, students are better prepared to handle future academic and professional projects. This paper presents a detailed discussion of the CS1 project and its execution, accompanied by results and feedback from a post-project survey administered to students.", "authors": [{"name": "Wei Kian Chen", "affiliation": "Champlain College, Burlington, VT, USA"}, {"name": "Brian R. Hall", "affiliation": "Champlain College, Burlington, VT, USA"}], "tags": ["software development skills", "CS1", "software engineering project"]}, {"title": "Games for teaching software development", "link": "https://dl.acm.org/doi/10.1145/2462476.2462494", "abstract": "We have been using games to teach software development for a number of years now with our MSc IT students as a warm-up to the group project over the summer. Games, and game-like processes without accompanying lectures can provide the participants with enough insight into the thinking and rationale of agile, lean, and kanban approaches to software development. This weeklong crash course consists of games and exercises to provide students with a good foundation in software development processes. The agile games, and game-like service design activities along with some Lego® Serious Play® games, illustrate why we use the agile approach. The game environment provides a mixture of icebreaker, team building and software development aspects in a useful week of work that the students enjoy.", "authors": [{"name": "Bruce A. Scharlau", "affiliation": "University of Aberdeen, Aberdeen, Scotland Uk"}], "tags": ["lego serious play", "games", "agile", "service design", "lean", "software development"]}, {"title": "Transforming computer science in schools", "link": "https://dl.acm.org/doi/10.1145/2462476.2462510", "abstract": "In this panel we explore efforts to improve computer science education in four countries.", "authors": [{"name": "Julie King", "affiliation": "Australian Curriculum and Assessment Reporting Authority, Sydney, Australia"}, {"name": "Simon Humphreys", "affiliation": "Computing at School, London, United Kingdom"}, {"name": "Judith Gal-Ezer", "affiliation": "The Open University of Israel, Raanana, Israel"}, {"name": "Chris Stephenson", "affiliation": "Computer Science Teachers Association, New York, USA"}], "tags": ["k-12 curriculum", "computer science education", "computational thinking"]}, {"title": "Beyond computer science: computational thinking across disciplines", "link": "https://dl.acm.org/doi/10.1145/2462476.2462511", "abstract": "No abstract available.", "authors": [{"name": "Amber Settle", "affiliation": "DePaul University, Chicago, IL, USA"}, {"name": "Debra S. Goldberg", "affiliation": "University of Colorado Boulder, Boulder, CO, USA"}, {"name": "Valerie Barr", "affiliation": "Union College, Schenectady, NY, USA"}], "tags": ["science", "k-12", "language arts", "humanities", "economics", "biology", "undergraduate", "visual arts", "english", "computational thinking"]}, {"title": "Hot fusion: music, art, and computer science education", "link": "https://dl.acm.org/doi/10.1145/2462476.2483798", "abstract": "This panel will be a conversation about the challenges of creating interdisciplinary programs and teaching interdisciplinary courses linking computer science and the arts. Three panelists will offer the benefit of their experience teaching interdisciplinary courses, overseeing the development of interdisciplinary programs, writing interdisciplinary computer science/arts textbooks, and mentoring students on interdisciplinary projects with significant and fascinating scientific and creative components. The overarching question will be \"how do we teach creative computational problem solving with intentionality in interdisciplinary arts/computer science courses\"?", "authors": [{"name": "Wayne Kirby", "affiliation": "UNC Asheville, Asheville, NC, USA"}, {"name": "Jennifer Burg", "affiliation": "Wake Forest University, Winston-Salem, NC, USA"}, {"name": "Susan Reiser", "affiliation": "UNC Asheville, Asheville, NC, USA"}], "tags": ["digital media", "computer science education", "digital sound and imaging"]}]