[{"title": "Session details: Plenary session", "link": "https://dl.acm.org/doi/10.1145/3248140", "abstract": "No abstract available.", "authors": [{"name": "Laurie Smith King", "affiliation": "College of the Holy Cross"}, {"name": "Dave Musicant", "affiliation": "Carleton College"}], "tags": []}, {"title": "The teacher's job is to design learning experiences; not primarily to impart information", "link": "https://dl.acm.org/doi/10.1145/2157136.2157138", "abstract": "The primary job of the teacher is to make learning happen; that is a design task. Most of us learned most of what we know by what we did, not by what we heard or read. A corollary is that the careful designing of exercises, assignments, projects, even quizzes, makes more difference than the construction of lectures. A second corollary is that project courses that go deeply into narrow aspects of a subject seem to stick longer and deeper than approaches aiming at comprehensive coverage. How to strike a balance? I've taught a first software engineering laboratory course 22 times, and an advanced computer architecture course about ten times. Here are some techniques that work for me.", "authors": [{"name": "Frederick P. Brooks", "affiliation": "University of North Carolina, Chapel Hill, NC, USA"}], "tags": ["keynote"]}, {"title": "Session details: Computer curricula 2013: update", "link": "https://dl.acm.org/doi/10.1145/3248083", "abstract": "No abstract available.", "authors": [{"name": "Mehran Sahami", "affiliation": "Stanford University"}], "tags": []}, {"title": "Computer science curriculum 2013: reviewing the strawman report from the ACM/IEEE-CS task force", "link": "https://dl.acm.org/doi/10.1145/2157136.2157140", "abstract": "Beginning over 40 years ago with the publication of Curriculum 68, the major professional societies in computing--ACM and IEEE-Computer Society--have sponsored various efforts to establish international curricular guidelines for undergraduate programs in computing. As the field has grown and diversified, so too have the recommendations for curricula. There are now guidelines for Computer Engineering, Information Systems, Information Technology, and Software Engineering in addition to Computer Science. These volumes are updated regularly with the aim of keeping computing curricula modern and relevant. In the Fall of 2010, work on the next volume in the series, Computer Science 2013 (CS2013), began. Considerable work on the new volume has already been completed and a first draft of the CS2013 report (known as the Strawman report) will be complete by the beginning of 2012. This panel seeks to update and engage the SIGCSE community in providing feedback on the Strawman report, which will be available shortly prior to the SIGCSE conference.", "authors": [{"name": "Ernesto Cuadros-Vargas", "affiliation": "San Pablo Catholic University, San Pablo, Peru"}, {"name": "Mehran Sahami", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Steve Roach", "affiliation": "University of Texas at El Paso, El Paso, TX, USA"}, {"name": "David Reed", "affiliation": "Creighton University, Omaha, NE, USA"}], "tags": ["computing curricula 2013: computer science", "CS2013"]}, {"title": "Session details: Scrum across the CS/SE curricula", "link": "https://dl.acm.org/doi/10.1145/3248084", "abstract": "No abstract available.", "authors": [{"name": "Mark Hoffman", "affiliation": "Quinnipiac University"}], "tags": []}, {"title": "Scrum across the CS/SE curricula: a retrospective", "link": "https://dl.acm.org/doi/10.1145/2157136.2157142", "abstract": "Scrum is one of the many agile approaches to software development that have been widely adopted over the past decade. Agile processes allow developers to embrace under-defined problems in complex environments where change in requirements is inevitable. The key agile features of Scrum are a flexible, adaptive schedule; democratic, collaborative teams; and frequent, iterative project and process reviews [2]. While students may engage with Scrum in the context of software development, the characteristics that suit many software problems to an agile approach also describe the student learning environment: complexity (new and unfamiliar concepts), under-defined problem space (students don't know what they don't know), short timeframe with frequent meetings (terms and class meetings), and inevitable change (apply new knowledge). This makes Scrum not only a software development strategy but a general learning strategy. Scrum facilitates frequent and iterative practice with timely feedback, development of mastery, and self-direction [1]. In this panel, the participants will describe how their students learn and practice Scrum in a software development context, how they use it to manage student projects outside the software development context, and how Scrum provides opportunities to integrate communication skills into the Computer Science (CS) and Software Engineering (SE) curricula. As participants in the NSF-funded CPATH II project (NSF Grants 0939122 and 0939081) \"Incorporating Communication Skills Throughout Computer Science and Software Engineering Curricula,\" each panelist has developed Scrum-based assignments that exercise the skills of reading, writing, speaking, and teaming. The participants will discuss the design of these assignments and their experiences with them to date.", "authors": [{"name": "Douglas Troy", "affiliation": "Miami University, Oxford, OH, USA"}, {"name": "Mark E. Hoffman", "affiliation": "Quinnipiac University, Hamden, CT, USA"}, {"name": "Charles Wallace", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Sriram Mohan", "affiliation": "Rose-Hulman Institute of Technology, Terre Haute, IN, USA"}], "tags": ["communication skills", "scrum", "software development", "curriculum"]}, {"title": "Session details: Special session", "link": "https://dl.acm.org/doi/10.1145/3248135", "abstract": "No abstract available.", "authors": [{"name": "Blair Taylor", "affiliation": "Towson University"}], "tags": []}, {"title": "The role of interdisciplinary computing in higher education, research and industry", "link": "https://dl.acm.org/doi/10.1145/2157136.2157144", "abstract": "No abstract available.", "authors": [{"name": "Ursula Wolz", "affiliation": "Franklin W. Olin College of Engineering, Needham, MA, USA"}, {"name": "Lillian (Botos) Cassel", "affiliation": "Villanova University, Villanova, PA, USA"}], "tags": ["interdisciplinary computing"]}, {"title": "Session details: Paper: data structures and algorithms", "link": "https://dl.acm.org/doi/10.1145/3248086", "abstract": "No abstract available.", "authors": [{"name": "Ivona Bezakova", "affiliation": "Rochester Institute of Technology"}], "tags": []}, {"title": "Sustainability themed problem solving in data structures and algorithms", "link": "https://dl.acm.org/doi/10.1145/2157136.2157146", "abstract": "During the past two years, we have been creating curricular material centered around complex problems rooted in sustainability. Since multi-disciplinary learning is one of our primary goals, these projects are most meaningful when they connect students from different disciplines working toward a common understanding. However, strong disciplinary components present in their solutions also allow us to frame these projects from strictly disciplinary perspectives. In this paper, we show how they can be used for increased engagement in the context of data structures and algorithms. We review two new ones to explore (i) the structural characteristics of the western part of the U.S. power-grid, and (ii) the effects of over-harvesting on fish stocks.", "authors": [{"name": "Tom Pfaff", "affiliation": "Ithaca College, Ithaca, NY, USA"}, {"name": "Ali Erkan", "affiliation": "Ithaca College, Ithaca, NY, USA"}, {"name": "Michael Rogers", "affiliation": "Ithaca College, Ithaca, NY, USA"}, {"name": "Jason Hamilton", "affiliation": "Ithaca College, Ithaca, NY, USA"}], "tags": ["scientific computing", "active learning"]}, {"title": "Metaphors and analogies for teaching algorithms", "link": "https://dl.acm.org/doi/10.1145/2157136.2157147", "abstract": "In this paper we explore the topic of using metaphors and analogies in teaching algorithms. We argue their importance in the teaching process. We present a selection of metaphors we successfully used when teaching algorithms to secondary school students. We also discuss the suitability of several commonly used metaphors, and in several cases we show significant weaknesses of these metaphors.", "authors": [{"name": "Monika Steinová", "affiliation": "ETH Zurich, Zurich, Switzerland"}, {"name": "Michal Forišek", "affiliation": "Comenius University, Bratislava, Slovakia"}], "tags": ["metaphor", "abstraction", "teaching algorithms", "mental model", "physical analogy"]}, {"title": "Detecting and understanding students' misconceptions related to algorithms and data structures", "link": "https://dl.acm.org/doi/10.1145/2157136.2157148", "abstract": "We describe the first results of our work towards a concept inventory for Algorithms and Data Structures. Based on expert interviews and the analysis of 400 exams we were able to identify several core topics which are prone to error. In a pilot study, we verified misconceptions known from the literature and identified previously unknown misconceptions related to Algorithms and Data Structures. In addition to this, we report on methodological issues and point out the importance of a two-pronged approach to data collection.", "authors": [{"name": "Wolfgang Paul", "affiliation": "Technische Universität Dortmund, Dortmund, Germany"}, {"name": "Holger Danielsiek", "affiliation": "Technische Universität Dortmund, Dortmund, Germany"}, {"name": "Jan Vahrenhold", "affiliation": "Technische Universität Dortmund, Dortmund, Germany"}], "tags": ["misconceptions", "concept inventories", "CS1/2"]}, {"title": "Session details: Paper: robots", "link": "https://dl.acm.org/doi/10.1145/3248087", "abstract": "No abstract available.", "authors": [{"name": "Sherri Goings", "affiliation": "Carleton College"}], "tags": []}, {"title": "A C-based introductory course using robots", "link": "https://dl.acm.org/doi/10.1145/2157136.2157150", "abstract": "Using robots in introductory computer science classes has recently become a popular method of increasing student interest in computer science. This paper describes the development of a new curriculum for a CS 2 course, Imperative Problem Solving and Data Structures, based upon Scribbler 2 robots with standard C. The curriculum contains eight distinct modules with a primary topic theme, readings, labs, and project at the end. Each module resulted from collaboration among former CS 2 students and a faculty member, utilizing an iterative process with revisions. Each lab includes a survey to obtain student feedback that will allow the course to evolve and better fit the needs of future CS 2 students. All materials discussed here are available online for use by others.", "authors": [{"name": "Henry M. Walker", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "April O'Neill", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "David Cowden", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "Dilan Ustek", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "Erik Opavsky", "affiliation": "Grinnell College, Grinnell, IA, USA"}], "tags": ["robots", "collaborative learning", "course materials", "modules", "lab-based course"]}, {"title": "dLife: a Java library for multiplatform robotics, AI and vision in undergraduate CS and research", "link": "https://dl.acm.org/doi/10.1145/2157136.2157151", "abstract": "dLife is a free and open-source Java library that supports undergraduate education and research involving robotics, artificial intelligence, machine learning and computer vision. The design of dLife addresses many concerns raised by experience reports in the CS education literature including a shortened code/test/debug cycle, ready access to robot sensor information and close integration with a robotic simulation system. Full support is currently provided for the following robots: Finch, Hemisson (or Khepera Jr.), Sony Aibo, Khepera 2, Khepera 3, and Pioneer 3, with more in development. Easily extensible packages support classroom and research applications using neural networks, genetic algorithms, reinforcement learning and computer vision.", "authors": [{"name": "Grant Braught", "affiliation": "Dickinson College, Carlisle, PA, USA"}], "tags": ["Java", "machine vision", "mobile robotics", "neural networks", "genetic algorithms", "reinforcement learning"]}, {"title": "Seven big ideas in robotics, and how to teach them", "link": "https://dl.acm.org/doi/10.1145/2157136.2157152", "abstract": "Robotics is widely recognized as an interdisciplinary mixture of engineering and computer science, but the latter component is not well represented at many undergraduate institutions. The sophisticated technologies that underlie perception, planning, and control mechanisms in modern robots need to be made accessible to more computer science undergraduates. Following the curriculum design principles of Wiggins and McTighe (Understanding by Design, 2nd Ed.), I present seven big ideas in robotics that can fit together in a one semester undergraduate course. Each is introduced with an essential question, such as \"How do robots see the world?\" The answers expose students to deep concepts in computer science in a context where they can be immediately demonstrated. Hands-on labs using the Tekkotsu open source software framework and robots costing under $1,000 facilitate mastery of these important ideas. Courses based on parts of an early version of this curriculum are being offered at Carnegie Mellon and several other universities.", "authors": [{"name": "David S. Touretzky", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["tekkotsu", "computer vision", "kinematics", "path planning"]}, {"title": "Session details: Paper: K-6 collaborations", "link": "https://dl.acm.org/doi/10.1145/3248088", "abstract": "No abstract available.", "authors": [{"name": "Sheila Castaneda", "affiliation": "Clarke University"}], "tags": []}, {"title": "Design and evaluation of a braided teaching course in sixth grade computer science education", "link": "https://dl.acm.org/doi/10.1145/2157136.2157154", "abstract": "We report on the design and evaluation of the first year of a Computer Science course in lower secondary education that implements the concept of braided teaching. Besides being a proof-of-concept, our study demonstrates that students an indeed be taught Computer Science (as opposed to Information and Communication Technology) as early as in sixth grade while at the same time not falling behind with respect to Information Technology Literacy. We present quantitative and qualitative results and argue that Computer Science can be taught just like any other science subject worth full curriculum credit.", "authors": [{"name": "Arno Pasternak", "affiliation": "Fritz-Steinhoff-Gesamtschule Hagen and Technische Universität Dortmund, Dortmund, Germany "}, {"name": "Jan Vahrenhold", "affiliation": "Technische Universität Dortmund, Dortmund, Germany"}], "tags": ["lower secondary computer science education", "braided teaching", "computer science vs. ICT"]}, {"title": "EcoSim: a language and experience teaching parallel programming in elementary school", "link": "https://dl.acm.org/doi/10.1145/2157136.2157155", "abstract": "Traditional introductory programming classes teach sequential programming using a single-threaded programming model. It is typical to wait until a student has developed proficiency in sequential programming before teaching parallel programming. As computer hardware becomes increasingly parallel, there is a greater need for software engineers who are proficient in designing parallel programs, and not just by \"parallelizing\" sequential designs. Teaching parallelism first is an important step towards educating tomorrow's programmers.\nWe present an overview of a five-day introductory parallel programming course. We taught the course to nine and ten year-olds with no prior programming experience. Our course utilized a fundamentally parallel language we designed for the course, one with a near-natural language syntax that exposed the parallel processors throughout the code. This language, coupled with an interactive online programming environment, allowed us to teach a wide range of parallel programming concepts in a very limited timeframe.\nWe also present examples of student-written code that demonstrates their understanding of some basic parallel programming concepts, and we describe the overall course goal and specific lesson plans geared towards teaching students how to \"think parallel.\"", "authors": [{"name": "James Cohoon", "affiliation": "University of Virginia, Charlottesville, VA, USA"}, {"name": "Chris Gregg", "affiliation": "University of Virginia, Charlottesville, VA, USA"}, {"name": "Luther Tychonievich", "affiliation": "University of Virginia, Charlottesville, VA, USA"}, {"name": "Kim Hazelwood", "affiliation": "University of Virginia, Charlottesville, VA, USA"}], "tags": ["introductory programming", "concurrent languages", "instructional design", "readability", "pedagogy", "elementary school", "K-12", "education", "parallel languages"]}, {"title": "Building upon and enriching grade four mathematics standards with programming curriculum", "link": "https://dl.acm.org/doi/10.1145/2157136.2157156", "abstract": "We found that fifth grade students' scores on Scratch programming quizzes in a summer enrichment course were highly correlated with their scores on a standardized test for mathematics. We identify ways in which the programming curriculum builds upon target skills from the Mathematics Content Standards for California Public Schools. We hypothesize that the programming curriculum leveraged and enriched students' mathematics content knowledge.", "authors": [{"name": "Colleen M. Lewis", "affiliation": "University of California, Berkeley, Berkeley, CA, USA"}, {"name": "Niral Shah", "affiliation": "University of California, Berkeley, Berkeley, CA, USA"}], "tags": ["scratch", "computational thinking", "middle-school", "mathematics"]}, {"title": "Session details: Paper: tools", "link": "https://dl.acm.org/doi/10.1145/3248089", "abstract": "No abstract available.", "authors": [{"name": "Sage Miller", "affiliation": "Webster Central School District"}], "tags": []}, {"title": "Calico: a multi-programming-language, multi-context framework designed for computer science education", "link": "https://dl.acm.org/doi/10.1145/2157136.2157158", "abstract": "The Calico project is a multi-language, multi-context programming framework and learning environment for computing education. This environment is designed to support several interoperable programming languages (including Python, Scheme, and a visual programming language), a variety of pedagogical contexts (including scientific visualization, robotics, and art), and an assortment of physical devices (including different educational robotics platforms and a variety of physical sensors). In addition, the environment is designed to support collaboration and modern, interactive learning. In this paper we describe the Calico project, its design and goals, our prototype system, and its current use.", "authors": [{"name": "Jennifer S. Kay", "affiliation": "Rowan University, Glassboro, NJ, USA"}, {"name": "Keith O'Hara", "affiliation": "Bard College, Annandale-on-Hudson, NY, USA"}, {"name": "Mark Russo", "affiliation": "Bryn Mawr College, Bryn Mawr, PA, USA"}, {"name": "Douglas Blank", "affiliation": "Bryn Mawr College, Bryn Mawr, PA, USA"}, {"name": "James B. Marshall", "affiliation": "Sarah Lawrence College, Bronxville, NY, USA"}], "tags": ["robots", "integrated development environment", "pedagogy", "CS1", "IDE", "computer science education", "programming languages"]}, {"title": "How a language-based GUI generator can influence the teaching of object-oriented programming", "link": "https://dl.acm.org/doi/10.1145/2157136.2157159", "abstract": "A language-based direct-manipulation user-interface generator automatically creates a visualization of an object directly from its class, allows users to edit the visualization, and invokes methods in the object in response to these edits. Such a generator can change, and we argue, improve the lectures and assignments on programming conventions, methods, state, constructors, preconditions, MVC, polymorphism, graphics, structured objects, loops, concurrency, and annotations. We have built such a generator, which has several novel features for teaching such as interactive instantiation of a class, interactive invocation of methods and constructors that take arbitrary arguments, visualization of objects representing records, sequences, table and graphics, use of preconditions to disable/enable user-interface elements, and automatic generation of model threads. We have been working on and using such a generator for teaching CS 1 and CS 2 for about a decade.", "authors": [{"name": "Prasun Dewan", "affiliation": "University of North Carolina, Chapel Hill, NC, USA"}], "tags": ["user-interface generator", "concurrency", "model view controller", "preconditions"]}, {"title": "CodeWave: a real-time, collaborative IDE for enhanced learning in computer science", "link": "https://dl.acm.org/doi/10.1145/2157136.2157160", "abstract": "Computer science instructors often rely on the final version of a program for assessment and feedback. This ignores the process the student used to arrive at the final program. When the instructor has the ability to observe real-time development progress of each student, they are better equipped to provide appropriate and timely feedback. CodeWave, a software program developed at the University of North Carolina Wilmington looks to alleviate these issues.\nCodeWave is a real-time, collaborative Integrated Development Environment with traditional features such as syntax highlighting and non-traditional features such as integrated messaging and logged playback. CodeWave enhances productivity by integrating many common tools students and instructors use during the programming process. Communication is effortless and allows a user to specify a point in the code as a link in the message body. Log playback provides the ability to review the entire development process. In this paper, we describe the software program we developed to enhance learning in computer science programming courses.", "authors": [{"name": "Benjamin Barbour", "affiliation": "University of North Carolina Wilmington, Wilmington, NC, USA"}, {"name": "Jason Vandeventer", "affiliation": "University of North Carolina Wilmington, Wilmington, NC, USA"}], "tags": ["collaboration", "asynchronous interaction", "distance learning", "IDE"]}, {"title": "Session details: A stratified view of programming language parallelism for undergraduate CS education", "link": "https://dl.acm.org/doi/10.1145/3248090", "abstract": "No abstract available.", "authors": [{"name": "Richard Brown", "affiliation": "St. Olaf College"}], "tags": []}, {"title": "A stratified view of programming language parallelism for undergraduate CS education", "link": "https://dl.acm.org/doi/10.1145/2157136.2157162", "abstract": "It is no longer news that undergraduates in computer science need to learn more about parallelism. The range of options for parallel programming is truly staggering, involving hundreds of languages. How can a CS instructor make informed choices among all the options? This panel provides a guided introduction to parallelism in programming languages and their potential for undergraduate CS education, organized into four progressive categories: low-level libraries and; higher-level libraries and features; programming languages that incorporate parallelism; and frameworks for productive parallel programming. The four panelists will present representative examples in their categories, then present viewpoints on how those categories relate to coursework, curriculum, and trends in parallelism.", "authors": [{"name": "Joel C. Adams", "affiliation": "Calvin College, Grand Rapids, MI, USA"}, {"name": "Richard A. Brown", "affiliation": "St. Olaf College, Northfield, MN, USA"}, {"name": "Jens Mache", "affiliation": "Lewis & Clark College, Portland, OR, USA"}, {"name": "Elizabeth Shoop", "affiliation": "Macalester College, St. Paul, MN, USA"}, {"name": "David P. Bunde", "affiliation": "Knox College, Galesburg, IL, USA"}], "tags": ["programming languages", "parallelism", "parallel computing", "education"]}, {"title": "DeMystifying computing with magic", "link": "https://dl.acm.org/doi/10.1145/2157136.2157164", "abstract": "One of the most important tasks an introductory computing student must do is to form a mental model of how the computer works. This could be as specific as understanding the read-evaluate-print loop of an interpreter, or as general as believing that the computer works predictably and deterministically. However, some have fuzzy mental models, or worse, sincerely believe that the computer works unpredictably, \"by magic\". We seek to demystify computing for these students using analogy, by showing them something that even magic itself isn't really mystical, it is just computation.\nMagic is one of the most colorful examples of \"unplugged\" (i.e., without-computer, active learning) activities. It adds a unique facet in that it holds a hidden secret that an audience can be challenged to unfold. Once solved, students are often enthusiastic to perform the magic in front of others. In this session, we will share a variety of magic tricks whose answer is grounded in computer science: modulo arithmetic, permutations, algorithms, binary encoding, probability, etc. For each trick, we will have an interactive discussion of its underlying computing fundamentals, and tips for successful showmanship. Audience participation will be critical, for helping us perform the magic, discussing the solution, and contributing other magic tricks.", "authors": [{"name": "David Ginat", "affiliation": "Tel-Aviv University, Tel-Aviv, Israel"}, {"name": "Daniel D. Garcia", "affiliation": "University of California, Berkeley, Berkeley, CA, USA"}], "tags": ["computational thinking", "card tricks", "magic", "unplugged activities"]}, {"title": "Session details: Community-based projects for computing majors: opportunities, challenges and best practices", "link": "https://dl.acm.org/doi/10.1145/3248092", "abstract": "No abstract available.", "authors": [{"name": "Jeffrey Stone", "affiliation": "Pennsylvania State University"}], "tags": []}, {"title": "Community-based projects for computing majors: opportunities, challenges and best practices", "link": "https://dl.acm.org/doi/10.1145/2157136.2157166", "abstract": "The use of community-based projects has been recognized as having pedagogical and experiential value for computing majors (e.g. [3], [4], [5], [6]). Community-based projects can be valuable learning experiences for computing majors as well as for faculty and community partners. However, these types of projects do present challenges for faculty and should be aligned with desired course outcomes. This panel will discuss the use of community-based projects from multiple perspectives. The expectation is that the panel will serve as a forum for the participants to share the opportunities, challenges, pedagogical motivations, and best practices obtained from prior experience. Exemplar projects will be highlighted. The panel also hopes the session motivates the audience to share their own experiences and sparks the interest of those faculty members who may have no prior experience with community-based projects.", "authors": [{"name": "Elinor M. Madigan", "affiliation": "Pennsylvania State University, Schuylkill Haven, PA, USA"}, {"name": "Bonnie MacKellar", "affiliation": "St. John's University, Queens, NY, USA"}, {"name": "Jeffrey A. Stone", "affiliation": "Pennsylvania State University, Schuylkill Haven, PA, USA"}, {"name": "Janice L. Pearce", "affiliation": "Berea College, Berea, KY, USA"}], "tags": ["experiential learning", "community projects", "service learning"]}, {"title": "Session details: Paper: games", "link": "https://dl.acm.org/doi/10.1145/3248093", "abstract": "No abstract available.", "authors": [{"name": "Adrienne Decker", "affiliation": "Rochester Institute of Technology"}], "tags": []}, {"title": "The five year evolution of a game programming course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157168", "abstract": "This paper presents lessons learned from five years of teaching a game design and programming outreach course. This class is taught over the course of a month to high school students participating in the California Summer School for Mathematics and Science (COSMOS) at the University of California, Santa Cruz. Over these five years we have changed everything in the course, from the overall project structure to the programming language used in the class. In this paper we discuss our successes and failures, and offer recommendations to instructors offering similar courses.", "authors": [{"name": "Gillian Smith", "affiliation": "UC Santa Cruz, Santa Cruz, CA, USA"}, {"name": "Anne Sullivan", "affiliation": "UC Santa Cruz, Santa Cruz, CA, USA"}], "tags": ["game development", "high school", "outreach", "CS education"]}, {"title": "Programming, PWNed: using digital game development to enhance learners' competency and self-efficacy in a high school computing science course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157169", "abstract": "Games are an important part of popular culture and have successfully engaged audiences from different age groups [8]. This has caused many educators to start thinking of different ways to infuse game-based techniques (playing or construction) to enhance education. Over the past five years, there has been several research efforts on curriculum development and the evaluation of game construction and playing methods to promote STEM (Science Technology, Engineering and Mathematics) concepts to middle and high school students. In this paper, we report on a new study following the lead of previous efforts. In particular, we were granted a block within Frank Hurt High School by the Surrey school district for which to develop a game construction-based curriculum as a basis for computer science education within the school, replacing a traditional computer science class. From February till June 2011 students were taught elementary programming using GameMaker, a digital game development tool. In addition to collecting students' overall impressions, we also evaluated students' technical competency (using tests) and self-efficacy (using surveys) at the start and end of the semester. Our findings show that the curriculum had a positive, statistically significant effect on concept comprehension, which suggests that the curriculum was effective for understanding computer science and game design concepts. In this paper we present the course structure, methods, and evaluation as a contribution.", "authors": [{"name": "Katie Seaborn", "affiliation": "York University, Toronto, ON, Canada"}, {"name": "Darren Yung", "affiliation": "Frank Hurt Secondary, Surrey, BC, Canada"}, {"name": "Magy Seif El-Nasr", "affiliation": "Northeastern University, Boston, MA, USA"}, {"name": "David Milam", "affiliation": "Simon Fraser University, Surrey, BC, Canada"}], "tags": ["constructionist learning", "games and learning", "game design curriculum", "computer science curriculum"]}, {"title": "A learning objective focused methodology for the design and evaluation of game-based tutors", "link": "https://dl.acm.org/doi/10.1145/2157136.2157170", "abstract": "We present the Game2Learn methodology for the design and evaluation of educational games with a focus on well-defined learning objectives and empirical verification. This integrative process adapts ideas from educational design, intelligent tutoring systems, classical test-theory, and interaction and game design, and agile software development. The methodology guides researchers through the steps of the design process, including identification of specific learning objectives, translation of learning activities to game mechanics, and the empirical evaluation of the final product. This methodology is particularly useful for ensuring successful student research experiences or software engineering courses.", "authors": [{"name": "Tiffany Barnes", "affiliation": "The University of North Carolina at Charlotte, Charlotte, NC, USA"}, {"name": "Michael John Eagle", "affiliation": "The University of North Carolina at Charlotte, Charlotte, NC, USA"}], "tags": ["empirical evaluation", "educational games", "serious games", "design methods", "game design"]}, {"title": "Session details: Paper: professional experiences", "link": "https://dl.acm.org/doi/10.1145/3248094", "abstract": "No abstract available.", "authors": [{"name": "Sarah Heckman", "affiliation": "North Carolina State University"}], "tags": []}, {"title": "Course guides: a model for bringing professionals into the classroom", "link": "https://dl.acm.org/doi/10.1145/2157136.2157172", "abstract": "A new model, professional course guides, describes how practicing professionals can be brought into the classroom as student mentors and integrated into the course material. This new model is compared to existing models for student interactions with practicing professionals including guest speakers, adjunct faculty, and program mentors.", "authors": [{"name": "Thomas Gibbons", "affiliation": "The College of St. Scholastica, Duluth, MN, USA"}], "tags": ["classroom management", "industry/academic collaboration", "systems analysis and design", "information systems", "professional practice", "mentors"]}, {"title": "Towards a better capstone experience", "link": "https://dl.acm.org/doi/10.1145/2157136.2157173", "abstract": "The computer science capstone experience is designed to bridge the gap from university expectations to those of industry. Yet trying to solve this problem with a single course sequence, even one spanning the senior year, has some shortcomings, in terms of learning outcomes which can be achieved, and also instructional strategies that can be employed. We describe here an alternative plan which first provides a junior year of practice on a client-based project integrated with learning design and other related topics, followed by a senior year in which students can work more independently to hone these skills on a harder year-long project with another client. This two-year sequence, with scaffolding provided at first that is gradually removed, has proven to be especially effective in preparing undergraduates for a career in the soft- ware industry. The approach also integrates well with the need for these students to become proficient at working in engineering teams.", "authors": [{"name": "Shawn Bohner", "affiliation": "Rose-Hulman Institute of Technology, Terre Haute, IN, USA"}, {"name": "Stephen Chenoweth", "affiliation": "Rose-Hulman Institute of Technology, Terre Haute, IN, USA"}, {"name": "Sriram Mohan", "affiliation": "Rose-Hulman Institute of Technology, Terre Haute, IN, USA"}], "tags": ["software engineering", "capstone", "education", "curriculum"]}, {"title": "An open co-op model for global enterprise technology education: integrating the internship and course work", "link": "https://dl.acm.org/doi/10.1145/2157136.2157174", "abstract": "We present an open co-op program called Global Enterprise Technology Immersion Experience (GET IE) developed by JPMorgan Chase & Co. and Syracuse University. The new program creates a global enterprise focus in technology-oriented academic majors, integrated with hands-on experiential work-based learning to provide a context in which students are stimulated to utilize their classroom experience. The program includes a two-semester paid internship component that can be seamlessly incorporated with the existing computer science curriculum at Syracuse and else where. The internship's unique pedagogical innovation is to simultaneously provide the students academic course work that is integrated within a students extended internship and provides relevant problems in global enterprise technology. The curricula is \"open\" in the sense that other institutions and companies can join the consortium to enrich choices for the students and foster cross-fertilization of curricula activities. The program, in effect, creates a domain specific next generation co-op program that complements typical computer science curricula with a skill-set that is required for creating very large, global enterprise applications for technically and socially diverse organizations.", "authors": [{"name": "Jeffrey Saltz", "affiliation": "JP Morgan Chase, New York, NY, USA"}, {"name": "Jae Oh", "affiliation": "Syracuse University, Syracuse, NY, USA"}], "tags": ["open-coop consortium model", "large global enterprise applications", "curriculum", "real-world experience"]}, {"title": "Session details: Paper: a session with a view", "link": "https://dl.acm.org/doi/10.1145/3248095", "abstract": "No abstract available.", "authors": [{"name": "Don Goelman", "affiliation": "Villanova University"}], "tags": []}, {"title": "Integrating video components in CS1", "link": "https://dl.acm.org/doi/10.1145/2157136.2157176", "abstract": "The Open University of Israel (OUI) is a distance learning university. Our CS1 course is taught through video-taped lectures that cover the study material. In addition, students may participate in face-to-face group meetings in study centers located all over the country and taught by tutors. There is a special group called Ofek, in which the tutor is located in a studio and the lesson is broadcast over the internet. Students enrolled in this group participate from their home PCs. The taped Ofek sessions as well as the lectures are stored on the course website, and students can watch them whenever convenient. We conducted a study to investigate students' viewing habits and the relationship between viewing and the success rate in the course.", "authors": [{"name": "Ronit Sagi", "affiliation": "The Open University of Israel, Raanana, Israel"}, {"name": "Ela Zur", "affiliation": "The Open University of Israel, Raanana, Israel"}, {"name": "Tamar Vilner", "affiliation": "The Open University of Israel, Raanana, Israel"}], "tags": ["taped lectures", "video", "distance learning", "CS1"]}, {"title": "Development and evaluation of indexed captioned searchable videos for STEM coursework", "link": "https://dl.acm.org/doi/10.1145/2157136.2157177", "abstract": "Videos of classroom lectures have proven to be a popular and versatile learning resource. This paper reports on videos featuring Indexing, Captioning, and Search capability (ICS Videos). The goal is to allow a user to rapidly search and access a topic of interest, a key shortcoming of the standard video format. A lecture is automatically divided into logical indexed video segments by analyzing video frames. Text is automatically identified with OCR technology enhanced with image transformations to drive keyword search. Captions can be added to videos. The ICS video player integrates indexing, search, and captioning in video playback and has been used by dozens of courses and 1000s of students. This paper reports on the development and evaluation of ICS videos framework and assessment of its value as an academic learning resource.", "authors": [{"name": "Lecia Barker", "affiliation": "University of Texas, Austin, TX, USA"}, {"name": "Olin Johnson", "affiliation": "University of Houston, Houston, TX, USA"}, {"name": "Tayfun Tuna", "affiliation": "University of Houston, Houston, TX, USA"}, {"name": "Shishir Shah", "affiliation": "University of Houston, Houston, TX, USA"}, {"name": "Varun Varghese", "affiliation": "University of Houston, Houston, TX, USA"}, {"name": "Jaspal Subhlok", "affiliation": "University of Houston, Houston, TX, USA"}], "tags": ["OCR", "text segmentation", "video search", "video indexing", "lecture videos", "assessment", "educational technologies"]}, {"title": "Metaview: a tool for learning about viewing in 3D", "link": "https://dl.acm.org/doi/10.1145/2157136.2157178", "abstract": "Metaview is an interactive tool that helps to teach concepts related to nested 3D coordinate systems, especially in the context of defining and establishing views of 3D scenes in common graphics APIs like OpenGL and Direct3D. We describe the context in which nested coordinate systems arise in the study of graphics programming, then we relate the common conceptual difficulties students typically experience when studying and trying to put this material into practice. We then describe the role that metaview plays in helping to overcome these problems. Space allows us only to describe its core uses in these areas; several of its additional features are briefly listed at the end. Metaview is packaged with a set of built-in 3D models used to demonstrate major concepts. In addition, external and/or student-programmed models are easily imported into the tool. Metaview can be run anywhere, anytime using Java Web Start. The latest released version of the tool can be executed from http://people.eecs.ku.edu/~miller/JOGL/metaview.jnlp. We are currently working on a port to OpenGL ES targeted for portable smart devices such as tablet computers.", "authors": [{"name": "James R. Miller", "affiliation": "University of Kansas, Lawrence, KS, USA"}], "tags": ["computer graphics", "self-paced learning", "educational technology", "computer-aided learning"]}, {"title": "Session details: Paper: pedagogy: programming", "link": "https://dl.acm.org/doi/10.1145/3248096", "abstract": "No abstract available.", "authors": [{"name": "Saquib Razak", "affiliation": "Carnegie Mellon University"}], "tags": []}, {"title": "Mediated transfer: Alice 3 to Java", "link": "https://dl.acm.org/doi/10.1145/2157136.2157180", "abstract": "In this paper, we describe a pedagogy for an undergraduate programming course using Alice 3 and Java. We applied the educational theory of mediated transfer to develop a new version of the Alice system and accompanying instructional materials. The pedagogy was implemented and tested over two years. Student test scores in experimental, treatment course sections showed dramatic improvement over scores in comparable non-treatment sections.", "authors": [{"name": "Don Slater", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Steve Cooper", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Wanda Dann", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Dennis Cosgrove", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Dave Culyba", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["mediated transfer", "Java", "Alice"]}, {"title": "Over-confidence and confusion in using bloom for programming fundamentals assessment", "link": "https://dl.acm.org/doi/10.1145/2157136.2157181", "abstract": "A computer science student is required to progress from a novice programmer to a proficient developer through the programming fundamentals sequence of subjects. This paper deals with the capturing and representation of learning progression. The key contribution is a web-based interactive tutorial that enables computer science educators to practice applying the Bloom Taxonomy in classifying programming exam questions. The tutorial captures participant confidence and self-explanations for each Bloom [5] classification exercise. The results of an evaluation with ten participants were analyzed for consistency and accuracy in the application of Bloom. The confidence and self-explanation measures were used to identify problem areas in the application of Bloom to programming fundamentals. The tutorial and findings are valuable contributions to future ACM/IEEE CS curriculum revisions, which are expected to have a continued emphasis on Bloom [1].", "authors": [{"name": "Judy Kay", "affiliation": "University of Sydney, Sydney, Australia"}, {"name": "Richard Gluga", "affiliation": "University of Sydney, Sydney, Australia"}, {"name": "Sabina Kleitman", "affiliation": "University of Sydney, Sydney, Australia"}, {"name": "Tim Lever", "affiliation": "University of Sydney, Sydney, Australia"}, {"name": "Raymond Lister", "affiliation": "University of Technology Sydney, Sydney, Australia"}], "tags": ["maturity", "programming", "CS1/2", "pedagogy", "learning progression", "bloom", "confidence", "competence", "assessment"]}, {"title": "Modeling how students learn to program", "link": "https://dl.acm.org/doi/10.1145/2157136.2157182", "abstract": "Despite the potential wealth of educational indicators expressed in a student's approach to homework assignments, how students arrive at their final solution is largely overlooked in university courses. In this paper we present a methodology which uses machine learning techniques to autonomously create a graphical model of how students in an introductory programming course progress through a homework assignment. We subsequently show that this model is predictive of which students will struggle with material presented later in the class.", "authors": [{"name": "Paulo Blikstein", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Steve Cooper", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Chris Piech", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Mehran Sahami", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Daphne Koller", "affiliation": "Stanford University, Stanford, CA, USA"}], "tags": ["intelligent tutor", "probabilistic graphical models", "hidden Markov model", "program dissimilarity metric", "student progress model"]}, {"title": "Session details: Science fiction in computer science education", "link": "https://dl.acm.org/doi/10.1145/3248097", "abstract": "No abstract available.", "authors": [{"name": "Rebecca Bates", "affiliation": "Minnesota State University, Mankato"}], "tags": []}, {"title": "Science fiction in computer science education", "link": "https://dl.acm.org/doi/10.1145/2157136.2157184", "abstract": "The use of science fiction (SF) to engage students in computer science learning is becoming more popular [1-6]. There is ample material available to help both undergraduate and graduate students make connections between technical content and human experience, from Star Trek to The Hitchhiker's Guide to the Galaxy to 2001: A Space Odyssey to I, Robot and many others. Fiction can be included in technical courses or used to draw students into the field in introductory classes. The panelists, who represent a range of schools, perspectives and classes, will present brief overviews (5-8 minutes) of how they have used science fiction to engage students in technical topics as well as ethical and societal issues related to computing. After the overviews, there will be plenty of time for discussion of examples used within the community and ways to make connections between science fiction and particular classes or topics. We will be gathering additional examples from the discussion and making them available online.", "authors": [{"name": "Valerie Summet", "affiliation": "Emory University, Atlanta, GA, USA"}, {"name": "Judy Goldsmith", "affiliation": "University of Kentucky, Lexington, KY, USA"}, {"name": "Nanette Veilleux", "affiliation": "Simmons College, Boston, MA, USA"}, {"name": "Rosalyn Berne", "affiliation": "University of Virginia, Charlottesville, VA, USA"}, {"name": "Rebecca Bates", "affiliation": "Minnesota State University, Mankato, Mankato, MN, USA"}], "tags": ["science fiction", "computer science education methods"]}, {"title": "Session details: Diversity initiatives to support systemic change for women in undergraduate computing", "link": "https://dl.acm.org/doi/10.1145/3248098", "abstract": "No abstract available.", "authors": [{"name": "Leisa D. Thompson", "affiliation": "University of Virginia"}], "tags": []}, {"title": "Initiatives to support systemic change for women in undergraduate computing", "link": "https://dl.acm.org/doi/10.1145/2157136.2157186", "abstract": "The National Center for Women & Information Technology (NCWIT) Extension Services for Undergraduate Programs (ES-UP) has created a large group of trained consultants (ESCs) and clients who are passionate about women's participation in computing. This panel will describe how our ESCs and clients have worked together to effect change and will show outcomes from our activities over the past three years.", "authors": [{"name": "Lecia J. Barker", "affiliation": "University of Texas at Austin, Austin, TX, USA"}, {"name": "Leisa D. Thompson", "affiliation": "University of Virginia, Charlottesville, VA, USA"}, {"name": "Tom McKlin", "affiliation": "The Findings Group, LLC, Atlanta, GA, USA"}, {"name": "Rita Manco Powell", "affiliation": "University of Pennsylvania, Philadelphia, PA, USA"}, {"name": "Catherine E. Brawner", "affiliation": "Research Triangle Educational Consultants, Raleigh, NC, USA"}], "tags": ["retention", "systemic change", "women", "gender", "diversity", "recruitment"]}, {"title": "Transforming the CS classroom with studio-based learning", "link": "https://dl.acm.org/doi/10.1145/2157136.2157188", "abstract": "The studio-based learning (SBL) model aims to promote learning in a social and collaborative context by having learners construct, iteratively refine, and critically review design artifacts under the guidance of instructors and disciplinary experts. Recognizing the potential of SBL to foster the development of not only technical design skills, but also increasingly-coveted communication and collaboration skills, we have been adapting the approach for computing education, implementing it in various courses, and evaluating its impact over the past 5 years. This effort now involves 26 computing courses at 15 institutions in seven states. To our knowledge, this represents the most systematic implementation and evaluation of a pedagogy for computing education to date. This special session will introduce SBL to the SIGCSE community and facilitate a discussion and exchange of ideas. In addition to oral and poster presentations of the SBL model and its evaluation results, the session will feature \"war stories\" from teachers who have applied the model to their courses and hands-on activities to help attendees apply SBL to their courses.", "authors": [{"name": "Christopher Hundhausen", "affiliation": "Washington State University, Pullman, WA 99164, WA, USA"}, {"name": "N. Hari Narayanan", "affiliation": "Auburn University, Auburn, WA, USA"}, {"name": "Dean Hendrix", "affiliation": "Auburn University, Auburn, AL, USA"}, {"name": "Martha Crosby", "affiliation": "University of Hawaii at Manoa, Honolulu, HI, USA"}], "tags": ["pedagogy", "studio-based learning and instruction", "design crit", "evaluation"]}, {"title": "Session details: Paper: broadening participation", "link": "https://dl.acm.org/doi/10.1145/3248100", "abstract": "No abstract available.", "authors": [{"name": "Kristine Nagel", "affiliation": "Georgia Gwinnett College"}], "tags": []}, {"title": "Making turing machines accessible to blind students", "link": "https://dl.acm.org/doi/10.1145/2157136.2157190", "abstract": "In this paper we describe how we tried to make the well-known JFLAP Turing machine simulator accessible to blind students taking a theoretical computer science course. Software accessibility is an important topic for both legal and ethical reasons: in our case, however, we also wanted to make the accessible software usable by blind students in cooperation with the other students, in order to encourage the integration of the blind students within the rest of the class. For this reason, the accessible version of the JFLAP Turing machine simulator that we developed is as much similar as possible to and fully compatible with the original one. In the paper, we also report some very satisfactory preliminary validation results that indicate how the new software can really make Turing machines accessible to blind students.", "authors": [{"name": "Leonardo Rossi", "affiliation": "Università di Firenze, Firenze, Italy"}, {"name": "Gianluca Apollaro", "affiliation": "Università di Firenze, Firenze, Italy"}, {"name": "Pierluigi Crescenzi", "affiliation": "Università di Firenze, Firenze, Italy"}], "tags": ["computability", "turing machines", "software accessibility"]}, {"title": "Toward an emergent theory of broadening participation in computer science education", "link": "https://dl.acm.org/doi/10.1145/2157136.2157191", "abstract": "A fundamental challenge to computer science education is the difficulty of broadening participation of women and underserved communities. The idea of game design and game programming as an activity to introduce children at an early age to computational thinking in a motivational way is quickly gaining momentum. A pedagogical approach called Project First has allowed the Scalable Game Design project to reach a large group of middle schools students including a large percentage of female (45%) and underrepresented (48%) students. With over 4000 students in inner city, remote rural, and Native American communities Scalable Game Design has investigated the impact on students' interest level of pedagogical approaches employed by teachers such as mediation and scaffolding. Findings suggest strong gender effects based on classroom scaffolding approaches. For instance, girls are substantially less likely to be motivated through scaffolding based on direct instruction. Conversely, guided discovery scaffolding approaches are highly motivating to the point where they can even overcome other negative predictors such as small girls to boys class participation ratios. This paper introduces the project, discusses different scaffolding approaches and presents data connecting gender specific motivational levels with scaffolding approaches.", "authors": [{"name": "Kyu Han Koh", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}, {"name": "David C. Webb", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}, {"name": "Alexander Repenning", "affiliation": "University of Colorado at Boulder, Boulder, CO, USA"}], "tags": ["student interest", "teacher-directed instruction", "guided discovery"]}, {"title": "Exploring formal learning groups and their impact on recruitment of women in undergraduate CS", "link": "https://dl.acm.org/doi/10.1145/2157136.2157192", "abstract": "As percentages of women in computing jobs and university programs decline, recruiting and retaining women in the field of Computer Science (CS) becomes increasingly important. Undergraduate CS programs, and more specifically, introductory-level CS courses, offer an opportunity to introduce women to CS studies. Furthermore, learning experiences in introductory CS courses can be pivotal in shaping female students' perceptions of CS. Collaborative learning, in various forms, is an instructional construct that has been shown to be effective in recruiting and retaining women in undergraduate CS programs. In this paper we present an exploratory study on formal learning groups and their potential to attract and maintain female students' interest in CS studies.", "authors": [{"name": "Keith Hellman", "affiliation": "Colorado School of Mines, Golden, CO, USA"}, {"name": "Julie Krause", "affiliation": "Colorado School of Mines, Golden, CO, USA"}, {"name": "Irene Polycarpou", "affiliation": "Colorado School of Mines, Golden, CO, USA"}], "tags": ["retention", "women", "gender", "collaborative learning", "computer science education", "recruitment", "formal learning groups", "introduction to computer science"]}, {"title": "Session details: Paper: online collaboration", "link": "https://dl.acm.org/doi/10.1145/3248101", "abstract": "No abstract available.", "authors": [{"name": "Charles Leska", "affiliation": "Randolph-Macon College"}], "tags": []}, {"title": "Perspectives on active learning and collaboration: JavaWIDE in the classroom", "link": "https://dl.acm.org/doi/10.1145/2157136.2157194", "abstract": "The Java Wiki Integrated Development Environment (JavaWIDE) is an innovative environment that promotes active learning and collaboration in programming courses. This paper surveys how JavaWIDE's features have been used to promote active and collaborative learning in both traditional and distance education (synchronous) in four different environments: high school, summer enrichment courses, and at two- and four-year colleges. The authors describe the context of each teaching and learning environment and the parts of JavaWIDE that are particularly well suited in each context. After discussing the active learning and collaboration techniques employed, student responses to the experience are summarized. This collection of case studies illustrates how the concurrent editing, shared environment awareness and other features of JavaWIDE can be used to promote active learning and collaboration within a heterogeneous set of teaching and learning environments.", "authors": [{"name": "Sonal Dekhane", "affiliation": "Georgia Gwinnett College, Lawrenceville, GA, USA"}, {"name": "Thomas Cooper", "affiliation": "The Walker School , Marietta, GA, USA"}, {"name": "Evelyn Brannock", "affiliation": "Georgia Gwinnett College, Lawrenceville, GA, USA"}, {"name": "Mark Hall", "affiliation": "University of Wisconsin - Marathon County, Marathon County, WI, USA"}, {"name": "Jam Jenkins", "affiliation": "Valdosta State University, Valdosta, GA, USA"}, {"name": "Michael Nguyen", "affiliation": "Emory University, Atlanta, GA, USA"}], "tags": ["introductory programming", "collaboration", "tutoring", "Java", "concurrent editing", "CS1", "javawide", "CS0", "active learning", "case study", "distance education", "web-based IDE"]}, {"title": "How well do online forums facilitate discussion and collaboration among novice animation programmers?", "link": "https://dl.acm.org/doi/10.1145/2157136.2157195", "abstract": "Animation programming is a widely-respected approach for helping students to learn programming skills, and online forums are a widely-used approach for helping students to interact with one another. But in what ways, if any, does combining animation programming with online forums lead to useful discussion and collaboration among learners? To answer this question, we analyzed online forum discussions among people who were learning to create animation programs using the Scratch programming environment. We discovered that specific kinds of online posts were more likely than others to be followed by discussion, and we found that the ensuing collaboration often involved the exchange of design ideas and feedback within small groups of users. These findings reveal opportunities for enhancing online forums and surrounding tools so they more effectively facilitate discussion, collaboration, and ultimately development of programming skills.", "authors": [{"name": "Yan Zhang", "affiliation": "Oregon State University, Corvallis, OR, USA"}, {"name": "Aniket Dahotre", "affiliation": "Oregon State University, Corvallis, OR, USA"}, {"name": "Christopher Scaffidi", "affiliation": "Oregon State University, Corvallis, OR, USA"}], "tags": ["scratch", "novice programming environments", "forums"]}, {"title": "Classroom salon: a tool for social collaboration", "link": "https://dl.acm.org/doi/10.1145/2157136.2157196", "abstract": "Classroom Salon is an on-line social collaboration tool that allows instructors to create, manage, and analyze social net- works (called Salons) to enhance student learning. Students in a Salon can cooperatively create, comment on, and modify documents. Classroom Salon provides tools that allow the instructor to monitor the social networks and gauge both student participation and individual effectiveness. This pa- per describes Classroom Salon, provides some use cases that we have developed for introductory computer science classes and presents some preliminary observations of using this tool in several computer science courses at Carnegie Mellon University.", "authors": [{"name": "John Barr", "affiliation": "Ithaca College, Ithaca, NY, USA"}, {"name": "Ananda Gunawardena", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}], "tags": ["assessment", "social networking", "collaborative documents"]}, {"title": "Session details: Paper: middle school collaborations", "link": "https://dl.acm.org/doi/10.1145/3248102", "abstract": "No abstract available.", "authors": [{"name": "Catherine Lang", "affiliation": "Swinburne University of Technology"}], "tags": []}, {"title": "Bringing the breadth of computer science to middle schools", "link": "https://dl.acm.org/doi/10.1145/2157136.2157198", "abstract": "In order to garner more student interest in the pursuit of computer science as both a major and a career path, K-12 students need to be made aware of what computer science is and what it is about earlier in their education. Although students in many high schools can pursue introductory programming, high school is arguably too late to interest students who may have developed ill-informed attitudes about computer science. This paper documents curricular items developed for and taught to an audience of mixed ability 6th through 8th graders taking a local Technology Education class that attempts to showcase some of the more interesting, less stereotypical, aspects of computer science using a breadth approach in an effort to encourage interest in the field.", "authors": [{"name": "Jennifer Walz", "affiliation": "Harrison Morton Middle School, Allentown, PA, USA"}, {"name": "Elizabeth Carter", "affiliation": "Lehigh University, Bethlehem, PA, USA"}, {"name": "Glenn Blank", "affiliation": "Lehigh University, Bethlehem, PA, USA"}], "tags": ["curricula", "K-12 education", "computer science education", "STEM"]}, {"title": "Integrating hard and soft skills: software engineers serving middle school teachers", "link": "https://dl.acm.org/doi/10.1145/2157136.2157199", "abstract": "We have developed and implemented, over four semesters, a model for engaging computer science majors in service learning for teachers of grades 6-8 at a K-8 school in an underserved community. This paper describes the design of a course focused on interweaving software engineering practice, service learning, and development of \"soft\" professional skills. CS student teams partner with middle school teacher teams to create learning games for classrooms, and then conduct classroom instruction and observation. We report on our results from evaluating the experience of CS students and middle school teachers through pre-post surveys, evaluator observation of student demo presentations and classroom instruction, focus groups, and student reflective journals.", "authors": [{"name": "Lori Pollock", "affiliation": "University of Delaware, Newark, DE, USA"}, {"name": "Richard Burns", "affiliation": "University of Delaware, Newark, DE, USA"}, {"name": "Terry Harvey", "affiliation": "University of Delaware, Newark, DE, USA"}], "tags": ["reflective journaling", "problem-based learning", "software engineering", "soft skills", "studio-based classroom", "service learning"]}, {"title": "The fairy performance assessment: measuring computational thinking in middle school", "link": "https://dl.acm.org/doi/10.1145/2157136.2157200", "abstract": "Computational thinking (CT) has been described as an essential capacity to prepare students for computer science, as well as to be productive members of society. But efforts to engage K-12 students in CT are hampered by a lack of definition and assessment tools. In this paper, we describe the first results of a newly created performance assessment tool for measuring CT in middle school. We briefly describe the context for the performance assessment (game-programming courses), the aspects of CT that are measured, the results, and the factors that are associated with performance. We see the development of assessment tools as a critical step in efforts to bring CT to K-12, and to strengthen the use of game programming in middle school. We discuss problems and implications of our results.", "authors": [{"name": "Linda Werner", "affiliation": "University of California, Santa Cruz, CA, USA"}, {"name": "Shannon Campe", "affiliation": "Education, Training, Research Associates, Scotts Valley, CA, USA"}, {"name": "Damon Chizuru Kawamoto", "affiliation": "Brown University, Providence, RI, USA"}, {"name": "Jill Denner", "affiliation": "Education, Training, Research Associates, Scotts Valley, CA, USA"}], "tags": ["pair programming", "middle school", "computational thinking", "Alice", "assessment", "game programming"]}, {"title": "Session details: Paper: new tricks for the classroom", "link": "https://dl.acm.org/doi/10.1145/3248103", "abstract": "No abstract available.", "authors": [{"name": "Julian Mason", "affiliation": "Duke University"}], "tags": []}, {"title": "Running students' software tests against each others' code: new life for an old \"gimmick\"", "link": "https://dl.acm.org/doi/10.1145/2157136.2157202", "abstract": "At SIGCSE 2002, Michael Goldwasser suggested a strategy for adding software testing practices to programming courses by requiring students to turn in tests along with their solutions, and then running every student's tests against every other student's program. This approach provides a much more robust environment for assessing the quality of student-written tests, and also provides more thorough testing of student solutions. Although software testing is included as a regular part of many more programming courses today, the all-pairs model of executing tests is still a rarity. This is because student-written tests, such as JUnit tests written for Java programs, are now more commonly written in the form of program code themselves, and they may depend on virtually any aspect of their author's own solution. These dependencies may keep one student's tests from even compiling against another student's program. This paper discusses the problem and presents a novel solution for Java that uses bytecode rewriting to transform a student's tests into a form that uses reflection to run against any other solution, regardless of any compile-time dependencies that may have been present in the original tests. Results of applying this technique to two assignments, encompassing 147 student programs and 240,158 individual test case runs, shows the feasibility of the approach and provides some insight into the quality of both student tests and student programs. An analysis of these results is presented.", "authors": [{"name": "Michael Cogswell", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Stephen H. Edwards", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Zalia Shams", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Robert C. Senkbeil", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["programming assignments", "bytecode transformation", "reflection", "software testing", "test coverage", "automated assessment", "test-driven development"]}, {"title": "Group note-taking in a large lecture class", "link": "https://dl.acm.org/doi/10.1145/2157136.2157203", "abstract": "Large introductory-level classes provide a cost-efficient approach for universities to serve many students at once, but also present several challenges to learning (e.g., poor visual angles). In addition, more students with declared, undeclared, or undiagnosed learning disabilities are entering the college and university systems. In the spirit of universal design, we created a group note-taking system in our large introductory computer science course to increase interaction amongst students, promote good note-taking strategies, and provide study resources to all students while also fulfilling the role of accommodating for students with learning disabilities. We show that the section of the course taught with our intervention performed significantly better on their final examination compared to a course taught without the intervention. We report that students enjoyed increased interactions with their peers, and that one third of the class self-reported an increase in their note-taking skills. Furthermore, our intervention only required minimal cost to the institution, and no financial cost to students, and is easily implemented in any size class.", "authors": [{"name": "Sal LaMarca", "affiliation": "The University of Georgia, Athens, GA, USA"}, {"name": "Christopher Plaue", "affiliation": "The University of Georgia, Athens, GA, USA"}, {"name": "Shelby H. Funk", "affiliation": "The University of Georgia, Athens, GA, USA"}], "tags": ["universal design", "note-taking", "teamwork", "introductory coursework"]}, {"title": "Following a thread: knitting patterns and program tracing", "link": "https://dl.acm.org/doi/10.1145/2157136.2157204", "abstract": "This paper presents observations about teaching program tracing to novices drawn from a study of knitting patterns. Due to changes in audience, knitting patterns have evolved from vague, chatty discourse written for experts to precise, line-by-line procedures that are akin to programs. The modern knitting community has developed numerous conventions for articulating iteration, expressing conditions, and documenting design decisions. \"Executing\" one of these patterns is analogous to tracing, since the knitter must demonstrate understanding of the instructions. We argue that the conventions adopted by knitters to make their patterns more understandable to non-experts provide useful insight to computer scientists teaching novices. Our observations suggest that phrasing conditions as termination cases (\"until\" instead of \"while\") and partially unrolling loops may help beginners understand code and that some structures, like parameters to functions, may be unfamiliar because they have no common analog.", "authors": [{"name": "Sarah Petersen", "affiliation": ", Toronto, ON, Canada"}, {"name": "Michelle Craig", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Andrew Petersen", "affiliation": "University of Toronto Mississauga, Mississauga, ON, Canada"}], "tags": ["nonmajors", "tracing", "novice programming"]}, {"title": "Session details: Plenary Session", "link": "https://dl.acm.org/doi/10.1145/3248104", "abstract": "No abstract available.", "authors": [{"name": "Tracy Camp", "affiliation": "Colorado School of Mines"}, {"name": "Paul Tyman", "affiliation": "Rochester Institute of Technology"}], "tags": []}, {"title": "From computational thinking to computational values", "link": "https://dl.acm.org/doi/10.1145/2157136.2157206", "abstract": "SIGCSE members love the beauty of computational thinking. They know the joy of bringing those ideas to young people. That love for computational thinking entails respect for the computational values that empower people in the digital world. For academics, those values have been central to the flowering of computing as an intellectual endeavor. Today, those values are increasingly threatened by stresses from both within and outside academia: squabbles over who owns academic work, increasingly stringent and overreaching intellectual property laws, and the replacement of open computing platforms by closed applications and walled-garden application markets.\nIn this talk I'll describe some things we've done at MIT to support computational values, like open publication of all our course materials, our faculty policy on open publication of academic research, and our recently announced initiative for open online instruction based on non-proprietary software platforms. I'll discuss Creative Commons licensing and Free Software, and the importance of tinkerability for empowering citizens in an information society. And I'll describe App Inventor for Android, a new programming tool motivated by the vision that all of us us can experience mobile computing as creators using tools that we can control and reshape, rather than only as consumers of packaged applications.", "authors": [{"name": "Hal Abelson", "affiliation": "Massachusetts Institute of Technology, Boston, MA, USA"}], "tags": ["keynote"]}, {"title": "Session details: Teaching mathematical reasoning across the curriculum", "link": "https://dl.acm.org/doi/10.1145/3248105", "abstract": "No abstract available.", "authors": [{"name": "Joan Krone", "affiliation": "Denison University"}], "tags": []}, {"title": "Teaching mathematical reasoning across the curriculum", "link": "https://dl.acm.org/doi/10.1145/2157136.2157208", "abstract": "No abstract available.", "authors": [{"name": "Jeffrey C. Carver", "affiliation": "University of Alabam, Tuscaloosa, AL, USA"}, {"name": "Joan Krone", "affiliation": "Denison University, Granville, OH, USA"}, {"name": "Joseph E. Hollingsworth", "affiliation": "Indiana University Southeast, New Albany, IN, USA"}, {"name": "Murali Sitaraman", "affiliation": "Clemson University, Clemson, SC, USA"}, {"name": "Amruth Kumar", "affiliation": "Ramapo Dollege of New Jersey, Mahwah, NJ, USA"}, {"name": "Doug Baldwin", "affiliation": "SUNY Geneseo, Geneseo, NY, USA"}], "tags": ["mathematical reasoning"]}, {"title": "Teaching HS computer science as if the rest of the world existed: rationale for a HS Pre-APCS curriculum of interdisciplinary central-problem-based units that model real-world applications", "link": "https://dl.acm.org/doi/10.1145/2157136.2157210", "abstract": "The presentation, an interim report, will focus on the design, implementation and rationale for a pre-APCS HS curriculum of Interdisciplinary Central-Problem-Based units that model real-world applications. In a typical multi-week unit, students use an existing complex software application to explore a specific problem, e.g. configuring SDSC Biology Workbench to build a phylogenetic (evolutionary) tree for various animal species after determining the degree of homology between protein or DNA sequences obtained from online genomic and protein databases. Students then build a small-scale version of the program - focusing on 1 or 2 algorithms - using Processing, Excel, BYOB or Alice. This approach allows students a glimpse into the inner workings of such programs, and affords them both context and practical potential for their projects. Back-stories from film and literature (e.g. Inherit the Wind) place problems within an historical and social context so that students will understand both their importance and the contribution CS can make to their solution. Unit topics have come from the fields of Astronomy (Galileo's discoveries), Bioinformatics (evolution), Molecular Modeling (DNA double helix), Political Science (women's suffrage/ Florida 2000 Presidential election), Environmental Science, Music (visualization software like Synthesia), and Holocaust Studies (IBM's active hardware and programming support for Hollerith machine technology used in the Nazi extermination programs).", "authors": [{"name": "Scott R. Portnoff", "affiliation": "Downtown Magnets High School, Los Angeles USD, Los Angeles, CA, USA"}], "tags": ["Pre-APCS", "interdisciplinary", "K-12 instruction", "increasing enrollment", "central problem", "curriculum", "gender / diversity"]}, {"title": "Funding the challenges in computing", "link": "https://dl.acm.org/doi/10.1145/2157136.2157212", "abstract": "What are the perceived challenges by the computing education and research communities? After small groups discuss this question, we will compare and contrast these perceived challenges to the current trend in proposals submitted and funded by the National Science Foundation's (NSF) Transforming Undergraduate Education in STEM (TUES) program. The intention is to create awareness for all involved and to broaden the range of proposals submitted to the NSF.", "authors": [{"name": "Guy-Alain Amoussou", "affiliation": "The National Science Foundation, Arlington, VA, USA"}, {"name": "Scott Grissom", "affiliation": "Grand Valley State University, Allendale, MI, USA"}], "tags": ["funding trends", "computing challenges", "NSF"]}, {"title": "Session details: Paper: CS1: new ideas", "link": "https://dl.acm.org/doi/10.1145/3248108", "abstract": "No abstract available.", "authors": [{"name": "Lori Carter", "affiliation": "Point Loma Nazarene University"}], "tags": []}, {"title": "Creative coding and visual portfolios for CS1", "link": "https://dl.acm.org/doi/10.1145/2157136.2157214", "abstract": "In this paper, we present the design and development of a new approach to teaching the college-level introductory computing course (CS1) using the context of art and creative coding. Over the course of a semester, students create a portfolio of aesthetic visual designs that employ basic computing structures typically taught in traditional CS1 courses using the Processing programming language. The goal of this approach is to bring the excitement, creativity, and innovation fostered by the context of creative coding. We also present results from a comparative study involving two offerings of the new course at two different institutions. Additionally, we compare our results with another successful approach that uses personal robots to teach CS1.", "authors": [{"name": "Ira Greenberg", "affiliation": "Southern Methodist University, Dallas, TX, USA"}, {"name": "Deepak Kumar", "affiliation": "Bryn Mawr College, Bryn Mawr, PA, USA"}, {"name": "Dianna Xu", "affiliation": "Bryn Mawr College, Bryn Mawr, PA, USA"}], "tags": ["art", "creative computation", "pedagogy", "visual portfolio", "CS1", "processing", "computer science", "education", "creative coding"]}, {"title": "Stepping up to integrative questions on CS1 exams", "link": "https://dl.acm.org/doi/10.1145/2157136.2157215", "abstract": "In this paper, we explore the use of sequences of small code writing questions (\"concept questions\") designed to incrementally evaluate single programming concepts. We report on a study of student performance on a CS1 final examination that included a traditional code-writing question and four intentionally corresponding concept questions. We find that the concept questions are significant predictors of performance on both the corresponding code-writing question and the final exam as a whole. We argue that concept questions provide more accurate formative feedback and simplify marking by reducing the number of variants that must be considered. An analysis of responses categorized by the students' previous programming experience suggests that inexperienced students have the most to gain from the use of concept questions.", "authors": [{"name": "Daniel Zingaro", "affiliation": "University of Toronto, Toronto, ON, Canada"}, {"name": "Andrew Petersen", "affiliation": "University of Toronto Mississauga, Toronto, ON, Canada"}, {"name": "Michelle Craig", "affiliation": "University of Toronto, Toronto, ON, Canada"}], "tags": ["CS1", "exams", "novice programming"]}, {"title": "Using reflective blogs for pedagogical feedback in CS1", "link": "https://dl.acm.org/doi/10.1145/2157136.2157216", "abstract": "The use of weekly, reflective student blogs can be one method for collecting ongoing feedback about a CS1 course. Reflective blogs permit a continuous feedback loop that can be used for both formative and summative assessment of pedagogical innovations. This paper reports on a two-year qualitative study involving the use of reflective blogging in six sections of two CS1-style courses. Reflective blogs were used as a low stakes, non-intimidating vehicle whereby concerns, requests, and other course-related issues could be voiced by students. The resultant blog posts were used as an assessment and feedback mechanism for a parallel pedagogical transformation of the participating courses. This study demonstrates that reflective student blogs in CS1 can be a useful tool for instructional planning. However, faculty must be careful to avoid reactionary changes which move the course away from predefined learning outcomes.", "authors": [{"name": "Jeffrey A. Stone", "affiliation": "Pennsylvania State University, Schuylkill Haven, PA, USA"}], "tags": ["CS1", "palms", "reflection", "writing"]}, {"title": "Session details: Paper: team work", "link": "https://dl.acm.org/doi/10.1145/3248117", "abstract": "No abstract available.", "authors": [{"name": "Jody Paul", "affiliation": "Metropolitan State College of Denver"}], "tags": []}, {"title": "Participation patterns in student teams", "link": "https://dl.acm.org/doi/10.1145/2157136.2157218", "abstract": "We describe a process that we applied for teaching teamwork in a Software Engineering module. Our objective with this process was to create opportunities for our students to experience some of the problems of working in a group before they formed teams in which they had to work for the rest of the year. The process entails expecting students to work on well defined assignments for short periods in teams where risk factors were induced. Through experiencing these short bursts of intense team tribulation students are prepared to handle difficult events and situations in their teams.\nWe describe the design and implementation of this process. We report on changes in the levels of participation of the students during the process. We offer our explanation of possible factors that may have caused the observed variations.", "authors": [{"name": "Dina M. Venter", "affiliation": "Olrac-SPS (formerly SPSS South Africa), Johannesburg, South Africa"}, {"name": "Linda Marshall", "affiliation": "University of Pretoria, Pretoria, South Africa"}, {"name": "Vreda Pieterse", "affiliation": "University of Pretoria, Pretoria, South Africa"}, {"name": "Lisa Thompson", "affiliation": "University of Pretoria, Pretoria, South Africa"}], "tags": ["teaching teamwork", "team formation", "soft skills"]}, {"title": "Application of non-programming focused treisman-style workshops in introductory computer science", "link": "https://dl.acm.org/doi/10.1145/2157136.2157219", "abstract": "In the 1960s and 70s, Uri Treisman developed a specific style of workshops to encourage the retention of underrepresented minority students in Calculus courses at the University of California, Berkley. Since that time, workshops based on the Treisman model have been successfully implemented across the United States and have resulted in more underrepresented minority students successfully completing Calculus. Some attempts have been made to translate the Treisman model to Introductory Computer Science, but all previous attempts have been focused on programming skills. However, one of the student assumptions that deter women and underrepresented minorities from attempting a major or minor in Computer Science is that a computer scientist is purely a solitary programmer [11]. In this paper, we discuss a specific two year pilot program of non-programming focused Treisman-style workshops in conjunction with a Introductory Computer Science course.", "authors": [{"name": "Angela C. Johnson", "affiliation": "St. Mary's College of Maryland, St. Mary's City, MD, USA"}, {"name": "Lindsay H. Jamieson", "affiliation": "St. Mary's College of Maryland, St. Mary's City, MD, USA"}, {"name": "Alan C. Jamieson", "affiliation": "St. Mary's College of Maryland, St. Mary's City, MD, USA"}], "tags": ["CS1", "treisman-style workshops", "diversity"]}, {"title": "Collaboration across the curriculum: a disciplined approach todeveloping team skills", "link": "https://dl.acm.org/doi/10.1145/2157136.2157220", "abstract": "Improving communication and collaborative skills of computer science students has been a priority in the community for some time. We present our philosophy, collaboration across the curriculum, which moves beyond existing individual courses or course units to teach collaboration skills in a pervasive manner. In our approach, concepts are introduced and skills are developed throughout the computer science curriculum---from CS1 to a capstone experience. Students are provided with opportunities to exercise skills in reflective environments that eventually mirror real-world experiences, and technical course content is not compromised.\nWe argue for this system and provide details about how collaboration across the curriculum is accomplished at a small liberal arts college.", "authors": [{"name": "Matthew Lang", "affiliation": "Moravian College, Bethlehem, PA, USA"}, {"name": "Ben Coleman", "affiliation": "Moravian College, Bethlehem, PA, USA"}], "tags": ["collaboration", "teamwork", "communication", "curriculum"]}, {"title": "Session details: Paper: summer experiences", "link": "https://dl.acm.org/doi/10.1145/3248118", "abstract": "No abstract available.", "authors": [{"name": "Kinnis Gosha", "affiliation": "Morehouse College"}], "tags": []}, {"title": "App inventor for android: report from a summer camp", "link": "https://dl.acm.org/doi/10.1145/2157136.2157222", "abstract": "Google's App Inventor for Android (AIA) is the newest visual \"blocks\" programming language designed to introduce students to programming through creation of mobile applications (apps). AIA opens up the world of mobile apps to novice programmers. Success stories of using AIA to introduce college students to programming exist. We used AIA in computing summer camps for high school students that we offer at our university. This paper is an experience report about using AIA in our camps. We provide a detailed description of designing our camps with AIA including the process of selecting and setting-up an Android device and instructional materials that we developed and made available to everyone. We evaluated our camps through surveys to determine the effects on the students. We found that there was mostly a slight increase in the favorable disposition towards computing. We also share our successes with using AIA and what still needs improvement for wider use.", "authors": [{"name": "Krishnendu Roy", "affiliation": "Valdosta State University, Valdosta, GA, USA"}], "tags": ["summer camp", "app inventor", "outreach", "android"]}, {"title": "Effective and sustainable computing summer camps", "link": "https://dl.acm.org/doi/10.1145/2157136.2157223", "abstract": "universities. But, it is not enough to offer computing summer camps and hope that students like them. The camps should be effective by some measure, such as broadening participation by underrepresented groups and/or increasing learning. Summer camps should also be financially sustainable, so that institutions can continue to offer them regularly. The summer camps at Georgia Tech have become effective and financially sustainable. This paper presents the rationale for our camps, the evaluation results that demonstrate positive attitude changes and increases in learning, and the business model that makes them financially sustainable. It also reports on the evaluation results from seven other colleges and universities in Georgia that offered computing summer camps during the summer of 2011 with assistance from Georgia Tech.", "authors": [{"name": "Tom McKlin", "affiliation": "The Findings Group, Decatur, GA, USA"}, {"name": "Barbara Ericson", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["robots", "outreach", "gender and diversity issues", "Alice", "cell phone programming", "app inventor", "scratch", "picocrickets", "summer camps"]}, {"title": "A summer science experience with computer graphics for secondary students", "link": "https://dl.acm.org/doi/10.1145/2157136.2157224", "abstract": "This paper describes the principles, implementation, and results of a weeklong summer science course for junior high and high school students interested in computer science. To motivate and foster interest and creativity in students, while providing adequate complexity to introduce programming concepts and techniques, we used programming projects in computer graphics as the main learning tool. Included in our discussion are experiences across three course offerings, as well as detailed course assignments.", "authors": [{"name": "Timothy A. Davis", "affiliation": "Clemson University, Clemson, SC, USA"}], "tags": ["image processing", "K-12 education", "problem-based instruction", "techni"]}, {"title": "Session details: Paper: software engineering", "link": "https://dl.acm.org/doi/10.1145/3248109", "abstract": "No abstract available.", "authors": [{"name": "Ariel Ortiz", "affiliation": "Tecnologico de Monterrey, Campus Estado de Mexico"}], "tags": []}, {"title": "Integrating UX with scrum in an undergraduate software development project", "link": "https://dl.acm.org/doi/10.1145/2157136.2157226", "abstract": "We report our experiences using the Scrum agile software development method in an undergraduate user-centered web development project. Our chief contributions are to report on using Scrum in a summer research setting as distinct from academic-year coursework and to consider the integration of Scrum and user experience (UX) development methods in a learning environment. Our experience with combining Scrum and UX was positive: this methodology gave our project a clear structure, kept us motivated, and focused us on developing a usable final product. We discuss our adaptations of Scrum to UX development and to the summer research setting, along with challenges we faced and lessons learned, to inform students and faculty who wish to apply such methods in future projects.", "authors": [{"name": "Janet Davis", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "Radka Slamova", "affiliation": "Grinnell College, Grinnell, IA, USA"}, {"name": "Chase Felker", "affiliation": "Grinnell College, Grinnell, IA, USA"}], "tags": ["scrum", "agile development", "user experience", "undergraduate research", "user-centered design"]}, {"title": "Using WReSTT in SE courses: an empirical study", "link": "https://dl.acm.org/doi/10.1145/2157136.2157227", "abstract": "There continues to be a lack of adequate training for students in software testing techniques and tools at most academic institutions. Several educators and researchers have investigated innovative approaches that integrate testing into programming and software engineering (SE) courses with some success. The main problems are getting other educators to adopt their approaches and ensuring students continue to use the techniques they learned in previous courses. In this paper we present a study that evaluates a non-intrusive approach to integrating software testing techniques and tools in SE courses. The study uses a Web-Based Repository of Software Testing Tools (WReSTT) that contains tutorials on software testing concepts and tools. The results of the study show that (1) students who use WReSTT in the classroom can improve their understanding and use of testing techniques and tools, (2) students find WReSTT a useful learning resource, and (3) the collaborative learning environment motivates students to complete assignments.", "authors": [{"name": "Tariq M. King", "affiliation": "North Dakota State University, Fargo, ND, USA"}, {"name": "Frank Hernandez", "affiliation": "Florida International University, Miami, FL, USA"}, {"name": "Debra Davis", "affiliation": "Florida International University, Miami, FL, USA"}, {"name": "Peter J. Clarke", "affiliation": "Florida International University, Miami, FL, USA"}, {"name": "Jairo Pava", "affiliation": "Florida International University, Miami, FL, USA"}], "tags": ["repository", "unit testing", "software testing", "collaborative learning"]}, {"title": "Understanding the tenets of agile software engineering: lecturing, exploration and critical thinking", "link": "https://dl.acm.org/doi/10.1145/2157136.2157228", "abstract": "The use of agile principles and practices in software development is becoming a powerful force in today's workplace. In our quest to develop better products, therefore, it is imperative that we strive to learn and understand the application of agile methods, principles and techniques to the software development enterprise. Unfortunately, in many educational institutions, courses and projects that emphasize agile software development are minimal. At best, students have only limited exposure to the agile philosophy, principles and practices at the graduate and undergraduate levels of education. In an effort to address this concern, we offered an advanced graduate-level course entitled \"Agile Software Engineering\" in the Department of Computer Science at Virginia Tech. The primary objectives of the course were to introduce the values, principles and practices underlying the agile philosophy, and to do so in an atmosphere that encour-ages debate and critical thinking. The course was designed around three central components: (1) teaching the essentials of how one develops a product within an agile framework, (2) having invited talks by notable industry experts, and (3) having students present and discuss current agile research topics and issues. This paper describes our experiences during the offering of that course, and in particular, the unique perspectives of the class instructor, the teaching assistant and a student who was enrolled in the course.", "authors": [{"name": "Shvetha Soundararajan", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Amine Chigani", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "James D. Arthur", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["pedagogy", "exploring agile tenets", "agile applicability", "agile software development", "agile instruction and education", "software engineering education"]}, {"title": "CS principles: piloting a national course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157230", "abstract": "No abstract available.", "authors": [{"name": "Dwight Barnette", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Owen Astrachan", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Rebecca Dovi", "affiliation": "Patrick Henry High School, Ashland, VA, USA"}, {"name": "Jeff Gray", "affiliation": "University of Alabama, Tuscaloosa, AL, USA"}, {"name": "Ralph Morelli", "affiliation": "Trinity College, Hartford, CT, USA"}, {"name": "Bill Cowles", "affiliation": "Booker T. Washington High School, Tuskegee, AL, USA"}, {"name": "Chinma Uche", "affiliation": "Greater Hartford Academy of Math and Science, Hartford, CT, USA"}], "tags": ["computer science principles"]}, {"title": "Fun, phone, and the future: Microsoft XNA game studio, Windows phone, and Kinect SDK", "link": "https://dl.acm.org/doi/10.1145/2157136.2157232", "abstract": "Microsoft XNA Game Studio and C# provide the basis of an advanced high school or introductory post-secondary game development computer science course. Game development is serious computer science. The curriculum tools enable students to create games, simulations, and applications for the PC, Xbox 360, Windows Phone, and Kinect that expand students' skills in complex logic, object oriented programming (OOP), advanced algorithms, and data structures.", "authors": [{"name": "Pat Yongpradit", "affiliation": "Springbrook High School, Silver Spring, MD, USA"}], "tags": ["windows phone", "Kinect", "XNA game studio", "game development", "curriculum", "C#", "mobile development", "XNA", "game programming"]}, {"title": "Session details: Special Session", "link": "https://dl.acm.org/doi/10.1145/3248119", "abstract": "No abstract available.", "authors": [{"name": "Michael Kölling", "affiliation": "University of Kent"}], "tags": []}, {"title": "Building an open, large-scale research data repository of initial programming student behaviour", "link": "https://dl.acm.org/doi/10.1145/2157136.2157234", "abstract": "Many initiatives in improving learning of programming are based on gut instinct or localised experience. Gathering data as a basis for interventions, especially on a large scale, is hard. The BlueJ environment is being instrumented to collect data useful to a variety of educational programming researchers. BlueJ is ideally placed to collect such data: Users number in the millions, situated all over the world. This volume and diversity is unique in the history of such investigations and presents a significant opportunity for researchers. The data will be open to interested research groups, which will enable a wide variety of investigations that were previously impractical. This session presents work to date and solicits input from researchers about the design of the data collection.", "authors": [{"name": "Ian Utting", "affiliation": "University of Kent, Canterbury, United Kingdom"}, {"name": "Michael Kölling", "affiliation": "University of Kent, Canterbury, United Kingdom"}], "tags": ["initial programming", "data collection", "CS1", "BlueJ", "student behaviour"]}, {"title": "Session details: Paper: collaborative learning", "link": "https://dl.acm.org/doi/10.1145/3248112", "abstract": "No abstract available.", "authors": [{"name": "Adrian German", "affiliation": "Indiana University School of Informatics and Computing"}], "tags": []}, {"title": "Assigning student programming pairs based on their mental model consistency: an initial investigation", "link": "https://dl.acm.org/doi/10.1145/2157136.2157236", "abstract": "Pair Programming has been shown to be beneficial to student learning. Much research has been conducted to effectively create student pairs when using pair programming in introductory computer science courses. This paper reports results of research investigating the effectiveness of pairing students based on their mental model consistency. Prior research has found a strong correlation between mental model consistency and performance in introductory computer programming courses. Evaluating students' mental models helps to provide insights into how students approach problem solving and may indicate how to effectively pair students to improve their programming ability and learning. The results from an empirical study conducted to investigate these effects indicate that mental model consistency is a predictor of student success in an introductory programming course. Future goals of this research are to fully evaluate all possible pairing arrangements and to produce tests that can be used to evaluate mental model consistency for other computer science concepts.", "authors": [{"name": "Alex Radermacher", "affiliation": "North Dakota State University, Fargo, ND, USA"}, {"name": "Richard Rummelt", "affiliation": "North Dakota State University, Fargo, ND, USA"}, {"name": "Gursimran Walia", "affiliation": "North Dakota State University, Fargo, ND, USA"}], "tags": ["pair programming", "empirical study", "computer programming", "mental model", "mental model consistency"]}, {"title": "Group whiteboards and modeler/customer teams: getting closer to industrial-style collaboration in a classroom", "link": "https://dl.acm.org/doi/10.1145/2157136.2157237", "abstract": "This paper reports on two simple innovations that helped create a more authentic and engaging modeling experience in an undergraduate Analysis and Design course: (a) having each team of students act both as modelers for another team, and as customers for another team, and (b) providing each team with their own whiteboard. The results from their use throughout the course, and for a single use of the whiteboards in a Computing Technology and Public Policy course, were quite positive. They resulted in a qualitatively different experience noticeable both to the instructors and the students. While some students were initially reluctant to use the whiteboards, by the end of the course most students were enthusiastic about their use.", "authors": [{"name": "David Socha", "affiliation": "University of Washington Bothell, Bothell, WA, USA"}], "tags": ["collaboration", "teaching", "whiteboards", "teams", "design", "groupwork", "diagramming", "analysis", "customers", "software"]}, {"title": "Is there service in computing service learning?", "link": "https://dl.acm.org/doi/10.1145/2157136.2157238", "abstract": "A variety of researchers have advocated for service learning projects in post-secondary computing programs. While these projects can achieve important disciplinary outcomes for the students, what has been under examined is the benefit that these projects have for the service recipients and their community. This paper argues that since service learning projects are meant to benefit both student donors and community recipients, we must examine much more carefully how computing service projects interact with all the social actors affected by the projects. Taking such an approach will require recognizing that ICT by itself will not improve or increase democracy, equality, social inclusion, or any other social good. Analogous to the experience of foreign aid recipients in the developing world, some service learning projects may actually do more harm than good. The paper concludes by providing some sample computer learning projects that are oriented more strongly towards achieving true service for the recipients.", "authors": [{"name": "Randy W. Connolly", "affiliation": "Mount Royal University, Calgary, AB, Canada"}], "tags": ["CS education", "pedagogy.", "social issues", "service learning"]}, {"title": "Session details: Paper: curriculum issues", "link": "https://dl.acm.org/doi/10.1145/3248113", "abstract": "No abstract available.", "authors": [{"name": "Colleen Lewis", "affiliation": "University of California, Berkeley"}], "tags": []}, {"title": "Computer science in NZ high schools: the first year of the new standards", "link": "https://dl.acm.org/doi/10.1145/2157136.2157240", "abstract": "Computer science became available as a nationally assessed topic in NZ schools for the first time in 2011. We review the introduction of computer science as a formal topic, including the level of adoption, issues that have arisen in the process of introducing it, and work that has been undertaken to address those issues.", "authors": [{"name": "Peter Andreae", "affiliation": "Victoria University of Wellington, Wellington, New Zealand"}, {"name": "Anthony Robins", "affiliation": "University of Otago , Dunedin, New Zealand"}, {"name": "Tim Bell", "affiliation": "University of Canterbury, Christchurch, New Zealand"}], "tags": ["teachers", "computer science education", "high school", "curriculum"]}, {"title": "Web science: expanding the notion of computer science", "link": "https://dl.acm.org/doi/10.1145/2157136.2157241", "abstract": "This paper discusses the role and place of Web Science in the computing disciplines. It provides an account of work which has been established towards defining an initial curriculum for Web Science. It presents and analyses plans for future curriculum developments utilizing novel methods to support and elaborate curriculum definition and review. The findings of a desk survey of Web Science education are presented. The paper then recommends future activities which may help determine whether we should expand the notion of computer science.", "authors": [{"name": "Su White", "affiliation": "University of Southampton, Southampton, United Kingdom"}, {"name": "Michalis Vafopoulos", "affiliation": "Aristotle University of Thessaloniki, Thessaloniki, Greece"}], "tags": ["co-evolution", "computing curriculum", "web science curriculum", "negotiated curriculum", "educational repository", "inter-disciplinarity", "co-creation", "web science education"]}, {"title": "Educating the educator through computation: what GIS can do for computer science", "link": "https://dl.acm.org/doi/10.1145/2157136.2157242", "abstract": "We designed a system where non-computational faculty members (along with undergraduates) enroll in an introductory, multidisciplinary, open source Geographic Information System (GIS) course to experience integrative learning as students. The faculty participants are subsequently required to integrate their newly acquired expertise with their own disciplinary teaching and research; the necessary time commitment is compensated by a three-credit teaching load reallocation. Our hypothesis is that increasing the general faculty's appreciation of computation (in the context of integrative learning) is an indirect yet effective and scalable way to reach a wider group of students to convey our fundamental disciplinary message: computing is more than programming and computing empowers people.", "authors": [{"name": "John Barr", "affiliation": "Ithaca College, Ithaca, NY, USA"}, {"name": "Ali Erkan", "affiliation": "Ithaca College, Ithaca, NY, USA"}], "tags": ["experience report", "computational thinking", "integrative learning", "spatial data processing", "education", "gis"]}, {"title": "Session details: Paper: active learning I", "link": "https://dl.acm.org/doi/10.1145/3248114", "abstract": "No abstract available.", "authors": [{"name": "Robert England", "affiliation": "Transylvania University"}], "tags": []}, {"title": "An experience report: on the use of multimedia pre-instruction and just-in-time teaching in a CS1 course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157244", "abstract": "We describe an experience using online multimedia instruction and just-in-time teaching in an introductory programming course. Survey data has shown that students are strongly in favour of the approach. A series of screencasts was developed to replace the traditional lecture component of the course. Students were asked to review a small number of screencasts before each class and were assessed on their comprehension at the start of class using a series of \"clicker\" questions. A just-in-time mini-lecture was provided in response to the initial assessment, on an as-needed basis. The remaining class time was devoted to small-group exercises.", "authors": [{"name": "Paul Carter", "affiliation": "University of British Columbia, Vancouver, BC, Canada"}], "tags": ["pedagogy", "CS1", "screencasts", "peer instruction", "JITT", "multimedia instruction"]}, {"title": "Using JITT in a database course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157245", "abstract": "This paper describes our experience using the Just-in-Time Teaching (JiTT) technique in an undergraduate database course for computer science majors during two semesters. JiTT was implemented by giving the students reading assignments and asking them to complete web-based reading tests the day before class, so that the teacher could detect weaknesses in students' understanding of the material and adjust the lesson plan just in time for the next day class. Based on surveys as well as on exams and course grades, we found a significant improvement on the students' interest in the course and learning of the material.", "authors": [{"name": "Alexandra Martinez", "affiliation": "Universidad de Costa Rica, San José, Costa Rica"}], "tags": ["database", "experience report", "classroom management", "active learning", "just in time teaching", "web-based techniques", "instructional technologies"]}, {"title": "Process oriented guided inquiry learning (POGIL) for computer science", "link": "https://dl.acm.org/doi/10.1145/2157136.2157246", "abstract": "This paper describes an ongoing project to develop activities for computer science (CS) using process oriented guided inquiry learning (POGIL). First, it reviews relevant background on effective learning and POGIL, compares POGIL to other forms of active learning, and describes the potential of POGIL for CS. Second, it describes a sample POGIL activity, including the structure and contents, student and facilitator actions during the activity, and how activities are designed. Third, it summarizes current progress and plans for a NSF TUES project to development POGIL materials for CS. Finally, it discusses student feedback and future directions.", "authors": [{"name": "Clifton Kussmaul", "affiliation": "Muhlenberg College, Allentown, PA, USA"}], "tags": ["experience report", "teams", "algorithms", "data structures", "inquiry learning", "communication", "active learning", "software engineering", "POGIL"]}, {"title": "Session details: Paper: communication skills", "link": "https://dl.acm.org/doi/10.1145/3248115", "abstract": "No abstract available.", "authors": [{"name": "James Early", "affiliation": "SUNY Oswego"}], "tags": []}, {"title": "Integrating communication skills into the computer science curriculum", "link": "https://dl.acm.org/doi/10.1145/2157136.2157248", "abstract": "Computer Science majors must be able to communicate effectively. Industry surveys identify the development of communication and critical thinking skills as key to the reform of the higher education sector. However, academics are challenged by time and discipline content pressures, as well as a lack of familiarity with the teaching and assessment of communication skills content. There is considerable existing work in the area of communication skills development, positioned both in terms of curriculum guidelines for effective communication skills development, and example communication skills activities. However, this research is deficient in detailed, contextualised methodologies and frameworks for the development of communication skills within the Computer Science curriculum. We present a new methodology, building upon well established theoretical frameworks, designed to assist academics in the development of communication skills activities integrated with discipline content across the curriculum. We illustrate this methodology in the design of a CS1/CS2 communication skills course.", "authors": [{"name": "Nickolas J.G. Falkner", "affiliation": "University of Adelaide, Adelaide, Australia"}, {"name": "Katrina Falkner", "affiliation": "University of Adelaide, Adelaide, Australia"}], "tags": ["curriculum design", "CS1/CS2", "communication skills"]}, {"title": "'Explain in plain English' questions: implications for teaching", "link": "https://dl.acm.org/doi/10.1145/2157136.2157249", "abstract": "This paper reports on the replication of a study of novice programmers, looking for relationships between ability to 'explain in plain English' the meaning of a code segment and success in writing code later in the semester. This study explores the question in a different learning environment and qualitatively evaluates 'explain in plain English' responses to identify implications for teaching. Statistical results from this study are similar to those of the earlier work. Results highlight students' fragile knowledge, particularly for students excluded from the primary analyses by a set of screening questions, and suggest the need for assessment and instruction of basic concepts later into the term than instructors are likely to expect.", "authors": [{"name": "Sue Fitzgerald", "affiliation": "Metropolitan State University, St. Paul, MN, USA"}, {"name": "Laurie Murphy", "affiliation": "Pacific Lutheran University, Tacoma, WA, USA"}, {"name": "Renée McCauley", "affiliation": "College of Charleston, Charleston, SC, USA"}], "tags": ["mixed methods", "computer science education research", "qualitative research methods", "explain in plain English"]}, {"title": "The impact of question generation activities on performance", "link": "https://dl.acm.org/doi/10.1145/2157136.2157250", "abstract": "Recent interest in student-centric pedagogies have resulted in the development of numerous tools that support student generated questions. Previous evaluations of such tools have reported strong correlations between student participation and exam performance, yet the level of student engagement with other learning activities in the course is a potential confounding factor. We show such correlations may be explained by other factors, and we undertake a deeper analysis that reveals evidence of the positive impact question-generation activities have on student performance.", "authors": [{"name": "Robert Sheehan", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Andrew Luxton-Reilly", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Beryl Plimmer", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Daniel Bertinshaw", "affiliation": "The University of Auckland, Auckland, New Zealand"}, {"name": "Paul Denny", "affiliation": "The University of Auckland, Auckland, New Zealand"}], "tags": ["question posing", "contributing student pedagogy", "studysieve", "free-response", "user generated content", "question generation", "student generated", "constructive evaluation"]}, {"title": "Understanding NSF funding opportunities", "link": "https://dl.acm.org/doi/10.1145/2157136.2157252", "abstract": "This session highlights programs in the National Science Foundation's Division of Undergraduate Education, Office of Cyberinfrastructure and Directorate of Computer and Information Science and Engineering. The focus is on providing descriptions of several programs of interest to college faculty and discussing the requirements and guidelines for programs in these areas. It includes a description of the proposal and review processes as well as strategies for writing competitive proposals. Participants are encouraged to discuss procedural issues with the presenters.", "authors": [{"name": "Suzanne Westbrook", "affiliation": "National Science Foundation, Arlington, VA, USA"}, {"name": "Mimi McClure", "affiliation": "National Science Foundation, Arlington, VA, USA"}, {"name": "Harriet Taylor", "affiliation": "National Science Foundation, Arlington, VA, USA"}, {"name": "Jeff Forbes", "affiliation": "National Science Foundation, Arlington, VA, USA"}, {"name": "Victor Piotrowski", "affiliation": "National Science Foundation, Arlington, VA, USA"}], "tags": ["proposals", "national science foundation", "grants", "awards", "education"]}, {"title": "Session details: Teaching outside the text", "link": "https://dl.acm.org/doi/10.1145/3248120", "abstract": "No abstract available.", "authors": [{"name": "Lester Wainwright", "affiliation": "Charlottesville High School"}], "tags": []}, {"title": "Teaching outside the text", "link": "https://dl.acm.org/doi/10.1145/2157136.2157254", "abstract": "We know that students bring diverse experiences and an assortment of learning styles into our classrooms. We greet them and hand out a syllabus listing the required textbook(s). One size does not fit all when it comes to textbooks. In this session, participants will discover teaching activities that can be used to supplement any computer science textbook. These activities include human modeling and role playing, interactive whiteboard activities, case studies, class projects, games, and more. By exploring \"extra\" activities not found in most textbooks, participants will learn how these hands-on, interesting and fun activities can help students understand the topics listed in the AP Computer Science A Course Description: Object-oriented Program Design, Program Implementation, Program Analysis, Standard Data Structures, Standard Algorithms, and Computing in Context. Student attention spans seem to be getting shorter. The panelists found themselves spending more and more time searching for and/or developing supplemental resources in efforts to reach and retain students. Members of the AP Computer Science-A Development Committee will share these resources and lead a discussion of proven strategies and lesson ideas for teaching outside the textbook.", "authors": [{"name": "Renee Ciezki", "affiliation": "Estrella Mountain Community College, Avondale, AZ, USA"}, {"name": "Lester Wainwright", "affiliation": "Charlottesville High School, Charlottesville, VA, USA"}, {"name": "Barbara Ericson", "affiliation": "Georigia Institute of Technology, Atlanta, GA, USA"}, {"name": "Robert Glen Martin", "affiliation": "School for the Talented and Gifted, Dallas, TX, USA"}], "tags": ["pedagogy", "curriculuar resources"]}, {"title": "Computer engineering review task force report", "link": "https://dl.acm.org/doi/10.1145/2157136.2157256", "abstract": "In early 2011, the ACM and the IEEE Computer Society (IEEE/CS) created the CE2004 Review Task Force (RTF) and charged it with the task of reviewing and determining the extent to which the document \"Curriculum Guidelines for Undergraduate Degree Programs in Computer Engineering,\" produced 2004 December 12 and known as CE2004 [1] required revisions. The RTF submitted a report to both societies in July of 2011. The report summarized a survey of academic and industry constituents conducted by the RTF. It recommended keeping the structure and the vast majority of the content of the original CE2004 document. However, it also recommended that contemporary topics should be strengthened or added while de-emphasizing other topics that appeared to be waning from the curricular mainstream of computer engineering. Additionally, the RTF recommended that the two societies form a joint special-purpose committee to update and edit the earlier document and to seek input and review from the computer engineering industrial and academic communities through presentations and workshops co-located at major conferences. The presenters of this special session were members of the 2011 RTF and two presenters were members of the original curricular task force from 2004. The presentation will provide insights in the RTF findings and thoughts on how a future computer engineering report might evolve.", "authors": [{"name": "John Impagliazzo", "affiliation": "Hofstra University, Hempstead, NY, USA"}, {"name": "Mitch Thornton", "affiliation": "Southern Methodist University, Dallas, TX, USA"}, {"name": "Andrew McGettrick", "affiliation": "University of Strathclyde, Glasgow, Scotland Uk"}, {"name": "Susan Conry", "affiliation": "Clarkson Universiy, Potsdam, NY, USA"}, {"name": "Timothy Wilson", "affiliation": "Embry-Riddle Aeronautical University, Daytona Beach, FL, USA"}, {"name": "Eric Durant", "affiliation": "Milwaukee School of Engineering, Milwaukee, WI, USA"}], "tags": ["curricular report", "ACM", "IEEE computer society", "education", "computer engineering"]}, {"title": "Session details: Paper: projects", "link": "https://dl.acm.org/doi/10.1145/3248122", "abstract": "No abstract available.", "authors": [{"name": "Jeff Gray", "affiliation": "University of Alabma"}], "tags": []}, {"title": "Social sensitivity and classroom team projects: an empirical investigation", "link": "https://dl.acm.org/doi/10.1145/2157136.2157258", "abstract": "Team work is the norm in major development projects and industry is continually striving to improve team effectiveness. Researchers have established that teams with high levels of social sensitivity tend to perform well when completing a variety of specific collaborative tasks. Social sensitivity is the personal ability to perceive, understand, and respect the feelings and viewpoints of others, and it is reliably measurable. However, the tasks in recent research have been primarily short term, requiring only hours to finish, whereas major project teams work together for longer durations and on complex tasks. Our claim is that, social sensitivity can be a key component in predicting the performance of teams that carry out major projects. Our goal is to determine if previous research, which was not focused on students or professionals in scientific or technical fields, is germane for people in computing disciplines. This paper reports the results from an empirical study that investigates whether social sensitivity is correlated with the performance of student teams on large semester-long projects. The overall result supports our claim that the team social sensitivity is highly correlated with successful team performance. It suggests, therefore, that educators in computer-related disciplines, as well as computer professionals in the workforce, should take the concept of social sensitivity seriously as an aid or obstacle to productivity.", "authors": [{"name": "Travis E. Nygard", "affiliation": "Ripon College, Ripon, WI, USA"}, {"name": "Gursimran Walia", "affiliation": "North Dakota State University, Fargo, ND, USA"}, {"name": "Krishna Kambhampaty", "affiliation": "North Dakota State University, Fargo, ND, USA"}, {"name": "Lisa Bender", "affiliation": "North Dakota State University, Fargo, ND, USA"}, {"name": "Kendall E. Nygard", "affiliation": "North Dakota State University, Fargo, ND, USA"}], "tags": ["social sensitivity", "empirical study", "collaboration", "teams", "computer science"]}, {"title": "Taming complexity in large-scale system projects", "link": "https://dl.acm.org/doi/10.1145/2157136.2157259", "abstract": "Engaging students in large system development projects is an important educational objective, since it exposes design and programming challenges that come to play only with scale. Alas, large scale system projects can be monstrously complex - to the extent of being infeasible in academic settings. We describe a set of principles and a framework that enable students to develop large-scale systems, e.g. a complete hardware platform or a compiler, in several semester weeks.", "authors": [{"name": "Shimon Schocken", "affiliation": "IDC Herzliya, Herzliya, Israel"}], "tags": ["compilers/programming languages & paradigms", "experience report", "abstraction", "software development", "modularity", "hardware simulation", "active learning", "software engineering", "architecture/hardware", "tools"]}, {"title": "An approach for evaluating FOSS projects for student participation", "link": "https://dl.acm.org/doi/10.1145/2157136.2157260", "abstract": "Free and Open Source Software (FOSS) offers a transparent development environment and community in which to involve students. Students can learn much about software development and professionalism by contributing to an on-going project. However, the number of FOSS projects is very large and there is a wide range of size, complexity, domains, and communities, making selection of an ideal project for students difficult. This paper addresses the need for guidance when selecting a FOSS project for student involvement by presenting an approach for FOSS project selection based on clearly identified criteria. The approach is based on several years of experience involving students in FOSS projects.", "authors": [{"name": "Gregory W. Hislop", "affiliation": "Drexel University, Philadelphia, PA, USA"}, {"name": "Michelle Purcell", "affiliation": "Drexel University, Philadelphia, PA, USA"}, {"name": "Heidi J.C. Ellis", "affiliation": "Western New England University, Springfield, MA, USA"}], "tags": ["computing education", "student projects", "free and open source software"]}, {"title": "Session details: Paper: alice and scratch", "link": "https://dl.acm.org/doi/10.1145/3248123", "abstract": "No abstract available.", "authors": [{"name": "Kelly Powers", "affiliation": "Advanced Math & Science Academy Charter School"}], "tags": []}, {"title": "Integrating computing into middle school disciplines through projects", "link": "https://dl.acm.org/doi/10.1145/2157136.2157262", "abstract": "For four years we have been integrating computing into a variety of middle school disciplines via the Alice programing language. Early on we focused on creating curriculum materials for teachers to use in teaching the basic programming and animation concepts. This paper describes our efforts over the past two years in creating model projects for students to build in all disciplines, and our most recent focus on science and mathematics projects. For science we have introduced experiments in Alice and the tools needed for them. In mathematics we have created projects to increase their understanding of programming and to use the projects to increase their understanding of mathematics. We also discuss our efforts in workshops to teach K-12 teachers Alice and an analysis of the teachers' lesson plans and worlds developed in the most recent workshop.", "authors": [{"name": "Jenna Hayes", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Chitra Gadwal", "affiliation": "UMBC, Baltimore, MD, USA"}, {"name": "Peggy Li", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Liz Liang", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Francine Wolfe", "affiliation": "Benedictine College, Atchinson, KS, USA"}, {"name": "Susan Rodger", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Melissa Dalis", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Wenhui Zhang", "affiliation": "Duke University, Durham, NC, USA"}], "tags": ["middle school", "Alice", "K-12 education", "introductory computer science", "virtual worlds"]}, {"title": "Children learning computer science concepts via Alice game-programming", "link": "https://dl.acm.org/doi/10.1145/2157136.2157263", "abstract": "Programming environments that incorporate drag-and-drop methods and many pre-defined objects and operations are being widely used in K-12 settings. But can middle school students learn complex computer science concepts by using these programming environments when computer science is not the focus of the course? In this paper, we describe a semester-long game-programming course where 325 middle school students used Alice. We report on our analysis of 231 final games where we measured the frequency of successful execution of programming constructs. Our results show that many games exhibit successful uses of high level computer science concepts such as student-created abstractions, concurrent execution, and event handlers.We discuss the implications of these results for designing effective game programming courses for young students.", "authors": [{"name": "Linda Werner", "affiliation": "University of California, Santa Cruz, CA, USA"}, {"name": "Shannon Campe", "affiliation": "Education, Training, Research Associates, Scotts Valley, CA, USA"}, {"name": "Jill Denner", "affiliation": "Education, Training, Research Associates, Scotts Valley, CA, USA"}], "tags": ["pair programming", "middle school", "Alice", "assessment", "game-programming"]}, {"title": "The writers' workshop for youth programmers: digital storytelling with scratch in middle school classrooms", "link": "https://dl.acm.org/doi/10.1145/2157136.2157264", "abstract": "This study investigates the potential to introduce basic programming concepts to middle school children within the context of a classroom writing-workshop. In this paper we describe how students drafted, revised, and published their own digital stories using the introductory programming language Scratch and in the process learned fundamental CS concepts as well as the wider connection between programming and writing as interrelated processes of composition.", "authors": [{"name": "Quinn Burke", "affiliation": "University of Pennsylvania, Philadelphia, PA, USA"}, {"name": "Yasmin B. Kafai", "affiliation": "University of Pennsylvania, Philadelphia, PA, USA"}], "tags": ["programming", "scratch", "computer science education", "digital storytelling"]}, {"title": "Session details: Paper: active learning II", "link": "https://dl.acm.org/doi/10.1145/3248124", "abstract": "No abstract available.", "authors": [{"name": "Douglas Kranch", "affiliation": "North Central State College"}], "tags": []}, {"title": "A software craftsman's approach to data structures", "link": "https://dl.acm.org/doi/10.1145/2157136.2157266", "abstract": "Data Structures (CS2) courses and course books do not usually put much emphasis in the process of how a data structure is engineered or invented. Instead, algorithms are readily given, and the main focus is in the mathematical complexity analysis of the algorithms. We present an alternative approach on presenting data structures using worked examples, i.e., by explicitly displaying the process that leads to the invention and creation of a data stucture and its algorithms. Our approach is heavily backed up by some of the best programming practices advocated by the Agile and Software Craftsmanship communities. It brings the often mathematically oriented CS2 course closer to modern software engineering and practical problem solving, without a need for compromise in proofs and analysis.", "authors": [{"name": "Thomas Vikberg", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Arto Vihavainen", "affiliation": "University of Helsinki, Helsinki, Finland"}, {"name": "Matti Luukkainen", "affiliation": "University of Helsinki, Helsinki, Finland"}], "tags": ["worked example", "instructional design", "software engineering best practices", "data structures"]}, {"title": "Jutge.org: an educational programming judge", "link": "https://dl.acm.org/doi/10.1145/2157136.2157267", "abstract": "Jutge.org is an open access educational online programming judge where students can try to solve more than 800 problems using 22 programming languages. The verdict of their solutions is computed using exhaustive test sets run under time, memory and security restrictions. By contrast to many popular online judges, Jutge.org is designed for students and instructors: On one hand, the problem repository is mainly aimed to beginners, with a clear organization and gradding. On the other hand, the system is designed as a virtual learning environment where instructors can administer their own courses, manage their roster of students and tutors, add problems, attach documents, create lists of problems, assignments, contests and exams. This paper presents Jutge.org and offers some case studies of courses using it.", "authors": [{"name": "Jordi Petit", "affiliation": "Universitat Politècnica de Catalunya, Catalunya, Spain"}, {"name": "Omer Giménez", "affiliation": "Google Inc, Mountain View, CA, USA"}, {"name": "Salvador Roura", "affiliation": "Universitat Politècnica de Catalunya, Catalunya, Spain"}], "tags": ["CS1/2", "active learning", "experiences", "tools", "instructional technologies"]}, {"title": "Integrating formal verification in an online judge for e-Learning logic circuit design", "link": "https://dl.acm.org/doi/10.1145/2157136.2157268", "abstract": "This paper investigates the use of formal verification techniques to create online judges that can assist in teaching logic circuit design. Formal verification not only contributes to give an exact assessment about correctness, but also saves the instructor the tedious task of designing test cases. The paper explains how formal verification has been integrated in an online judge. It also describes the courseware created for a course on logic circuits and the successful experience of using it in a one-week summer course with students from secondary and high school.", "authors": [{"name": "Javier de San Pedro", "affiliation": "Universitat Politècnica de Catalunya, Barcelona, Spain"}, {"name": "Jordi Cortadella", "affiliation": "Universitat Politècnica de Catalunya, Barcelona, Spain"}, {"name": "Jordi Petit", "affiliation": "Universitat Politècnica de Catalunya, Barcelona, Spain"}, {"name": "Josep Carmona", "affiliation": "Universitat Politècnica de Catalunya, Barcelona, Spain"}], "tags": ["logic circuit design", "online judge", "formal verification", "verilog"]}, {"title": "Session details: Paper: non-majors", "link": "https://dl.acm.org/doi/10.1145/3248125", "abstract": "No abstract available.", "authors": [{"name": "Derek Schuurman", "affiliation": "Redeemer University College"}], "tags": []}, {"title": "Computing for STEM majors: enhancing non CS majors' computing skills", "link": "https://dl.acm.org/doi/10.1145/2157136.2157270", "abstract": "One of the challenges facing the U.S. technological workforce is that as fewer students take computing courses, fewer college graduates are being prepared for computing careers. Besides trying to attract more CS majors, another approach is to (i) design a computing curriculum that appeals to students and faculty from other (non-CS) disciplines, (ii) use special scholarships to attract students to that curriculum, and (iii) sponsor faculty development workshops for non-CS departments. In this paper, we detail this approach, using a new introductory course oriented to science majors, and scholarships funded by the National Science Foundation Scholarships for Science, Technology, Engineering, and Mathematics (NSF S-STEM) program to motivate non-CS majors to take CS courses. We also present several success stories that this approach has produced in its first two years.", "authors": [{"name": "Randall J. Pruim", "affiliation": "Calvin College, Grand Rapids, MI, USA"}, {"name": "Joel C. Adams", "affiliation": "Calvin College, Grand Rapids, MI, USA"}], "tags": ["NSF", "sciences", "curriculum", "computing", "S-STEM", "scholarships"]}, {"title": "Operations research: broadening computer science in a liberal arts college", "link": "https://dl.acm.org/doi/10.1145/2157136.2157271", "abstract": "Operations research, while not traditionally taught at many small or liberal arts colleges, can be a significant asset to the offerings of a computer science department. Often seen as a discipline at the intersection of mathematics, computer science, business, and engineering, it has great interdisciplinary potential and practical appeal, allowing for recruitment of students who may not consider taking a CS0 or CS1 course. A special topics course in operations research was offered by the computer science department at Southwestern University as an upper-level elective, and it was also cross-listed as a business and mathematics elective. Not only did the course benefit computer science majors who appreciated the applications and different perspectives, but it provided a means for the department to serve a wider population, increased interdisciplinary education, and resulted in a filled-to-capacity upper-level course in computer science for the first time in recent memory. This course is now being considered as a permanent elective that will interest computer science majors and minors as well as draw in students from disciplines across campus. For departments with limited faculty resources for teaching non-major courses, offering an operations research course provides an alternative that simultaneously serves the department and the campus as a whole.", "authors": [{"name": "Barbara M. Anthony", "affiliation": "Southwestern University, Georgetown, TX, USA"}], "tags": ["outreach", "liberal arts", "interdisciplinary", "operations research", "computer science education", "non-majors"]}, {"title": "Beyond competency: a context-driven CSO course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157272", "abstract": "In the process of revising our general education course, which is required of a large fraction of students, we attempted to answer the question \"What should a graduate of a liberal arts university understand about computational technology?\" As computing technology has impacted and created drastic change in nearly all aspects of everyday life, university students may know more about narrow areas of technology but the true impact on their lives cannot be understood without an appreciation for the nature and limitations of the technology. This paper presents a set of assumptions about the impact of technology on individuals and society and describes elements of a computing context designed to enable students to critically evaluate the technology that has such an impact on their lives. Assessment of the approach indicates that students are more aware of the impact of technology and the importance of an understanding of the technology.", "authors": [{"name": "Jeff Cramer", "affiliation": "Taylor University, Upland, IN, USA"}, {"name": "Bill Toll", "affiliation": "Taylor University, Upland, IN, USA"}], "tags": ["computer science education", "liberal arts", "non-majors"]}, {"title": "Nifty assignments", "link": "https://dl.acm.org/doi/10.1145/2157136.2157274", "abstract": "No abstract available.", "authors": [{"name": "Joshua T. Guerin", "affiliation": "University of Kentucky, Lexington, KY, USA"}, {"name": "Keen Debby", "affiliation": "University of Kentucky, Lexington, KY, USA"}, {"name": "Nick Parlante", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Julie Zelenski", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Dave O'Hallaron", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA"}, {"name": "Kevin Wayne", "affiliation": "Princeton University, Princeton, NJ, USA"}, {"name": "Stephen Davies", "affiliation": "University of Mary Washington, Fredericksburg, VA, USA"}, {"name": "Zachary Kurmas", "affiliation": "Grand Valley State University, Allendale, MI, USA"}, {"name": "Daniel Zingaro", "affiliation": "University of Toronoto, Toronto, ON, Canada"}], "tags": ["nifty", "repository", "pedagogy", "library", "examples", "education", "assignments", "homeworks"]}, {"title": "Update on the CS principles project", "link": "https://dl.acm.org/doi/10.1145/2157136.2157276", "abstract": "The CS Principles Project is a collaborative effort to develop a new introductory course in computer science, accessible to all students. Computer Science educators at all levels have worked together on the development of the new curriculum under the direction of the College Board with support from the National Science Foundation. This special session provides an opportunity for the CS Principles project leaders to report on recent updates and new directions, and to engage in discussion on all aspects of the project with SIGCSE participants", "authors": [{"name": "Owen Astrachan", "affiliation": "Duke University, Durham, NC, USA"}, {"name": "Amy Briggs", "affiliation": "Middlebury College, Middlebury, VT, USA"}, {"name": "Chris Stephenson", "affiliation": "Computer Science Teachers Association, New York, NY, USA"}, {"name": "Jan Cuny", "affiliation": "National Science Foundation, Arlington, VA, USA"}, {"name": "Lien Diaz", "affiliation": "College Board, New York, NY, USA"}], "tags": ["CS principles", "computational thinking", "computer science education", "K-12 curriculum"]}, {"title": "Session details: Implementing evidence-based practices makes a difference in female undergraduate enrollments", "link": "https://dl.acm.org/doi/10.1145/3248128", "abstract": "No abstract available.", "authors": [{"name": "Wendy DuBow", "affiliation": "University of Colorado"}], "tags": []}, {"title": "Implementing evidence-based practices makes a difference in female undergraduate enrollments", "link": "https://dl.acm.org/doi/10.1145/2157136.2157278", "abstract": "While many computing departments may be aware there are \"promising\" and \"proven\" practices for recruiting and retaining female students, there seems to be a drive to try new and novel approaches rather than use what is known, or strongly suspected, to be effective. Developing a diverse student body is a long-term multi-faceted process that includes active recruitment, inclusive pedagogy, meaningful curriculum and necessitates student, faculty and institutional support, as well as assessment of progress [1,2,3]. Given all the moving parts and intrinsic challenges of enacting change, departments could make it easier on themselves - and very likely achieve better results - if they intentionally and systematically used practices that have been shown to be effective. This panel will present the rationale for implementing evidence-based practices to increase female enrollments in undergraduate computing departments, and share evidence of successes. Wendy DuBow will examine the concept of evidence-based practices as well as describe briefly the research-based approaches taken by the National Center for Women & Information Technology (NCWIT) to identify the evidence-based practices an academic institution could use and distribute easy-to-use materials explaining such practices. Elizabeth Litzler will supplement this rationale by sharing compelling evaluation data that show that academic departments that implement a variety of evidence-based practices and actively seek to increase their female enrollments actually do see increases. Maureen Biggers will describe her department's recent efforts to increase female undergraduates at Indiana University, which enabled them to double the number of new female majors. Mike Erlinger will discuss Harvey Mudd's recent successes in attracting more Computer Science majors overall, including a large percentage of female students.", "authors": [{"name": "Wendy DuBow", "affiliation": "National Center for Women & IT, Boulder, CO, USA"}, {"name": "Maureen Biggers", "affiliation": "Indiana University, Bloomington, IN, USA"}, {"name": "Mike Erlinger", "affiliation": "Harvey Mudd College, Claremont, CA, USA"}, {"name": "Elizabeth Litzler", "affiliation": "University of Washington, Seattle, WA, USA"}], "tags": ["outreach", "gender and diversity", "new curriculum"]}, {"title": "Session details: Paper: high school collaborations", "link": "https://dl.acm.org/doi/10.1145/3248129", "abstract": "No abstract available.", "authors": [{"name": "Tim Bell", "affiliation": "University of Canterbury"}], "tags": []}, {"title": "Life two years after a game programming course: longitudinal viewpoints on K-12 outreach", "link": "https://dl.acm.org/doi/10.1145/2157136.2157280", "abstract": "In our faculty we have run week-long K-12 game programming courses now for three summers. In this paper we investigate what programming-related activities students do after they take a course, and what factors in the students' background relate to post-course programming. We also investigate a possible change in the students' interest towards higher education science studies. We find that most students continue programming after the course and that their interest towards science studies keeps increasing. In student background we observed some indicative trends, but did not find reliable explaining factors related to post-course programming or increased interest towards science studies.", "authors": [{"name": "Antti-Jussi Lakanen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Ville Isomöttönen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}, {"name": "Vesa Lappalainen", "affiliation": "University of Jyväskylä, Jyväskylä, Finland"}], "tags": ["outreach", "long-term impacts", "recruitment", "K-12", "game programming"]}, {"title": "Reflections on outreach programs in CS classes: learning objectives for \"unplugged\" activities", "link": "https://dl.acm.org/doi/10.1145/2157136.2157281", "abstract": "To provide a unified view of any scientific field, outreach programs need to realistically portray the subject in question. Consequently, topics and methods actually taught in Computer Science courses should to be touched upon in Computer Science outreach programs or, conversely, elements from successful Computer Science outreach programs can be used to enrich established courses in Computer Science. We follow up on the latter aspect and investigate how outreach material might be used as a teaching resource in lower secondary Computer Science. In particular, we extract and classify learning objectives from the activities of the well-received Computer Science Unplugged program. Based upon this classification, we comment on where and to which extent these activities can be used to enrich teaching Computer Science in secondary education.", "authors": [{"name": "Renate Thies", "affiliation": "Cusanus-Gymnasium Erkelenz and Technische Universität Dortmund, Dortmund, Germany"}, {"name": "Jan Vahrenhold", "affiliation": "Technische Universität Dortmund, Dortmund, Germany"}], "tags": ["learning objectives", "outreach programs", "computer science unplugged", "taxonomy"]}, {"title": "Weaving a tapestry: creating a satellite workshop to support HS CS teachers in attracting and engaging students", "link": "https://dl.acm.org/doi/10.1145/2157136.2157282", "abstract": "In this paper, we describe the Tennessee Technological University (TTU) Tapestry Workshop for high school (HS) teachers. The Tapestry Workshop initiative - a collaborative partnership between TTU, the University of Virginia (UVA) and HS teachers - shares strategies, practices, and innovative ideas for teaching Computer Science (CS) effectively. This three-day professional development workshop utilized informational, technical, networking, activity-, and discussion-oriented sessions geared towards attracting and engaging a diverse body of CS students. The workshop was a worthwhile professional development activity for both the organizers and attendees and contributed to the initiation of a local HS CS program.", "authors": [{"name": "Martha J. Kosa", "affiliation": "Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Summer-Mistine Olmstead", "affiliation": "Tennessee Tech University, Cookeville, TN, USA"}, {"name": "Ambareen Siraj", "affiliation": "Tennessee Tech University, Cookeville, TN, USA"}], "tags": ["high school computer science", "cs education community", "K-12 outreach", "AP CS"]}, {"title": "Who AM I?: understanding high school computer science teachers' professional identity", "link": "https://dl.acm.org/doi/10.1145/2157136.2157283", "abstract": "Quality computer science (CS) teachers are critical for secondary computing education. In addition to increasing the number of high school (HS) CS teachers, there is a great need for supporting those teachers to grow and stay as committed, effective teachers. Recent literature on teacher education suggests that teachers' sense of commitment and (other aspects of) teaching profession is tightly linked with their teacher identity. However, the current educational system in the U.S. does not provide typical contexts for teachers to build a sense of identity as CS teachers. This study is intended to gain an initial understanding of CS teachers' perceptions about their own professional identity and potential factors that might contribute to these perceptions. Our findings indicate that current HS teachers teaching CS courses do not necessarily identify themselves as CS teachers. They have different perceptions related to CS teaching. Four kinds of factors can contribute to these perceptions: teachers' educational background and certification, CS curriculum and department hierarchy, availability of CS teacher community, and teachers' perceptions about the field of CS.", "authors": [{"name": "Mark Guzdial", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "Lijun Ni", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["HS CS teacher", "CS teacher identity", "professional development", "community"]}, {"title": "Session details: Paper: parallelism and concurrency", "link": "https://dl.acm.org/doi/10.1145/3248130", "abstract": "No abstract available.", "authors": [{"name": "Jodi Tims", "affiliation": "Baldwin-Wallace College"}], "tags": []}, {"title": "Introducing parallelism and concurrency in the data structures course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157285", "abstract": "We report on our experience integrating a three-week introduction to multithreading in a required data structures course for second-year computer science majors. We emphasize a distinction between parallelism and concurrency that teaches students to use extra processors effectively and enforce mutual exclusion correctly. The material fits naturally in the data structures course by having the same mix of algorithms, programming, and asymptotic analysis as the conventional, single-threaded part of the course. Our department has used this unit for 1.5 years and will do so indefinitely. We report feedback from students, multiple instructors for the course, and students in a later course that uses threads. We developed a full set of course materials that have been adapted for use by instructors in various courses at five other institutions so far.", "authors": [{"name": "Dan Grossman", "affiliation": "University of Washington, Seattle, WA, USA"}, {"name": "Ruth E. Anderson", "affiliation": "University of Washington, Seattle, WA, USA"}], "tags": ["parallelism", "data structures", "undergraduate curriculum", "mutual exclusion", "fork-join", "concurrency"]}, {"title": "Exploring concurrency using the parallel analysis tool", "link": "https://dl.acm.org/doi/10.1145/2157136.2157286", "abstract": "Laboratory work in the CS classroom is intended to solidify essential concepts and core design principles. Because of recent advances and the widespread adoption of multicore technologies, one area of investigation that has become increasingly important across all levels of CS instruction is parallel computing. This paper describes the initial version of the Parallel Analysis Tool (PAT), a pedagogical tool designed to assist undergraduate students in visualizing concurrency and effectively connecting parallel processing to applied coding strategies. The PAT is a complete Java development environment, with an emphasis on (1) helping students to identify appropriate code locations where parallelization can be applied and (2) allowing students to subsequently examine the practical performance tradeoffs of these parallelization decisions in a laboratory setting. The Parallel Quotient (PQ), a fundamental dimensionless metric generated by the PAT, supports the student's conceptual understanding and analysis of the relative benefits of employing various parallel programming strategies.", "authors": [{"name": "Brian W. Rague", "affiliation": "Weber State University, Ogden, UT, USA"}], "tags": ["visual tool", "parallelism", "program analysis", "model", "parallel concepts", "parallel perceptions"]}, {"title": "Virtual clusters for parallel and distributed education", "link": "https://dl.acm.org/doi/10.1145/2157136.2157287", "abstract": "The reality of multicore machines as a standard and the prevalence of distributed cloud computing has signaled a need for parallel and distributed computing to become integrated into the computer science curriculum. At the same time, operating system virtualization has become a common technique with open standard tools available to any practitioners. Virtual machines (VMs) installed on available computer lab resources can be used to simulate high-performance cluster computing environments. This paper describes two such virtual clusters in use at small colleges, demonstrates their effectiveness for parallel computing education, and provides information about how to obtain the VMs for use in an educational lab setting. We have used these clusters to introduce parallelism into several courses in our undergraduate curriculum.", "authors": [{"name": "Malcolm Kane", "affiliation": "Macalester College, St. Paul, MN, USA"}, {"name": "Richard Brown", "affiliation": "St. Olaf College, Northfield, MN, USA"}, {"name": "Eric Biggers", "affiliation": "Macalester College, St. Paul, MN, USA"}, {"name": "Devry Lin", "affiliation": "Macalester College, St. Paul, MN, USA"}, {"name": "Maura Warner", "affiliation": "Macalester College, St. Paul, MN, USA"}, {"name": "Elizabeth Shoop", "affiliation": "Macalester College, Saint Paul, MN, USA"}], "tags": ["parallel and distributed computing education", "virtual machines", "virtual clusters"]}, {"title": "Cross teaching parallelism and ray tracing: a project-based approach to teaching applied parallel computing", "link": "https://dl.acm.org/doi/10.1145/2157136.2157288", "abstract": "Massively parallel Graphics Processing Unit (GPU) hardware has become increasingly powerful, available and affordable. Software tools have also advanced to the point that programmers can write general purpose parallel programs that take advantage of the large number of compute cores available in the hardware. With literally hundreds of compute cores available on a single device, program performance can increase by orders of magnitude. We believe that introducing students to the concepts of parallel programming for massively parallel hardware is of increasing importance in an undergraduate computer science curriculum. Furthermore, we believe that students learn best when given projects that reflect real problems in computer science. This paper describes the experience of integrating two undergraduate computer science courses to enhance student learning in parallel computing concepts. In this cross teaching experience we structured the integration of the courses such that students studying parallel computing worked with students studying advanced rendering for approximately 30% of the quarter long courses. Working in teams on a joint project, both groups of students were able to see the application of parallelization to an existing software project with both the benefits and complications exposed early in the curriculum of both courses. Motivating projects and performance gains are discussed, as well as student survey data on the effectiveness of the learning outcomes. Both performance and survey data indicate a positive gain from the cross teaching experience.", "authors": [{"name": "Chris Lupo", "affiliation": "Cal Poly, San Luis Obispo, CA, USA"}, {"name": "Zoe J. Wood", "affiliation": "Cal Poly, San Luis Obispo, CA, USA"}, {"name": "Christine Victorino", "affiliation": "University of California, Santa Barbara, Santa Barbara, CA, USA"}], "tags": ["graphics", "CUDA", "GPU"]}, {"title": "Session details: Paper: mobile computing", "link": "https://dl.acm.org/doi/10.1145/3248131", "abstract": "No abstract available.", "authors": [{"name": "Cyndi Rader", "affiliation": "Colorado School of Mines"}], "tags": []}, {"title": "Cabana: a cross-platform mobile development system", "link": "https://dl.acm.org/doi/10.1145/2157136.2157290", "abstract": "Mobile application development is a hot topic in computer science education, and debate rages over which platform to develop on and what software to use for development. Cabana is a web-based application designed to enable development on multiple mobile platforms and to make application development easier. It uses an approach to application programming based on a wiring diagram that is supplemented with the ability to program directly using JavaScript. It is an ideal choice for application development in introductory computer science courses and for upper-level courses where the focus is on application design and not application programming. This paper introduces Cabana and describes its use in two different computer science courses.", "authors": [{"name": "Paul E. Dickson", "affiliation": "Hampshire College, Amherst, MA, USA"}], "tags": ["android", "mobile devices", "Cabana", "xcode", "appinventor", "iPhone", "smartphone", "apps"]}, {"title": "Mobile apps for the greater good: a socially relevant approach to software engineering", "link": "https://dl.acm.org/doi/10.1145/2157136.2157291", "abstract": "Socially relevant computing has recently been proposed as a way to reinvigorate interest in computer science. By appealing to students' interest in helping others, socially relevant computing aims to give students life-changing experiential learning not typically achieved in the classroom, while providing software that benefits society at large. For the last two years, the Wake Forest University Computer Science Department has been using mobile device programming, agile methods, and real-world, socially relevant projects for teaching software engineering in a liberal arts Computer Science curricula. We report on the teaching methods, student experiences, and products delivered by this approach. In particular, one of these products, Verbal Victor, is now a commercial and social entrepreneurship success in the field of assistive technology for communication disabilities.", "authors": [{"name": "Victor Paul Pauca", "affiliation": "Wake Forest University, Winston-Salem, NC, USA"}, {"name": "Richard T. Guy", "affiliation": "University of Toronto, Toronto, ON, Canada"}], "tags": ["teaching software engineering", "socially relevant computing", "mobile computing"]}, {"title": "Using mobile phone programming to teach Java and advanced programming to computer scientists", "link": "https://dl.acm.org/doi/10.1145/2157136.2157292", "abstract": "In this work an approach employing the Android mobile phone platform in an upper division computer science course to teach Java programming and other advanced computer science topics is presented. Mobile phones are growing influences in the computing market, but their strengths and popularity are rarely exploited in computer science classrooms. The aim of the course is to harness this enthusiasm to improve fluency in the Java language to afford an opportunity to learn how to work on large, complex projects and to enhance the students' preparedness for the job market. The ideas presented in this work could be adapted for improving learning in many courses across the computing curriculum.", "authors": [{"name": "Derek Riley", "affiliation": "University of Wisconsin- Parkside, Kenosha, WI, USA"}], "tags": ["mobile devices", "Java"]}, {"title": "RoboLIFT: engaging CS2 students with testable, automatically evaluated android applications", "link": "https://dl.acm.org/doi/10.1145/2157136.2157293", "abstract": "Making computer science assignments interesting and relevant is a constant challenge for instructors of introductory courses. Android has become popular in these courses to take advantage of the increasing popularity of smartphones and mobile \"apps.\" This has been shown to increase student engagement but it is only the first step, and we must continue to provide support for teaching methodologies that we have used in the past, such as test-driven development and automated assessment. We have developed RoboLIFT, a library that makes unit testing of Android applications approachable for students. Furthermore, by supporting existing automated grading techniques, we are able to sustain large student enrollments, and we evaluate the effects that using Android has had on student performance.", "authors": [{"name": "Anthony Allevato", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Stephen H. Edwards", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}], "tags": ["android", "GUI", "apps", "test-first coding", "graphical user interfaces", "TDD", "tablet", "smartphone", "mobile development", "JUnit", "test-driven development"]}, {"title": "Session details: Paper: visualization", "link": "https://dl.acm.org/doi/10.1145/3248132", "abstract": "No abstract available.", "authors": [{"name": "Demian Lessa", "affiliation": "State University of New York at Buffalo"}], "tags": []}, {"title": "Highway data and map visualizations for educational use", "link": "https://dl.acm.org/doi/10.1145/2157136.2157295", "abstract": "It is often a challenge to find interesting and appropriate data sets to use as examples to demonstrate graph data structures and algorithms. Goals for the data are often conflicting. The data should include examples small enough to work through in a class example by hand, but some large enough to demonstrate important behaviors of a structure or algorithm. Data should be freely available in a convenient format and should have some real-world relevance. Visualization of the data and results computed from it is helpful.\nThis paper describes a collection of graph data sets generated from the Clinched Highway Mapping Project's highway data and some examples of their use in undergraduate courses on data structures and algorithms. The source data, the process used to convert the data into a more useful format, some examples of its use, and a visualization tool using the Google Maps API, are described.", "authors": [{"name": "James D. Teresco", "affiliation": "Siena College, Loudonville, NY, USA"}], "tags": ["graph data structures", "Google maps API", "pedagogical tools", "algorithm visualization"]}, {"title": "Experiments with algorithm visualization tool development", "link": "https://dl.acm.org/doi/10.1145/2157136.2157296", "abstract": "This paper presents the initial stages of a teaching tool named iSketchmate, intended for instructor use during lecture. iSketchmate allows users to create and manipulate splay trees through an animated GUI. It improves upon existing tools by providing (1) the ability to begin with any user-defined tree, (2) a history mechanism so tree operations can be repeated or changed, and (3) finer-grained animation within each operation so instructors may give further descriptions at intermediate steps within any given operation. Experiments showed iSketchmate users could produce significantly more diagrams and these diagrams were significantly more accurate than those made with pencil and paper.", "authors": [{"name": "Michael C. Orsega", "affiliation": "The University of West Georgia, Carrollton, GA, USA"}, {"name": "Bradley T. Vander Zanden", "affiliation": "The University of Tennessee, Knoxville, TN, USA"}, {"name": "Christopher H. Skinner", "affiliation": "The University of Tennessee, Knoxville, TN, USA"}], "tags": ["iSketchmate"]}, {"title": "CSTutor: a pen-based tutor for data structure visualization", "link": "https://dl.acm.org/doi/10.1145/2157136.2157297", "abstract": "We present CSTutor, a sketch-based interface designed to help students understand data structures. It currently supports Linked Lists, Binary Search Trees, AVL Trees, and Heaps, and creates an environment in which a user's sketched diagram and code are combined seamlessly. In each of the data structure modes, the user can naturally sketch a data structure on the canvas just as they would on the white board. CSTutor analyzes the user's diagrams in real time, and automatically generates code in a separate code view to reflect any changes the user has made. Additionally, the code can also be edited and any new code changes animate the data structure drawn on the canvas. The connection between the data structure drawn on the canvas and the code implementation is intended to bridge the gap between the conceptual diagram of a data structure and the actual implementation. We also present the results of a perceived usefulness survey. The results of the study indicate that the majority of students would find CSTutor helpful for learning data structures.", "authors": [{"name": "Sarah Buchanan", "affiliation": "University of Central Florida, Orlando, FL, USA"}, {"name": "Brandon Ochs", "affiliation": "University of Central Florida, Orlando, FL, USA"}, {"name": "Joseph J. LaViola Jr.", "affiliation": "University of Central Florida, Orlando, FL, USA"}], "tags": ["data structures", "visualization", "animation", "sketch-based input"]}, {"title": "ECvisual: a visualization tool for elliptic curve based ciphers", "link": "https://dl.acm.org/doi/10.1145/2157136.2157298", "abstract": "This paper describes a visualization tool ECvisual that helps students understand and instructors teach elliptic curve based ciphers. This tool permits the user to visualize elliptic curves over the real field and over a finite field of prime order, perform arithmetic operations, do encryption and decryption, and convert plaintext to a point on an elliptic curve. The demo mode of ECvisual can be used for classroom presentation and self-study. With the practice mode, the user may go through steps in finite field computations, encryption, decryption and plaintext conversion. The user may compute the output for each operation check each answer for correctness. This helps students understand the primitive operations and how they are used in an elliptic curve cipher. The opportunity for self-study provides an instructor greater flexibility in selecting a lecture pace for this detail-filled material. Classroom evaluation was positive and very encouraging.", "authors": [{"name": "Jean Mayo", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Ching-Kuang Shene", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Melissa Keranen", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Jun Ma", "affiliation": "Michigan Technological University, Houghton, MI, USA"}, {"name": "Jun Tao", "affiliation": "Michigan Technological University, Houghton, MI, USA"}], "tags": ["visualization", "cryptography"]}, {"title": "Session details: Rediscovering the passion, beauty, joy, and awe: making computing fun again", "link": "https://dl.acm.org/doi/10.1145/3248133", "abstract": "No abstract available.", "authors": [{"name": "Daniel Garcia", "affiliation": "UC Berkeley"}], "tags": []}, {"title": "Rediscovering the passion, beauty, joy, and awe: making computing fun again, part 5", "link": "https://dl.acm.org/doi/10.1145/2157136.2157300", "abstract": "In 2006, computing education was suffering from a crisis - enrollments were dropping sharply at universities and colleges across the United States, and interest in computing from high school and middle school students was waning significantly. At the 2007 SIGCSE Symposium, the ACM Education Board organized a special session to explore the underlying causes. In his keynote at the same conference, Grady Booch exhorted us to share the \"passion, beauty, joy and awe\" (PBJA) of computing. This led to a series of room-packed sessions at the following four SIGCSE symposia to explore that idea from different angles. They have provided a forum for sharing: \"What we've done: Highlighting successful PBJA initiatives the presenters have undertaken or seen and wish to celebrate. \"What we should do (curriculum): Pointing out where our curriculum is lacking in PBJA, and how to fix it. \"How we should do it (pedagogy): Sharing how a change in attitude / focus / etc. can make strides to improving PBJA.\nFortunately, enrollments have been continually rising, and there are colleges where the numbers are so strong (returning to historic highs), that some claim the crisis is over. Some point to \"the Facebook Factor\" as the source of inspiration for many young students, claiming this is a \"Sputnik moment\". Many dispute this, however, citing statistics that indicate under-represented students have not returned, and continuing negative connotations about the field. This PBJA \"movement\" was born out of this enrollment crisis, but is not tied to it. There is always value in sharing novel best practices and advocating techniques that make computing fun.\nIn the past, we tried to gather educators who brought a wide variety of perspectives (e.g., in 2010 we heard from international, domestic, high school, university and industrial representatives). At recent sessions, we've shifted from that \"breadth-first\" model to a \"depth-first\" one. This year we have invited three educators who have worked tirelessly toward broadening participation of computing to underrepresented groups. The hope with this panel is to be able to explore best practices in outreach, in terms of extolling the PBJA of computing.", "authors": [{"name": "Colleen Lewis", "affiliation": "University of California, Berkeley, Berkeley, CA, USA"}, {"name": "Joanna Goode", "affiliation": "University of Oregon, Eugene, OR, USA"}, {"name": "Daniel D. Garcia", "affiliation": "University of California, Berkeley, Berkeley, CA, USA"}, {"name": "Barbara Ericson", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["computer science education", "PBJA"]}, {"title": "Promoting student-centered learning with POGIL", "link": "https://dl.acm.org/doi/10.1145/2157136.2157302", "abstract": "POGIL (Process Oriented Guided Inquiry Learning) is a type of learning based on the principle that students learn more when they construct their own understanding. Rather than teaching by telling, POGIL instructors provide activities that guide students to discover concepts on their own. Students work in groups, encouraging them to discuss their findings with their peers. Not only do students learn the material better, but the very process of discovery teaches them to be better problem solvers. This special session will provide SIGCSE attendees the opportunity to experience a POGIL activity for themselves. The presenters will share guided inquiry activities tested in our classrooms. We will discuss ways that POGIL may be used to transform computer science classes at all levels, from high school to graduate-level classes, from small schools to large universities.", "authors": [{"name": "Helen H. Hu", "affiliation": "Westminster College, Salt Lake City, UT, USA"}, {"name": "Clifton Kussmaul", "affiliation": "Muhlenberg College, Allentown, PA, USA"}], "tags": ["active learning", "POGIL", "teams", "cooperative learning"]}, {"title": "Teaching secure coding: report from summit on education in secure software", "link": "https://dl.acm.org/doi/10.1145/2157136.2157304", "abstract": "Software is critical to life in the 21st century. It drives financial, medical, and government computer systems as well as systems that provide critical infrastructures in areas such as transportation, energy, networking, and telecommunications. As the number and severity of attacks that exploit software vulnerabilities increase, writing reliable, robust, and secure programs will substantially improve the ability of systems and infrastructure to resist such attacks. Education plays a critical role in addressing cybersecurity challenges of the future, such as designing curricula that integrate principles and practices of secure programming into educational programs. To help guide this process, the National Science Foundation Directorates of Computer and Information Science and Engineering (CISE) and Education and Human Resources (EHR) jointly sponsored the Summit on Education in Secure Software (SESS), held in Washington, DC in October, 2010. The goal of this session is to share some of the key findings and challenges identified by the summit and to actively engage the community in the discussions. Each of the speakers participated in the summit and brings a unique viewpoint to the session.", "authors": [{"name": "Diana Burley", "affiliation": "George Washington University, Washington, DC, USA"}, {"name": "Robert Seacord", "affiliation": "Carnegie Mellon University/SEI, Pittsburgh, PA, USA"}, {"name": "Steve Cooper", "affiliation": "Stanford University, Stanford, CA, USA"}, {"name": "Blair Taylor", "affiliation": "Towson University, Towson, MD, USA"}, {"name": "Matt Bishop", "affiliation": "University of California Davis, Davis, CA, USA"}, {"name": "Ron Dodge", "affiliation": "United States Military Academy, West Point, NY, USA"}], "tags": ["secure coding"]}, {"title": "Session details: Paper: attracting majors", "link": "https://dl.acm.org/doi/10.1145/3248136", "abstract": "No abstract available.", "authors": [{"name": "Nanette Veilleux", "affiliation": "Simmons College"}], "tags": []}, {"title": "Starting with Ubicomp: using the senseboard to introduce computing", "link": "https://dl.acm.org/doi/10.1145/2157136.2157306", "abstract": "In this paper, we describe a new undergraduate module for novice students conducted entirely through distance learning: My Digital Life (TU100). The module has been designed to lower the barriers to creating programs that interact with the world; TU100's materials have been designed to excite, encourage, reassure and support learners who explore the novel topic of ubiquitous computing through playful experimentation. It introduces the fundamentals of computing by giving students the capability for programming a device, the SenseBoard, which has built-in input/output and sensors. Programming is done in Sense, an extension of Scratch, which scaffolds programming and reduces the syntax burden. TU100 has taken inspiration from childhood learning and commercial product design to produce compelling, yet academically rigorous study materials.", "authors": [{"name": "Mike Richards", "affiliation": "The Open University, Milton Keynes, United Kingdom"}, {"name": "Marian Petre", "affiliation": "The Open University, Milton Keynes, United Kingdom"}, {"name": "Arosha K. Bandara", "affiliation": "The Open University, Milton Keynes, United Kingdom"}], "tags": ["sense", "programming", "senseboard", "ubiquitous computing", "computer science education", "distance education"]}, {"title": "Improving first-year success and retention through interest-based CS0 courses", "link": "https://dl.acm.org/doi/10.1145/2157136.2157307", "abstract": "Many computer science programs suffer from low student retention rates. At Cal Poly San Luis Obispo, academic performance and retention rates among first-year computer science students are among the lowest on campus.\nIn order to remedy this, we have developed a new CS0 course featuring different \"tracks\" that students can choose from (e.g. robotics, gaming, music, mobile apps). This allows students to learn the basics of programming, teamwork, and college-level study in a domain that is of personal interest. In addition, the course relies on classic Project-based Learning (PBL) approaches as well as a focus on both academic and non-academic factors shown to increase student retention.\nInitial assessment demonstrates positive results in the form of increased academic performance in post CS0 courses and student retention.", "authors": [{"name": "Christopher Clark", "affiliation": "California Polytechnic, San Luis Obispo, CA, USA"}, {"name": "John Clements", "affiliation": "California Polytechnic, San Luis Obispo, CA, USA"}, {"name": "Michael Haungs", "affiliation": "California Polytechnic, San Luis Obispo, CA, USA"}, {"name": "David Janzen", "affiliation": "California Polytechnic, San Luis Obispo, CA, USA"}], "tags": ["cornerstone", "self-efficacy", "CS1", "CS0", "motivation"]}, {"title": "Reshaping the image of computer science in only fifteen minutes (of class) a week", "link": "https://dl.acm.org/doi/10.1145/2157136.2157308", "abstract": "Low undergraduate enrollments in computer science will not meet the future demand of employers. Some reasons for the low enrollments are computer science's nerdy image, lack of understanding of the field, and low motivation for learning programming. We propose to change the image of computer science by exposing students to applications of computing and its impact on their lives through reading and discussing recent news articles in 15 minutes of class. We call this component of our courses the Broader Issues in computer science. In this paper, we present our motivation for the Broader Issues component, how we implemented the component in CS0 and CS1 courses, and our evaluation of the component, including student reactions to and impact of the component.", "authors": [{"name": "Sara Sprenkle", "affiliation": "Washington and Lee University, Lexington, VA, USA"}, {"name": "Shannon Duvall", "affiliation": "Elon University, Elon, NC, USA"}], "tags": ["introductory course", "teaching methods", "computer science education"]}, {"title": "Session details: Paper: OS and distributed computing", "link": "https://dl.acm.org/doi/10.1145/3248137", "abstract": "No abstract available.", "authors": [{"name": "William Mongan", "affiliation": "Drexel University"}], "tags": []}, {"title": "Experiences teaching MapReduce in the cloud", "link": "https://dl.acm.org/doi/10.1145/2157136.2157310", "abstract": "We describe our experiences teaching MapReduce in a large undergraduate lecture course using public cloud services. Using the cloud, every student could carry out scalability benchmarking assignments on realistic hardware, which would have been impossible otherwise. Over two semesters, over 500 students took our course. We believe this is the first large-scale demonstration that it is feasible to use pay-as-you-go billing in the Cloud for a large undergraduate course. Modest instructor effort was sufficient to prevent students from overspending. Average per-pupil expenses in the Cloud were under $45, less than half our available grant funding. Students were excited by the assignment: 90% said they thought it should be retained in future course offerings.", "authors": [{"name": "Charles Reiss", "affiliation": "UC Berkeley, Berkeley, CA, USA"}, {"name": "David Patterson", "affiliation": "UC Berkeley, Berkeley, CA, USA"}, {"name": "Randy Katz", "affiliation": "UC Berkeley, Berkeley, CA, USA"}, {"name": "Ariel S. Rabkin", "affiliation": "UC Berkeley, Berkeley, CA, USA"}], "tags": ["cloud computing", "education", "mapreduce"]}, {"title": "Developing microlabs using Google web toolkit", "link": "https://dl.acm.org/doi/10.1145/2157136.2157311", "abstract": "Closed labs have become a common feature in computer science education because they provide hands-on experience in a supervised setting. Microlabs extend this approach into the lecture format with very short hands-on activities in the \"middle of the lecture.\" The programming microlab approach was developed for a distributed computing course that integrated all levels of parallelism (multicore, cluster, and grid). Since that time we have developed logical microlabs where students solve conceptual problems that do not involve programming. These are integrated into a Microlab Learning Cycle. We want our microlabs to be usable with a wide variety of computing devices, including tablets. After experimenting with different development environments we have adopted the Google Web Toolkit (GWT). After presenting the current status of our activities, we discuss future directions for microlab development. This work is supported, in part, by three National Science Foundation grants.", "authors": [{"name": "James B. Fenwick", "affiliation": "Appalachian State University, Boone, NC, USA"}, {"name": "Barry L. Kurtz", "affiliation": "Appalachian State University, Boone, NC, USA"}, {"name": "Philip Meznar", "affiliation": "Appalachian State University, Boone, NC, USA"}], "tags": ["active learning", "automated grading", "web development"]}, {"title": "Teaching operating systems using android", "link": "https://dl.acm.org/doi/10.1145/2157136.2157312", "abstract": "The computing landscape is shifting towards mobile devices. To learn about operating systems, it is increasingly important for students to gain hands-on kernel programming experience in these environments, which are quite different from traditional desktops and servers. We present our work at Columbia University to teach operating systems using Android, an open, commercially supported software platform increasingly used on mobile and embedded devices. We introduce a series of five Android kernel programming projects suitable for a one semester introductory operating systems course. Each project teaches a core operating system concept infused with Android or mobile device specific context, such as Android specific process relationships, use of sensors, and design considerations for resource constrained mobile devices. We also introduce an Android virtual laboratory based on virtual appliances, distributed version control, and live demonstrations which gives students hands-on Android experience, with minimal computing infrastructure. We have used these Android kernel programming projects and the Android virtual lab to teach an introductory operating systems course. Although this was our first time teaching the course using Android, over 80% of students surveyed enjoyed using Android and the majority of students preferred Android to traditional desktop development.", "authors": [{"name": "Jeremy Andrus", "affiliation": "Columbia University, New York, NY, USA"}, {"name": "Jason Nieh", "affiliation": "Columbia University, New York, NY, USA"}], "tags": ["android", "mobile devices", "operating systems"]}, {"title": "Session details: Paper: curricular innovations and research", "link": "https://dl.acm.org/doi/10.1145/3248138", "abstract": "No abstract available.", "authors": [{"name": "Michael Hewner", "affiliation": "Duke University"}], "tags": []}, {"title": "Open educational resources in computer science teaching", "link": "https://dl.acm.org/doi/10.1145/2157136.2157314", "abstract": "Open content and open access to resources are important factors in the innovation of Computer Science education. This paper presents a study aimed at gaining an understanding of the needs of Computer Science educators in terms of Open Educational Resources (OER): what kind of resources they need, when they need them, how they use them, and what are the barriers and the enablers for using OER The results of the study are compared and analyzed in the context of the popular OER sites. The work contributes to the research on OER utilization and discovery.", "authors": [{"name": "Darina Dicheva", "affiliation": "Winston Salem State University, Winston Salem, NC, USA"}, {"name": "Christo Dichev", "affiliation": "Winston Salem State University, Winston Salem, NC, USA"}], "tags": ["open content", "open educational resources", "open education"]}, {"title": "Emergent themes in a UI design hybrid-studio course", "link": "https://dl.acm.org/doi/10.1145/2157136.2157315", "abstract": "The goal of our research and teaching collaboration has been to learn more about how key aspects of pedagogy commonly incorporated in architecture and industrial design classes might positively impact the teaching of user interface (UI) design within a standard computer science curriculum. Toward that end, we studied a number of studio design courses, developed a set of curriculum guidelines, and analyzed the effectiveness of these guidelines as implemented in a UI design course. We discovered three emergent themes: 1) students need early and constant reminders that design is an iterative process involving user feedback and testing; 2) instructor modeling is critical; and 3) technology needs to be carefully managed at critical junctures throughout the class.", "authors": [{"name": "Sarah A. Douglas", "affiliation": "University of Oregon, Eugene, OR, USA"}, {"name": "Katherine Cennamo", "affiliation": "Virginia Tech, Blacksburg, VA, USA"}, {"name": "Yolanda Jacobs Reimer", "affiliation": "University of Montana, Missoula, MT, USA"}], "tags": ["design critiques", "studio-based learning", "computer science education research", "user interface design"]}, {"title": "A multilevel, multidimensional undergraduate course and lab experience on embedded multimedia systems", "link": "https://dl.acm.org/doi/10.1145/2157136.2157316", "abstract": "Traditional curricular structures can be fragmented in the sense that course inter-relationships or links between theories, methodologies, and practices, are not immediately recognized by the students. The completion of the course puzzle and the integration of course knowledge usually become evident only after graduation. In this paper, we describe a course/lab implementation that has offered students a unique opportunity to experience the full spectrum of course elements, namely, fundamentals of theory, algorithmic design, hardware design and simulation, and implementation and testing on programmable logic devices all within a single framework. The course/lab design has been a collaborative effort between the Dept. of Electrical Engr. (EE) at the University of New Orleans (UNO) and the Dept. of Math and Computer Science (CS) at Barry University (BU). This has helped ensure that the course/ lab offerings can be implemented successfully in diverse environments.", "authors": [{"name": "Dimitrios Charalampidis", "affiliation": "University of New Orleans, New Orleans, LA, USA"}, {"name": "James Haralambides", "affiliation": "Barry University, Miami Shores, FL, USA"}], "tags": ["multimedia applications", "image and signal processing", "embedded systems", "multi-level and multi-dimensional course design"]}, {"title": "Session details: Paper: CS education research", "link": "https://dl.acm.org/doi/10.1145/3248139", "abstract": "No abstract available.", "authors": [{"name": "Yana Kortsarts", "affiliation": "Widener University"}], "tags": []}, {"title": "Effective closed labs in early CS courses: lessons from eight terms of action research", "link": "https://dl.acm.org/doi/10.1145/2157136.2157318", "abstract": "We report on best practices we have established to teach first-year computer science students in closed laboratories, founded on over three years of action research in a large introductory discrete mathematics and digital logic course. Our practices have resulted in statistically significant improvements in student and teaching assistant perception of the labs. Specifically, we discuss our practices of streamlining labs to reduce load on students that is extraneous to the lab's learning goals; establishing a positive first impression for students and TAs in the early weeks of the term; and effectively managing the teaching staff, including weekly preparation meetings for TAs using and a gradual, iterative curriculum development cycle that engages all stakeholders in the course.", "authors": [{"name": "Steven Andrew Wolfman", "affiliation": "University of British Columbia, Vancouver, BC, Canada"}, {"name": "Elizabeth Ann Patitsas", "affiliation": "University of Toronto, Toronto, ON, Canada"}], "tags": ["curriculum evaluation", "teaching assistants", "computer science education", "curriculum development", "labs", "survey"]}, {"title": "What do students learn about programming from game, music video, and storytelling projects?", "link": "https://dl.acm.org/doi/10.1145/2157136.2157319", "abstract": "Drag-and-drop learning environments like Alice (alice.org) and Scratch (scratch.mit.edu) eliminate syntax errors, making them attractive as ways to introduce programming concepts to students. Alice is closely associated with storytelling, Scratch was designed for creating music videos, and both can be used to create games. Having had students create each kind of project, we began to wonder: Do students learn different things creating games compared to music videos or stories? What programming constructs do students actually use (and hence learn well enough to be able to apply)? To answer these questions, we conducted a quantitative analysis of a collection of over 300 different student projects created using these tools. In examining different kinds of projects, we found significant differences in how frequently the students creating those projects used variables, if statements, loops, and dialog constructs.", "authors": [{"name": "Andrew R. Webster", "affiliation": "Calvin College, Grand Rapids, MI, USA"}, {"name": "Joel C. Adams", "affiliation": "Calvin College, Grand Rapids, MI, USA"}], "tags": ["music videos", "Alice", "genres", "games", "storytelling", "scratch"]}, {"title": "Bayesian network analysis of computer science grade distributions", "link": "https://dl.acm.org/doi/10.1145/2157136.2157320", "abstract": "Time to completion is a major factor in determining the total cost of a college degree. In an effort to reduce the number of students taking more than four years to complete a degree, we propose the use of Bayesian networks to predict student grades, given past performance in prerequisite courses. This is an intuitive approach because the necessary structure of any Bayesian network must be a directed acyclic graph, which is also the case for prerequisite graphs. We demonstrate that building a Bayesian network directly from the prerequisite graph results in effective predictions, and demonstrate a few applications of the resulting network in areas of identifying struggling students and deciding upon which courses a department should allocate tutoring resources. We find that many of our observations agree with what has long been considered conventional wisdom in computer science education.", "authors": [{"name": "Mitch Raney", "affiliation": "Baldwin-Wallace College, Berea, OH, USA"}, {"name": "Adam Anthony", "affiliation": "Baldwin-Wallace College, Berea, OH, USA"}], "tags": ["grade prediction", "Bayesian network", "course prerequisites"]}, {"title": "Through the looking glass: talking about the world with visualization", "link": "https://dl.acm.org/doi/10.1145/2157136.2157322", "abstract": "Data visualization has historically been accessible only to the elite in academia, business, and government. It was \"serious\" technology, created by experts for experts. In recent years, however, web-based visualizations--ranging from political art projects to news stories--have reached audiences of millions. What will this new era of data transparency look like--and what are the implications for technologists who work with data? To help answer this question, we report on recent research into public data analysis and visualization. Some of our results come from Many Eyes, a \"living laboratory\" web site where people may upload their own data, create interactive visualizations, and carry on conversations. We'll also show how the art world has embraced visualization. We'll discuss the future of visual literacy and what it means for a world where visualizations are a part of political discussions, citizen activism, religious discussions, game playing, and educational exchanges.", "authors": [{"name": "Fernanda Viégas", "affiliation": "Google, Cambridge, MA, USA"}, {"name": "Martin Wattenberg", "affiliation": "Google, Cambridge, MA, USA"}], "tags": ["keynote"]}]