[{"title": "The Impact of Digital Technology on Female Students’ Learning Experience in Partition-Rooms: Conditioned by Social Context", "link": "https://ieeexplore.ieee.org/document/8378045/", "abstract": "Contribution: As expected, a partition-room environment negatively affects students' learning. An unexpected result of this study is that female students occasionally choose not to use the technology available in partition-rooms, to avoid undesirable facial exposure. Background: The main purpose of partition-rooms is to prevent male instructors from seeing female students' faces. In learning environments where instructors and students are physically separated, technology is expected to play an integral role in bridging the gap. In one side of partition-rooms, female students use their own mobile devices, such as laptops, tablets and mobile phones, for course activities and communication; in the other side, the instructor has various digital teaching equipment provided by the institution. Research Question: What effect does a partition-room's physical environment have on female students' academic performance, satisfaction, technology efficacy, and perceived learning? What effect does a partition-room's social environment have on female students' academic performance, satisfaction, technology efficacy, and perceived learning? Methodology: Both quantitative and qualitative approaches were followed. Quantitative results were obtained from a student questionnaire. Qualitative data was gathered in a focus group session. Findings: The communication benefits offered by technology are impaired by both the physical context and the cultural-social context. The latter emerged during focus group discussions where students said that their faces might by revealed in the light emitted by their devices. Thus, local culture and social context limit the benefits of using digital technology in the classroom.", "authors": [{"name": "Mariam A. Elhussein", "affiliation": "Computer Information Systems Department, Imam Abdulrahman Bin Faisal University, Dammam, Saudi Arabia"}, {"name": "Amani K. Hamdan Alghamdi", "affiliation": "College of Education, Imam Abdulrahman Bin Faisal University, Dammam, Saudi Arabia"}, {"name": "Dilek Düştegör", "affiliation": "Computer Science Department, Imam Abdulrahman Bin Faisal University, Dammam, Saudi Arabia"}, {"name": "Naya Nagy", "affiliation": "Computer Science Department, Imam Abdulrahman Bin Faisal University, Dammam, Saudi Arabia"}], "tags": ["Portable computers", "partition-rooms", "computer aided instruction", "educational institutions", "Education", "teaching", "social context", "gender issues", "female students", "student questionnaire", "Cultural differences", "Computer-based instruction", "pedagogical issues", "digital technology", "perceived learning", "Information technology", "partition-room environment", "learning environment", "Computer science", "educational courses", "learning technology", "Global communication", "technology efficacy", "instructor", "Mobile handsets", "evaluation of CAL systems"]}, {"title": "Particle in a Box: An Experiential Environment for Learning Introductory Quantum Mechanics", "link": "https://ieeexplore.ieee.org/document/7999225/", "abstract": "Quantum mechanics (QMs) is a foundational subject in many science and engineering fields. It is difficult to teach, however, as it requires a fundamental revision of the assumptions and laws of classical physics and probability. Furthermore, introductory QM courses and texts predominantly focus on the mathematical formulations of the subject and lay less emphasis on its conceptual understanding. Consequently, students struggle to build robust mental models of the concepts. This paper posits that games can provide an effective platform for an experiential and conceptual understanding of introductory QM. Games are particularly suitable for demonstrating QM characteristics because their repetitive nature is conducive to demonstrating probability concepts that form a core part of QM. Games can also immerse students in an engaging environment that motivates them to learn. This paper presents the design and evaluation of a digital game for learning introductory QM concepts. The evaluation of the game indicates an improvement in students' conceptual understanding of probability. Students also reported an increase in comfort level with key concepts taught in the game.", "authors": [{"name": "Ridhima Gupta", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "Aditya Anupam", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "Nassim JafariNaimi", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "Azad Naeemi", "affiliation": "Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["probability concepts", "digital game", "Conceptual learning", "STEM", "introductory quantum mechanics", "serious games", "engaging environment", "physics computing", "computer aided instruction", "educational games", "quantum mechanics", "Visualization", "Education", "teaching", "computer games", "QM characteristics", "experiential understanding", "Quantum mechanics", "physics education", "Probability distribution", "games for learning", "conceptual understanding", "introductory QM concepts", "learning environment", "educational courses", "quantum theory", "experiential environment", "mathematical formulations", "educational technology", "Games", "Energy states"]}, {"title": "Persistence, Resilience and Mathematics in Engineering Transfer Capital", "link": "https://ieeexplore.ieee.org/document/8347133/", "abstract": "Contribution: This paper identifies key personal and academic factors in successful transfer to electrical, computer, and mechatronics (ECM) engineering programs. The findings support prior research on engineering transfer shows that successful students accumulate knowledge and behaviors in their sending institution that enable their progress in the receiving institution. Background: Institutional arrangements and processes, inclusive cultures and practices, social integration, and clear academic requirements support the transfer of students who go from two-year colleges and similar to follow engineering programs at four-year institutions. Various personal attributes are also associated with successful transfer. Research Question: What factors enable transferees to succeed in four-year ECM engineering degree programs? Methodology: Student data were obtained from the receiving institution's registration database and grades administration system. Database queries were used to identify transfer and non-transfer students' performance. Averages and frequencies of passes, fails, repeats, withdrawals, etc., were calculated and compared. There were limited data on students' personal challenges and non-academic strengths. Findings: All the students who attained Bachelor of Science degrees in ECM showed persistence and resilience in their journeys toward an engineering qualification, and had achieved high grades in mathematics at the sending institution.", "authors": [{"name": "Simon L. Winberg", "affiliation": "Department of Electrical Engineering, University of Cape Town, Cape Town, South Africa"}, {"name": "Christine Winberg", "affiliation": "Work-Integrated Learning, Cape Peninsula University of Technology, Cape Town, South Africa"}, {"name": "Penelope Engel-Hills", "affiliation": "Faculty of Health and Wellness Sciences, Cape Peninsula University of Technology, Cape Town, South Africa"}], "tags": ["Resilience", "engineering education", "mechatronics engineering programs", "four-year ECM engineering degree programs", "nontraditional students", "underrepresentation", "educational institutions", "computer science education", "electrical-computer-mechatronics", "Education", "key personal factors", "grades administration system", "institution registration database", "Cultural differences", "query processing", "Databases", "transfer students", "engineering qualification", "student diversity", "Electronic countermeasures", "mathematics", "Mathematics", "database queries", "Engineering transfer capital", "academic factors", "engineering transfer capital", "Social factors", "two-year colleges"]}, {"title": "Identifying Core Concepts of Cybersecurity: Results of Two Delphi Processes", "link": "https://ieeexplore.ieee.org/document/7967715/", "abstract": "This paper presents and analyzes results of two Delphi processes that polled cybersecurity experts to rate cybersecurity topics based on importance, difficulty, and timelessness. These ratings can be used to identify core concepts-cross-cutting ideas that connect knowledge in the discipline. The first Delphi process identified core concepts that should be learned in any first course on cybersecurity. The second identified core concepts that any cybersecurity professional should know upon graduating from college. Despite the rapidly growing demand for cybersecurity professionals, it is not clear what defines foundational cybersecurity knowledge. Initial data from the Delphi processes lay a foundation for defining the core concepts of the field and, consequently, provide a common starting point to accelerate the development of rigorous cybersecurity education practices. These results provide a foundation for developing evidence-based educational cybersecurity assessment tools that will identify and measure effective methods for teaching cybersecurity. The Delphi results can also be used to inform the development of curricula, learning exercises, and other educational materials and policies.", "authors": [{"name": "David DeLatte", "affiliation": "Cyber Defense Lab, University of Maryland, Baltimore County, Baltimore, MD, USA"}, {"name": "Linda Oliva", "affiliation": "Education Department, University of Maryland, Baltimore County, Baltimore, MD, USA"}, {"name": "Travis Scheponik", "affiliation": "Cyber Defense Lab, University of Maryland, Baltimore County, Baltimore, MD, USA"}, {"name": "Alan T. Sherman", "affiliation": "Cyber Defense Lab, University of Maryland, Baltimore County, Baltimore, MD, USA"}, {"name": "Geoffrey L. Herman", "affiliation": "Department of Computer Science, University of Illinois at Urbana–Champaign, Urbana, IL, USA"}, {"name": "Geet Parekh", "affiliation": "Cyber Defense Lab, University of Maryland, Baltimore County, Baltimore, MD, USA"}, {"name": "Dhananjay Phatak", "affiliation": "Cyber Defense Lab, University of Maryland, Baltimore County, Baltimore, MD, USA"}], "tags": ["Delphi process", "student assessment", "Tools", "cybersecurity professional", "educational institutions", "computer science education", "Concept inventory", "information assurance", "Delphi results", "Education", "further education", "teaching", "core concepts identification", "conceptual learning", "Delphi processes", "cybersecurity topics", "security of data", "foundational cybersecurity knowledge", "cybersecurity", "cybersecurity experts", "Engineering profession", "core concepts-cross-cutting ideas", "cybersecurity assessment tools (CATS)", "Computer science", "educational courses", "evidence-based educational cybersecurity assessment tools", "cybersecurity teaching", "Cats", "Computer security", "rigorous cybersecurity education practices", "assessment tools"]}, {"title": "Using Mobile Application Development and 3-D Modeling to Encourage Minority Male Interest in Computing and Engineering", "link": "https://ieeexplore.ieee.org/document/8352000/", "abstract": "Contribution: This paper shows that participating in a year-round program for African-American male middle school students (ages 10-14) can positively impact their attitudes toward STEM, their confidence in problem solving and team work, and their interest in STEM careers, but may not impact the interest in taking STEM classes to the same extent. Background: Increasing the number of under-represented minorities pursuing degrees in science and engineering through formal and informal learning activities has been a focus in the United States for many years. Efforts to diversify the engineering workforce have often targeted students in high school and college (ages 15-22), with varying success. Intended Outcomes: This program was designed to increase participants' content knowledge, interest in STEM courses, interest in STEM careers, interest in attending college, and improve their attitudes about STEM. Application Design: Approaches used included: 1) introducing software tools that encouraged critical thinking, creativity and independent learning; 2) integrating engineering and software design processes; 3) providing projects that were age- and culturally-appropriate; and 4) using ethnically matched mentors. Findings: After almost two years in the program participants show improved attitudes toward STEM, more interest and career choices in computing and engineering, and increased interest in attending college. These findings suggested that summer and academic year programs can be effective for cultivating interest in computing and engineering careers, but their impact on interest in studying related subjects may need further study.", "authors": [{"name": "Edward C. Dillon", "affiliation": "Department of Computer Science, Morgan State University, Baltimore, MD, USA"}, {"name": "Jumoke O. Ladeji-Osias", "affiliation": "Department of Electrical and Computer Engineering, Morgan State University, Baltimore, MD, USA"}, {"name": "LaDawn E. Partlow", "affiliation": "Department of Electrical and Computer Engineering, Morgan State University, Baltimore, MD, USA"}], "tags": ["historically black colleges/universities (HBCUs)", "STEM", "creativity", "engineering education", "3-D modeling", "independent learning", "engineering careers", "computer aided instruction", "Three-dimensional displays", "educational institutions", "academic year programs", "mobile applications", "Mentoring", "mobile application development", "gender issues", "software tools", "integrating engineering", "software design processes", "STEM courses", "minority male interest", "ethnically matched mentors", "critical thinking", "mobile learning", "Engineering profession", "computing", "African-American male middle school students", "Statistics", "Sociology", "educational courses", "Programming", "middle school", "Software"]}, {"title": "Effect of Combined Use of Flipped Learning and Inquiry-Based Learning on a System Modeling and Control Course", "link": "https://ieeexplore.ieee.org/document/8126236/", "abstract": "Contribution: This paper illustrates how to design and implement curricula in terms of the combined use of flipped learning and inquiry-based learning in an engineering course. Background: Elementary courses in engineering schools are conventional and foundational, and involve a considerable amount of knowledge. Throughout such courses, students are also expected to develop insight, which cannot be obtained by only listening to instructors. Having relevant discussions is also difficult for most instructors. Intended Outcomes: The combined use of flipped learning and inquiry-based learning would be beneficial to broaden student achievement. Application Design: Based on an epistemological approach about knowledge and knowing, this paper applies the combined use of flipped learning and inquiry-based learning to enhance student knowledge and advance ways of thinking on a System Modeling and Control course. Findings: The extended learning time and the collective responsibility for learning are discussed as critical issues in applying the combined use of flipped learning and inquiry-based learning in an engineering school.", "authors": [{"name": "Yeon Kim", "affiliation": "Department of Mathematical Education, Silla University, Busan, South Korea"}, {"name": "Changsun Ahn", "affiliation": "School of Mechanical Engineering, Pusan National University, Busan, South Korea"}], "tags": ["engineering education", "system modeling", "computer aided instruction", "Videos", "Education", "engineering school", "control course", "engineering course", "epistemological approach", "flipped classroom", "flipped learning", "Systems modeling", "Cognition", "extended learning time", "inferential statistics", "educational courses", "elementary courses", "inquiry-based learning", "undergraduate", "Knowledge engineering", "Planning", "Control class", "Control systems"]}, {"title": "Implicit Theories and Self-Efficacy in an Introductory Programming Course", "link": "https://ieeexplore.ieee.org/document/8264710/", "abstract": "Contribution: This paper examined student effort and performance in an introductory programming course with respect to student-held implicit theories and self-efficacy. Background: Implicit theories and self-efficacy help in understanding academic success, which must be considered when developing effective learning strategies for programming. Research Questions: Are implicit theories of intelligence and programming, and programming-efficacy, related to each other and to student success in programming? Is it possible to predict student performance in a course using these constructs? Methodology: Two consecutive surveys (N = 100 and N = 81) were administered to non-CS engineering students in Isık University, Turkey. Findings: Implicit theories of programming-aptitude and programming-efficacy are interrelated and positively correlated with effort, performance, and previous failures in the course. Although it was not possible to predict student course grade the data confirms that students who believe in improvable programming aptitude have significantly higher programming efficacy, report more effort, and get higher course grades. In addition, failed students tend to associate the failure with fixed programming aptitude; repeating students favor fixed programming aptitude theory and have lower programming-efficacy, which increases the possibility of further failure.", "authors": [{"name": "F. Boray Tek", "affiliation": "Department of Computer Engineering, Işık University, Istanbul, Turkey"}, {"name": "Kristin S. Benli", "affiliation": "Department of Computer Engineering, Işık University, Istanbul, Turkey"}, {"name": "Ezgi Deveci", "affiliation": "Department of Psychology, Işık University, Istanbul, Turkey"}], "tags": ["Resilience", "student course grade", "computer aided instruction", "computer science education", "programming efficacy", "introductory programming course", "Programming profession", "Isık University", "attribution theory", "Psychology", "implicit theories", "self-efficacy", "Achievement", "nonCS engineering students", "Turkey", "mindset for programming", "student perception", "Mathematics", "programming aptitude theory", "higher programming efficacy", "educational courses", "lower programming-efficacy", "programming aptitude", "higher course grades", "student-held implicit theories", "fixed programming aptitude theory", "Current measurement"]}, {"title": "Helping Engineering Students Learn in Introductory Computer Science (CS1) Using Computational Creativity Exercises (CCEs)", "link": "https://ieeexplore.ieee.org/document/8303219/", "abstract": "Contribution: This paper provides evidence that computational creativity exercises (CCEs) can increase engineering students' learning in introductory computer science (CS1) courses. Its main contribution is its more rigorous treatment/control group research design that allows testing for causal influences of CCEs on student learning and performance. Background: Computer science (CS) courses are critical foundational courses for engineering students. CCEs that merge computational and creative thinking have been shown to increase achievement and learning of engineering and nonengineering students in CS1 courses, but previous research has used quasi- and non-experimental designs. Intended Outcomes: CCEs are intended to improve students' learning of CS1 content and problem-solving ability by fostering computational creativity. Application Design: CCEs can improve student learning and can be used to supplement other evidence-based instructional practices. Findings: Propensity score matching was used to create equivalent treatment and control groups; results show that students in the CCE implementation section had higher scores on a CS knowledge test than students in the control section, but not higher self-efficacy for their CS knowledge. Focus group and open-ended survey questions indicated that students had mixed reactions to the CCEs, with about half the students seeing them as improving their learning, understanding, and ability to apply CS in their engineering field. Responses also reinforced the importance of fully incorporating CCEs in courses and aligning them with course topics.", "authors": [{"name": "Leen-Kiat Soh", "affiliation": "Department of Computer Science and Engineering, University of Nebraska–Lincoln, Lincoln, NE, USA"}, {"name": "Markeya S. Peteranetz", "affiliation": "Department of Educational Psychology, University of Nebraska–Lincoln, Lincoln, NE, USA"}, {"name": "Abraham E. Flanigan", "affiliation": "Department of Educational Psychology, University of Nebraska–Lincoln, Lincoln, NE, USA"}, {"name": "Duane F. Shell", "affiliation": "Department of Educational Psychology, University of Nebraska–Lincoln, Lincoln, NE, USA"}], "tags": ["Problem-solving", "computational creativity exercises", "computer science", "CCE", "computational creativity", "engineering education", "engineering student learning", "Creativity", "Tools", "computer aided instruction", "Teamwork", "computer science education", "nonengineering students", "critical foundational courses", "CS knowledge test", "CS1 courses", "control groups", "Task analysis", "problem-solving ability", "computational thinking", "CS1", "self-efficacy", "Engineering students", "Achievement", "creative thinking", "Computer science", "educational courses", "engineering computing", "engineering field", "introductory computer science courses", "evidence-based practice", "equivalent treatment"]}, {"title": "Cloud Computing for Education: A Systematic Mapping Study", "link": "https://ieeexplore.ieee.org/document/8283623/", "abstract": "This paper examines the cloud computing for education (CCE) literature, and analyzes if the research is developing scientifically with adequate empirical validation. All aspects of empirical investigations covered in the literature are shown as weak, hence, the necessary scientific development of CCE requires extending its scope of interest, and involving scholars synergistically to create and maintain a “common research agenda.” Background: A need to develop research on CCE has been recognized, and considerable efforts made to create an accurate understanding of the development of its scope of interest, in terms of supporting pedagogical developments and processes for better quality of studies. Research Questions: This paper has three main aims: 1) to evaluate the scope of interest in the literature for CCE with specific reference to pedagogy and educational processes; 2) to analyze the characteristics of papers, specifically empirical studies, from the various points of view of the daily improvement activities of teachers and learners at all levels of education; and 3) to identify eventual research gaps to consider and stimulate new topics or further investigations. Methodology: This systematic mapping study review followed a rigorous, replicable process to collect and analyze representative studies of CCE. Findings: Differences are found across geographic areas in applying CCE infrastructure and technologies in educational institutions; few studies address CCE's impact on pedagogic processes. The scope of interest in CCE is only partially covered; with empirical research being very shallow. Suggestions are made for more effective research on concerning the production and use of content.", "authors": [{"name": "Giuseppe Visaggio", "affiliation": "Dipartimento di Informatica, Università degli Studi di Bari, Bari, Italy"}, {"name": "Enrica Gentile", "affiliation": "Dipartimento di Informatica, Università degli Studi di Bari, Bari, Italy"}, {"name": "Maria Teresa Baldassarre", "affiliation": "Dipartimento di Informatica, Università degli Studi di Bari, Bari, Italy"}, {"name": "Giovanni Dimauro", "affiliation": "Dipartimento di Informatica, Università degli Studi di Bari, Bari, Italy"}, {"name": "Danilo Caivano", "affiliation": "Dipartimento di Informatica, Università degli Studi di Bari, Bari, Italy"}], "tags": ["systematic mapping study review", "Electronic learning", "CCE infrastructure-and-technologies", "computer aided instruction", "educational institutions", "cloud computing", "organisational aspects", "technology-enhanced learning", "pedagogical developments", "computer-based instruction", "necessary scientific development", "educational processes", "instructional methods", "adequate empirical validation", "Sensitivity", "CCE literature", "systematic mapping study", "education literature", "Statistics", "Sociology", "learning environment", "Systematics", "pedagogic process", "Cloud computing", "e-learning", "educational technology", "cloud computing-for-education"]}, {"title": "An Instructional Feedback Technique for Teaching Project Management Tools Aligned With PMBOK", "link": "https://ieeexplore.ieee.org/document/8167322/", "abstract": "Contribution: An approach is presented to provide contextualized feedback for students using a project management (PM) tool. This approach covers the ten PM knowledge areas, guiding students through the planning of software projects. Background: Because software PM is unfeasible without the support of a PM tool there is a growing demand that these tools be taught in the higher education computer courses. Hence, several approaches already have been proposed to improve this teaching, such as educational PM tools or simulators, which facilitate the application of specific PM techniques and the treatment of their results. Another approach to improve the teaching of PM tools is instructional feedback, but little information is as yet available on how to provide instructional feedback when teaching software PM. Intended Outcomes: Instructional feedback, essential to helping students to learn, is based on an evaluation of their actions and decisions. To take advantage of this instructional approach, this paper proposes an instructional feedback technique to be employed in an instructional unit (IU) teaching PM tools aligned with the project management body of knowledge. Application Design: This technique was evaluated through an experiment carried out in undergraduate computer courses. Control and experiential groups were exposed to the same IU, with only the experiential group using the instructional feedback technique. Findings: The proposed feedback technique contributes to student learning, meeting students' need for better explanations to acquire a comprehensive understanding of PM theory and its practice.", "authors": [{"name": "Christiane A. Gresse von Wangenheim", "affiliation": "Department of Informatics and Statistics, Federal University of Santa Catarina, Florianópolis, Brazil"}, {"name": "Jean C. R. Hauck", "affiliation": "Department of Informatics and Statistics, Federal University of Santa Catarina, Florianópolis, Brazil"}, {"name": "Rafael Queiroz Gonçalves", "affiliation": "Department of Informatics and Statistics, Federal University of Santa Catarina, Florianópolis, Brazil"}, {"name": "Andreia Zanella", "affiliation": "Department of Informatics and Statistics, Federal University of Santa Catarina, Florianópolis, Brazil"}], "tags": ["Open source software", "feedback", "Tools", "computer aided instruction", "PMBOK", "computer science education", "project management tool", "software projects", "PM tool", "Education", "further education", "Project management", "formative", "instructional unit", "open-source", "project management", "teaching software PM", "Computer science", "educational courses", "teaching project management tools", "instructional feedback technique", "Planning", "higher education computer courses", "educational software", "contextualized feedback"]}, {"title": "Gendered Interests in Electrical, Computer, and Biomedical Engineering: Intersections With Career Outcome Expectations", "link": "https://ieeexplore.ieee.org/document/8434267/", "abstract": "Contribution: The current study finds that female-identified students report stronger associations between “helping others” and interest in bioengineering/biomedical engineering than non-females, while they report less interest in electrical and computer engineering overall, with similar associations to factors such as “inventing/designing things” than non-females. Background: While women have made gains in STEM, electrical and computer engineering programs award 13% of their Bachelor's degrees to women while bioengineering/biomedical engineering programs award over 40%. Prior work suggests that women's persistent under-representation in electrical and computer engingeering may be due to them being drawn into other disciplines. Women persist in engineering at similar rates as men, so a better understanding of early college attitudes is needed. Research Questions: (1) How are career outcome expectations associated to electrical engineering, computer engineering, and bioengineering/biomedical engineering? (2) What are females' interests in electrical engineering, computer engineering, and bioengineering/biomedical engineering? (3) Are outcome expectations and major interests distinct for female-identified students? Methodology: Regression analyses were conducted on multiply-imputed data of introductory engineering students at four public universities in the U.S. Findings: Students associate inventing/designing things and “developing new knowledge and skills” to electrical engineering, and associate inventing/designing things and “working with people” (negative) to computer engineering. Students associate helping others and “supervising others” (negative) to bioengineering/biomedical engineering. Female-identified students are less interested in electrical and computer engineering, more interested in bioengineering/biomedical engineering, and associate helping others to bioengineering/biomedical engineering more strongly.", "authors": [{"name": "Allison Godwin", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Jacqueline Rohde", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Monique Ross", "affiliation": "School of Computing and Information Sciences, Florida International University, Miami, FL, USA"}, {"name": "Catherine McGough", "affiliation": "Department of Engineering and Science Education, Clemson University, Clemson, SC, USA"}, {"name": "Geoff Potvin", "affiliation": "STEM Transformation Institute, Florida International University, Miami, FL, USA"}, {"name": "Dina Verdín", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Lisa Benson", "affiliation": "Department of Engineering and Science Education, Clemson University, Clemson, SC, USA"}, {"name": "Hank J. Boone", "affiliation": "School of Nursing, Nevada State College, Henderson, NV, USA"}, {"name": "Adam Kirn", "affiliation": "College of Engineering and the College of Education, University of Nevada, Reno, NV, USA"}, {"name": "Jacqueline Doyle", "affiliation": "Science Education Department, Harvard-Smithsonian Center for Astrophysics, Cambridge, MA, USA"}, {"name": "Beverly Ma", "affiliation": "College of Engineering and the College of Education, University of Nevada, Reno, NV, USA"}], "tags": ["STEM", "inventing-designing things", "computer aided instruction", "underrepresentation", "educational institutions", "computer science education", "Biomedical engineering", "gender", "Electrical engineering", "gender issues", "electrical engineering education", "electrical engineering", "US public universities", "Engineering students", "computer engineering electrical engineering", "female-identified students", "Engineering profession", "recruitment", "multiply-imputed data", "Recruitment", "educational courses", "bioengineering-biomedical engineering programs award", "undergraduate", "regression analysis", "introductory engineering students", "computer engineering programs award", "biomedical engineering", "career outcome expectations"]}, {"title": "Enhancing the Student Learning Experience in Software Engineering Project Courses", "link": "https://ieeexplore.ieee.org/document/8026185/", "abstract": "Carrying out real-world software projects in their academic studies helps students to understand what they will face in industry, and to experience first-hand the challenges involved when working collaboratively. Most of the instructional strategies used to help students take advantage of these activities focus on supporting agile programming, which is appropriate for capstone courses. This is not always recommended in initial software engineering project courses, however, where novice developers run projects in teams while simultaneously taking other courses. To enhance the learning and teamwork experience in this latter instructional scenario, this paper proposes a formative monitoring method, reflexive weekly monitoring (RWM), for use in project courses that involve disciplined software processes and loosely coupled work. RWM uses self-reflection and collaborative learning practices to help students be aware of their individual and team performance. RWM was applied in a case study over nine consecutive semesters. The results obtained indicate that RWM was effective in enhancing the learning experience in the instructional scenario studied. While students in the monitored teams were more effective and coordinated, and experienced a higher sense of team belonging and satisfaction, little evidence was found of them being more productive than students working in non-monitored teams.", "authors": [{"name": "María Cecilia Bastarrica", "affiliation": "Department of Computer Science, Universidad de Chile, Santiago, Chile"}, {"name": "Sergio F. Ochoa", "affiliation": "Department of Computer Science, Universidad de Chile, Santiago, Chile"}, {"name": "Francisco J. Gutierrez", "affiliation": "Department of Computer Science, Universidad de Chile, Santiago, Chile"}, {"name": "Maíra Marques", "affiliation": "Department of Computer Science, Universidad de Chile, Santiago, Chile"}], "tags": ["latter instructional scenario", "disciplined software processes", "Tools", "real-world software projects", "disciplined software process", "reflexive monitoring", "Teamwork", "computer science education", "teamwork experience", "reflective practice", "nonmonitored teams", "Industries", "team working", "team belonging", "initial software engineering project courses", "project-based learning", "individual team performance", "software engineering project course", "formative monitoring", "team performance", "student learning experience", "Productivity", "academic studies", "formative monitoring method", "capstone courses", "instructional strategies", "RWM", "Monitoring", "software engineering", "team satisfaction", "reflexive weekly monitoring", "project management", "Software engineering", "agile programming", "teamwork", "educational courses", "Collaborative learning", "collaborative learning practices", "Software"]}, {"title": "Hybrid Problem-Based Learning in Digital Image Processing: A Case Study", "link": "https://ieeexplore.ieee.org/document/8103068/", "abstract": "Contribution: This paper reports a curriculum development in hybrid problem-based learning (h-PBL), addresses the design, implementation, effectiveness, and assessment issues of h-PBL, and explains the mixed results observed regarding the impact of problem-based learning (PBL) on student grades from a hybrid perspective. Background: The effect of PBL on student learning is difficult to analyze. Empirical research on h-PBL has been scant in the engineering education field. Intended Outcomes: The hybrid approach described in this paper can be used to guide other course designs. Future research directions are also provided in order to better capture the positive effects of PBL on student learning. Application Design: A 3-D imaging project was developed and implemented using h-PBL. A non-parametric hypothesis test was conducted to compare four-year student performance data collected after the implementation of h-PBL with four-year student performance data collected under traditional lecturing; both sets of students were taught by the same instructor. Findings: Student project grades improved after h-PBL, whereas student cumulative course grades did not show significant improvement. The study suggests that higher ratios and weights of PBL, better timing in introducing PBL, and more integrated course components in the hybrid approach may further improve student performance.", "authors": [{"name": "Songxin Tan", "affiliation": "Department of EECS, South Dakota State University, Brookings, SD, USA"}, {"name": "Zixing Shen", "affiliation": "College of Business and Information Systems, Dakota State University, Madison, SD, USA"}], "tags": ["h-PBL", "engineering education", "student assessment", "computer aided instruction", "Three-dimensional displays", "digital image processing", "student cumulative course grades", "Education", "electrical engineering", "Electronics packaging", "image processing", "hybrid problem-based learning", "Cameras", "Active learning", "Distortion", "hybrid problem-based learning (h-PBL)", "Digital images", "student learning", "3D imaging", "four-year student performance data", "fringe projection"]}, {"title": "Elevating Learner Achievement Using Formative Electronic Lab Assessments in the Engineering Laboratory: A Viable Alternative to Weekly Lab Reports", "link": "https://ieeexplore.ieee.org/document/7940018/", "abstract": "A laboratory pedagogy interweaving weekly student portfolios with onsite formative electronic laboratory assessments (ELAs) is developed and assessed within the laboratory component of a required core course of the electrical and computer engineering (ECE) undergraduate curriculum. The approach acts to promote student outcomes, and neutralize academic integrity violations, while refocusing instructor and teaching assistant roles toward high-gain instructional activities, such as personalized student tutoring. A mixed-method study evaluated the learning effectiveness and student satisfaction using biweekly ELAs versus traditional laboratory reports in a large-enrollment (N=68) undergraduate computer engineering laboratory course. The results of the evaluation indicate statistically significant effects on both learning outcomes and student satisfaction from the use of formative assessments in laboratory delivery, which were corroborated by the instructor's reflections. Students in the ELA with tutoring enabled delivery cohort performed better on the post-test and were more satisfied with the laboratory assessment design and assistance received in laboratory than those in the control cohort. The findings offer a promising alternative for ECE and engineering laboratory instruction that fosters gains in practical skills and content mastery.", "authors": [{"name": "Ronald F. DeMara", "affiliation": "Department of Electrical Engineering and Computer Science, University of Central Florida, Orlando, FL, USA"}, {"name": "Soheil Salehi", "affiliation": "Department of Electrical Engineering and Computer Science, University of Central Florida, Orlando, FL, USA"}, {"name": "Richard Hartshorne", "affiliation": "Instructional Design and Technology Program, University of Central Florida, Orlando, FL, USA"}, {"name": "Baiyun Chen", "affiliation": "Center for Distributed Learning, University of Central Florida, Orlando, FL, USA"}], "tags": ["Problem-solving", "ECE undergraduate curriculum", "laboratory", "student assessment", "Tools", "electrical and computer engineering undergraduate curriculum", "learner achievement", "educational institutions", "Writing", "computer science education", "Education", "further education", "teaching", "Computers", "electrical engineering education", "formative electronic lab assessments", "engineering facilities", "student satisfaction", "Portfolios", "engineering laboratory", "laboratory delivery", "laboratory instruction", "formative assessment", "teaching assistant roles", "Electronic assessment delivery", "learner remediation strategies", "educational courses", "Manuals", "laboratories"]}, {"title": "Affordances of Virtual and Physical Laboratory Projects for Instructional Design: Impacts on Student Engagement", "link": "https://ieeexplore.ieee.org/document/8269365/", "abstract": "Contribution: Student engagement and interest in engineering is compared between virtual and physical laboratory projects, designed to be realistic and replicate engineering practice. Reported motivation and engagement was greater in the virtual project than the physical projects. Results are interpreted in terms of the different affordances for instructional design using physical and virtual laboratories. Background: Interest is increasing in incorporating virtual laboratories in engineering curricula. Numerous studies report equal or greater gains in students' conceptual understanding in a virtual laboratory than a corresponding physical laboratory, but many researchers question if virtual laboratories can stimulate the same level of excitement for engineering as physical laboratories. Research Questions: Do students' self-reports of interest in engineering depend on the instructional design afforded by the laboratory mode? How do instructional designs of virtual and physical laboratory projects relate to students' perceptions of engagement, their contribution to the team, and the transfer of prior coursework to meet project objectives? Method: In a within-subjects design, 118 students' interest and engagement in two physical laboratory projects and one of two virtual laboratory projects in a senior-year capstone course is investigated. Separate principal components analyses were used to develop reliable scales for interest and for engagement. Findings: Students reported greater engagement, perceptions of contribution to their group's learning, opportunities to transfer prior learning from coursework, and end-of-course interest in engineering problem solving in the virtual laboratory project rather than the physical laboratory projects. The positive outcomes are connected to instructional design through the affordances of the virtual laboratory.", "authors": [{"name": "Susan Bobbitt Nolen", "affiliation": "College of Education, University of Washington, Seattle, WA, USA"}, {"name": "Milo D. Koretsky", "affiliation": "School of Chemical, Biological, and Environmental Engineering, Oregon State University, Corvallis, OR, USA"}], "tags": ["principal component analysis", "engineering education", "computer aided instruction", "educational institutions", "Laboratories", "virtual project", "Visualization", "Education", "teaching", "instructional design", "Semiconductor device measurement", "Task analysis", "Biology", "Reliability", "incorporating virtual laboratories", "physical projects", "physical laboratory projects", "senior undergraduates", "corresponding physical laboratory", "educational courses", "virtual laboratory", "learning technology", "student engagement", "virtual laboratory project", "laboratory learning environment", "Capstone projects", "CVD"]}, {"title": "Guest Editorial Special Issue on Increasing the Socio-Cultural Diversity of Electrical and Computer Engineering and Related Fields", "link": "https://ieeexplore.ieee.org/document/8513832/", "abstract": "Universities and colleges struggle to achieve their diversity goals in disciplines including electrical engineering, computer science, and computer engineering. Even if entering students are sufficiently diverse, programs are challenged to provide appropriate support and develop engagement opportunities that enable these students to succeed. Some students from minority populations may have had schooling less well funded than that of their mainstream peers, and while capable of succeeding, may be differently equipped than their peers. This special issue asks: How can efforts to increase success of minority students be designed and implemented? How can programs help faculty to understand challenges diverse students face? How can they change their teaching methods?", "authors": [{"name": "Laura Bottomley", "affiliation": "College of Engineering, North Carolina State University, Raleigh, NC, USA"}, {"name": "Karen Panetta", "affiliation": "Department of Electrical and Computer Engineering, Tufts University, Medford, MA, USA"}, {"name": "Shannon M. Chance", "affiliation": "Centre for Engineering Education, University College London, London, U.K."}, {"name": "Bill Williams", "affiliation": "CEG-IST, Instituto Superior Técnico Universidade de Lisboa, Lisbon, Portugal"}], "tags": ["Cultural differences", "STEM", "Engineering education", "Special issues and sections", "Engineering profession"]}, {"title": "A Survey of Current Trends in Master’s Programs in Microelectronics", "link": "https://ieeexplore.ieee.org/document/8232470/", "abstract": "Contribution: This paper brings forward a paradigm shift in microelectronic and nanoelectronic engineering education. Background: An increasing number of universities are offering graduate-level electrical engineering degree programs with multi-disciplinary Master's-level specialization in microelectronics or nanoelectronics. The paradigm shift from electrical engineering to microelectronics graduate education has been slow, but the technology has now advanced to the point where industry is relying on cyber-physical connectivity, thus providing an opportunity for engineering education to utilize this capability. Research Questions: How are methods deployed when teaching traditional electrical engineering degrees still applicable in microelectronics education, and how are globally ranked institution shifting their online teaching and learning pedagogies for this? Methodology: A survey is presented of current trends in Master's degree programs in microelectronics and related fields, and in electrical engineering degree programs with specialization in microelectronics. The review reveals how Quacquarelli Symonds' top-ranked world universities, and other global universities with established micro- and nanoelectronic degrees, are selecting modules for their curricula and curricula content in attempts to attract and develop engineering students to this specialized field. Findings: The current global trend toward microelectronic education is following a part-coursework, part-dissertation Master's degree model, consisting of several core modules, several electives, a research proposal writing module and a mini-dissertation. Furthermore, following industrial trends, there is a clear shift toward the “fabless” or cyber-physical approach and outsourced manufacturing, with technology-led teaching mediating the possibility of completing both theoretical and laboratory components using online resources and interactivity.", "authors": [{"name": "Mladen Božanić", "affiliation": "Department of Electrical and Electronic Engineering Science, University of Johannesburg, Johannesburg, South Africa"}, {"name": "Saurabh Sinha", "affiliation": "Office of the Deputy Vice-Chancellor: Research and Internalization, University of Johannesburg, Johannesburg, South Africa"}], "tags": ["paradigm shift", "nanoelectronic degrees", "outsourced manufacturing", "microelectronic engineering education", "graduate education", "cyber-physical systems", "nanoelectronic engineering education", "computer aided instruction", "educational institutions", "cyber-physical approach", "integrated circuits", "Master’s students", "Education", "Market research", "teaching", "Electrical engineering", "Microelectronics", "masters-level specialization", "online teaching", "Integrated circuits", "Fabrication", "outsourcing", "part-coursework", "engineering students", "masters degree programs", "cyber-physical connectivity", "microelectronic degrees", "technology-led teaching", "microelectronic education", "microelectronics education", "industrial trends", "electronic engineering education", "microelectronics graduate education", "part-dissertation masters degree model", "graduate-level electrical engineering degree programs", "nanoelectronics", "microelectronics", "Quacquarelli Symonds top-ranked world universities", "educational courses", "engineering curriculum", "learning pedagogies"]}, {"title": "A Multidisciplinary Industrial Robot Approach for Teaching Mechatronics-Related Courses", "link": "https://ieeexplore.ieee.org/document/8024173/", "abstract": "This paper presents a robot prototype for an undergraduate laboratory program designed to fulfill the criteria laid out by ABET. The main objective of the program is for students to learn some basic concepts of embedded systems and robotics, and apply them in practice. For that purpose, various practical laboratory exercises were prepared to teach different aspects of communications, control, mechatronics, and microcontrollers. The practicals are organized such that the students can systematically solve real-world problems. The most important feature of the presented program is that, it incorporates interdisciplinary knowledge, and inculcates technical and professional skills required in pursuing a successful career. Furthermore, students and instructors can modify the software and hardware units of the robot prototype as necessary, to explore more ideas and to apply the robot in other mechatronics-related courses. A digital electronics course taught at the Automation Department at Universidad Autónoma de Querétaro, Querétaro, Mexico, is presented as a case study in which the evaluation process was based on ABET criteria and the corresponding student outcomes. A student survey elicited students' observations of, and interest in, the learning process. The positive student feedback and student academic outcomes indicate that the inclusion of prototype had a significant impact on student academic outcomes.", "authors": [{"name": "Juvenal Rodríguez-Reséndiz", "affiliation": "Engineering Department, Universidad Autónoma de Querétaro, Querétaro, Mexico"}, {"name": "Gonzalo Macias-Bobadilla", "affiliation": "Engineering Department, Universidad Autónoma de Querétaro, Querétaro, Mexico"}, {"name": "Suresh Thenozhi", "affiliation": "Engineering Department, Universidad Autónoma de Querétaro, Querétaro, Mexico"}, {"name": "Mariano Garduño-Aparicio", "affiliation": "Engineering Department, Universidad Autónoma de Querétaro, Querétaro, Mexico"}], "tags": ["technical skills", "Servomotors", "engineering education", "software", "student academic outcomes", "Universidad Autónoma", "computer aided instruction", "digital electronics course", "ABET criteria", "interdisciplinary", "educational robots", "robot prototype", "higher education", "microcontrollers", "Education", "further education", "teaching", "project-based learning", "Microcontrollers", "engineering technology", "control engineering education", "Querétaro", "Prototypes", "Educational robots", "learning process", "undergraduate laboratory program", "electronic engineering education", "practical laboratory exercises", "interdisciplinary knowledge", "industrial robotics", "mechatronics-related courses teaching", "professional skills", "educational courses", "hardware units", "design practice", "positive student feedback", "mechatronics", "embedded systems", "ABET accreditation", "Service robots", "multidisciplinary industrial robot approach"]}, {"title": "Exploring Undergraduate Students’ Computational Modeling Abilities and Conceptual Understanding of Electric Circuits", "link": "https://ieeexplore.ieee.org/document/8340250/", "abstract": "Contribution: This paper adds to existing literature on teaching basic concepts of electricity using computer-based instruction; findings suggest that students can develop an accurate understanding of electric circuits when they generate multiple and complementary representations that build toward computational models. Background: Several studies have explored the efficacy of computer-based, multi-representational teaching of electric circuits for novice learners. Existing research has found that instructional use of computational models that move from abstract to concrete representations can foster students' comprehension of electric circuit concepts, but other features of effective instruction using computational models need further investigation. Research Questions: 1) Is there a correlation between students' representational fluency and their ability to reason qualitatively on electric circuits? and 2) Is the quality of student-generated computational representations correlated to their conceptual understanding of electric circuits? Methodology: The study comprised two cases in which 51 sophomore-engineering students completed a voluntary assignment designed to assess their representational fluency and conceptual understanding of electric circuits. Qualitative insights from the first case informed the design of a scoring rubric that served as both the assessment and the data collection instrument. Findings: The results suggest that a multi-representational approach aimed at the construction of computational models can foster conceptual understanding of electric circuits. The number and quality of students' representations showed a positive correlation with their conceptual understanding. In particular, the quality of the computational representations was found to be highly, and significantly, correlated with the correctness.", "authors": [{"name": "William Sanchez", "affiliation": "Polytechnic Institute, Purdue University, West Lafayette, IN, USA"}, {"name": "Alejandra J. Magana", "affiliation": "Polytechnic Institute, Purdue University, West Lafayette, IN, USA"}, {"name": "Juan D. Ortega-Alvarez", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}], "tags": ["engineering education", "student experiments", "computer aided instruction", "computational models", "computer engineering", "computer-based instruction", "Education", "further education", "teaching", "Electrical engineering", "electric circuit concepts", "Task analysis", "circuit analysis", "rubric", "Computational modeling", "conceptual understanding", "Cognition", "student-generated computational representations", "Integrated circuit modeling", "undergraduate student computational modeling abilities", "Mathematical model", "Media", "simulation", "mental models", "electronic engineering computing"]}, {"title": "A Closer Look at the Differences Between Graders in Introductory Computer Science Exams", "link": "https://ieeexplore.ieee.org/document/8319499/", "abstract": "Contribution: This paper shows how significantly computer science instructors can disagree when grading code writing questions in introductory computer science (CS1) exams. Certain solutions are considered “very good” by some instructors and “very bad” by others. The study identifies four factors as possible contributors to such differences between graders: 1) disagreement on the role of syntax in CS1; 2) absence of objective measures for the seriousness of logic errors; 3) variance in how rubrics are constructed; and 4) the use of subjective judgement while grading. Background: Code writing questions are widely used in CS1 exams. Understanding differences in how graders approach such questions can help the CS education community become more informed about how to design valid assessments for summative and formative purposes. Research Questions: Do graders differ significantly in how they score student programs? What are the main factors to which differences between graders could be attributed? Methodology: A number of CS1 instructors and TAs were asked to score pieces of code resembling student solutions to CS1 exam questions, and were asked to answer open ended questions on how they approach grading in CS1 exams. Responses were then analyzed qualitatively and quantitatively. Findings: There is no consensus on how code writing questions in CS1 exams should be graded. Differences in opinion on how many points to award can be very significant, even for very simple programs and between graders in the same institution. Some graders assign grades that do not necessarily agree with how many points they believe the student solution is worth.", "authors": [{"name": "Ibrahim Albluwi", "affiliation": "Computer Science Department, Princeton University, Princeton, NJ, USA"}], "tags": ["TA", "grades", "student assessment", "Writing", "computer science education", "CS1 instructors", "Education", "manual grading", "Programming profession", "CS education community", "partial credit", "Syntactics", "grading code writing questions", "Data collection", "code resembling student solutions", "rubric", "research questions", "computer science instructors", "Computer science", "educational courses", "CS1 exam questions", "introductory computer science exams", "CS1 exams"]}, {"title": "Scaffolding to Support Problem-Solving Performance in a Bioengineering Lab—A Case Study", "link": "https://ieeexplore.ieee.org/document/8068235/", "abstract": "Background: Engineering programs must equip students to solve open-ended workplace problems. However, the literature points to actual or potential difficulties faced by students in solving open-ended or complex problems. During Fall 2014, the authors' students experienced difficulties in solving open-ended bio-signals laboratory problems of designing input signals to analyze unknown systems via MATLAB programming. These difficulties resulted in low performance. Intended Outcomes: To support, or scaffold, problem-solving in subsequent semesters, a strategy of frequent and timely monitoring and feedback was used. The hypotheses were that these scaffolding strategies would be associated with enhanced performance on open-ended projects, and would support students in similar future work once removed. Application Design: Based upon strategies from the scaffolding literature, assignments that guided problem decomposition were used. Flipped instruction challenged students to prepare for the laboratory by reviewing worked programming examples and completing online assessments. The laboratory sessions were reserved for collaborative, hands-on programming, with instructor oversight, as in a problem-based learning environment. Students submitted frequent progress reports for self-monitoring and feedback throughout each project. Findings: A statistical comparison of project scores across semesters revealed performance improvements with scaffolding. Post-scaffolding assessment in a follow-up course determined scaffolding to be helpful and applicable by these students for similar projects. These preliminary results are important for STEM students and instructors encountering challenges with open-ended problem-solving of this nature, and they provide quantitative evidence recently called for by the STEM scaffolding literature.", "authors": [{"name": "Renee M. Clark", "affiliation": "Engineering Education Research Center, Swanson School of Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}, {"name": "Arash Mahboobin", "affiliation": "Department of Bioengineering, University of Pittsburgh, Pittsburgh, PA, USA"}], "tags": ["Problem-solving", "coaching", "STEM", "self-monitoring", "engineering education", "feedback", "bio-signals laboratory problems", "computer aided instruction", "STEM scaffolding literature", "bioengineering lab", "post-scaffolding assessment", "input signals", "Biomedical engineering", "problem-solving performance", "Education", "Engineering programs", "laboratory sessions", "MATLAB programming", "cognitive apprenticeship", "hands-on programming", "scaffolding", "problem-based learning", "project scores", "actual difficulties", "Employment", "problem decomposition", "open-ended projects", "performance improvements", "progress reports", "workplace problems", "mathematics computing", "open-ended problem solving", "educational courses", "Programming", "online assessments", "STEM students", "course determined scaffolding", "MATLAB"]}, {"title": "Do Female Motives for Enrolling Vary According to STEM Profile?", "link": "https://ieeexplore.ieee.org/document/8338160/", "abstract": "Contribution: Stereotypes and immediate environment are the reasons for low enrollment of women in STEM studies. Background: The low number of women in STEM degree courses has been the subject of much research, which has found that the lack of female enrollment is not evenly distributed across all STEM studies. In some areas, such as computing, communications, and electrical and electronic engineering (CCEEE), not only has the number of women not increased, it has even fallen. Research Questions: Is there a stereotype for women taking STEM studies? Is this stereotype different between women taking CCEEE and non-CCEEE degrees? What are the main reasons that lead women to enroll in STEM studies? Methodology: A survey was sent to 3699 female students and STEM graduates belonging to the authors' university in six schools with a lowest level of enrollment, and 1060 replies were received. A qualitative study based on data analysis triangulation was performed. Findings: The women surveyed consider social stereotypes (31.47%) and the immediate environment (14.5%) as the main reasons for the low enrollment of women in STEM studies. Surprisingly, the third reason (11.03%) is that women do not like engineering. New knowledge concerning what motivates female students to enroll in STEM studies, what stereotypes they must struggle against, and the existence of possible differences between CCEEE and STEM but non-CCEEE female students could help policy makers and academia to improve female enrollment in STEM and, in particular, in CCEEE studies.", "authors": [{"name": "David López", "affiliation": "Computer Architecture Department, Universitat Politècnica de Catalunya (BarcelonaTech), Barcelona, Spain"}, {"name": "Mireia López-Beltrán", "affiliation": "Education Sciences Institute, School of Engineering Barcelona East, Universitat Politècnica de Catalunya (BarcelonaTech), Barcelona, Spain"}, {"name": "M. Núria Salán Ballesteros", "affiliation": "Department of Materials Science and Metallurgical Engineering, Universitat Politècnica de Catalunya (BarcelonaTech), Terrassa, Spain"}, {"name": "Antoni Perez-Poch", "affiliation": "Education Sciences Institute, School of Engineering Barcelona East, Universitat Politècnica de Catalunya (BarcelonaTech), Barcelona, Spain"}, {"name": "Fermín Sánchez Carracedo", "affiliation": "Computer Architecture Department, Universitat Politècnica de Catalunya (BarcelonaTech), Barcelona, Spain"}, {"name": "Noelia Olmedo-Torre", "affiliation": "Graphic Engineering Department, Universitat Politècnica de Catalunya (BarcelonaTech), Barcelona, Spain"}], "tags": ["STEM", "Engineering", "computing-communications-electrical-electronic engineering", "educational institutions", "female motives", "STEM studies", "female enrollment", "gender issues", "female students", "Data analysis", "enrollment", "schools", "human factors", "student diversity", "Optimized production technology", "data analysis", "Statistics", "female", "Sociology", "educational courses", "equality", "CCEEE studies", "STEM graduates", "gender", "Europe", "STEM degree courses", "university"]}, {"title": "Structured Abstracts for the IEEE Transactions on Education", "link": "https://ieeexplore.ieee.org/document/8424522/", "abstract": "In 2018 the IEEE Transactions on Education began requiring structured abstracts for all published papers. This editorial presents the rationale for the decision to require structured abstracts, lists the required sections for the structured abstract, and explains expectations for each section in the structured abstract. The goal of this editorial is to help authors prepare structured abstracts that (i) show advancement of the fi elds of education in areas within the scope of interest of IEEE, (ii) give the reader a clear understanding of the manuscript's content, and (iii) meet the expectations for these abstracts.", "authors": [{"name": "Jeffrey E. Froyd", "affiliation": "Department of Engineering Education, Ohio State University, Columbus, OH, USA"}], "tags": ["structured abstracts", "IEEE Transactions on Education", "manuscript content", "abstracting", "education", "published papers"]}, {"title": "A Multidisciplinary PBL Approach for Teaching Industrial Informatics and Robotics in Engineering", "link": "https://ieeexplore.ieee.org/document/7976355/", "abstract": "This paper describes the design of an industrial informatics course, following the project-based learning methodology, and reports the experience of four academic years (from 2012-13 to 2015-16). Industrial Informatics is a compulsory course taught in the third year of the B.Sc. degree in industrial electronics and automation engineering at the University of the Basque Country (UPV/EHU), Spain. The course had students develop an embedded controller for a 2DoF SCARA robot that drew a specific trajectory. The robot was built with the LEGO Mindstorms kit and the controller was implemented with NXC, a C-like programming language for the NXT brick. In this activity, students became aware of their learning needs and had to work proactively, both autonomously and in teams. The course design achieved several objectives: 1) students learned the course material; 2) soft skills demanded by employers were reinforced; and 3) the material was structured into project tasks for students to perform. The article analyses two indicators: 1) qualification marks and 2) student satisfaction.", "authors": [{"name": "Jerónimo Quesada", "affiliation": "Department of Electronic Technology, University of the Basque Country, Vitoria-Gasteiz, Spain"}, {"name": "Itziar Cabanes", "affiliation": "Department of Systems Engineering and Automatic Control, University of the Basque Country, Vitoria-Gasteiz, Spain"}, {"name": "Oscar Barambones", "affiliation": "Department of Systems Engineering and Automatic Control, University of the Basque Country, Vitoria-Gasteiz, Spain"}, {"name": "Isidro Calvo", "affiliation": "Department of Systems Engineering and Automatic Control, University of the Basque Country, Vitoria-Gasteiz, Spain"}], "tags": ["automation engineering", "course material", "Informatics", "Computing skills", "embedded controller", "Embedded systems", "student assessment", "LEGO Mindstorms kit", "computer aided instruction", "UPV/EHU", "educational institutions", "computer science education", "teaching", "project-based learning", "Robot kinematics", "robotics", "industrial engineering", "control engineering education", "robot programming", "industrial electronics", "control engineering computing", "Basque Country", "Trajectory", "compulsory course", "multidisciplinary PBL approach", "academic years", "C", "educational courses", "engineering curriculum", "industrial informatics course", "2DoF SCARA robot", "Programming", "embedded systems", "course design", "Service robots", "teaching industrial Informatics"]}, {"title": "Agent-Based Simulation of Learning Dissemination in a Project-Based Learning Context Considering the Human Aspects", "link": "https://ieeexplore.ieee.org/document/8068227/", "abstract": "Contribution: This paper presents the “PBL classroom model,” an agent-based simulation (ABS) that allows testing of several scenarios of a project-based learning (PBL) application by considering different levels of soft-skills, and students' perception of the methodology. Background: While the community has made great advances in conducting engineering education studies, achieving goals of meaningful learning is still difficult. In this context, each new teaching methodology should be field tested, which can be time consuming. Introducing a simulation that can pre-test methodologies to check their efficiency can assist in the methodological building process. Research questions: The proposed simulation environment helps in understanding the differences in the learning rate of a group of agents (students) with different levels of humanization and instruction. Methodology: Partial least squares path modeling (PLS-PM) was used to build the causal relationship between the students and a PBL methodology, to generate the input data for the simulation. Based on the analysis of the responses to a survey performed over five consecutive semesters, it was possible to generate some cause-effect data parameters to be used as the input for a hybrid type of ABS, known as PLS agent. Findings: The use of the proposed model, based on a computational approach, to study the educational process was validated; the simulation outcomes indicate that higher levels of self-esteem, self-realization, and cooperation result in better learning experiences.", "authors": [{"name": "Romeu Hausmann", "affiliation": "Department of Electrical Engineering, Regional University of Blumenau, Blumenau, Brazil"}, {"name": "Eduardo Augusto Bezerra", "affiliation": "Department of Electrical Engineering, Federal University of Santa Catarina, Florianópolis, France, LIRMM, Université de Montpellier, Montpellier, France"}, {"name": "Laio Oriel Seman", "affiliation": "Department of Electrical Engineering, Federal University of Santa Catarina, Florianópolis, Brazil"}], "tags": ["PBL classroom model", "project-based learning context", "engineering education", "structural equation modeling", "Cooperative learning", "computer aided instruction", "engineering education studies", "simulation", "Data models", "students", "learning dissemination", "teaching", "field test", "agent-based simulation", "PLS agent", "self-realization", "partial least squares path modeling", "electrical engineering", "teaching methodology", "knowledge transfer", "Analytical models", "meaningful learning", "ABS", "cooperation result", "Computational modeling", "pre-test methodologies", "cause-effect data parameters", "soft-skills", "simulation environment", "educational courses", "Engineering education", "learning rate", "Knowledge engineering", "Mathematical model", "human aspects", "instruction", "PLS-PM", "statistics", "self-esteem", "humanization"]}, {"title": "Bridging Theory and Practice in Programming Lectures With Active Classroom Programmer", "link": "https://ieeexplore.ieee.org/document/8337084/", "abstract": "Contribution: Active classroom programmer (ACP) is a software tool that places minimal pressure on resources, and is shown to help improve student learning while also encouraging a high degree of engagement both during and outside of programming lectures. Background: Programming is difficult for students, largely due to the myriad of ever-advancing concepts. As students gradually become stronger programmers, both within a course and within their degree, they are constantly presented with new and challenging programming concepts regardless of their expertise. While laboratory sessions provide an excellent opportunity for students to independently practice, this does not help them in the programming process where expert scaffolding is desired. Intended outcomes: ACP is intended to engage students with active programming exercises and develop an inductive approach to learning, focusing on developing problem-solving skills. Application design: Students need guidance in the programming strategy rather than the syntax and peculiarities of the particular programming language. ACP allows students to program alongside instructors as new concepts are introduced. Findings: Experience from two concept-rich programming courses at different levels is presented, demonstrating students engaged with ACP both inside and outside lectures to deepen their understanding of the programming concepts.", "authors": [{"name": "Nasser Giacaman", "affiliation": "Department of Electrical and Computer Engineering, University of Auckland, Auckland, New Zealand"}, {"name": "Giuseppe De Ruvo", "affiliation": "Department of Electrical and Computer Engineering, University of Auckland, Auckland, New Zealand"}], "tags": ["Problem-solving", "computer science", "Portable computers", "Encoding", "active programming exercises", "computer aided instruction", "programming language", "computer science education", "computer engineering", "Education", "Programming profession", "Active classroom programmer", "bridging theory", "classroom", "software tool", "programming", "programming process", "concept-rich programming courses", "ACP", "programming concepts", "Active learning", "programming strategy", "programming lectures", "problem-solving skills", "educational courses", "engagement", "student learning", "educational software", "Software"]}, {"title": "Equal But Not Equitable: Self-Reported Data Obscures Gendered Differences in Project Teams", "link": "https://ieeexplore.ieee.org/document/8338079/", "abstract": "Contribution: This paper argues for a shift in how students' team project experiences are assessed. Findings from this paper suggest that it is not enough to consider student-reported data in assessing team dynamics; hidden gendered behavior may be impacting students in ways that students do not realize or report. Background: Although the number of women in engineering is rising, difficulties still exist for female students in electrical engineering and computer science, particularly in team projects. Male and female students may have very different project experiences, due to differing levels of confidence/self-efficacy, difficult team dynamics, or inequitable task division. Research Questions: This paper aimed to elucidate what differences exist in the project experience between male and female students, considering self-reported measures (engineering confidence/self-efficacy, time spent on task, and team satisfaction) and observational study. Methodology: Students completed pre/post-project surveys, weekly logs, and post-project interviews to report and discuss their engineering confidence/self-efficacy, project task selection, and team satisfaction. This paper reports a case study of one student team, observed by a researcher throughout the project course. Findings: While student-reported data implied a lack of gender division (male and female students had the same levels of confidence, completed the same project tasks, and were similarly satisfied with their teams), the observational study implied that the student-reported data may not be telling the whole story. Given the difficult team dynamics observed in the student team (but not reported by students), findings suggest that difficult gender dynamics may go unrecognized by students.", "authors": [{"name": "Laura J. Hirshfield", "affiliation": "Chemical Engineering Department, University of Michigan, Ann Arbor, MI, USA"}], "tags": ["Problem-solving", "computer science", "engineering education", "First year experience", "team projects", "gender dynamics", "project tasks", "team working", "project-based learning", "Electrical engineering", "gender issues", "engineering confidence/self-efficacy", "Interviews", "electrical engineering", "Task analysis", "student-reported data", "female students", "Instruments", "Focusing", "project task selection", "Computer science", "educational courses", "teamwork", "project course", "gender"]}, {"title": "Reflection on System Dynamics Principles Improves Student Performance in Haptic Paddle Labs", "link": "https://ieeexplore.ieee.org/document/8305478/", "abstract": "Contribution: Significant effort has been placed on the development of laboratory exercises for mechanical engineering curricula. Often, however, the exercises are not structured to encourage students to see the labs as a scientific process, instead of a checklist to be completed. Facilitating reflective observation and abstract conceptualization during the concrete experience (CE) of the lab improves student performance. Background: Extensive work has been put into the development of simple, low-cost educational tools to improve learning by supplementing curricula with hands-on experiences. Several devices, including haptic paddles, have been developed to combine dynamics and mechatronics content which culminate in rendering virtual environments. Despite demonstrated student interest in haptic devices and the foundational role of CE in learning, experimental comparisons of learning outcomes over a broad range of devices have had mixed results. Intended Outcomes: Device design can only address the experience portions of the learning cycle-effort put into encouraging and mediating a reflection phase will improve student performance. To test this hypothesis, the performance was compared of groups receiving the standard haptic paddle lab curriculum or a curriculum intended to facilitate reflection. Findings: Students receiving the reflective curriculum had statistically significant higher scores on lab report grades than those receiving the standard, non-reflective curriculum. The increased performance across multiple student GPA quartiles suggests that even modest curriculum changes designed to encourage reflection can improve student performance.", "authors": [{"name": "Janelle P. Clark", "affiliation": "Mechatronics and Haptic Interfaces Laboratory, Rice University, Houston, TX, USA"}, {"name": "Marcia K. O’Malley", "affiliation": "Mechatronics and Haptic Interfaces Laboratory, Rice University, Houston, TX, USA"}, {"name": "Chad G. Rose", "affiliation": "Mechatronics and Haptic Interfaces Laboratory, Rice University, Houston, TX, USA"}, {"name": "Craig G. Mcdonald", "affiliation": "Mechatronics and Haptic Interfaces Laboratory, Rice University, Houston, TX, USA"}], "tags": ["laboratory", "low-cost educational tools", "Tools", "computer aided instruction", "reflective observation", "Performance evaluation", "mechatronics content", "reflective curriculum", "learning outcomes", "system dynamics principles", "learning cycle", "laboratory exercises", "Standards", "multiple student GPA quartiles", "haptic devices", "standard haptic paddle lab curriculum", "concrete experience", "Mechanical engineering", "Haptics", "reflection", "Haptic interfaces", "Mechatronics", "System dynamics", "student performance improvement", "haptic interfaces", "mechanical engineering curriculum", "CE", "educational courses", "reflection phase", "mechatronics", "lab report grades", "mechanical engineering curricula", "abstract conceptualization", "virtual environment rendering", "standard nonreflective curriculum", "undergraduate", "mechanical engineering computing"]}, {"title": "Long Term Effects of Pair Programming", "link": "https://ieeexplore.ieee.org/document/8214246/", "abstract": "Contribution: This paper provides evidence for the benefits of pair programming early in the curriculum on student performance later in the curriculum. It also confirms the short term benefits of partnerships at scale. Background: Engineers often work in teams, both in industry and in academia. Previous work has shown that partnered programming yields higher student performance during the course in which students partner. Research Questions: This paper investigates the long term effects of early curriculum pair programming on student performance in a following course. Specifically, do student partnerships impact long-term student performance in a later course? Are previously observed effects of partner programming robust to a larger sample size? Methodology: This quantitative analysis examines 2468 students in an introductory computer science sequence at a large, public research institution. The data set comprises two academic years and includes partnership participation, project and exam scores, withdraw rates, time between courses, GPA, and gender. Findings: A positive relationship is observed between partnering in an introductory course, and higher project scores in a future course, where all students worked alone (N=1003). Students with the lowest GPAs experienced the greatest benefits. Additionally, results with a large population of students confirm the observations of previous research, showing that partnerships are associated with an overall positive grade impact during the course in which the partnership takes place (N=2468).", "authors": [{"name": "Andrew DeOrio", "affiliation": "Department of Electrical Engineering and Computer Science, University of Michigan, Ann Arbor, MI, USA"}, {"name": "Max O. Smith", "affiliation": "Department of Electrical Engineering and Computer Science, University of Michigan, Ann Arbor, MI, USA"}, {"name": "Andrew Giugliano", "affiliation": "Department of Electrical Engineering and Computer Science, University of Michigan, Ann Arbor, MI, USA"}], "tags": ["observations", "exam scores", "computer aided instruction", "quantitative", "computer science education", "student gender", "pair programming", "Education", "Programming profession", "Statistical analysis", "withdraw rates", "quantitative analysis", "project scores", "Computer science education", "Data structures", "partner programming", "educational courses", "teamwork", "undergraduate", "computer science course", "GPA", "Marine vehicles", "long term effects", "short term benefits"]}, {"title": "A Preliminary Instrument for Measuring Students’ Subjective Perceptions of Difficulties in Learning Recursion", "link": "https://ieeexplore.ieee.org/document/8068262/", "abstract": "Contribution: Findings are provided from an initial survey to evaluate the magnitude of the recursion problem from the student point of view. Background: A major difficulty that programming students must overcome-the learning of recursion-has been addressed by many authors, using various approaches, but none have considered how students perceive this issue. Research Questions: 1) How can an instrument be developed to characterize the main difficulties students encounter, from their subjective perspective, when learning recursion? and 2) How can the quality of the developed instrument be determined? Methodology: 1) A development process was followed to create the instrument. This process included justification of the content, and a quality analysis of the instrument in terms of validity and reliability and 2) the study was on a limited number of students, so should be regarded as preliminary with respect to validity and reliability of results. Findings: 1) An initial survey indicates the magnitude of the recursion problem from the students' point of view; 2) students' perception is that neither motivation, nor their previous knowledge of theoretical concepts on recursion, are factors that affect their learning of the recursion process; and 3) for further statistical analysis, data from a simplified survey proved more valid and more reliable than that from the original survey, for the study sample examined.", "authors": [{"name": "Carmen Lacave", "affiliation": "Department of Technology and Information Systems, Universidad of Castilla-La Mancha, Ciudad Real, Spain"}, {"name": "Miguel A. Redondo", "affiliation": "Department of Technology and Information Systems, Universidad of Castilla-La Mancha, Ciudad Real, Spain"}, {"name": "Ana I. Molina", "affiliation": "Department of Technology and Information Systems, Universidad of Castilla-La Mancha, Ciudad Real, Spain"}], "tags": ["validity", "results reliability", "initial survey", "computer aided instruction", "computer science education", "results validity", "Algorithm design and analysis", "statistical analysis", "higher education", "Education", "teaching", "programming students", "preliminary instrument", "students subject perspective measurement", "learning recursion", "Instruments", "Indexes", "student perception", "program control structures", "subjective perception of recursion", "Computer science", "educational courses", "Reliability theory", "Programming", "quality of surveys", "reliability", "quality analysis"]}, {"title": "Effective Learner-Centered Approach for Teaching an Introductory Digital Systems Course", "link": "https://ieeexplore.ieee.org/document/7999279/", "abstract": "In the Internet era, students have increasingly lost interest in traditional lectures; as a consequence, their learning motivation and exam performance have decreased. The widespread adoption of learner-centered teaching methods that address this issue faces certain barriers, including: 1) the significant faculty effort necessary to prepare e-learning materials; 2) significant extra time required for active online communication with students; 3) student resistance to taking an active role in their education; and 4) lecturers' common belief that learner-centered teaching activities do not allow discussion of all the required topics. This paper presents a case study based on one offering of an introductory digital systems course taught with a combination of learner-centered strategies selected to overcome these barriers and improve student performance. These measures included: 1) improving the student-teacher relationship; 2) applying intriguing, inductive, and counterintuitive approaches to introducing new concepts; 3) adopting puzzle-based quizzes integrated with peer instruction; 4) using an audience response system; 5) replacing certain lectures with tutorials; 6) reducing course duration; and 7) using a graphics tablet. The results obtained demonstrate significant improvements in lecture attendance and in student performance. The author believes that the approach presented here can benefit other engineering educators in similar courses.", "authors": [{"name": "Piotr Dȩbiec", "affiliation": "Institute of Electronics, Lodz University of Technology, Lodz, Poland"}], "tags": ["Internet", "e-learning materials", "computer science", "Electronic learning", "lecture attendance", "computer aided instruction", "computer science education", "learning motivation", "distance learning", "teaching", "instructional design", "classroom", "effective learner-centered approach", "digital system course", "Tutorials", "Active learning", "active online communication", "Resistance", "student performance", "Computer science", "educational courses", "student-teacher relationship", "learner-centered teaching activities", "exam performance", "undergraduate", "learning technology", "audience response system"]}, {"title": "Gendered Risks of Team-Based Learning: A Model of Inequitable Task Allocation in Project-Based Learning", "link": "https://ieeexplore.ieee.org/document/8329003/", "abstract": "Contribution: A conceptual model for task allocation among student teams in project-based learning (PBL) is proposed in this paper, along with a discussion on ways gender can affect teams' apportioning of roles in inequitable ways in STEM PBL. Background: Studies find that men and women report taking on different roles in PBL projects, and that there is a relationship between team gender breakdown and students' satisfaction with PBL teams, with teams less happy with the inclusion of more women. Both male and female students on teams with two or more women report lower team satisfaction than men on teams of just men, or men and women on teams with a single woman Research Questions: How do students self-select, negotiate, and allocate tasks on PBL teams? How does past PBL experience influence task allocation? How does gender affect task allocation? Methodology: First-year students (N = 60) completed reflections about task assignment during a semester-long PBL experience. Findings: Individual student characteristics that are related to gender - including interests, skills, experiences, and self-efficacy - interact with students' goal orientations to lead to individual preferences regarding tasks. Ultimate task allocations are distributed in a non-gender-neutral way following individual preferences.", "authors": [{"name": "Magel P. Su", "affiliation": "Department of Materials Science and Engineering, University of Michigan, Ann Arbor, MI, USA"}, {"name": "Robin R. Fowler", "affiliation": "Program in Technical Communication, University of Michigan, Ann Arbor, MI, USA"}], "tags": ["Resource management", "First year", "Feedback loop", "student experiments", "computer aided instruction", "further education", "team working", "ultimate task allocations", "project-based learning", "gender issues", "team-based learning", "Task analysis", "STEM PBL", "lower team satisfaction", "student teams", "inequitable task allocation", "Professional communication", "Computational modeling", "Solid modeling", "Computer science", "teamwork", "semester-long PBL experience", "team gender breakdown", "gendered risks", "PBL teams", "task allocation", "PBL projects", "task assignment", "gender"]}, {"title": "The Impact of Gender on Conference Authorship in Audio Engineering: Analysis Using a New Data Collection Method", "link": "https://ieeexplore.ieee.org/document/8327945/", "abstract": "Contribution: This paper provides evidence of the lack of gender diversity at audio engineering conferences, using a novel and inclusive gender determination method to produce a new dataset of author gender. Background: Audio engineering has historically been male-dominated; while the number of non-male audio engineers has increased recently, the industry mindset has changed very little. Studies into the gender diversity of this field are required, to force a shift in mindset and create a more inclusive environment. Research Questions: To what extent is there an imbalance in the representation of different genders at audio engineering conferences? Do conference topic, presentation type, or author position have an impact on the gender balance? Methodology: A novel method was designed to obtain pronouns of authors where possible, avoiding removal of data or potential false positives. The main limitation of this methodology is the time required for gender determination. Gender composition was analyzed across 20 conferences, with gender balance further analyzed within four key categories: 1) conference topic; 2) presentation type; 3) position in the author byline; and 4) the number of authors. Findings: This paper demonstrates a clear lack of gender diversity in conference authorship in audio engineering. The results show low overall representation of non-male authors at audio engineering conferences, with significant differences across conference topics, and a notable lack of gender diversity within invited presentations.", "authors": [{"name": "Kat Young", "affiliation": "Audio Laboratory, Communication Technologies Research Group, University of York, York, U.K."}, {"name": "Helena Daffern", "affiliation": "Audio Laboratory, Communication Technologies Research Group, University of York, York, U.K."}, {"name": "Jude Brereton", "affiliation": "Audio Laboratory, Communication Technologies Research Group, University of York, York, U.K."}, {"name": "Michael Lovedee-Turner", "affiliation": "Audio Laboratory, Communication Technologies Research Group, University of York, York, U.K."}], "tags": ["conferences", "STEM", "audio engineering conferences", "Encoding", "underrepresentation", "Electronic mail", "gender composition", "conference authorship", "Industries", "gender issues", "Data collection", "Audio engineering", "bias", "presentation type", "engineering pipeline", "author gender", "gender diversity", "Databases", "inclusive gender determination method", "nonmale audio engineers", "nonmale authors", "Organizations", "conference topic", "new data collection method", "discrimination", "gender balance", "gender", "author byline", "Conferences"]}, {"title": "Analysis of Students’ Ratings of Teaching Quality to Understand the Role of Gender and Socio-Economic Diversity in Higher Education", "link": "https://ieeexplore.ieee.org/document/8327883/", "abstract": "Contribution: This paper contributes to the literature by confirming the existence, in gender and socio-economic diversified higher educational environments, of differential evaluation ratings given by students to their teachers. Background: Women and low socio-economic classes have historically been under-represented, both as students and teachers. Various policies and measures are being put in place internationally to raise their standing, equity, and success as they progress in their careers. To be effective, the after effects of these policies must be investigated and understood. Research Questions: This paper addressed the question of whether gender and socio-economic differences, in both teachers and students, affect students' opinion of their teachers in higher education, across a number of disciplines. Methodology: The research analyzed the differentials in students' ratings of their teachers in five disciplines in the field of education. Data was drawn from student responses to the surveys conducted in a large Indian university at the end of each course unit. The survey questions elicit their perceptions of teaching quality in the disciplines of civil engineering, electrical engineering, computer science engineering, mathematics, humanities and social sciences. This paper analyzes 112 919 and 16 354 complete sets of student ratings, to study the gender and socio-economic diversity based effects respectively. Statistical multivariate and univariate general linear models were used to derive the relevant results and graphs. Findings: The study reveals the existence of socio-economic status bias, gender-typical behavior, gender-atypical behavior, and same-gender and cross-gender biases; these resulted in differential ratings in the disciplines examined.", "authors": [{"name": "Parteek Kumar", "affiliation": "Department of Computer Science and Engineering, Thapar Institute of Engineering and Technology, Patiala, India"}, {"name": "Anika Gupta", "affiliation": "Department of Computer Science and Engineering, Thapar Institute of Engineering and Technology, Patiala, India"}, {"name": "Deepak Garg", "affiliation": "Department of Computer Science and Engineering, Bennett University, Noida, India"}], "tags": ["Indian university", "socio-economic status", "higher educational environments", "student responses", "educational institutions", "higher education", "Education", "further education", "teaching", "student ratings", "socioeconomic classes", "Economics", "gender issues", "teaching quality", "gender-atypical behavior", "same-gender biases", "gender-typical behavior", "teaching evaluations", "Cultural differences", "differential evaluation ratings", "Engineering profession", "data analysis", "educational administrative data processing", "Biological system modeling", "Computer science", "educational courses", "socioeconomic differences", "cross-gender biases", "socioeconomic diversity", "socioeconomic status bias", "Engineering education", "Civil engineering", "gender"]}, {"title": "Guest Editorial Special Issue on Computing in Engineering", "link": "https://ieeexplore.ieee.org/document/8424529/", "abstract": "With the increasing ubiquity of computing, more engineering programs now require their students to take one or more computing courses. At institutions where significant numbers of engineering students take computer courses, computing instructors and educators often assume roles that have them teaching their computing courses for non-majors as service courses, dealing with students with diverse backgrounds and varied motivations. Although teaching computing courses to non-majors is not new, the increasing importance of computing in future undergraduate engineering curricula poses new challenges. In this Special Issue, four of the papers offer insight into, and give evidence of, teaching computing to engineering students; the fifth paper investigates computational modeling abilities in conceptual understanding of electric circuits.", "authors": [{"name": "Leen-Kiat Soh", "affiliation": "Department of Computer Science and Engineering, University of Nebraska, Lincoln, NE, USA"}, {"name": "Stephen Cooper", "affiliation": "Department of Computer Science and Engineering, University of Nebraska, Lincoln, NE, USA"}], "tags": ["Engineering students", "Programming", "Special issues and sections", "Computational modeling", "Computer science education"]}, {"title": "A Case Study of Post-Workshop Use of Simple Active Learning in an Introductory Computing Sequence", "link": "https://ieeexplore.ieee.org/document/8307279/", "abstract": "Background: Active learning (AL) requires students to do more than just listen and take notes. AL is important because of its positive impact on learning, and should be used to some degree in STEM courses. Fortunately, AL can be incorporated into a course in numerous ways, from the simple to the complex. Simple approaches, such as think-pair-share (TPS), often require little or no preparation. Intended Outcomes: The instructor intended to enhance his teaching approach and associated learning outcomes using simple techniques after attending an AL workshop. This case study contributes to the literature on post-workshop adoption of AL, as recently called for. Application Design: The repeated use of simple AL (i.e., TPS, minute paper, and pair programming) was implemented in a digital logic and computer organization/assembly language course sequence. Both courses had previously been taught by the same instructor using lecture only. Exam results in the active semester were compared to previous results, using GPA as a control variable. Findings: Significantly higher exam scores were obtained during the active semester in both courses. The techniques were indirectly assessed by content analysis of student interviews with a research-supported coding scheme; the great majority of students perceived the techniques as helpful to learning, with most citing the ability to converse and work with their classmates to solve problems. The instructor's main observation from his inaugural use of these techniques is that they led to overall gains, and required little or no preparation.", "authors": [{"name": "Samuel J. Dickerson", "affiliation": "Department of Electrical and Computer Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}, {"name": "Renee M. Clark", "affiliation": "Department of Industrial Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}], "tags": ["teaching approach", "post-workshop", "positive impact", "introductory computing sequence", "active semester", "computer aided instruction", "computer science education", "associated learning outcomes", "computer engineering", "simple active learning", "pair programming", "teaching", "adoption", "Programming profession", "Application Design", "digital logic", "content analysis", "a research-supported coding scheme", "student interviews", "electrical engineering", "STEM courses", "higher exam scores", "exam results", "control variable", "Active learning", "AL workshop", "Organizations", "Digital systems", "assembly language", "educational courses", "TPS", "Engineering education", "minute paper", "post-workshop adoption", "think-pair-share", "Conferences", "computer organization/assembly language course sequence"]}, {"title": "Characterizing Engineering Learners’ Preferences for Active and Passive Learning Methods", "link": "https://ieeexplore.ieee.org/document/8024158/", "abstract": "This paper studies electrical engineering learners' preferences for learning methods with various degrees of activity. Less active learning methods such as homework and peer reviews are investigated, as well as a newly introduced very active (constructive) learning method called “slectures,” and some others. The results suggest that graduate students' perception of the usefulness of the activity increases with its level of activity. For undergraduate students, an increased perception of the usefulness of the activity was observed for lightly active but structured learning methods. Group-based analysis focusing on two types of learners, defined as “instructor-dependent” and “instructor-independent” according to their perception of the usefulness of the classroom lectures, was also performed. The results suggest that instructor-independent learners may benefit more from active learning methods than instructor-dependent learners. For example, instructor-independent undergraduate learners were found to perceive the homework assignment as being more useful than the lectures. Such a preference was not seen in the average group data. In fact, no learning method was found to be perceived as more useful than the lectures, on average. Thus this paper illustrates the pertinence of group-based data analysis.", "authors": [{"name": "Camilo Vieira", "affiliation": "Department of Computer and Information Technology, Purdue University, West Lafayette, IN, USA"}, {"name": "Mireille Boutin", "affiliation": "School of Electrical and Computer Engineering, Purdue University, West Lafayette, IN, USA"}, {"name": "Alejandra J. Magana", "affiliation": "Department of Computer and Information Technology, Purdue University, West Lafayette, IN, USA"}], "tags": ["classroom lectures", "passive learning methods", "instructor-independent undergraduate learners", "constructive learning method", "further education", "Electrical engineering", "electrical engineering education", "graduate students", "group-based data analysis", "Engineering students", "peer reviews", "engineering learner preference characterization", "Active learning", "Information technology", "electrical engineering learners", "undergraduate students", "educational courses", "slectures", "instructor-independent learners", "active learning methods", "Learning systems", "structured learning methods", "Blogs", "instructor-dependent learners", "homework assignment"]}]