[{"title": "Incidence of Digital Competences in the Completion Rates of MOOCs: Case Study on Energy Sustainability Courses", "link": "https://ieeexplore.ieee.org/document/9003538/", "abstract": "Contribution: This article analyzes the correlation between users' digital competencies and their tendencies to successfully complete energy sustainability massive online open courses (MOOCs). In addition to reviewing whether digital competencies are a predictor of the effective completion of the course, this article analyzes whether participants acquire higher levels of digital competence through interaction in the course. Background: Completion rates of MOOCs typically range between 5% and 8%, with respect to registered participants. According to the literature, low rates may be due to factors such as students' lack of motivation or digital competence limitations. Research Questions: RQ1: Is there a correlation between the level of digital competence declared by the participants and their tendency to successfully complete the MOOC? RQ2: Does participation in a MOOC improve participants' digital competencies? Methodology: Two surveys, one pretest and one post-test (before and after the MOOCs), were applied to assess the digital competence levels of the participants. The total population of participants in the 12 MOOCs was 123 124 unique users, from which 9075 participants (pretest) - 7.37% of the universe - and 6029 participants (post-test) - 35.70% of the universe - were extracted as a sample. To determine its internal consistency, an exploratory factorial analysis was performed on both instruments and a Cronbach's alpha greater than 0.8 was obtained in all of its dimensions. Findings: A significant level of moderate to high correlation between the declared levels of digital competence and the trend toward successful completion of the MOOCs under study was observed. However, a significant increase was not demonstrated in the levels of digital competence acquired in the interaction with MOOCs. Conclusions: The level of digital competence of a participant in a MOOC was a valid predictor of their tendency to finish it. Although no increase in the levels of digital competence acquired through MOOCs was demonstrated, this may be because the subject matter of the MOOCs was alien to the indicators and dimensions of the digital competence. Further research could analyze the effectiveness of MOOCs in terms of digital competition at the acquired levels of competition.", "authors": [{"name": "Luis M. Romero-Rodríguez", "affiliation": "Universidad Rey Juan Carlos, Madrid, Spain, ESAI Business School, Universidad Espiritu Santo, Guayaquil, Ecuador"}, {"name": "María Soledad Ramírez-Montoya", "affiliation": "School of Humanities and Education, Tecnológico de Monterrey, Monterrey, Mexico"}, {"name": "Jaime Ricardo Valenzuela González", "affiliation": "School of Humanities and Education, Tecnológico de Monterrey, Monterrey, Mexico"}], "tags": ["Tools", "educational courses", "Internet", "digital competition", "technology-enhanced learning", "human factors", "Social network services", "Cronbach's alpha", "Completion rates", "completion rates", "educational institutions", "computer aided instruction", "pretest", "e-learning", "Training", "digital competences", "exploratory factorial analysis", "digital competence limitations", "sustainability", "post-test", "MOOC", "internal consistency", "sustainable development", "Sustainable development", "massive online open courses (MOOCs)", "Correlation", "energy sustainability massive online open courses", "digital competence levels", "online education"]}, {"title": "Tiered Assignments in Lab Programming Sessions: Exploring Objective Effects on Students’ Motivation and Performance", "link": "https://ieeexplore.ieee.org/document/8967142/", "abstract": "Contribution: A model of tiered in-lab, compulsory lab programming sessions suitable for use in flipped learning environments. This article also addresses the scarcity of research that explores the effects of in-class activity organization. Background: When facing a subject they perceive as dry or difficult, some students may feel discouraged from making an effort to learn. Previous research has shown that students have a positive attitude toward assignment tiering, as a form of scaffolding, in voluntary, take-home assignments. Related models either are designed for different settings or have obvious problems with applicability in flipped learning environments. Intended Outcomes: A lab environment that motivates students to learn and consequently to perform better on in-class evaluations and on exams. The approach should be positively received by students. Application Design: Drawing upon the previous teaching experience, the proposed approach is a modification of an assignment tiering model found in the academic literature. With two gated tiered assignments per class, the steepness of the learning curve is alleviated for struggling students, while the injection of deliberate errors, reflexive questions, and ad hoc modification requests keep experienced students engaged with challenging tasks. Findings: The results of the six-year study, performed on an assembly language programming subject, are encouraging: Test groups were better in terms of motivation and performance, and the great majority of students expressed a positive attitude toward the new model.", "authors": [{"name": "Vladimir Simic", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}, {"name": "Vladimir Ciric", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}, {"name": "Ivan Milentijevic", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}, {"name": "Oliver Vojinovic", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}], "tags": ["Tools", "in-class evaluations", "tiered in-lab", "human factors", "lab environment", "assembly language programming subject", "Education", "take-home assignments", "instructional design", "experienced students", "objective effects", "Task analysis", "computer aided instruction", "in-class activity organization", "assignment tiering model", "motivation", "application design", "Programming profession", "performance", "struggling students", "teaching", "Organizations", "computer science education", "laboratory", "compulsory lab programming sessions", "gated tiered assignments", "teaching experience", "assembly language", "Active learning", "Nickel", "flipped learning environments", "related models", "learning curve", "positive attitude"]}, {"title": "Transitioning From Face-to-Face to Blended and Full Online Learning Engineering Master’s Program", "link": "https://ieeexplore.ieee.org/document/8759079/", "abstract": "Contribution: A demonstration of a move from face-to-face to blended learning in an engineering Master's program by adding a parallel online group, which showed the synergy between blended and online approaches in terms of level of interaction, enrollment, student satisfaction, dropout rate, and final grades. Background: Education's transition from traditional face-to-face learning to blended and full online learning can be confronted in different ways. Extensive research has demonstrated that the incorporation of online resources has a positive effect on learning outcomes and can help to assure the continuity of a Master's program. Intended Outcomes: To increase enrollment and student satisfaction, and reduce the dropout rate. Application Design: New equipment and online resources and additional support material allowed students to choose their preferred manner of studying: asynchronous (lecture capture) or synchronous (face-to-face or live broadcast lecture). Findings: The changes increased enrollment and student satisfaction, and lowered the dropout rate. The new methodology significantly improved students' average grades, with no significant differences being found between the blended and online groups. This case study could guide other institutions in the successful implementation of blended and online learning in an engineering Master's degree program.", "authors": [{"name": "Pedro Juan Martínez", "affiliation": "Miguel Hernández University of Elche, Elche, Spain"}, {"name": "Francisco Javier Aguilar", "affiliation": "Miguel Hernández University of Elche, Elche, Spain"}, {"name": "Mario Ortiz", "affiliation": "Miguel Hernández University of Elche, Elche, Spain"}], "tags": ["Face", "Tools", "educational courses", "distance learning", "Software", "blended learning", "Education", "engineering education", "education transition", "computer aided instruction", "enrollment", "Indexes", "Master’s institutions", "open BIM", "parallel online group", "dropout rate", "online learning engineering master", "face-to-face learning", "educational administrative data processing", "online resources", "engineering master degree program", "Buildings", "online groups", "online", "student satisfaction", "Blended learning", "Master’s education", "HVAC"]}, {"title": "Teaching a Standalone Optics and Lasers Course Using Project-Based Learning", "link": "https://ieeexplore.ieee.org/document/9036081/", "abstract": "Contribution: A hybrid approach involving reduced lecture content with project-based learning (PBL) was introduced to a standalone course in optics at an engineering school not specialized in this area, with promising results. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n At most schools, optics is an elective “niche” area involving a single senior course. This presents challenges, since the topic has breadth and depth, leaving little time for application projects. Yet, seniors want future applicability. After many years, the instructor questioned his “broad-brush” approach involving many topics with limited application, especially given the role of optics and photonics in technology leadership. A literature search uncovered recent use of project-based methods for optics in K–12 and community colleges but little use in U.S. universities, suggesting an opportunity. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Intended Outcomes:</italic>\n The authors intended that achievement and valuation by students would be greater with authentic projects and less content. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Application Design:</italic>\n Therefore, an approach that concentrated content and project work on light’s dualistic nature in a mathematically rigorous manner was taken. With reduced content, class time was available for PBL, whereby the problem motivated the content. For light’s wave nature, five lecture weeks were followed by a project simulating the propagation of light. For the particle nature, a circuit design project to implement analog electronic circuits during class occurred after five lecture weeks. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n Student interviews and instructor perspectives on impacts of learning, career preparation, graduate school interest, and in-class engagement uncovered encouraging results. A direct assessment showed significantly higher homework scores with the course changes.", "authors": [{"name": "Mohan Wang", "affiliation": "Swanson School of Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}, {"name": "Kevin P. Chen", "affiliation": "Swanson School of Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}, {"name": "Zachary A. Splain", "affiliation": "Swanson School of Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}, {"name": "Renee M. Clark", "affiliation": "Swanson School of Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}], "tags": ["project-based learning (PBL)", "Integrated optics", "Photonics", "Education", "Lasers", "Biomedical optical imaging", "photonics", "Engineering education", "optics", "Engineering profession", "lasers"]}, {"title": "Model-Based Systems Thinking: Assessing Engineering Student Teams", "link": "https://ieeexplore.ieee.org/document/8895791/", "abstract": "Contribution: A rubric for assessing the systems thinking expressed in conceptual models of technological systems has been constructed and assessed using a formal methodology. The rubric, a synthesis of prior findings in science and engineering education, forms a framework for improving communication between science and engineering educators. Background: Systems thinking is an important skill in engineering, but to date no rubric for assessing this skill based on a formal methodology has been published with reliability and validity measures. Research Questions: (a) What attributes should a rubric for assessing the systems thinking of engineering students comprise? (b) To what extent can such a rubric serve in assessing the systems thinking level of engineering students, as expressed in their conceptual system models? Methodology: Based on a literature review of systems thinking assessment in science and engineering education, the authors classified the systems thinking attributes they had identified into system function, structure, and behavior. Scoring instructions were developed for conceptual system models based on Object-Process Methodology ISO 19450, a formal methodology and language for model-based systems engineering. A total of 142 undergraduate engineering students in 32 teams modeled Web-based systems using the methodology. Each team submitted two models of the same system, at the middle and end of semester. Models were scored using the rubric, and its reliability and validity were evaluated. Findings: Indications of interrater reliability, internal consistency, and construct validity were acceptable, excluding the system function aspect, implying the rubric may be used reliably for its intended purpose.", "authors": [{"name": "Dov Dori", "affiliation": "Faculty of Industrial Engineering and Management, Technion—Israel Institute of Technology, Haifa, Israel, Systems Design and Management Program, Massachusetts Institute of Technology, Cambridge, USA"}, {"name": "Niva Wengrowicz", "affiliation": "Faculty of Industrial Engineering and Management, Technion—Israel Institute of Technology, Haifa, Israel"}, {"name": "Yehudit Judy Dori", "affiliation": "Samuel Neaman Institute, Haifa, Israel"}, {"name": "Rea Lavi", "affiliation": "Faculty of Education in Science and Technology, Technion—Israel Institute of Technology, Haifa, Israel"}], "tags": ["systems engineering", "student assessment", "educational courses", "Internet", "technological systems", "systems thinking", "engineering computing", "model-based systems engineering", "Systems thinking", "object-process methodology ISO 19450", "student teams", "undergraduate engineering students", "model-based systems thinking", "Engineering students", "ISO standards", "Web-based systems", "engineering education", "further education", "undergraduate", "computer aided instruction", "conceptual models", "system function aspect", "Modeling", "rubric", "systems thinking assessment", "formal methodology", "systems thinking level", "conceptual system models", "Reliability", "Assessment tools", "conceptual modeling", "engineering student teams"]}, {"title": "Utilizing Portable Learning Technologies to Improve Student Engagement and Retention", "link": "https://ieeexplore.ieee.org/document/8851404/", "abstract": "Contribution: Portable learning instrumentation has become common in university classrooms and laboratories, but few publications assess the effects of these technologies on student retention. This paper addresses this under-researched connection between the use of portable learning technologies, incorporated into an Introduction to Computer Engineering course, and student retention. Background: The desire for active learning experiences has promoted the use of portable, hands-on technologies in classrooms and laboratories. However, published results from such efforts do not often assess the impact of such tools on student retention. In Fall 2015, the Kansas State University Department of Electrical and Computer Engineering overhauled an introductory computer engineering course, incorporating portable learning tools with the aims to increase student retention, where a secondary focus related to helping students understand the limitations of portable hardware platforms. Intended Outcomes: The goal was to improve student confidence and the retention of first- and second-year students who took the course. Application Design: Laboratory exercises used portable technologies and focused on hardware limitations. Summative surveys helped to quantify the impact of the new course structure on student confidence. The retention of first- and second-year students who took the course was also investigated. Findings: Survey results indicated that the course transformation positively affected student confidence (measured directly and indirectly). Retention of second-year students who took the course improved to a two-year average of 51%, from a 40% average for the three prior years.", "authors": [{"name": "Charles Carlson", "affiliation": "Kansas State University, Manhattan, USA"}, {"name": "Garrett Peterson", "affiliation": "Kansas State University, Manhattan, USA"}, {"name": "Dwight Day", "affiliation": "Kansas State University, Manhattan, USA"}], "tags": ["Tools", "educational courses", "Programming", "portable learning instrumentation", "active learning experiences", "Laboratories", "portable technologies", "portable learning tools", "engineering education", "further education", "Hardware", "university classrooms", "educational institutions", "computer aided instruction", "Task analysis", "Microprocessors", "computer engineering", "student engagement", "student retention", "electrical and computer engineering", "curricula", "portable learning technologies", "computer science education", "Instruments", "introductory computer engineering course", "retention", "Active learning", "portable hardware platforms"]}, {"title": "A Transactive Memory System Perspective in Software Engineering Education", "link": "https://ieeexplore.ieee.org/document/9007353/", "abstract": "Contribution: Results and conclusions on the use of transactive memory system (TMS) in software engineering (SE) education in student project teams that consist of undergraduate and postgraduate students are documented. This can be valuable for the adoption of this learning approach and team formation by other universities and institutes. Background: Preparing students for the SE industry requires bringing them in close collaboration to real-world tasks. This is usually performed via students carrying out software projects, working in teams. In such environments, the knowledge sharing and the interactions within the team are worth investigating, as they can affect the outcome of the student collaboration and can provide insight on how the collaboration is valued by the team members. Research Questions: 1) What is the effect of TMS on students in SE education? 2) Do parameters, such as gender, affect TMS development? 3) Does the inclusion of a project manager with more expertise affect TMS? Methodology: Students were divided into teams working on SE projects. Teams consist of both undergraduate and postgraduate students. Data from students on TMS for consecutive academic years were gathered. Findings: TMS is present in student teams and some of its scale items are affected by parameters, such as the team composition and the project type. TMS also affects performance.", "authors": [{"name": "Styliani Loizou Kleanthous", "affiliation": "Faculty of Pure and Applied Sciences, Open University of Cyprus, Latsia, Cyprus"}, {"name": "Georgia M. Kapitsaki", "affiliation": "University of Cyprus, Nicosia, Cyprus"}, {"name": "George A. Papadopoulos", "affiliation": "University of Cyprus, Nicosia, Cyprus"}], "tags": ["educational courses", "SE projects", "software projects", "team members", "undergraduate students", "Software", "team working", "student project teams", "Education", "transactive memory system (TMS)", "SE education", "further education", "Task analysis", "computer aided instruction", "student collaboration", "postgraduate students", "TMS development", "project manager", "team composition", "project management", "Collaboration", "computer science education", "Project management", "Industries", "transactive memory system", "software engineering education", "software engineering (SE) education", "Software engineering", "software engineering", "SE industry", "learning approach"]}, {"title": "BLDC Motor-Driven Fluid Pumping System Design: An Extrapolated Active Learning Case Study for Electrical Machines Classes", "link": "https://ieeexplore.ieee.org/document/8989979/", "abstract": "Contribution: A project-based active learning approach with the collaborative pedagogical environment is used to train electrical engineers, focusing on loading characteristic of motors where extrapolated knowledge from advanced classes and feedback from the industry professionals are used to engage fellow students to improve their conceptual and applicatory learning. Background: Forces of globalization, including engineering education's multicontingent epistemological structure requiring a broad-based skill set, linking academia, and industry necessitate specific pedagogical intervention. The project-based pedagogy contextually embedded in collaborative environment has proven to serve as an ideal approach to address the scenario. Despite its demonstrated efficacy, its implementation has been sporadic, globally, and systemically within most educational institutions. In that light, this article is expected to stand as a strengthening paradigm simultaneously with conventional didactic orientation to fill that void. Intended Outcomes: Based on the academic needs and industrial demands, the specific techniques employed greater primacy on augmenting content mastery, critical thinking, and problem-solving skills that may have higher sustainability. Application Design: Project-based model that has been tested here is embedded in multidisciplinary and collaborative teaching package emphasizing problem probing and prescription. This approach underlies a very holistic orientation, providing a greater connection between theory and praxis, thereby having a higher appeal to theoreticians, learners, and the end-users. Findings: Extrapolated knowledge from graduate and upper-division undergraduate courses can be used to train lower-division undergraduate students. A positive trend in student learning outcome in power courses and a very positive feedback from industry professionals reflect the active learning model effectiveness accompanied by actual student test scores.", "authors": [{"name": "Ashraf Alshemary", "affiliation": "Bureau of Reclamation, Mills, USA"}, {"name": "Ahmed AbouArkoub", "affiliation": "Mohawk College of Applied Arts and Technology, Hamilton, Canada"}, {"name": "Muhammad M. Haque", "affiliation": "McNeese State University, Lake Charles, USA"}, {"name": "Kaisar R. Khan", "affiliation": "McNeese State University, Lake Charles, USA, Distributed Energy Resource Planning, Eversource Energy, Southborough, USA"}], "tags": ["educational courses", "electrical engineers", "conceptual learning", "fellow students", "collaborative environment", "conventional didactic orientation", "collaborative teaching package", "feedback", "electrical engineering education", "industry necessitate specific pedagogical intervention", "student learning outcome", "Education", "industry professionals", "engineering education", "project-based model", "applicatory learning", "demonstrated efficacy", "educational institutions", "computer aided instruction", "problem-solving skills", "industrial demands", "augmenting content mastery", "project-based pedagogy", "lower-division undergraduate students", "application design", "active learning model effectiveness", "electrical machines classes", "brushless dc (BLDC) motor", "fault tolerance", "Force", "multidisciplinary teaching package", "Pumps", "extrapolated knowledge", "Brushless motors", "optimum pump control", "teaching", "advanced classes", "Collaboration", "electrical engineering computing", "extrapolated active learning case study", "project-based active learning approach", "Industries", "actual student test scores", "prescription", "project-based learning (PBL)", "broad-based skill", "industrial process", "BLDC motor-driven fluid pumping system design", "Active learning", "collaborative pedagogical environment"]}, {"title": "Supporting Self-Directed Learning in a Project-Based Embedded Systems Design Course", "link": "https://ieeexplore.ieee.org/document/9046768/", "abstract": "Contribution: This article shares the learning ecosystem of a project-based embedded systems course, identifying course elements that support self-directed learning and how assignments guide students toward becoming adaptive experts. Background: The technology advances while the fundamentals of electrical engineering remain static. Educators can increasingly prepare students to identify what they need to know to solve problems and avail themselves of resources to learn. This article seeks to further understand ways that a project-based learning approach in an undergraduate embedded systems course can facilitate students' self-directed learning. Research Question: In what ways can a project-based learning approach in an undergraduate embedded systems course facilitates the self-directed learning amongst students? Methodology: This article, conducted in the context of an existing embedded systems design (ESD) course, relied on interviews of students, teaching assistants, and faculty along with document analysis and a mixed inductive-deductive thematic analysis. Findings: A learning ecology of the course is presented. This includes descriptions of space and facilities that influence student motivation, means by which the pedagogical intent of the instructor impacts the student experience, how the course builds on project-based learning knowledge, how the content is distributed using knowledge sharing, how Making supported the ecosystem, how students and instructor occupy similar roles, how the curricular design process was conducted, and how the open ecology promotes student self-direction.", "authors": [{"name": "Steven Weiner", "affiliation": "School for the Future of Innovation in Society, Arizona State University, Tempe, USA"}, {"name": "Micah Lande", "affiliation": "Polytechnic School, Arizona State University, Mesa, USA, South Dakota School of Mines & Technology, Rapid City, USA"}, {"name": "Shawn S. Jordan", "affiliation": "Polytechnic School, Arizona State University, Mesa, USA"}, {"name": "James Larson", "affiliation": "Ira A. Fulton Schools of Engineering, Arizona State University, Tempe, USA"}], "tags": ["project-based learning approach", "educational courses", "iterative prototyping", "Electrostatic discharges", "Education", "engineering education", "further education", "learning ecology", "computer aided instruction", "student motivation", "Adaptive expertise", "electrical engineering", "self-directed learning ecosystem", "Adaptive systems", "project-based learning knowledge", "teaching", "Ecology", "computer science education", "project-based learning", "embedded systems", "Lenses", "student self-direction", "student experience", "project-based embedded systems design course", "self-directed learning", "undergraduate embedded systems design course", "Fabrication", "inductive-deductive thematic analysis", "Embedded systems"]}, {"title": "A Scalable Operating System Experiment Platform Supporting Learning Behavior Analysis", "link": "https://ieeexplore.ieee.org/document/9027831/", "abstract": "Contribution: The design of an operating system (OS) experiment course with a gentle learning curve is proposed and a scalable OS experiment platform supporting learning behavior analysis is presented. Background: In the teaching practice of the OS experiment course, several problems were faced. First, the learning curve for the students is too steep. Second, the OS experiment is hard to scale to a large number of students. Finally, it is difficult to track the learning behaviors of the students and to provide feedback to the teaching plan. Intended Outcomes: By smoothing the learning curve and providing targeted and rapid feedback, students using the system can more effectively master the knowledge of the OS by completing experimental tasks. Application Design: A large number of students can log in to the experiment system and complete multiple labs online. In addition to using automated testing to provide fast feedback, the lab system also collects learning behavior data of the students, enabling the teachers to analyze the data and adjust their teaching plan accordingly. Findings: The performance and learning-behavior data of the students from 2015 to 2018 showed that the OS experiment is effective to scale to a large number of students with satisfiable teaching effectiveness.", "authors": [{"name": "Xiang Long", "affiliation": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Ziqi Zhen", "affiliation": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Hailong Sun", "affiliation": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Lei Wang", "affiliation": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Tianyu Wo", "affiliation": "School of Computer Science and Engineering, Beihang University, Beijing, China"}, {"name": "Bo Jiang", "affiliation": "School of Computer Science and Engineering, Beihang University, Beijing, China"}], "tags": ["educational courses", "operating system experiment course", "Linux", "scalable OS experiment platform", "Virtual machining", "learning behavior analysis", "Education", "lab system", "Task analysis", "computer aided instruction", "Memory management", "Learning behavior", "teaching plan", "Servers", "scalability", "teaching", "scalable operating system experiment platform", "OS experiment course", "automated testing", "operating systems (computers)", "learning-behavior data analysis", "operating system (OS) experiment"]}, {"title": "Improving Teaching–Learning Process in MIL-STD-1553B Bus Classes Using a New Hybrid Web-Lab Methodology", "link": "https://ieeexplore.ieee.org/document/9072314/", "abstract": "This article describes the implementation of a remote access experiment, called Web-lab 1553B (Digital Data Bus Lab), for courses in the Avionics Systems Program. Its main objective is to present a study about the use of two rotation model subgroups: 1) rotation laboratory and 2) station rotation. In the “rotation laboratory” subgroup, the teacher does not need to leave the classroom, once the access (rotation) to the lab is done remotely and not physically. On the other hand, in the “station rotation” subgroup, rotation is performed by changing the experiment functions, and thus students not having to physically change stations. This article shows some preliminary results, which demonstrate that the application of the aforementioned methods not only increases the teaching–learning process effectiveness (quantitative results) but also improves student satisfaction (qualitative results) and motivation. Two comparative tests were carried out to quantitatively verify the impact on the student’s accomplishment: Test 1, following the theory class, and Test 2, following the demo class and lab practice, using the Web-lab 1553B. Results show an average increase of 27.69% in the student grades. Considering qualitative assessments, students’ rates for the Web-lab 1553B method showed that 81.25% of the questions achieved rate “5” (top level), demonstrating that Web-lab meets the desired needs. These assessments serve as data sources for the validation of the hybrid teaching models, concerning classes and laboratory practices, as proposed, showing a high potential for practical implementation in different levels of education institutions.", "authors": [{"name": "J. S. E. Germano", "affiliation": "Instituto Tecnológico de Aeronáutica, São José dos Campos, Brazil"}, {"name": "Daisy Hirata", "affiliation": "Instituto Tecnológico de Aeronáutica, São José dos Campos, Brazil"}, {"name": "P. C. S. Euphrásio", "affiliation": "Instituto Tecnológico de Aeronáutica, São José dos Campos, Brazil"}, {"name": "L. A. Faria", "affiliation": "Instituto Tecnológico de Aeronáutica, São José dos Campos, Brazil"}], "tags": ["Military standards", "education", "Avionics Systems", "Aerospace electronics", "Web-lab", "Computational modeling", "Electronic learning", "blended learning", "MIL-STD-1553B data~bus", "Computers"]}, {"title": "Modeling and Analysis of Inductive “Kickback” in Low Voltage Circuits", "link": "https://ieeexplore.ieee.org/document/8782154/", "abstract": "Contribution: A didactic methodology, based on analytical expressions and experimental validation, to describe the process of abrupt current interruption in a series RL circuit, that considers real passive components and uses a toggle switch as disconnecting device. Background: In undergraduate courses, circuits adopted in transient analysis usually assume electrical switches in their ideal form, disregarding electrical impedance and its variation over time. Texts and instructors rarely point out these simplifications, so students can become confused. There is thus a need for a suitable switch model that yields a behavior consistent with real devices, while permitting a mathematical formulation of the inductor current. Intended Outcomes: That students should understand electrical component modeling, and how models can represent the physical phenomena that occur in electrical circuits. Application Design: An experiment, designed to evaluate students' perceptions of switch modeling, modeled a switch by using three different equivalent circuits of increasing complexity, to allow a more realistic simulation. Electrical switch modeling is described, with the models being based on measurements performed on a real circuit. Findings: Student performance was evaluated qualitatively through test scores, and quantitatively through a post-class questionnaire. The results indicate that 96.15% of the students were able to propose an accurate model of the electrical switch.", "authors": [{"name": "Wesley Beccaro", "affiliation": "Polytechnic School, University of São Paulo, São Paulo, Brazil, Polytechnic School, University of São Paulo, São Paulo, Brazil"}, {"name": "Flavio A. M. Cipparrone", "affiliation": "Polytechnic School, University of São Paulo, São Paulo, Brazil, Polytechnic School, University of São Paulo, São Paulo, Brazil"}, {"name": "Walter Kaiser", "affiliation": "Polytechnic School, University of São Paulo, São Paulo, Brazil, Polytechnic School, University of São Paulo, São Paulo, Brazil"}], "tags": ["educational courses", "electrical impedance", "switches", "Switches", "disconnecting device", "Integrated circuit modeling", "SPICE", "didactic methodology", "engineering education", "transient analysis", "inductors", "low voltage circuits", "experimental validation", "Inductors", "RLC circuits", "student experiments", "series RL circuit", "inductive kickback", "electrical engineering", "simulation", "Mathematical model", "power system transients", "electrical switch modeling", "equivalent circuits", "electrical component modeling", "electrical circuits", "switch model", "inductor current", "Switching circuits", "Active learning", "abrupt current interruption", "modeling"]}, {"title": "An Educational Laboratory Approach for Hybrid Project-Based Learning of Synchronous Machine Stability and Control: A Case Study", "link": "https://ieeexplore.ieee.org/document/8948338/", "abstract": "Contribution: A distinct instructional approach to laboratory activities for power system machines, based on hybrid project-based learning (h-PBL). Students develop their own laboratory procedures and explain their results. This approach creates a positive environment to improve students' problem-solving, and their control design and implementation skills. Background: Prior studies on undergraduate education in electric machines show that power systems control techniques are mostly approached as lectures and simulation tasks, which makes it difficult for students to apply these concepts in real situations. Several studies explored the impact of educational platforms on student learning of various power systems subjects, but further investigation is needed to analyze the influence of the instructional approaches used in applying these educational tools. Intended Outcomes: The h-PBL laboratory activities are intended to foster student learning of power system control by replacing the teacher-led approach with a focus on student-centered real-world applications. This method is also expected to improve student skills in control systems design. Application Design: Students have difficulties implementing power system control techniques in real machines since these are abstract and highly complex. The h-PBL laboratory activities allow students to transition from theory to practice by finding their own solutions to the proposed problems. Findings: The h-PBL laboratory had a positive impact on student learning and grades due to factors that include improving student's critical sense and their problem-solving skills, providing more opportunities for peer-to-peer discussion in group h-PBL activities, and increasing students' interest and motivation to learn through practical engineering applications.", "authors": [{"name": "Felix Alberto Farret", "affiliation": "Center of Excellence in Energy and Power Systems, Federal University of Santa Maria, Santa Maria, Brazil"}, {"name": "André Abelardo Tavares", "affiliation": "SATC Faculty, Criciúma, Brazil"}, {"name": "Daniel Pinheiro Bernardon", "affiliation": "Center of Excellence in Energy and Power Systems, Federal University of Santa Maria, Santa Maria, Brazil"}, {"name": "Luciano Lopes Pfitscher", "affiliation": "Federal University of Santa Catarina, Araranguá, Brazil"}, {"name": "Douglas de Matos Magnus", "affiliation": "Federal University of Santa Catarina, Araranguá, Brazil"}, {"name": "Luis Felipe Bianchi Carbonera", "affiliation": "SATC Faculty, Criciúma, Brazil"}], "tags": ["educational courses", "power system machines", "electronic engineering education", "hybrid project-based learning", "student skills", "Education", "problem solving skills", "further education", "instructional approaches", "power system stability", "teacher-led approach", "computer aided instruction", "student-centered real-world applications", "learning objectives", "student learning", "Regulators", "undergraduate education", "Synchronous machines", "synchronous machines", "educational laboratory approach", "synchronous machine stability", "Generators", "teaching", "Power system stability", "laboratory", "Stability analysis", "Educational technology", "control system synthesis", "educational platforms", "project-based learning (PBL)", "educational tools", "power system control", "control design", "h-PBL laboratory activities", "electric machines", "power system control techniques"]}, {"title": "A Flipped Classroom Approach to Teaching Empirical Software Engineering", "link": "https://ieeexplore.ieee.org/document/8960400/", "abstract": "Contribution: A flipped classroom approach to teaching empirical software engineering increases student learning by providing more time for active learning in class. Background: There is a need for longitudinal studies of the flipped classroom approach in general. Although a few cross-sectional studies show that a flipped classroom approach can increase student learning by providing more time for other in-class activities, such as active learning, such studies are also rare in the context of teaching software engineering. Intended Outcomes: To assess the usefulness of a flipped classroom approach in teaching software engineering. Application Design: The study was conducted at an international master's program in Sweden, given in English, and partially replicated at a university in Africa. Findings: The results suggest that students' academic success, as measured by their exam grades, can be improved by introducing a flipped classroom to teach software engineering topics, but this may not extend to their subjective liking of the material, as measured by student evaluations. Furthermore, the effect of the change in the teaching methodology was not replicated when changing the teaching team.", "authors": [{"name": "Lucas Gren", "affiliation": "Chalmers University of Technology, Gothenburg, Sweden, University of Gothenburg, Gothenburg, Sweden"}], "tags": ["educational courses", "Statistical analysis", "Software", "blended learning", "software engineering topics", "multiculturalism", "flipped classroom", "active learning", "educational institutions", "computer aided instruction", "Online services", "teaching software engineering", "Software measurement", "university", "flipped classroom approach", "teaching", "computer science education", "Engineering education", "international master program", "computer-based instruction", "master’s students", "Active learning", "Software engineering", "empirical software engineering", "software engineering", "student learning"]}, {"title": "JolasMATIKA: An Experience for Teaching and Learning Computing Topics From University to Primary Education", "link": "https://ieeexplore.ieee.org/document/8915746/", "abstract": "Contribution: A learning-by-teaching methodology through games can be used to promote informatics (computer science) in primary and secondary education. Applying the proposed activities can change students' perception of informatics from seeing it as merely using computers to seeing its relationship with mathematics. The experience can also help students acquire competences in teaching. Background: Although students, specifically in primary and secondary education, are increasingly competent in terms of technology use, it has been found that in many cases informatics, as a science, has been relegated to a secondary status; it is usually considered only as a tool or additional resource, and not as an object of study. Intended Outcomes: To refine the application of the learning-to-teach-to-learn (L2T2L) methodology, a learning-by-teaching methodology that has students learn and then, in turn, teach that learning to younger students, in cascade from university to secondary to primary students. To analyze its effects on students' attitudes toward informatics. Application Design: The model incorporates a learning-by-teaching approach in a multistage sequence across different kinds of learners and teachers, using fun, game-like materials. Findings: The use of the action research methodology allowed adjustment of the educational methodology, providing more reliable data and enough experience to suggest how to extend the project to a broader audience. Although the results obtained were less significant than expected, the experience did give students a more realistic view of informatics.", "authors": [{"name": "Jose F. Lukas", "affiliation": "Faculty of Education, Philosophy and Anthropology, University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Edurne Larraza-Mendiluze", "affiliation": "Faculty of Informatics, University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Ana Arruarte", "affiliation": "Faculty of Informatics, University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Olatz Arbelaitz", "affiliation": "Faculty of Informatics, University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}, {"name": "Nestor Garay-Vitoria", "affiliation": "Faculty of Informatics, University of the Basque Country (UPV/EHU), Donostia-San Sebastian, Spain"}], "tags": ["L2T2L", "Tools", "younger students", "Computer science", "Sociology", "informatics", "Mathematics", "Informatics", "secondary education", "primary students", "action research methodology", "learning computing topics", "Education", "educational methodology", "game-like materials", "cross-disciplinary skills", "computer aided instruction", "Action research", "learning-by-teaching approach", "game theory", "gender", "computing skills", "primary education", "Games", "learning-to-teach-to-learn methodology", "teaching", "computer science education", "computer science", "games", "learning-by-teaching methodology", "fun", "learning by teaching"]}, {"title": "As Necessary as the Cleaning Crew: Experiences of Respect and Inclusion Among Full-Time Non-Tenure-Track Electrical Engineering Faculty at Research-Intensive Institutions", "link": "https://ieeexplore.ieee.org/document/9046778/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contribution:</italic>\n This article explores issues of respect and inclusion among full-time non-tenure-track (NTT) electrical engineering faculty. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n NTT faculty members are an important and growing part of electrical engineering programs in the USA. This article complements prior research on NTT faculty member career satisfaction and effectiveness, providing perspectives from the NTT faculty members themselves on their experiences with respect and inclusion. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Research Question:</italic>\n The research question for this article is: How do NTT faculty members experience respect and inclusion in electrical engineering departmental cultures? \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Methodology:</italic>\n Using a qualitative design and semi-structured interview protocol, data were collected via 45-min interviews with 13 full-time NTT engineering faculty. The analysis used thematic coding. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n Most participants in this article work in departmental cultures that diminish their effectiveness. They are keenly aware of whether they feel respected and included in their department and these factors significantly affect their career satisfaction. Many of the participants have been specifically excluded from departmental discussion affecting their work, have suffered the effects of policies that are biased against them, and have been told directly or indirectly that their appointments are not valued by their administration or other faculty.", "authors": [{"name": "Deborah Trytten", "affiliation": "School of Computer Science, Gallogly College of Engineering, University of Oklahoma, Norman, OK, USA"}, {"name": "Cliff Fitzmorris", "affiliation": "School of Electrical and Computer Engineering, Gallogly College of Engineering, University of Oklahoma, Norman, OK, USA"}, {"name": "Randa Shehab", "affiliation": "Gallogly College of Engineering, University of Oklahoma, Norman, OK, USA"}], "tags": ["Electrical engineering", "motivation", "Education", "non-tenure-track (NTT)", "Employment", "inclusivity", "Micromechanical devices", "Contingent", "Interviews", "institutional culture", "Engineering profession", "qualitative", "Cleaning"]}, {"title": "Toward an Improvement of Engineering Teaming Skills Through an In-House Professionalism Course", "link": "https://ieeexplore.ieee.org/document/9049405/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contribution:</italic>\n A modular three-credit undergraduate course that enables students to sharpen their teaming skills is introduced. The course addresses the professional skill gap between recent undergraduate students and what the work environment expects. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n The trend of teaming in the industrial world continues to grow as the demand for team-based projects and problem-solving skills is becoming the norm in any workflow with recruiters now listing teaming as a fundamental requirement for most positions. This drives the educational system to adapt and integrate a new skillset into its various curricula with a view to equipping students with these sought-after skills. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Intended Outcomes:</italic>\n Adoption of a new three-credit nontraditional undergraduate course targeting team-building education and teaming skills acquisition. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Application Design:</italic>\n The design of the course includes project-based learning as well as student-centered learning where team members work on a variety of nontechnical controversial projects, and frequently undergo team/self-assessment on multidisciplinary criteria. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n Based on F1-scores of multiple conceptual and situational examination questions, the assessment survey demonstrates a stark change in students’ understanding of professional skills before and after taking the course, confirming this course’s ability in developing and enhancing the students teaming skills.", "authors": [{"name": "Mohammad Al-Abbas", "affiliation": "Lebanese American University, Beirut, Lebanon"}, {"name": "Zahi Nakad", "affiliation": "Lebanese American University, Beirut, Lebanon"}, {"name": "George E. Nasr", "affiliation": "Lebanese American University, Beirut, Lebanon"}, {"name": "Samer S. Saab", "affiliation": "Lebanese American University, Beirut, Lebanon"}, {"name": "Wissam Fawaz", "affiliation": "Lebanese American University, Beirut, Lebanon"}, {"name": "Chadi Abou Rjeily", "affiliation": "Lebanese American University, Beirut, Lebanon"}, {"name": "Iyad Ouaiss", "affiliation": "Lebanese American University, Beirut, Lebanon"}, {"name": "Raymond Ghajar", "affiliation": "Lebanese American University, Beirut, Lebanon"}], "tags": ["Education", "team building", "team performance", "Micromechanical devices", "Collaborative learning", "Task analysis", "project-based learning", "Companies", "Teamwork", "professional skills", "Industries"]}, {"title": "Predicting Student Performance in an Educational Game Using a Hidden Markov Model", "link": "https://ieeexplore.ieee.org/document/9084102/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contributions:</italic>\n Prior studies on education have mostly followed the model of the cross-sectional study, namely, examining the pretest and the posttest scores. This article shows that students’ knowledge throughout the intervention can be estimated by time-series analysis using a hidden Markov model (HMM). \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n Analyzing time series and the interaction between the students and the game data can result in valuable information that cannot be gained by only cross-sectional studies of the exams. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Research Questions:</italic>\n Can an HMM be used to analyze the educational games? Can an HMM be used to make a prediction of the students’ performance? \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Methodology:</italic>\n The study was conducted on (\n<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$N=854$ </tex-math></inline-formula>\n) students who played the Save Patch game. Students were divided into class 1 and class 2. Class 1 students are those who scored lower in the posttest than class 2 students. The analysis is done by choosing various features of the game as the observations. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n The state trajectories can predict the students’ performance accurately for both classes 1 and 2.", "authors": [{"name": "Manie Tadayon", "affiliation": "University of California at Los Angeles, Los Angeles, CA, USA"}, {"name": "Gregory J. Pottie", "affiliation": "University of California at Los Angeles, Los Angeles, CA, USA"}], "tags": ["Gaussian distribution", "prediction", "Games", "Education", "hidden Markov model (HMM)", "Bayes methods", "Data models", "Trajectory", "time series", "game", "Hidden Markov models", "Time series analysis"]}, {"title": "Engineering Education for Sustainable Development: The European Project Semester Approach", "link": "https://ieeexplore.ieee.org/document/8764594/", "abstract": "Contribution: An analysis of the extent to which sustainability is present in the syllabi, project briefs, report templates, and student final reports of the three Iberian European project semester (EPS) providers, over a five-year period. Background: EPS is a one-semester capstone project framework that adopts project-based learning and multicultural, multidisciplinary teamwork. Educating engineers for sustainable development requires fostering critical and ethical thinking and a desire for equity, solidarity and preservation of natural resources, and cultural and genetic diversity. Existing engineering capstone design programs emphasize solving real world problems, hands-on training, and soft skills, but few focus on sustainability aspects of engineering design. The three Iberian EPS providers adopt project-based learning and teamwork methodologies, promoting the development of transversal skills and addressing sustainability in a multicultural and multidisciplinary background. Intended Outcomes: To show that the three Iberian EPS providers follow these recommendations and contribute to raising students' awareness of sustainable development. Application Design: The proposed sustainability learning assessment method collects evidence from syllabi, project briefs, report templates, and final reports to extract faculty and student perspectives. The sustainability-related terms collected were processed into word cloud format, allowing a simple and intuitive interpretation of students' understanding of sustainability, and in co-occurrence network format, to understand if sustainability has a pervasive or confined presence within the reports. Findings: Iberian EPS faculty and students are aware of the social, economic, and environmental impact of their projects, in terms of quality of life, social responsibility, the use of resources, and environmentally friendly technology.", "authors": [{"name": "Elisabet Arnó", "affiliation": "School of Engineering of Vilanova i la Geltrú, Polytechnic University of Catalonia, Vilanova i la Geltrú, Spain"}, {"name": "Pedro Guedes", "affiliation": "School of Engineering, Porto Polytechnic, Porto, Portugal"}, {"name": "Benedita Malheiro", "affiliation": "School of Engineering, Porto Polytechnic, Porto, Portugal, Centre of Robotics and Autonomous Systems, INESC TEC, Porto, Portugal"}, {"name": "Abel J. Duarte", "affiliation": "School of Engineering, Porto Polytechnic, Porto, Portugal, REQUIMTE/LAQV, ISEP, Porto Polytechnic, Porto, Portugal"}, {"name": "Paulo Ferreira", "affiliation": "School of Engineering, Porto Polytechnic, Porto, Portugal"}, {"name": "Pedro Fuentes-Durá", "affiliation": "School of Design Engineering, Universitat Politècnica de València, Valencia, Spain"}, {"name": "Manuel F. Silva", "affiliation": "School of Engineering, Porto Polytechnic, Porto, Portugal, Centre of Robotics in Industry and Intelligent Systems, INESC TEC, Porto, Portugal"}, {"name": "Ignasi Perat", "affiliation": "School of Engineering of Vilanova i la Geltrú, Polytechnic University of Catalonia, Vilanova i la Geltrú, Spain"}], "tags": ["educational courses", "diversity", "engineering", "Europe", "multidisciplinary teamwork", "report templates", "transversal skills", "project briefs", "engineering education", "Iberian European project semester providers", "student final reports", "engineering design", "computer aided instruction", "sustainability-related terms", "Capstone project", "Economics", "higher education", "sustainability", "student perspectives", "sustainability aspects", "multicultural background", "multicultural teamwork", "European project semester approach", "Engineering education", "sustainable development", "sustainability learning assessment method", "one-semester capstone project framework", "Sustainable development", "Iberian EPS providers", "European project semester", "Tag clouds", "engineering capstone design programs", "multidisciplinary background", "addressing sustainability", "Teamwork", "syllabi"]}, {"title": "Effects of Applying the Havruta Method in Class: A Study on Targeting Learner Variables in the “General Physics and Experiments 2” Class", "link": "https://ieeexplore.ieee.org/document/9107444/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contribution:</italic>\n This article aims to explore learner variables that predict the effectiveness of university class using the Havruta method. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n This article was conducted on 105 learners enrolled in the “General Physics and Experiments 2” class at K University in South Korea. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Research Questions:</italic>\n Independent and dependent variables were selected from previous studies to predict the effectiveness of the Havruta method in a university class. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Methodology:</italic>\n Descriptive statistics, such as frequency and averages, were used to analyze the general characteristics of the subjects, and Pearson’s \n<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$r$ </tex-math></inline-formula>\n was used to check for correlation among all variables. Variables that predicted learning satisfaction and flow were evaluated through the multiple regression analysis. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n The results indicate that the independent variable, “openness to learning opportunities” significantly explained learning satisfaction by 16.1%. Together with “initiative and independence in learning,” they were significant in explaining the learning flow by 32.2%. These findings have practical application in universities in integrating the Havruta method to their classes.", "authors": [{"name": "Mi Ri Eom", "affiliation": "Center for Teaching and Learning, Korea University, Seoul, South Korea"}, {"name": "Young In Lee", "affiliation": "Kwangwoon University, Seoul, South Korea"}], "tags": ["Education", "instructional method", "Correlation", "discussion", "Physics", "Dielectric measurement", "Regression analysis", "educational effectiveness", "Havruta method", "Debating", "Creativity", "Problem-solving"]}, {"title": "Teaching Battery Basics in Laboratories: Hands-On Versus Simulated Experiments", "link": "https://ieeexplore.ieee.org/document/9027123/", "abstract": "Contribution: Prior studies comparing the effectiveness of different laboratory learning modes do not allow one to draw a universally valid conclusion, as other influences are mixed with the learning modes. In order to contribute to the existing body of work and to add another piece to the puzzle, this article demonstrates an improved methodology to evaluate the effectiveness of computer-simulated laboratories in comparison to hands-on exercises using a battery basics practical course as a case study. Background: Computer-simulated experiments are becoming increasingly popular for conducting laboratory exercises in higher education and vocational training institutions. To ensure the consistent quality of laboratory learning, an accurate comparison between the results of simulated experiments and practical hands-on experiments is required. Intended Outcomes: In this article, the achievement of the following learning objectives were compared between the two laboratory modes: 1) comprehension of the most important parameters of battery cells and 2) knowledge on how these parameters can be determined using adequate experimental procedures. Application Design: To avoid interference of factors other than laboratory mode on the learning, laboratory instructions and experimental interfaces ensured identical execution of the experiments in the compared modes. Using a counterbalanced methodology, the two laboratory modes alternated by the session, while the experimental procedures remained constant regardless of the respective modes. Findings: Tests taken by the participants after conducting the laboratory experiments revealed that hands-on laboratories resulted in statistically significantly better student performance than simulated laboratories. This difference was even more pronounced for the participants that finished a vocational education and training program before the university studies.", "authors": [{"name": "Fabian Steger", "affiliation": "Faculty of Electrical Engineering and Computer Science, Technische Hochschule Ingolstadt, Ingolstadt, Germany, School of Electrical and Computer Engineering, Royal Melbourne Institute of Technology, Melbourne, Australia"}, {"name": "Iouri Belski", "affiliation": "School of Engineering, Royal Melbourne Institute of Technology, Melbourne, Australia"}, {"name": "Katja D. Brade", "affiliation": "Center of Applied Research, Technische Hochschule Ingolstadt, Ingolstadt, Germany"}, {"name": "Alexander Arbesmeier", "affiliation": "University of Vienna, Vienna, Austria"}, {"name": "Alexander Nitsche", "affiliation": "Center of Applied Research, Technische Hochschule Ingolstadt, Ingolstadt, Germany"}, {"name": "Hans-Georg Schweiger", "affiliation": "Faculty of Electrical Engineering and Computer Science, Technische Hochschule Ingolstadt, Ingolstadt, Germany, Center of Applied Research, Technische Hochschule Ingolstadt, Ingolstadt, Germany"}], "tags": ["educational courses", "vocational training", "energy storages", "laboratory techniques", "hands-on", "Laboratories", "Electrical resistance measurement", "vocational training institutions", "electrical engineering education", "compared modes", "Voltage measurement", "teaching battery basics", "Education", "Battery", "practical hands-on", "further education", "educational institutions", "computer aided instruction", "learning objectives", "computer-simulated laboratories", "laboratory exercises", "laboratory experiments", "laboratory instructions", "laboratory learning modes", "higher education", "electrical engineering", "simulation", "Batteries", "Discharges (electric)", "teaching", "hands-on exercises", "electrical engineering computing", "computer-simulated experiments", "laboratory learning", "Resistance", "laboratory mode", "student experience", "knowledge gain", "respective modes"]}, {"title": "Blending Inverted Lectures and Laboratory Experiments to Improve Learning in an Introductory Course in Digital Systems", "link": "https://ieeexplore.ieee.org/document/8941026/", "abstract": "Contribution: An improved inverted lecturing (IIL) framework based on blending flipped lectures and handson experiments provides instructional benefits, compared to traditional teaching (TT) and inverted lecturing (IL), in an introductory course in digital systems. Background: IL has proven more effective than TT in improving student learning in engineering courses, but has mostly been used for theory sessions. The impact of combining inverted lectures and hands-on experiments on student learning has not still been thoroughly assessed in engineering courses. Intended Outcomes: Attendance, marks, and satisfaction should improve for students in IL-based theory lectures, compared with those receiving TT, and should improve still further for students receiving the IIL-based method. Workload both for student and instructor should not increase significantly. Application Design: The three methods were compared in six consecutive offerings of the course. In the first two, TT was used for both theory and laboratory classes; in the next two, IL was used for theory lectures; and in the final two offerings the IIL-based scheme was used. The instructor, intended learning outcomes (ILOs), course syllabus, and student grading scheme were constant over the six semesters. A total of 184 students with similar backgrounds participated. Findings: Students under the ILand IIL-based frameworks were more engaged than those receiving TT, and were more satisfied with their learning process. The IIL-based learners achieved the deepest conceptual understanding. Finally, the ILand IILbased methods did not significantly increase workload for either the students or the instructor.", "authors": [{"name": "Roberto Zangróniz", "affiliation": "University of Castilla–La Mancha, Cuenca, Spain"}, {"name": "José Joaquín Rieta", "affiliation": "BioMIT.org, Universitat Politecnica de Valencia, Valencia, Spain"}, {"name": "Arturo Martínez-Rodrigo", "affiliation": "University of Castilla–La Mancha, Cuenca, Spain"}, {"name": "Raúl Alcaraz", "affiliation": "University of Castilla–La Mancha, Cuenca, Spain"}], "tags": ["educational courses", "student perception", "engagement", "hands-on experiments", "course syllabus", "Europe", "digital systems", "Logic gates", "flipped classroom", "Digital systems", "Education", "Digital circuits", "Logic functions", "IIL-based method", "computer aided instruction", "laboratory experiments", "improved inverted lecturing framework", "introductory course", "Communications technology", "teaching", "IL-based theory lectures", "laboratory", "traditional teaching", "laboratory classes", "blending inverted lectures", "blending flipped lectures", "engineering courses", "Active learning", "IIL-based learners", "student grading scheme", "student learning"]}, {"title": "Nonparametric Analysis of the Effect of Knowledge Integration Activities on Third-Year Undergraduate Performance", "link": "https://ieeexplore.ieee.org/document/9103977/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contribution:</italic>\n This article presents quantitative support that the changes implemented as part of Colorado State University’s (CSU’s) Revolutionizing Engineering Departments (REDs) grant produce statistically significant positive change through a series of nonparametric analysis techniques. Additionally, the set of nonparametric analysis techniques provides a novel approach to quantitatively analyzing student data after significant pedagogical changes are made to the undergraduate curriculum. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n As part of the grant, a series of significant pedagogical changes were made to the electrical and computer engineering (ECE) undergraduate curriculum. A large portion of these changes relates to knowledge integration techniques, which are used to highlighting the intricate relationships between the three topics of electronics, signals and systems, and electromagnetics. This article presents an analysis of the outcomes that are in part due to these changes. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Intended Outcomes:</italic>\n As a result of the grant and the associated curriculum changes, it was anticipated that the cumulative in-major grade point average for third-year students would increase. It was also anticipated that the in-major intercourse grades would be more positively correlated. The analysis techniques that were used provide novel examples of applications to student data. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Application Design:</italic>\n The implemented changes described in this article directly follow from the goals of the National Science Foundation’s RED program. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n Three nonparametric analysis techniques are performed on a collection of data from ECE undergraduates that was collected over 20 years. It is shown that the intertopical correlations between courses increase immediately following the implementation of the intervention discussed in this article, and statistically, significant evidence is presented supporting that the distribution of grades has positively changed following the intervention.", "authors": [{"name": "Edwin K. P. Chong", "affiliation": "Colorado State University, Fort Collins, CO, USA"}, {"name": "Anthony A. Maciejewski", "affiliation": "Colorado State University, Fort Collins, CO, USA"}, {"name": "Christopher Robbiano", "affiliation": "Colorado State University, Fort Collins, CO, USA"}], "tags": ["Principal component analysis", "National Science Foundation (NSF)", "principal component analysis (PCA)", "Education", "Power supplies", "Computer engineering", "computer science", "correlation", "Kolmogorov–Smirnov (KS) distance", "Linear systems", "Correlation", "Revolutionizing Engineering Department (RED)", "Knowledge engineering", "knowledge integration (KI)", "electrical engineering"]}, {"title": "Idea Generation Practices in a Biomedical Engineering Capstone Course", "link": "https://ieeexplore.ieee.org/document/8720259/", "abstract": "Contribution: This paper examines ideation practices of biomedical engineering (BME) students in a capstone design course during a designated team ideation session and provides recommendations for structuring idea generation instruction. Background: Capstone courses provide students with opportunities to engage with open-ended and complex engineering problems requiring knowledge from multiple disciplines. Limited work has focused on how BME students engage in idea generation in capstone courses. Yet, success in solving problems depends on how students engage with and organize their idea generation efforts. Research Questions: What design activities do BME students engage in during a session designated for idea generation? What factors impact how students approach their ideation sessions and select the ideation approaches to use in a design course? Methodology: Five student teams were recorded during their idea generation sessions. Post-session interviews were conducted with a subset of students. Qualitative analysis of transcripts revealed themes related to design activities and factors impacting idea generation. Findings: Students commonly moved into convergent idea evaluation activities during generation. Their approaches to ideation were influenced by course activities and structures, design requirements, and sponsor feedback.", "authors": [{"name": "Shanna R. Daly", "affiliation": "University of Michigan, Ann Arbor, USA"}, {"name": "Aileen Huang-Saad", "affiliation": "University of Michigan, Ann Arbor, USA"}, {"name": "Anastasia K. Ostrowski", "affiliation": "University of Michigan, Ann Arbor, USA, MIT Media Lab, Massachusetts Institute of Technology, Cambridge, USA"}, {"name": "Colleen M. Seifert", "affiliation": "University of Michigan, Ann Arbor, USA"}], "tags": ["Tools", "educational courses", "biomedical engineering capstone course", "design process", "Biomedical engineering", "engineering education", "biomedical education", "design education", "BME students", "idea generation sessions", "computer aided instruction", "Knowledge engineering", "design requirements", "idea generation", "biomedical engineering students", "post-session interviews", "capstone design course", "capstone projects", "idea generation instruction", "Stakeholders", "team ideation session", "complex engineering problems", "Interviews", "convergent idea evaluation activities", "Teamwork"]}, {"title": "Assessing the Effectiveness of Using Fab Lab-Based Learning in Schools on K–12 Students’ Attitude Toward STEAM", "link": "https://ieeexplore.ieee.org/document/8952636/", "abstract": "Contribution: The NEWTON fabrication laboratory (Fab Lab) Education Initiative assesses the effectiveness of Fab Lab-based learning on K-12 students' attitude toward learning science, technology, engineering, art, and mathematics (STEAM). It considers two aspects: 1) students' motivation and affective state and 2) students' observations and perception of Fab Lab-based learning. Background: Fab Labs are described as small workshops equipped with a set of computer-controlled tools (e.g., 3-D printers) that offer personalized digital fabrication. They have been shown to have a positive impact on learners' academic and personal growth when used in extracurricular activities, but little research examines whether integrating Fab Labs into school curricula can help raise student interest in STEAM education. Research Question: Can Fab Lab-based learning foster students' interest in STEM in primary and secondary schools? Would students be keen to use Fab Labs in their science classes? Methodology: Two case studies were carried out in two different schools as part of the European Horizon 2020 NEWTON project. The study had 39 participants; three different surveys were used to assess different constructs. Findings: Results show that after using the Fab Lab-based learning: 1) students felt more interested in science classes as well as more engaged and less bored and 2) while some students struggled at first when manipulating Fab Lab tools, they adapted quickly and reported that they would like to use Fab Labs as part of their science classes.", "authors": [{"name": "Gabriel-Miro Muntean", "affiliation": "Performance Engineering Laboratory, Dublin City University, Dublin 9, Ireland"}, {"name": "Gianluca Cornetta", "affiliation": "Universidad San Pablo—CEU, Campus de Monteprincipe Alcorcón, Madrid, Spain"}, {"name": "Covadonga Lorenzo", "affiliation": "Universidad San Pablo—CEU, Campus de Monteprincipe Alcorcón, Madrid, Spain"}, {"name": "Mohammed Amine Togou", "affiliation": "Performance Engineering Laboratory, Dublin City University, Dublin 9, Ireland"}], "tags": ["Tools", "educational courses", "fab lab-based learning", "3-D modeling", "fab lab tools", "electronic engineering education", "Printers", "engagement", "EU Horizon 2020 NEWTON project", "STEAM education", "Education", "Task analysis", "computer aided instruction", "educational institutions", "student experiments", "K-12 students", "computer-controlled tools", "collaborative learning", "NEWTON fabrication laboratory education", "Ceramics", "science-technology-engineering-art-and-mathematics", "computer science education", "K???12 education", "students motivation", "STEM", "Fabrication", "digital fabrication", "Teamwork"]}, {"title": "Using Continuous Peer Evaluation in Team-Based Engineering Capstone Projects: A Case Study", "link": "https://ieeexplore.ieee.org/document/9007387/", "abstract": "Scholarship of Application. Background: Capstone courses constitute the culminating experience in engineering curricula. A core characteristic is the student team and project-based nature, with many team deliverables. The ensuing difficulty is to fairly assess the individual team member's contribution toward the team effort. Contribution: The method presented here is based on weekly peer evaluation of the individual team member's contribution, which subsequently yields a participation factor (PF), in turn scaling the team grade in accordance with the individual student performance. Intended Outcome: This method allows the timely adjustment of the individual student effort to match the group expectations and rewards high-performing students by making higher individual grades than the team average possible, while penalizing underperforming free riders by not benefiting from other student's performance. Application Design: The method allows students to continuously calibrate their own and their teammate's expectations and improve their peer score by adjusting their individual efforts. This feedback also requires students to practice professional communication, and in particular giving and receiving critical feedback, and thus is highly aligned with industry needs. Findings: Results evaluated over three iterations of the assessment process indicate a weak positive correlation (0.26) of the peer evaluation with the individual instructor-graded deliverables as well as the individual student grade point average (GPA, 0.23). Further, survey-based data indicate student agreement that the PF is a fair reflection of the individual performance, and a neutral perceived overall assessment system effectiveness, with reported primary barriers being the difficulty in assigning fair peer grades and of open, critical discussion.", "authors": [{"name": "Andrew J. Goupee", "affiliation": "University of Maine, Orono, USA"}, {"name": "Wilhelm A. Friess", "affiliation": "University of Maine, Orono, USA"}], "tags": ["student assessment", "educational courses", "senior design", "Mechanical engineering", "team working", "team grade", "student performance", "survey-based data", "Sensitivity", "Education", "individual instructor-graded deliverables", "engineering education", "computer aided instruction", "student agreement", "team-based engineering capstone projects", "undergraduate education", "student team", "team member", "computer science education", "project-based learning", "Industries", "Grading systems", "Correlation", "continuous peer evaluation", "team effort", "teamwork", "Teamwork"]}, {"title": "A Design-Oriented Engineering Course Involving Interactions With Stakeholders", "link": "https://ieeexplore.ieee.org/document/9069936/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contribution:</italic>\n A novel project-based learning (PBL) approach applicable to diverse design-oriented engineering courses. This article reports the application results during six academic years (2012/13 to 2017/18) for electronic instrumentation (EI) course for third-year Industrial Electronic and Automation Engineering majors. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n Engineering education should prepare students to specify, design, and validate systems interacting with stakeholders in complex professional scenarios. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Intended Outcomes:</italic>\n The general aim of the course was to train students in the specification, design, and validation of real-world instrumentation systems, promoting the development of expertise and deep understanding of fundamental concepts and techniques. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Application Design:</italic>\n The students, working in teams, were tasked with the specification, design, and development of different instrumentation projects. They had to exchange information about their projects with other teams and discuss design decisions, thus creating a multiple-case experience. In addition, each team acted as a provider of a different team and as a client of another team, in a circular client–provider relationship. This student-centered learning process was supported and complemented with guided teaching of fundamental concepts, principles, and techniques and with continuous evaluation, complemented with rigorous individual exams. The project activities, lectures, and problem-solving classes were coordinated to optimize the process of developing the students’ understanding and expertise. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n Based on the academic results and the feedback from the students obtained along the years through two different anonymous surveys, it is concluded that most of the students achieved the expected learning outcomes, i.e., learning to design EI systems and dealing with stakeholders. Analyzed results proved that students were very satisfied with the methodology.", "authors": [{"name": "Isidro Calvo", "affiliation": "University of the Basque Country (UPV/EHU), Vitoria-Gasteiz, Spain"}, {"name": "Manuel Castro", "affiliation": "Spanish University for Distance Education (UNED), Madrid, Spain"}, {"name": "Jerónimo Quesada", "affiliation": "University of the Basque Country (UPV/EHU), Vitoria-Gasteiz, Spain"}, {"name": "Javier Sancho", "affiliation": "University of the Basque Country (UPV/EHU), Vitoria-Gasteiz, Spain"}, {"name": "Rafael Sebastián", "affiliation": "Spanish University for Distance Education (UNED), Madrid, Spain"}], "tags": ["project-based learning~(PBL)", "Stakeholders", "Automation", "Course design", "Task analysis", "Engineering education", "Instruments", "electronics engineering education", "electronic instrumentation (EI)", "inductive learning", "Industrial electronics"]}, {"title": "Use of a Cornerstone Project to Teach Ill-Structured Software Design in First Year", "link": "https://ieeexplore.ieee.org/document/8957041/", "abstract": "Contribution: A first-year programming course was redesigned with a large, open-ended robotics project. The course design aligns with best practices for promoting development of students' self-efficacy in solving ill-structured software design problems. Background: From Jonassen's theory, problem-solving outcomes are dependent on the problem structure, complexity, and representation; and the characteristics of the solver. These characteristics are diverse, including knowledge, familiarity, and psychometric qualities of the solver (e.g., self-efficacy and motivation). Thus, better problem-solving outcomes are dependent on the development of these traits, and on the problem characteristics. Intended Outcomes: Pre-2010, course learning activities and assessments overly focused on syntax. The course was redesigned with a focus on ill-structured problem solving and design in high-fidelity problem domains. Application Design: Complex and ill-structured lecture examples, assignments, and exams were redesigned to reinforce the importance of software design and problem solving. An open-ended cornerstone project using robotics was added as a structured means of providing students practice with solving ill-structured and open-ended problems. The assignment and exam questions, with the course cornerstone project, achieve instructional alignment in the course. Findings: The results show that students' self-efficacy improved from start to end of term. The course design achieves several objectives: 1) students learned the requisite programming skills; 2) students developed their self-efficacy in programming and design; and 3) students demonstrated strong problem-solving outcomes.", "authors": [{"name": "Christopher Rennick", "affiliation": "Engineering Ideas Clinic, University of Waterloo, Waterloo, Canada"}, {"name": "Carol C. W. Hulls", "affiliation": "University of Waterloo, Waterloo, Canada"}], "tags": ["educational courses", "open-ended robotics project", "Robots", "Complexity theory", "human factors", "Computing skills", "open-ended problems", "self-efficacy", "design projects", "instructional design", "team-based learning", "problem structure", "Task analysis", "computer aided instruction", "Software design", "course cornerstone project", "Problem-solving", "first-year programming course", "course learning activities", "Programming profession", "application design", "ill-structured software design problems", "structured means", "teaching", "computer science education", "project-based learning", "problem characteristics", "high-fidelity problem", "strong problem-solving outcomes"]}, {"title": "Grounding Concepts and Methods of Real-Time Scheduling in Reality Using Arduino", "link": "https://ieeexplore.ieee.org/document/9031740/", "abstract": "Contribution: There exist software tools designed for professional or research purposes that may serve for grounding the learning of real-time scheduling within introductory courses. This article contributes with a hardware and software infrastructure aimed at improving the learning process of the essentials of real-time scheduling in undergraduate courses. Background: Engineering students need to acquire a solid understanding of the scheduling topic due to the importance of real-time systems; affordable, open, and simple approaches focused on the essentials are needed that fit with limited changes and cost into existing courses. Intended Outcomes: A relatively low-cost solution close to the nuts and bolts of the scheduling problem; mild changes in the existing syllabi to fit the corresponding lab exercises and seminars; improved academic results. Application Design: A hardware and software infrastructure based on the Arduino, FreeRTOS, and some MATLAB scripts have been carefully designed, along with a number of practical exercises that focus on grounding the essential concepts of the topic in reality. A rigorous analysis procedure has assessed the approach. Findings: A promising trend in the improvement in academic results, a stronger understanding of real-time scheduling both theoretically and when applied to real systems, a relatively low cost of implementation and use, and an easy integration into a quite common introductory course on real-time systems at the undergraduate level.", "authors": [{"name": "Cipriano Galindo", "affiliation": "University of Málaga, Málaga, Spain"}, {"name": "Juan-Antonio Fernández-Madrigal", "affiliation": "University of Málaga, Málaga, Spain"}], "tags": ["educational courses", "affordable approaches", "existing syllabi", "Software", "low-cost solution", "undergraduate courses", "essential concepts", "learning process", "Grounding", "microcontrollers", "professional research purposes", "Real-time systems", "mathematics computing", "Hardware", "Task analysis", "computer aided instruction", "real-time systems", "real-time scheduling", "Matlab", "common introductory course", "Computer engineering", "open approaches", "scheduling problem", "simple approaches", "academic results", "computer science education", "software tools", "grounding concepts", "embedded systems", "scheduling topic", "operating systems (computers)", "introductory courses", "software infrastructure", "Processor scheduling"]}, {"title": "Implementing a Design Thinking Project in a Biomedical Instrumentation Course", "link": "https://ieeexplore.ieee.org/document/9031690/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contribution:</italic>\n This article illustrates how to design and implement a Design Thinking project in a biomedical instrumentation course as a bridge between education and industry. It also presents the effect of the project on student perceptions of their learning gains and their postgraduate preparedness. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n Biomedical engineering continues to experience strong growth, with instrumentation being one of the top three segments of the industry. Design Thinking is a desirable skill in the industry, is highly applicable to the human-centered outcomes of biomedical instrumentation, and has documented a positive impact on student learning. Therefore, Design Thinking implementation in a biomedical instrumentation course would be valuable, but has yet to be accomplished. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Intended Outcomes:</italic>\n The implementation of a Design Thinking project is expected to increase student learning and postgraduate preparedness. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Application Design:</italic>\n A Design Thinking project was designed and implemented in an upper level biomedical instrumentation course. This article describes the structure of the project, for example, student outcomes and its assessment. The “Student Assessment of Learning Gains” instrument and a postgraduate survey were used to evaluate student perception of their learning and postgraduate preparedness. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n The critical elements of Design Thinking were successfully implemented into a four-week biomedical instrumentation project experience within the instrumentation course. Students perception of their learning was significantly increased by the Design Thinking project. A postgraduate survey indicated a positive influence of the project on student preparedness for industry and graduate studies.", "authors": [{"name": "Emily J. Farrar", "affiliation": "Messiah College, Mechanicsburg, PA, USA"}], "tags": ["project-based learning (PBL)", "student learning", "Employment", "Aerospace electronics", "undergraduate", "Bridges", "Biomedical instrumentation", "design thinking", "Instruments", "Prototypes", "Biomedical measurement", "Industries"]}, {"title": "The Effect of Internships on Computer Science Engineering Capstone Projects", "link": "https://ieeexplore.ieee.org/document/8782630/", "abstract": "Contribution: Internships designed to provide training and an initial period of contact with industry, prior to a computer science engineering capstone project, have a very positive impact on both industry and academic capstone projects. Background: Internships and capstone projects are widely used to integrate work-related learning in computer engineering curricula. Both activities offer numerous benefits for students, industry, and academia. Although their effects have been extensively studied separately, the interaction between them remains unexplored. Research Questions: What is the effect of internships on the development of a subsequent capstone project? Methodology: The hypothesis was that the completion of an internship will have positive effects on several aspects of the capstone projects: 1) improved student competencies; 2) improved capstone project outcomes; and 3) decreased supervision effort. Further, these positive effects were expected to be greater in industry-based projects than in academic projects. The hypothesis was tested through a quantitative study of data collected from 274 computer science engineering capstone projects. A period of time with internships was compared with another period without internships, and differentiating between academic and industry projects. Findings: Internships prior to capstone projects improve student skills in autonomy, technology, methodology, and project management; increase the complexity and technological novelty of the resulting projects; and reduce advisor involvement in practical (technology, execution) and keep-the-project-alive issues, and increase advisor involvement in monitoring student work (meetings, reports, and initial arrangements). This effect was observed in both industrial and academic projects.", "authors": [{"name": "Juan J. Olarte", "affiliation": "Universidad de La Rioja, Logroño, Spain"}, {"name": "Arturo Jaime", "affiliation": "Universidad de La Rioja, Logroño, Spain"}, {"name": "César Domínguez", "affiliation": "Universidad de La Rioja, Logroño, Spain"}, {"name": "Francisco J. García-Izquierdo", "affiliation": "Universidad de La Rioja, Logroño, Spain"}], "tags": ["Proposals", "educational courses", "Computer science", "Companies", "human resource management", "industry-based projects", "academic projects", "Engineering students", "Marine vehicles", "engineering education", "further education", "computer engineering curricula", "internships", "project management", "computer science education", "computer science engineering capstone projects", "workplace", "Capstone projects", "Industries", "keep-the-project-alive issues", "computer science", "Monitoring", "academic capstone projects", "supervision"]}, {"title": "OpenCV Basics: A Mobile Application to Support the Teaching of Computer Vision Concepts", "link": "https://ieeexplore.ieee.org/document/9103956/", "abstract": "Contribution: Open Source Computer Vision Library (OpenCV) Basics is an application designed with the purpose of facilitating the initiation of industrial engineering students in the field of Computer Vision, making the learning process easier, more dynamic and more direct. To this end, an application has been developed for the Android operating system with which users can make use of a wide variety of algorithms available in the OpenCV library. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n Teaching topics related to Computer Vision can rely on the use of new technologies such as mobile applications. With this type of support, students can learn concepts that might otherwise be difficult to understand. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Intended Outcomes:</italic>\n The objective is to facilitate the assimilation of concepts related to Computer Vision by taking advantage of the camera and the processing power of a mobile device to observe in real time the effects produced on an image by many of the image processing algorithms included in OpenCV. This application is currently available to be downloaded for free through the Google Play Store so that anyone interested in the field of Computer Vision can make use of it. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Application Design:</italic>\n The proposed approach introduces students to concepts related to Computer Vision by making use of the developed application, complementing the theoretical contents taught by the teacher with specific examples. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n The degree of satisfaction of OpenCV Basics users has been evaluated within the framework of the course advanced robotized systems, taught in the industrial engineering degree at the University of La Laguna.", "authors": [{"name": "Marta Sigut", "affiliation": "Universidad de La Laguna Avda, San Cristóbal de La Laguna, Spain"}, {"name": "Rafael Arnay", "affiliation": "Universidad de La Laguna Avda, San Cristóbal de La Laguna, Spain"}, {"name": "Jose Sigut", "affiliation": "Universidad de La Laguna Avda, San Cristóbal de La Laguna, Spain"}, {"name": "Miguel Castro", "affiliation": "DISA Corporación Petrolífera S.A., Área de Sistemas, San Cristóbal de La Laguna, Spain"}], "tags": ["Mobile applications", "Education", "Computer vision", "Mobile handsets", "mobile application", "Computer Vision", "Open Source Computer Vision Library (OpenCV)", "Libraries", "Cameras"]}, {"title": "Lecture-Free Classroom: Fully Active Learning on Moodle", "link": "https://ieeexplore.ieee.org/document/9098921/", "abstract": "<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Contribution:</italic>\n This article shows that today’s learning technologies have the potential to make lectures unnecessary by supporting student’s active learning in the classroom. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Background:</italic>\n Despite worries about their pedagogical effectiveness, lectures remain the main instructional method in university classrooms. Introducing active learning into the classroom can be difficult due to class sizes and the challenge of providing appropriate scaffolding to individual students. This article shows that a thoughtful deployment of today’s learning technology can help in structuring a whole course as a set of activities, which can improve students’ engagement in the classroom. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Intended Outcomes:</italic>\n With this full engagement in the classroom, students’ affective and learning attitudes as well as their learning performance are expected to improve. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Application Design:</italic>\n Moodle was used to design learning activities for second-year students taking a digital logic design course in an electrical and computer engineering program. Throughout the semester, the students used the class time entirely to complete these activities and reflect on them. The instructor’s role in the classroom was limited to interaction with individual students or teams to clarify any questions. He did not give any lectures during the term. \n<italic xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Findings:</italic>\n A total of 103 students took this course in Fall 2018 and Spring 2019. The students showed a strong acceptance of the presented instructional design. Their evaluation of individual learning activities was consistently positive and their performance in the final exam has improved considerably compared to the previous offerings of the course.", "authors": [{"name": "Abdulhadi Shoufan", "affiliation": "Khalifa University, Abu Dhabi, UAE"}], "tags": ["Education", "Springs", "Moodle", "quizzes", "Logic design", "students’ perceptions", "Active learning", "Hardware", "Task analysis", "Videos", "Adders", "students’ engagement"]}, {"title": "Comparison of the Effectiveness of Online Homework With Handwritten Homework in Electrical and Computer Engineering Classes", "link": "https://ieeexplore.ieee.org/document/9007035/", "abstract": "Contribution: This article compares the predictive performance of the scores on WeBWorK homework (online) with those of standard handwritten homework. The comparison is done across six undergraduate electrical engineering classes where each of the nine instructors have used both homework modalities. Background: Online homework systems have been used for many years, but analysis of their effectiveness is mixed. Previous work has been limited to a small number of classes in a wide variety of disciplines. This article has a larger number of classes and instructors than previous studies. The classes cover many basic topic areas in electrical and computer engineering, so is directly applicable to the audience of these transactions. Research Question: What is the effect of online homework compared to traditional handwritten homework on the performance of the students on the final exams in selected ECE classes? Methodology: Mixed-effects analysis of variance models are used to determine the predictive ability of performance on homework of the two modalities on the performance on the final exams. The data are limited to classes where the instructors have taught the class using both modalities. These models incorporate the effect of modalities for each instructor and the effect of the modalities across all classes. Findings: The result is that there is no significant statistical difference in the two modalities to predict final exam scores. This indicates that the advantages of using the automated online system can be obtained with no detrimental effect on the students' learning.", "authors": [{"name": "H. Joel Trussell", "affiliation": "NC State University, Raleigh, USA"}, {"name": "Marcia L. Gumpertz", "affiliation": "NC State University, Raleigh, USA"}], "tags": ["Standards", "educational courses", "Programming", "undergraduate electrical engineering classes", "Electronic mail", "Software", "electrical engineering education", "mixed-effects analysis", "WeBWorK homework", "final exam scores", "Education", "automated online system", "computer aided instruction", "WeBWorK", "electrical and computer engineering classes", "Electrical engineering", "online homework systems", "statistical analysis", "Testing", "online homework", "traditional homework", "Effectiveness", "standard handwritten homework", "ECE classes", "handwritten homework"]}, {"title": "The Influence of Entrepreneurial Mindsets on Student Design Problem Framing", "link": "https://ieeexplore.ieee.org/document/8731959/", "abstract": "Contribution: Increased understanding of the influence of a project-based multidisciplinary design and innovation course on students' engineering design thinking, specifically regarding problem framing. Background: Entrepreneurship-related education has been offered to engineering and technology students, but its influence has been discussed mainly in terms of students' self-efficacy or awareness of entrepreneurship or technological innovation, relying mostly on their self-reported data. Research Questions: 1) How do undergraduate students perceive the relationship between entrepreneurial mindsets and engineering design thinking after a project-based design course that integrates entrepreneurial activities and 2) How differently do they frame a design situation after this course? Methodology: This qualitative case study involved 14 undergraduate students pursuing a minor in design and innovation at a polytechnic institute. For more systematic data collection and analysis, a conceptual framework was developed based on literature about cognitive operations for problem framing and entrepreneurial engineering mindsets. Primary data were collected through semi-structured interviews and pre- and post-activities focused on problem framing. The interview and activity data were analyzed through multiple qualitative analysis approaches based on the conceptual framework. Findings: The analysis of the interview responses reveals the participants' thoughts on the role of an entrepreneurial mindset in engineering design practice, and the comparison between their pre- and post-problem framing activities shows that they tended to focus more on Customer and Social problem elements and less on Technical and Business problem elements after the course. However, important questions remain to better understand the impact of this change on their design abilities.", "authors": [{"name": "Eunhye Kim", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, USA"}, {"name": "Greg J. Strimel", "affiliation": "Purdue University, West Lafayette, USA"}], "tags": ["project-based design course", "educational courses", "technological innovation", "Technological innovation", "undergraduate students", "entrepreneurial activities", "cognition", "project-based multidisciplinary design", "design engineering", "student design problem", "entrepreneurship", "design thinking", "entrepreneurial mindset", "entrepreneurship-related education", "Education", "engineering education", "Entrepreneurship", "primary data", "post-activities", "engineering design thinking", "problem based learning", "activity data", "Systematics", "educational institutions", "multiple qualitative analysis", "Problem-solving", "engineering design practice", "innovation", "multidisciplinary design", "technology students", "Capstone projects", "systematic data collection", "innovation management", "problem definition", "entrepreneurial engineering mindsets", "design abilities", "Interviews", "innovation course", "design situation", "post-problem framing activities"]}, {"title": "The Effectiveness of a Systems Engineering Course in Developing Systems Thinking", "link": "https://ieeexplore.ieee.org/document/8760534/", "abstract": "Contribution: An evaluation of the effectiveness of systems engineering (SE) courses in developing students' systems thinking (ST) capacity in both the cognitive and affective domains. A combined cognitive ST performance and affective engagement with ST assessment is proposed as an approach to assess students' ST in both domains. The results can support course change decisions and guide learning experience development. Background: SE education aims to produce graduates with strong knowledge and skills in SE and a strong appreciation of the practical value of ST, which addresses the cognitive and affective domains in education. Consequently, it is important to evaluate the effectiveness of SE courses in developing students' ST in these domains, an area that studies do not consider. Intended Outcomes: An understanding of the ST ability of undergraduate students in an SE course in a domain specific engineering program in both the cognitive and affective domains. Application Design: A study evaluated the effectiveness of two SE classes in developing students' ST capacity using a combined cognitive and affective assessment tool developed and validated in previous studies. ST assessment is determined by combining ST performance and affective engagement. To observe the transformation of students' ST capacity, a longitudinal design collected data at two times in each of two offerings of an SE course offered by the same university in two locations-Australia and Singapore. Findings: The course developed students in most dimensions of cognitive ST, but did not appear to improve students' affective engagement with ST.", "authors": [{"name": "Timothy L. J. Ferris", "affiliation": "Centre for Systems Engineering, Cranfield University (Defence Academy of the United Kingdom), Shrivenham, U.K."}, {"name": "Fanny Camelia", "affiliation": "Centre for Systems Engineering, Cranfield University, Cranfield, U.K."}, {"name": "Monica B. Behrend", "affiliation": "Research and Innovation Services, University of South Australia (Mawson Lakes Campus), Mawson Lakes, Australia"}], "tags": ["systems engineering", "Tools", "educational courses", "student assessment", "systems thinking", "undergraduate students", "Australia", "domain specific engineering program", "Systems thinking", "affective assessment tool", "cognitive ST performance", "Education", "engineering education", "learning experience development", "SE education", "further education", "undergraduate", "Task analysis", "SE classes", "systems engineering education", "ST assessment", "affective engagement", "assessment tools", "cognitive domain", "Affective domain", "Reliability", "SE course", "systems engineering course"]}, {"title": "Remote Control of a Robotic Unit: A Case Study for Control Engineering Formation", "link": "https://ieeexplore.ieee.org/document/9032350/", "abstract": "Hands-on experimentation has widely demonstrated its efficacy in engineering training, especially in control formation, since experimentation using computer-aided control system design (CACSD) tools is essential for future engineers. In this context, this article describes a case study for Control Engineering formation, based on a new lab practice for the linear and angular velocity control for a commercial P3-DX robot platform, to teach industrial control. This lab proposal includes all the stages involved in the design of a real control system, from plant identification from an open-loop test to real experimentation of the designed control system. The lab practices proposed have a twofold objective: First, it is an interdisciplinary approach that allows students to put into practice the skills from other subjects in the curriculum, facilitating the integration of knowledge. In addition, it allows increasing the motivation of the students by working with a complex and realistic plant. The proposal has been evaluated through the grades of the students, as well as the perception of both students and instructors, and the results obtained allow to confirm the benefits of the proposal.", "authors": [{"name": "Carlos Santos-Pérez", "affiliation": "University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Marta Marrón-Romera", "affiliation": "University of Alcalá, Alcalá de Henares, Spain"}, {"name": "José Manuel Rodríguez-Ascariz", "affiliation": "University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Cristina Losada-Gutiérrez", "affiliation": "University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Felipe Espinosa", "affiliation": "University of Alcalá, Alcalá de Henares, Spain"}], "tags": ["Educational robots", "Tools", "Proposals", "Computer-aided instruction", "engineering education", "control engineering", "Control engineering", "Training", "remote control"]}, {"title": "Measuring the Programming Self-Efficacy of Electrical and Electronics Engineering Students", "link": "https://ieeexplore.ieee.org/document/9031745/", "abstract": "Contribution: This article has shown that self-efficacy in performing complex computer programming tasks and the self-regulation of electrical and electronics engineering undergraduate students varies with respect to the class standing and prior experience in computer programming. Background: Computer programming is an essential skill that all engineers must possess, as most industries require engineers to own this skill. Prior studies discuss programming self-efficacy (PSE) measures; however, these studies do not specifically measure the PSE of electrical and electronics engineering major in the Indian context. Research Questions: The overarching research question of this article is: What factors related to participants' demographics, vicarious experiences, and performance accomplishments influence the PSE of electrical and electronics engineering students in India? Methodology: To answer the above research question, a study is conducted using quantitative methods in engineering education research. This article focuses on the development of a survey instrument to measure the PSE of electrical and electronics engineering students of India. The survey includes a total of 31 items, content validity and face validity were established. An exploratory factor analysis was conducted, and the final two factors are “basic programming tasks and dependence” and “complex programming tasks and self-regulation.” A multiple regression analysis was performed to find the best fitting model for the two factors. Findings: The regression model with “basic programming tasks and dependence” was not statistically significant and the regression model with “complex programming tasks and self-regulation” was found to be statistically significant with predictors class standing and prior programming experience.", "authors": [{"name": "Javeed Kittur", "affiliation": "Engineering Education Systems and Design Program, Arizona State University, Mesa, USA"}], "tags": ["India", "educational courses", "factor analysis", "electronic engineering education", "PSE", "Engineering students", "complex programming tasks", "basic programming tasks", "student background", "engineering education", "electronic engineering computing", "multiple regression analysis", "complex computer programming tasks", "Java", "Task analysis", "computer aided instruction", "exploratory factor analysis", "gender", "electrical electronics engineering undergraduate students", "programming self-efficacy (PSE)", "Electrical engineering", "Programming profession", "Electric variables measurement", "engineering education research", "computer science education", "Instruments", "programming self-efficacy", "prior programming experience", "regression", "self-regulation", "programming", "self-efficacy measures", "regression analysis", "quantitative method"]}]