[{"title": "Teaching Business Management to Engineers: The Impact of Interactive Lectures", "link": "https://ieeexplore.ieee.org/document/7811278/", "abstract": "Some education specialists are challenging the use of traditional strategies in classrooms and are calling for the use of contemporary teaching and learning techniques. In response to these calls, many field experiments that compare different teaching and learning strategies have been conducted. However, to date, little is known on the outcomes of these strategies specific to the context of engineers and engineering education. The debate on traditional versus contemporary strategies continues, with many traditionalists holding firm to the view that contemporary techniques diminish the academic quality and integrity of teaching and learning. This paper adds to the current debate by assessing the outcome of interactive lectures, a contemporary teaching strategy, in the context of engineering education. Specifically, this paper examines the effect of interactive lectures on student academic achievement and the learning environment. This paper supported the quantitative survey responses with self-reported student reflections. The findings contradict the traditionalist view of teaching and learning; student performance was not significantly different when interactive learning strategies were employed. However, students held a more positive view toward the learning environment and felt that interactive learning enhanced their overall learning experiences and spurred interest in the subject area. This paper concluded that interactive lecturing can be an effective approach in teaching business management in engineering education.", "authors": [{"name": "Musti K. S. Sastry", "affiliation": "Department of Electrical and Computer Engineering, University of the West Indies (St. Augustine Campus), St. Augustine, Trinidad and Tobago"}, {"name": "Meena Rambocas", "affiliation": "Department of Management Studies, University of the West Indies (St. Augustine Campus), St. Augustine, Trinidad and Tobago"}], "tags": ["Active learning", "engineering curriculum", "student academic achievement", "engineering education", "graduate education", "Engineering students", "Business", "learning environment", "Student activities", "Computers", "interactive lectures", "teaching philosophies", "management education", "business management", "Context"]}, {"title": "Development of Procedures to Assess Problem-Solving Competence in Computing Engineering", "link": "https://ieeexplore.ieee.org/document/7513434/", "abstract": "In the context of higher education, a competence may be understood as the combination of skills, knowledge, attitudes, values, and abilities that underpin effective and/or superior performance in a professional area. The aim of the work reported here was to design a set of procedures to assess a transferable competence, i.e., problem solving, that is basic for learning, in both academic and professional life, and crucial for engineering. The study involved a total of 71 students enrolled at three universities at two different stages of their studies. The development phases of the assessment device included an analysis of the competence and its facets, the design of the assessment task, the development of criteria to rate student performance, and the analysis of the basic psychometric properties for assessment methods in the area of education. The conclusion was drawn that the training process and the elaboration of scoring criteria are costly but necessary if objectivity in the interpretation of results is to be guaranteed. The main achievement of this project was the development of a procedure that measures learning outcomes and, more specifically, problem solving.", "authors": [{"name": "Ruth Cobos", "affiliation": "Universidad Autónoma de Madrid, Madrid, Spain"}, {"name": "Javier García", "affiliation": "Department of Computer Systems, Technical University of Madrid, Madrid, Spain"}, {"name": "Jorge Pérez", "affiliation": "Department of Computer Systems, Technical University of Madrid, Madrid, Spain"}, {"name": "Aurelio Bermúdez", "affiliation": "Department of Computer Systems, University of Castilla-La Mancha, Albacete, Spain"}, {"name": "Carmen Vizcarro", "affiliation": "Universidad Autónoma de Madrid, Madrid, Spain"}], "tags": ["learning outcome (LO) assessment", "engineering education assessment", "further education", "universities", "computer science education", "higher education", "computing engineering", "Computers", "problem solving competence assessment", "Standards", "Europe", "educational institutions", "Engineering education", "Particle measurements", "transferable competence", "Education", "psychometric properties", "problem solving", "transferable competences", "engineering education", "assessment task", "learning", "scoring criteria", "Atmospheric measurements", "Problem-solving"]}, {"title": "From Higher Education to Open Education: Challenges in the Transformation of an Online Traditional Course", "link": "https://ieeexplore.ieee.org/document/7582384/", "abstract": "Open education has revolutionized the educational environment. Massive open online courses have become the main showcase for open educational resources, but the competition to establish a position in this movement has led to the rapid publication of many courses of arguable quality. This paper presents and analyzes the process of creating a small private online course that meets the requirements to be offered as a massive course. The starting point was an online higher education course that had previously been published as OpenCourseWare. In this paper, data were examined from 112 students enrolled in four different academic years, during which changes were progressively incorporated to transform the traditional course to an open course. The results show an improvement in students' perceptions of resources and assessments and in their overall satisfaction. New assessment tools were developed and validated, without affecting the academic results. The process had positive effects on the instructional design of the final course, but some risks were identified when the course was adapted as a massive course. The final course provides useful input for future developments and a more effective student-focused methodology.", "authors": [{"name": "Edmundo Tovar Caro", "affiliation": "Department of Software Engineering, Technical University of Madrid, Madrid, Spain"}, {"name": "José Luis Martín Núñez", "affiliation": "Institute of Education Sciences, Technical University of Madrid, Madrid, Spain"}, {"name": "José Ramón Hilera González", "affiliation": "Computer Science Department, University of Alcalá, Madrid, Spain"}], "tags": ["Videos", "OpenCourseWare", "further education", "Open Educational Resources", "student-focused methodology", "massive open online courses (MOOCs)", "Transforms", "higher education", "educational courses", "project-based learning (PBL)", "Market research", "online higher education course", "Opencourseware (OCW)", "Europe", "small private online course", "instructional design", "Distance learning", "online traditional course", "computer aided instruction", "engineering education", "massive open online courses", "open educational resources"]}, {"title": "The Underrepresentation of Women in Computing Fields: A Synthesis of Literature Using a Life Course Perspective", "link": "https://ieeexplore.ieee.org/document/7953503/", "abstract": "Using a life course perspective, this literature review synthesizes research on women's underrepresentation in computing fields across four life stages: 1) pre-high school; 2) high school; 3) college major choice and persistence; and 4) post-baccalaureate employment. Issues associated with access to, and use of, computing resources at the pre-high school and high school levels are associated with gender differences in interest and attitudes toward computing. At the college level, environmental context (classroom design, interactions with peers and role models, signals from stereotypical images) contribute to whether students will major in computing, whereas psychosocial factors (e.g., sense of belonging and self-efficacy) and departmental culture play a role in persistence in computing fields. As in other fields, issues associated with work-life conflict, occupational culture, and mentoring/networking opportunities play a role in women's participation in the computing workforce. Several initiatives and programs have been implemented to address women's underrepresentation in computing fields. While great strides have been made in making computing more accessible, the life course perspective highlights the importance of longitudinal studies in identifying students' pathways to and through computing fields, as well as how interventions across life stages may intersect or cumulate to generate trends in computing participation.", "authors": [{"name": "Corey Schimpf", "affiliation": "Concord Consortium, Concord, MA, USA"}, {"name": "Joyce B. Main", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}], "tags": ["Computer engineering", "further education", "postbaccalaureate employment", "computer science education", "Bibliographies", "Context", "Employment", "Computer science", "computer science", "mentoring opportunities", "occupational culture", "Computers", "prehigh school", "underrepresentation", "persistence", "gender differences", "diversity", "employee welfare", "life course perspective", "computing fields", "women", "girls", "work-life conflict", "Games", "Focusing", "college major choice", "networking opportunities", "personnel"]}, {"title": "After the Workshop: A Case Study of Post-Workshop Implementation of Active Learning in an Electrical Engineering Course", "link": "https://ieeexplore.ieee.org/document/7480377/", "abstract": "Engineering education research has empirically validated the effectiveness of active learning over traditional instructional methods. However, the dissemination of education research into instructional practice has been slow. Faculty workshops for current and future instructors offer a solution to promote the widespread adoption of active learning in engineering classrooms. However, most of the existing research has relied on faculty self-reporting to evaluate the success of engineering faculty workshops. Researchers have noted variations in self-reporting and the actual classroom implementation. In this paper, using classroom observations, faculty interviews, student surveys, and focus groups, the authors examine an engineering instructor's postworkshop implementation of active learning in an electrical engineering course. The findings demonstrate the influence of faculty conceptions of teaching in the selection and design of activities and the subsequent impact of these design choices on student engagement. The authors report the instructor's and students' responses to the active learning exercises and present recommendations for engineering faculty development.", "authors": [{"name": "Prateek Shekhar", "affiliation": "Department of Mechanical Engineering, University of Texas at Austin, Austin, TX, USA"}, {"name": "Maura Borrego", "affiliation": "Department of Mechanical Engineering, University of Texas at Austin, Austin, TX, USA"}], "tags": ["student engagement", "electrical engineering education", "Electrical engineering", "instructional practice", "faculty conceptions", "engineering classrooms", "classroom observations", "Resistance", "student surveys", "educational courses", "faculty development", "post-workshop implementation", "electrical engineering course", "Interviews", "engineering faculty development", "Conferences", "Engineering education", "faculty interviews", "active learning", "Active learning", "education research dissemination", "computer aided instruction", "teaching", "electrical engineering computing", "engineering education", "engineering faculty workshops", "Problem-solving"]}, {"title": "PBL-SEE: An Authentic Assessment Model for PBL-Based Software Engineering Education", "link": "https://ieeexplore.ieee.org/document/7577777/", "abstract": "The problem-based learning (PBL) approach has been successfully applied to teaching software engineering thanks to its principles of group work, learning by solving real problems, and learning environments that match the market realities. However, the lack of well-defined methodologies and processes for implementing the PBL approach represents a major challenge. The approach requires great flexibility and dynamism from all involved, whether in mapping content, in teacher performance, or laying out the process of how learners should go about solving problems. This paper suggests that management processes can help in implementing PBL throughout its life cycle (planning, implementation, monitoring, and enhancement), and proposes an assessment model called PBL-SEE for use in software engineering education (SEE). Two examples of its use are provided. The results show how the model can be applied and how the resulting information can be used to make the PBL initiatives “authentic,” in that they bring the reality of the labor market to the learning environment, while keeping to PBL principles.", "authors": [{"name": "Simone C. dos Santos", "affiliation": "Centro de Informática, Universidade Federal de Pernambuco, Recife, Brazil"}], "tags": ["Planning", "planning", "Software", "problem-based learning approach", "computer science education", "Process control", "Context", "teacher performance", "professional skills", "case study", "authentic assessment model", "management processes", "teaching evaluations", "mapping content", "Education", "software engineering", "problem solving", "life cycle", "software engineering education", "student assessment", "Bloom’s taxonomy", "PBL-SEE", "Software engineering", "problem-based learning (PBL)", "Problem-solving"]}, {"title": "All Roads Lead to Computing: Making, Participatory Simulations, and Social Computing as Pathways to Computer Science", "link": "https://ieeexplore.ieee.org/document/7765145/", "abstract": "Computer science (CS) is becoming an increasingly diverse domain. This paper reports on an initiative designed to introduce underrepresented populations to computing using an eclectic, multifaceted approach. As part of a yearlong computing course, students engage in Maker activities, participatory simulations, and computing projects that foreground the social and collaborative aspects of CS. Collectively, these activities are designed to introduce learners to the growing diversity of what CS looks like in the 21st century. This paper lays out the practical and theoretical motivations for the Computational Thinking for Girls (CT4G) project, specifically highlighting the use of Making through physical and social computing as ways to engage students in CS. A snapshot of one activity from the program is provided-Wearing the Web-in which students use open-hardware programmable badges to explore the underlying structure and technology that enables the Internet. Data from the first year of the CT4G program are presented to show the positive effects that this diverse introduction to CS is having on the students with respect to their attitudes toward CS.", "authors": [{"name": "Corey Brady", "affiliation": "Center for Connected Learning and Computer-Based Modeling, Northwestern University, Evanson, IL, USA, Vanderbilt University, Nashville, TN, USA"}, {"name": "Sebastian Rodriguez", "affiliation": "Center for Connected Learning and Computer-Based Modeling, Northwestern University, Evanson, IL, USA, University of Illinois at Urbana–Champaign, Urbana, IL, USA"}, {"name": "Kai Orton", "affiliation": "Center for Connected Learning and Computer-Based Modeling, Northwestern University, Evanson, IL, USA"}, {"name": "Gabriella Anton", "affiliation": "Center for Connected Learning and Computer-Based Modeling, Northwestern University, Evanson, IL, USA"}, {"name": "Uri Wilensky", "affiliation": "Center for Connected Learning and Computer-Based Modeling, Northwestern University, Evanson, IL, USA"}, {"name": "David Weintrop", "affiliation": "University of Chicago, Chicago, IL, USA, Center for Connected Learning and Computer-Based Modeling, Northwestern University, Evanson, IL, USA"}], "tags": ["student engagement", "collaborative aspect", "open-hardware programmable badge", "physical computing", "participatory simulations", "social computing", "high school", "Sociology", "Wearing the Web", "computer science education", "Context", "underrepresented students", "Computational modeling", "educational courses", "computing course", "participatory simulation", "computer science", "CT4G project", "Computational Thinking for Girls project", "computer science (CS)", "gender diversity", "maker activities", "making", "Internet", "wearable technology", "Social computing", "Programming profession", "computing project", "Collaborative learning", "Collaboration", "social aspect"]}, {"title": "An Interdisciplinary Practical for Multimedia Engineering Students", "link": "https://ieeexplore.ieee.org/document/7486121/", "abstract": "Interdisciplinary projects in the industry typically require collaboration between professionals from various fields. However, this relationship is not generally addressed in the training offered by university programs, which often ignore this interdisciplinary approach. This paper offers an example of interdisciplinary interaction through joint laboratory activities in the curricula of two very different degree programs, i.e., Multimedia Engineering and Teacher Training in Primary Education. The programs' students formed an interdisciplinary team of multimedia engineers and trainee teachers to develop a Web product for children's cognitive development. The complexity of the task required students to engage in close and strong interdisciplinary cooperation and communication; in turn, they benefited from the synergy offered by collaborative work. The results of this paper, presented from the perspective of the multimedia engineering students, demonstrate a significant increase in their academic performance compared to the control group. This paper shows that university studies can incorporate an interdisciplinary perspective to engineering education without the need to introduce a specific course on the topic, thus avoiding further demands on the curriculum schedule.", "authors": [{"name": "María Luisa Pertegal-Felices", "affiliation": "Department of Development Psychology and Teaching, University of Alicante, Alicante, Spain"}, {"name": "Diego Marcos-Jorquera", "affiliation": "Department of Computer Technology, University of Alicante, Alicante, Spain"}, {"name": "Antonio Jimeno-Morenilla", "affiliation": "Department of Computer Technology, University of Alicante, Alicante, Spain"}, {"name": "Raquel Gilar-Corbí", "affiliation": "Department of Development Psychology and Teaching, University of Alicante, Alicante, Spain"}], "tags": ["teaching methodology", "Training", "Multimedia communication", "Engineering students", "computer science education", "Employment", "joint laboratory activities", "Context", "multimedia", "teacher training", "educational courses", "multimedia computing", "interdisciplinary interaction", "primary education", "children cognitive development", "Design of activities", "cognition", "educational institutions", "Teamwork", "university programs", "academic performance", "engineering education", "collaborative work", "interdisciplinary practices", "interdisciplinary practical", "Web product", "multimedia engineering students"]}, {"title": "A Project-Based Cooperative Approach to Teaching Sustainable Energy Systems", "link": "https://ieeexplore.ieee.org/document/7820108/", "abstract": "Engineering education is undergoing a restructuring driven by the needs of an increasingly multidisciplinary engineering profession. At the same time, power systems are transitioning toward future smart grids that will require power engineers with skills outside of the core power engineering domain. Since including new topics in the existing curriculum while maintaining the existing requirements is difficult, this paper proposes a project-based cooperative learning approach to promote soft skills in an engineering course. This paper then shows how to construct a realistic open-ended multidisciplinary problem whose solution requires a wide range of skills, which is not a trivial task. The design and technoeconomic viability assessment of a small-scale photovoltaic battery system is used as a case study. The effectiveness of the approach and students' satisfaction were assessed over two years. Survey results after the first year revealed that the students did not feel sufficiently prepared for multidisciplinary work. After appropriate adjustments in the second year, the survey results improved noticeably. Statistical analysis reveals that the project teaches skills that are complementary to the core domain skills, which confirms the validity of the approach.", "authors": [{"name": "Gregor Verbič", "affiliation": "School of Electrical and Information Engineering, University of Sydney, Sydney, NSW, Australia"}, {"name": "Chanaka Keerthisinghe", "affiliation": "School of Electrical and Information Engineering, University of Sydney, Sydney, NSW, Australia"}, {"name": "Archie C. Chapman", "affiliation": "School of Electrical and Information Engineering, University of Sydney, Sydney, NSW, Australia"}], "tags": ["sustainable energy systems", "Buildings", "Education", "Optimization", "open-ended multidisciplinary problem", "Economics", "project-based cooperative learning approach", "engineering education", "Cooperative learning", "project-based learning (PBL)", "Teamwork", "Power systems", "engineering course", "Batteries", "photovoltaic (PV) battery systems", "soft skills", "engineering curriculum"]}, {"title": "Teaching Tool for a Control Systems Laboratory Using a Quadrotor as a Plant in MATLAB", "link": "https://ieeexplore.ieee.org/document/7836322/", "abstract": "This paper presents a MATLAB-based application to teach the guidance, navigation, and control concepts of a quadrotor to undergraduate students, using a graphical user interface (GUI) and 3-D animations. The Simulink quadrotor model is controlled by a proportional integral derivative controller and a linear quadratic regulator controller. The GUI layout's many components can be easily programmed to perform various experiments by considering the simulation of the quadrotor as a plant; it incorporates control systems (CS) fundamentals such as time domain response, transfer function and state-space form, pole-zero location, root locus, frequency domain response, steady-state error, position and disturbance response, controller design and tuning, unity, and the use of a Kalman filter as a feedback sensor. 3-D animations are used to display the quadrotor flying in any given condition selected by the user. For each simulation, users can view the output response in the form of 3-D animations, and can run time plots. The quadrotor educational tool (QET) helps students in the CS laboratory understand basic CS concepts. The QET was evaluated based on student feedback, grades, satisfaction, and interest in CS.", "authors": [{"name": "Subhan Khan", "affiliation": "Department of Electrical Engineering, COMSATS Institute of Information Technology, Lahore, Pakistan"}, {"name": "Athar Hanif", "affiliation": "Department of Electrical Engineering, COMSATS Institute of Information Technology, Lahore, Pakistan"}, {"name": "Mujtaba Hussain Jaffery", "affiliation": "Department of Electrical Engineering, COMSATS Institute of Information Technology, Lahore, Pakistan"}, {"name": "Muhammad Rizwan Asif", "affiliation": "Department of Electrical Engineering, COMSATS Institute of Information Technology, Lahore, Pakistan"}], "tags": ["steady-state error", "three-term control", "root locus", "further education", "linear quadratic control", "transfer function", "disturbance response", "control systems", "time domain response", "laboratories", "control systems laboratory", "student experience", "feedback sensor", "Simulink quadrotor model", "poles and zeros", "graphical user interfaces", "educational software", "Control systems", "GUI", "Animation", "state-space methods", "mobile robots", "frequency domain response", "learning technology", "mathematics computing", "pole-zero location", "undergraduate students", "MATLAB", "position response", "state-space form", "linear quadratic regulator controller", "Kalman filters", "controller tuning", "remote laboratory", "proportional integral derivative controller", "control engineering education", "QET", "feedback", "Kalman filter", "helicopters", "Three-dimensional displays", "CS laboratory", "Graphical user interfaces", "quadrotor educational tool", "graphical user interface", "Mathematical model", "Education", "computer aided instruction", "teaching", "3D animations", "control engineering computing", "computer animation", "transfer functions", "3-D animations", "Earth", "controller design", "teaching tool"]}, {"title": "Common Learning Objectives for Undergraduate Control Systems Laboratories", "link": "https://ieeexplore.ieee.org/document/7896572/", "abstract": "Course objectives, like research objectives and product requirements, help provide clarity and direction for faculty and students. Unfortunately, course and laboratory objectives are not always clearly stated. Without a clear set of objectives, it can be hard to design a learning experience and determine whether students are achieving the intended outcomes of the course or laboratory. In this paper, a common set of laboratory objectives, concepts, and components of a laboratory apparatus for undergraduate control systems laboratories were identified. A panel of 40 control systems faculty members completed a multi-round Delphi survey to bring them toward consensus on the common aspects of their laboratories. These panelists identified 15 laboratory objectives, 26 concepts, and 15 components common to their laboratories. Then an 45 additional faculty members and practitioners completed a follow-up survey to gather feedback on the results. In both surveys, each participant rated the importance of each item. While average ratings differed slightly between the two groups, the order in which the items were ranked was similar. Important examples of common learning objectives include connecting theory to what is implemented in the laboratory, designing controllers, and modeling systems. The most common component in both groups was MathWorks software. Some of the common concepts include block diagrams, stability, and PID control. Defining common aspects of undergraduate control systems laboratories enables common development, detailed comparisons, and simplified adaptation of equipment and experiments between campuses and programs.", "authors": [{"name": "Rebecca M. Reck", "affiliation": "Department of Mechanical Engineering, Kettering University, Flint, MI, USA"}], "tags": ["Hardware", "Laboratories", "three-term control", "further education", "block diagrams", "Software", "laboratory objectives", "MathWorks software", "laboratory techniques", "Control systems", "educational courses", "learning objectives", "course objectives", "undergraduate control systems laboratories", "Mechanical engineering", "laboratory apparatus", "stability", "control engineering education", "PID control", "laboratory", "Electronic mail", "Education", "undergraduate", "equipment", "survey"]}, {"title": "Empirical Analysis of the Use of the VISIR Remote Lab in Teaching Analog Electronics", "link": "https://ieeexplore.ieee.org/document/7582459/", "abstract": "Remote laboratories give students the opportunity of experimenting in STEM by using the Internet to control and measure an experimental setting. Remote laboratories are increasingly used in the classroom to complement, or substitute for, hands-on laboratories, so it is important to know its learning value. While many authors approach this question through qualitative analyses, this paper reports a replicated quantitative study that evaluates the teaching performance of one of these resources, the virtual instrument systems in reality (VISIR) remote laboratory. VISIR, described here, is the most popular remote laboratory for basic analog electronics. This paper hypothesizes that use of a remote laboratory has a positive effect on students' learning process. This report analyzes the effect of the use of VISIR in five different groups of students from two different academic years (2013-2014 and 2014-2015), with three teachers and at two educational levels. The empirical experience focuses on Ohm's Law. The results obtained are reported using a pretest and post-test design. The tests were carefully designed and analyzed, and their reliability and validity were assessed. The analysis of knowledge test question results shows that the post-test scores are higher that the pretest. The difference is significant according to Wilcoxon test (p <; 0.001), and produces a Cohen effect size of 1.0. The VISIR remote laboratory's positive effect on students' learning processes indicates that remote laboratories can produce a positive effect in students' learning if an appropriate activity is used.", "authors": [{"name": "Unai Hernandez-Jayo", "affiliation": "Faculty of Engineering, University of Deusto, Bilbao, Spain"}, {"name": "Lucinio Gonzalez-Sabate", "affiliation": "Institut Químic de Sarrià, Universitat Ramon Llull, Barcelona, Spain"}, {"name": "Ingvar Gustavsson", "affiliation": "Blekinge Institute of Technology, Karlskrona, Valhallavägen, Sweden"}, {"name": "Mariluz Guenaga", "affiliation": "Faculty of Engineering, University of Deusto, Bilbao, Spain"}, {"name": "Susana Romero", "affiliation": "Faculty of Engineering, University of Deusto, Bilbao, Spain"}, {"name": "Pablo Orduña", "affiliation": "Deusto Institute of Technology, University of Deusto, Bilbao, Spain"}, {"name": "Javier Garcia-Zubia", "affiliation": "Faculty of Engineering, University of Deusto, Bilbao, Spain"}, {"name": "Jordi Cuadros", "affiliation": "Institut Químic de Sarrià, Universitat Ramon Llull, Barcelona, Spain"}], "tags": ["Current measurement", "electrical engineering", "Resistors", "learning value", "educational levels", "Wilcoxon test", "pretest design", "virtual instrument systems in reality (VISIR) remote laboratory", "VISIR remote lab", "STEM", "electronic engineering computing", "Remote laboratories", "student learning process", "remote laboratory", "Ohm law", "analog electronic teaching", "Internet", "Active learning", "engineering curriculum", "Education", "computer aided instruction", "teaching", "Electrical resistance measurement", "virtual instrumentation", "post-test design", "virtual reality", "electronic engineering education", "student experiments", "virtual instrument systems in reality", "reliability"]}, {"title": "Training Engineers for the Ambient Intelligence Challenge", "link": "https://ieeexplore.ieee.org/document/7582358/", "abstract": "The increasing complexity of the new breed of distributed intelligent systems, such as the Internet of Things, which require a diversity of languages and protocols, can only be tamed with design and programming best practices. Interest is also growing for including the human factor, as advocated by the ambient intelligence (AmI) research field, whose focus is on transparently and intelligently supporting people. These new design methodologies are increasingly needed in the toolbox of new electronic and computer engineers, and teaching strategies should be devised that allow students to acquire a systems-level view instead of getting lost in technology-oriented approaches. This paper describes a study carried out over two academic years, in a course in AmI at Politecnico di Torino, Italy. In the course, a project-based learning approach was adopted, in which students design and prototype an AmI system, and their progress is closely monitored throughout the semester. This paper presents the learning goals and teaching strategies, analyzes the learning outcomes from the qualitative and quantitative points of view, and highlights the lessons learned in the process.", "authors": [{"name": "Fulvio Corno", "affiliation": "Politecnico di Torino, Turin, Italy"}, {"name": "Luigi De Russis", "affiliation": "Politecnico di Torino, Turin, Italy"}], "tags": ["Knowledge engineering", "technology-oriented approaches", "project-based learning", "Protocols", "electronic engineers", "computer science education", "ambient intelligence", "computer engineers", "educational courses", "multidisciplinary teams", "project-based learning (PBL)", "Ambient intelligence (AmI)", "Computers", "learning outcomes", "learning goals", "Internet of Things", "distributed intelligent systems", "computer based training", "Prototypes", "engineers training", "computer engineering (CE)", "Internet of Things (IoT)", "systems-level view", "computing skills", "teaching strategies", "Education", "teaching", "Ambient intelligence", "Italy", "human factor", "AmI system", "Internet of things", "AmI course", "Politecnico di Torino"]}, {"title": "Undergraduate Electronics Projects Based on the Design of an Optical Wireless Audio Transmission System", "link": "https://ieeexplore.ieee.org/document/7542562/", "abstract": "The two projects presented in this paper can be used either as two separate assignments in two different semesters or as a final assignment for undergraduate students of electrical engineering. They have two main objectives: first, to teach basic electronic circuit design concepts and, second, to motivate the students to learn more about analog circuit design. The two projects are: 1) the design of an audio power amplifier, and 2) the design of an amplitude-modulated optical link with a pulsed light-emitting diode (LED) at the emitter and a photodiode and a transimpedance amplifier at the receiver. An audio signal is used to modulate the oscillator that drives the LED, and the receiver demodulates this signal to produce an audio signal (music, for example) that can be sent to a loudspeaker. The intent of this optical communication system was to allow students to design and build various electronic circuits that have an overall objective and a clear practical application. Students are motivated by using this system to transmit, receive, and listen to their own music.", "authors": [{"name": "Nuno Paulino", "affiliation": "Centre of Technology and Systems, Instituto de Desenvolvimento de Novas Tecnologias (CTS-UNINOVA), Departamento de Engenharia Electrotecnica, Faculdade de Ciências e Tecnologia, Universidade Nova de Lisboa, Caparica, Portugal"}, {"name": "Rui Santos-Tavares", "affiliation": "Centre of Technology and Systems, Instituto de Desenvolvimento de Novas Tecnologias (CTS-UNINOVA), Departamento de Engenharia Electrotecnica, Faculdade de Ciências e Tecnologia, Universidade Nova de Lisboa, Caparica, Portugal"}, {"name": "Luis Bica Oliveira", "affiliation": "Centre of Technology and Systems, Instituto de Desenvolvimento de Novas Tecnologias (CTS-UNINOVA), Departamento de Engenharia Electrotecnica, Faculdade de Ciências e Tecnologia, Universidade Nova de Lisboa, Caparica, Portugal"}, {"name": "João Goes", "affiliation": "Centre of Technology and Systems, Instituto de Desenvolvimento de Novas Tecnologias (CTS-UNINOVA), Departamento de Engenharia Electrotecnica, Faculdade de Ciências e Tecnologia, Universidade Nova de Lisboa, Caparica, Portugal"}, {"name": "João P. Oliveira", "affiliation": "Centre of Technology and Systems, Instituto de Desenvolvimento de Novas Tecnologias (CTS-UNINOVA), Departamento de Engenharia Electrotecnica, Faculdade de Ciências e Tecnologia, Universidade Nova de Lisboa, Caparica, Portugal"}, {"name": "Nuno Pereira", "affiliation": "Centre of Technology and Systems, Instituto de Desenvolvimento de Novas Tecnologias (CTS-UNINOVA), Departamento de Engenharia Electrotecnica, Faculdade de Ciências e Tecnologia, Universidade Nova de Lisboa, Caparica, Portugal"}], "tags": ["telecommunication engineering education", "Transistors", "electrical engineering", "electronic circuit design", "power amplifiers", "LED", "Amplifiers", "optical communication", "Light emitting diodes", "oscillators", "light emitting diodes", "Wireless communication", "optical receivers", "oscillator", "loudspeaker", "free-space optical communication", "loudspeakers", "undergraduate electronics projects", "audio power amplifier", "Optical fiber communication", "optical communication system", "Education", "optical wireless audio transmission system", "analog circuit design", "Oscillators", "audio signals", "filters", "pulsed light-emitting diode", "Electronic circuits", "amplitude-modulated optical link"]}, {"title": "Setting the Pace: Experiments With Keller's PSI", "link": "https://ieeexplore.ieee.org/document/7553543/", "abstract": "The ideal of self-paced learning, which was introduced nearly 50 years ago by Keller in his Personalized System of Instruction (PSI), has not yet been widely adopted. In spite of its perceived promise of helping students to learn at the speed aligned to their individual backgrounds, motivation, and skills, PSI has been challenging to implement. University teaching practice with weekly plans means that instructors expect students to learn at the same pace. Against this backdrop, this paper reports experiences from deploying PSI in multiple offerings of an introductory programming course at a Scandinavian university over five years. These include variations, such as a buddy system, rightsizing modules, encouraging pacing, alternative targets, intermediate milestones, active coaching, and time management, all primarily aimed at overcoming a key concern associated with PSI, namely, procrastination. The lessons associated with each are described with a view to providing fellow instructors with strategies and options that they can consider for implementing PSI into introductory programming courses.", "authors": [{"name": "Hallgeir Nilsen", "affiliation": "University of Agder, Kristiansand, Norway"}, {"name": "Even Åby Larsen", "affiliation": "University of Agder, Kristiansand, Norway"}, {"name": "Maung Sein", "affiliation": "University of Agder, Kristiansand, Norway"}, {"name": "Sandeep Purao", "affiliation": "Bentley University, Waltham, MA, USA"}], "tags": ["Keller PSI", "computer science education", "Context", "programming", "self-paced learning", "educational courses", "Schedules", "educational institutions", "Computing education", "university teaching practice", "Fellows", "Scandinavian university", "introductory programming course", "Education", "Blogs", "Programming profession", "teaching", "procrastination", "personalized system of instruction", "Keller", "Personalized System of Instruction (PSI)"]}, {"title": "Students’ Task Interpretation and Conceptual Understanding in an Electronics Laboratory", "link": "https://ieeexplore.ieee.org/document/7898859/", "abstract": "Task interpretation is a critical first step for students in the process of self-regulated learning, and a key determinant when they set goals in their learning and select strategies in assigned work. This paper focuses on the explicit and implicit aspects of task interpretation based on Hadwin's model. Laboratory activities improve students' conceptual understanding, as they utilize cognitive ability to integrate the new experiences these provide. The purpose of this paper is to investigate how students' interpretation of a task assigned during laboratory work may change during the task process, and how this relates to their conceptual understanding. A total of 143 students enrolled in an electronics course participated in this paper. Instruments to measure task interpretation and conceptual understanding were created, piloted, and applied before and after selected laboratory activities over the semester. Findings suggest that while students' task interpretation changes during the task process, increasing after the completion of the laboratory activity levels of task interpretation are low. Previous research findings-that students generally have an incomplete understanding of the assigned tasks and struggle to establish a connection between laboratory activities and the theory-were confirmed. Lastly, this paper reports a significant relationship between students' task interpretation and their conceptual understanding in laboratory work. Further investigation is necessary to unveil other factors related to these constructs in order to engage students in laboratory work.", "authors": [{"name": "Oenardi Lawanto", "affiliation": "Utah State University, Logan, UT, USA"}, {"name": "Michael L. Pate", "affiliation": "Utah State University, Logan, UT, USA"}, {"name": "Presentacion Rivera-Reyes", "affiliation": "Utah State University, Logan, UT, USA"}], "tags": ["electrical engineering", "engagement", "task process", "task interpretation", "conceptual understanding", "Context", "laboratory techniques", "educational courses", "cognitive ability", "electronics laboratory", "Joining processes", "laboratory activities", "students task interpretation", "cognition", "Hadwin's model", "self-regulated learning", "laboratory work", "Particle measurements", "statistical analysis", "laboratory", "Education", "Conceptual understanding", "undergraduate research", "Instruments", "electronics course", "electronic engineering education", "Atmospheric measurements", "Problem-solving"]}, {"title": "Personalizing Sample Databases With Facebook Information to Increase Intrinsic Motivation", "link": "https://ieeexplore.ieee.org/document/7498652/", "abstract": "Motivation is fundamental for students to achieve successful and complete learning. Motivation can be extrinsic, i.e., driven by external rewards, or intrinsic, i.e., driven by internal factors. Intrinsic motivation is the most effective and must be inspired by the task at hand. Here, a novel strategy is presented to increase intrinsic motivation toward activities requiring the use of sample data sets, by automatically extracting the student's social data from a social media network, to create a personalized sample data set. A tool was developed to access Facebook and create a database to be used in practical assignments on database queries. A user study (N = 74) measured intrinsic motivation before and after the assignment in three different groups of first-year university students. Each group had to create a set of queries of similar difficulty, with each group using a different database. Intrinsic motivation was found to be significantly higher for the group using their own social media data than for the groups using social media data from an unknown person or a business. The approach presented here can be applied to other subjects, such as data mining, image processing, or statistics.", "authors": [{"name": "María Teresa Sanz de Acedo", "affiliation": "Public University of Navarre, Pamplona, Spain"}, {"name": "Oscar Ardaiz", "affiliation": "Public University of Navarre, Pamplona, Spain"}, {"name": "Asier Marzo", "affiliation": "Public University of Navarre, Pamplona, Spain"}, {"name": "María Luisa Sanz de Acedo", "affiliation": "Public University of Navarre, Pamplona, Spain"}], "tags": ["personalization", "Business", "Facebook", "query processing", "Facebook information", "personalizing sample databases", "social data extraction", "human factors", "social media network", "social networking (online)", "Media", "student social data", "Particle measurements", "database queries", "intrinsic motivation", "Data mining", "database management systems", "Databases", "Atmospheric measurements", "social media data"]}, {"title": "An IoT and Wearable Technology Hackathon for Promoting Careers in Computer Science", "link": "https://ieeexplore.ieee.org/document/7755808/", "abstract": "This paper explores the use of a constructivist 21st-century learning model to implement a week-long workshop, delivered as a “hackathon,” to encourage preuniversity teenagers to pursue careers in STEM, with a particular emphasis on computer science. For Irish preuniversity students, their experience of computing can vary from word processing to foundational programming, and while many schools are looking to introduce more ICT into the classroom, many students are left with a narrow view of what computer science is all about. Twenty-one students participated in the workshop and completed pre- and post-surveys, and a free word association exercise in the areas of computing and careers in computing. Analysis revealed that students' motivation to learn about the design process, programming, inputs and outputs, and wearable technology (wearables)/Internet of Things (IoT) increased following participation. There were also increases in confidence in inputs and outputs and wearables/IoT following participation, as well as changes in the computing word associations, with students associating computing more with computer programming terms rather than general terms such as the Internet. The findings suggest that the combination of a hackathon event and a model for 21st century learning can be effective in motivating and increasing the self-efficacy of preuniversity teenagers in a number of emerging technological contexts such as IoT and wearables.", "authors": [{"name": "Jake Rowan Byrne", "affiliation": "Centre for Research in IT in Education, School of Education and School Computer Science and Statistics, Trinity College Dublin, University of Dublin, Dublin, Ireland"}, {"name": "Katriona O’Sullivan", "affiliation": "Centre for Research in IT in Education, School of Education and School Computer Science and Statistics, Trinity College Dublin, University of Dublin, Dublin, Ireland"}, {"name": "Kevin Sullivan", "affiliation": "Centre for Research in IT in Education, School of Education and School Computer Science and Statistics, Trinity College Dublin, University of Dublin, Dublin, Ireland"}], "tags": ["IoT", "Irish preuniversity students", "Wearable computers", "ICT", "prototypes", "constructivist 21st-century learning model", "wearable technologies", "wearable technology hackathon", "word processing", "students motivation", "computer science", "wearable computers", "creativity", "STEM", "human factors", "Internet of Things", "Prototypes", "educational institutions", "Internet of Things (IoT)", "foundational programming", "Teamwork", "design thinking", "Computer science education", "computer aided instruction", "problem solving", "teamwork", "student experiments"]}, {"title": "Self-Efficacy as a Long-Term Outcome of a General Education Course on Digital Technologies", "link": "https://ieeexplore.ieee.org/document/7809094/", "abstract": "This paper investigates the long-term outcomes of a general education course on digital technologies. Through conducting cross-sectional and longitudinal interviews with students, the authors found that non-engineering students who took this course had notable noncognitive, long-term outcomes. A primary focus of the work reported in this paper was the long-term outcome of self-efficacy. The authors also investigated the sources of self-efficacy for the students in the course. The primary sources of self-efficacy in the course were verbal persuasion and mastery experience. Faculty and teaching assistants were key sources for verbal persuasion. Some students exhibited a “success paradox”: They felt successful in the course even though they failed to meet their initial expectations. The authors also found that a mastery experience, such as working on a final project, can still feel successful when it is mediated by verbal persuasion. This paper can guide faculty in designing or adapting courses to promote student self-efficacy.", "authors": [{"name": "Christopher D. Schmitz", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois at Urbana–Champaign, Urbana, IL, USA"}, {"name": "Duyen T. Le", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois at Urbana–Champaign, Urbana, IL, USA"}, {"name": "Michael C. Loui", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Renata A. Revelo", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois at Chicago, Chicago, IL, USA"}], "tags": ["Springs", "self-efficacy", "undergraduate", "educational courses", "engineering education", "general education engineering course", "student self-efficacy", "Education courses", "mastery experience", "interviews", "verbal persuasion", "project-based learning", "Computers", "HTML", "Interviews", "digital technologies", "Information technology"]}, {"title": "Micro- and Macroscale Ideas of Current Among Upper-Division Electrical Engineering Students", "link": "https://ieeexplore.ieee.org/document/7778210/", "abstract": "The concept of electric current is fundamental in the study of electrical engineering (EE). Students are often exposed to this concept in their daily lives and early in middle school education. Lower-division university courses are usually limited to the study of passive electronic devices and simple electric circuits. Semiconductor physics is an upper-division course that presents the physics behind semiconductor devices in depth and exposes the students to microscale explanations of different types of current, such as drift and diffusion currents. This paper investigates how third-year college students majoring in EE link microscale and macroscale concepts of current, and what misconceptions they reveal after one quarter of advanced instruction in semiconductor physics. The interviewees were posed a problem, based on a distracting device structure that exposed student difficulties in defining current, charges and doping, and the plotting of current-voltage (I-V) characteristics. For example, some students had the naïve idea that current is the flow of a particular type of charge (i.e., only electrons or only holes) or that there is a “spectrum of doping.” Almost all students drew a one-quadrant coordinate system for the I-V curves, which might imply that students think only about positive voltages. These findings can inform further studies to identify and address misconceptions in the important area of semiconductor device physics.", "authors": [{"name": "Christian H. Kautz", "affiliation": "Zentrum fur Lehre and Lernen, Hamburg University of Technology, Hamburg, Germany"}, {"name": "Danielle B. Harlow", "affiliation": "Department of Education, University of California Santa Barbara, CA, USA"}, {"name": "Gina C. Adam", "affiliation": "Department of Electrical and Computer Engineering, University of California Santa Barbara, CA, USA, National Institute for Research and Development in Microtechnologies, Bucharest, Romania"}, {"name": "Susan M. Lord", "affiliation": "Department of Electrical Engineering, University of San Diego, CA, USA"}], "tags": ["Charge carrier processes", "doping spectrum", "third-year college students", "Doping", "Semiconductor devices", "electrical engineering education", "Current", "electric current concept", "EE link macroscale concepts", "upper-division course", "misconceptions", "Physics", "semiconductor physics", "lower-division university courses", "passive electronic devices", "educational courses", "qualitative", "EE link microscale concepts", "one-quadrant coordinate system", "power electronics", "Interviews", "microscale ideas", "upper-division electrical engineering students", "simple electric circuits", "educational institutions", "electric current", "semiconductor devices", "interviews", "macroscale ideas", "Batteries", "current-voltage characteristics", "Conceptual understanding", "electrical engineering (EE)", "middle school education", "doping", "semiconductor device physics"]}, {"title": "Using PBL to Improve Educational Outcomes and Student Satisfaction in the Teaching of DC/DC and DC/AC Converters", "link": "https://ieeexplore.ieee.org/document/7817795/", "abstract": "This paper examines the question of how to use project-based learning to increase student performance and satisfaction in a power electronics course addressing the topics of dc/dc and dc/ac converters, the assembly of a dc/dc converter, and the use of a commercial speed drive. A detailed presentation of the methodology is shown, and the results are analyzed by comparison to previous academic years and by satisfaction surveys. The new course design applies the jigsaw cooperative learning strategy to have students learn the theory of converters, solve problems, and perform simulations, before carrying out projects that solve real-world problems, such as the power converter for a competition solar vehicle (2014/15 course) and power converters for an air conditioner with inverter technology (2015/16 course). Rubrics were used to evaluate the students' work reports and the simulations. The project deliverables are presented and assessed in two design reviews, the first version covering the design and an open loop simulation, and the second covering the closed loop simulation and verification of specifications.", "authors": [{"name": "Alexis B. Rey-Boue", "affiliation": "Politechnical University of Cartagena, Cartagena, Spain"}, {"name": "Fernando Martinez-Rodrigo", "affiliation": "Tecnologia Electronica Department, University of Valladolid, Valladolid, Spain"}, {"name": "Luis Carlos Herrero-De Lucas", "affiliation": "Tecnologia Electronica Department, University of Valladolid, Valladolid, Spain"}, {"name": "Santiago de Pablo", "affiliation": "Electronics Technology Department, University of Valladolid, Valladolid, Spain"}], "tags": ["electrical engineering education", "rubric", "Planning", "project-based learning", "Portfolios", "commercial speed drive", "Power electronics", "dc/ac converters", "PBL", "project-based learning (PBL)", "Technological innovation", "peer review", "Atmospheric modeling", "power electronics", "rubrics", "DC-DC power convertors", "dc/dc converters", "DC-AC converters", "drives", "DC-DC converters", "air conditioner", "solar vehicle", "Active learning", "collaborative learning", "Education", "power electronics course", "jigsaw cooperative learning strategy", "Telecommunications", "cooperative learning (CL)", "student experiments", "DC-AC power convertors"]}, {"title": "Evaluating the Effect of Program Visualization on Student Motivation", "link": "https://ieeexplore.ieee.org/document/7817884/", "abstract": "An increase in student motivation is often cited as an expected effect of software visualization, but, as far as the authors are aware, no controlled experiments have yet demonstrated this. This paper therefore presents a controlled evaluation of this effect, conducted within the framework of self-determination theory. Students were tasked with removing redundant recursion in a multiple recursive algorithm. The experimental group (N = 19) used the SRec program visualization system, while the control group (N = 17) could use any programming tool in which they were proficient, such as BlueJ or Eclipse. The increase in motivation was measured by the difference between student scores in pre- and post-tests of their motivation. Statistically significant increases were observed for the two more determined forms of motivation, intrinsic motivation (p = 0.01), and extrinsic motivation via identified regulation (p = 0.03). Student feedback about their subjective acceptance of SRec reinforced these results. These findings give experimental support to expectations for software visualization in terms of motivation. Several paths for future work are identified, in particular, the need for more experiments under various conditions to achieve deeper understanding of the motivational effect of program visualization.", "authors": [{"name": "Maximiliano Paredes-Velasco", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Spain"}, {"name": "J. Ángel Velázquez-Iturbide", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Spain"}, {"name": "Isidoro Hernán-Losada", "affiliation": "Universidad Rey Juan Carlos, Móstoles, Spain"}], "tags": ["recursive functions", "programming tool", "Eclipse", "program visualisation", "document analysis", "Heuristic algorithms", "Software", "computer science education", "programming", "educational software", "multiple recursive algorithm", "Programming", "SRec program visualization system", "Data visualization", "program visualization", "Visualization", "BlueJ", "redundant recursion removal", "student motivation", "Algorithm design and analysis", "subjective acceptance", "Computer science education", "self-determination theory", "Java", "student feedback", "experimental research", "software visualization"]}, {"title": "Personalized Assessment as a Means to Mitigate Plagiarism", "link": "https://ieeexplore.ieee.org/document/7577807/", "abstract": "Although every educational institution has a code of academic honesty, they still encounter incidents of plagiarism. These are difficult and time-consuming to detect and deal with. This paper explores the use of personalized assessments with the goal of reducing incidents of plagiarism, proposing a personalized assessment software framework through which each student receives a unique problem set. The framework not only auto-generates the problem set but also auto-marks the solutions when submitted. The experience of using this framework is discussed, from the perspective of both students and staff, particularly with respect to its ability to mitigate plagiarism. A comparison of personalized and traditional assignments in the same class confirms that the former had far fewer observed plagiarism incidents. Although personalized assessment may not be cost-effective in all courses (such as language courses), it still can be effective in areas such as mathematics, engineering, science, and computing. This paper concludes that personalized assessment is a promising approach to counter plagiarism.", "authors": [{"name": "Sathiamoorthy Manoharan", "affiliation": "Department of Computer Science, University of Auckland, Auckland, New Zealand"}], "tags": ["security of data", "educational institution", "learning environment", "Automation", "mathematics", "computer science education", "student experience", "language courses", "Programming", "automated grading", "Academic dishonesty", "personalized assessment software framework", "plagiarism mitigation", "computing", "Interviews", "plagiarism", "science", "academic honesty", "Service-oriented architecture", "Plagiarism", "student assessment", "engineering", "Databases"]}, {"title": "A Three-Year Feedback Study of a Remote Laboratory Used in Control Engineering Studies", "link": "https://ieeexplore.ieee.org/document/7577834/", "abstract": "This paper discusses the results of a feedback study for a remote laboratory used in the education of control engineering students. The goal is to show the effectiveness of the remote laboratory on examination results. To provide an overview, the two applications of the remote laboratory are addressed: 1) the Stewart platform, and 2) the quadruple water tank system. Combining both applications allows a broad spectrum of practical examples featuring challenging control aspects such as multiple-input-multiple-output control, decoupling, non-minimum phase systems, open-loop unstable systems, and PID control design. The remote laboratory feedback study was performed using a five-point Likert-type scale survey to elicit the students' level of satisfaction with the laboratory. Three years of student examination results were also studied to compare performance before and after integrating the remote laboratory. In the first of these years there was no use of the remote laboratory. In the second year, the remote laboratory was introduced on a voluntary basis, and in the third year the remote laboratory was obligatory. Student feedback indicates that the remote laboratory needs further development to counter its limitations. A major conclusion of the survey was that there is keen interest in the remote laboratory to provide practical experience in the training of a control engineer. It can be concluded that the remote laboratory has a positive effect on student examination results.", "authors": [{"name": "Cosmin Copot", "affiliation": "Department of Electrical Energy, Systems and Automation, Ghent University, Ghent, Belgium"}, {"name": "Robin De Keyser", "affiliation": "Department of Electrical Energy, Systems and Automation, Ghent University, Ghent, Belgium"}, {"name": "Amélie Chevalier", "affiliation": "Department of Electrical Energy, Systems and Automation, Ghent University, Ghent, Belgium"}, {"name": "Clara Ionescu", "affiliation": "Department of Electrical Energy, Systems and Automation, Ghent University, Ghent, Belgium"}], "tags": ["Storage tanks", "Stewart platform", "three-year feedback study", "student experience", "student examination", "remote laboratory feedback study", "higher education", "five-point Likert-type scale survey", "Control engineering", "Remote laboratories", "control engineering students", "remote laboratory", "control engineering education", "feedback", "quadruple water tank system", "Servers", "Graphical user interfaces", "Education", "student experiments"]}, {"title": "Socio-Cultural Challenges in Global Software Engineering Education", "link": "https://ieeexplore.ieee.org/document/7755765/", "abstract": "Global software engineering education (GSEE) is aimed at providing software engineering (SE) students with knowledge, skills, and understanding of working in globally distributed arrangements so they can be prepared for the global SE (GSE) paradigm. It is important to understand the challenges involved in GSEE for improving the quality and experience of educators and students. This paper reports the findings of an empirical study on the socio-cultural aspects of GSEE. A case study was conducted involving 14 participants from ten different universities in eight countries. The data was analyzed using grounded theory's open coding procedure. The key contributions of this paper are the identification and description of seven dimensions of socio-cultural distance that caused several significant challenges in the courses: 1) language differences; 2) concept of time; 3) attitude toward grades; 4) assumptions about national culture; 5) differences in autonomy; 6) influence of the course lecturer; and 7) work habits. Recommendations from this paper that are expected to benefit GSEE educators and students include: cross-cultural orientation of students prior to the course; use of various strategies to support better comprehension of different English accents (e.g., speaking slowly, replaying recorded video messages, and text chatting); and educators familiarizing themselves and their students with the relevant GSE and GSEE literature.", "authors": [{"name": "Humaa Yaqoob", "affiliation": "University of Auckland, New Zealand, Auckland, New Zealand"}, {"name": "Muhammad Ali Babar", "affiliation": "University of Adelaide, Adelaide, SA, Australia, IT University of Copenhagen, Copenhagen, Denmark"}, {"name": "Rashina Hoda", "affiliation": "University of Auckland, New Zealand, Auckland, New Zealand"}, {"name": "Yogeshwar Shastri", "affiliation": "University of Auckland, New Zealand, Auckland, New Zealand"}], "tags": ["design projects", "Training", "Software", "computer science education", "cross-cultural orientation", "GSEE", "Context", "software engineering (SE) education", "higher education", "open coding procedure", "grounded theory", "socio-cultural challenges", "global software engineering (GSE)", "global software engineering education", "Curriculum design", "software engineering", "Global communication", "experiential learning", "teamwork", "Cultural differences", "Software engineering"]}, {"title": "Virtual-Instrument-Based Online Monitoring System for Hands-On Laboratory Experiment of Partial Discharges", "link": "https://ieeexplore.ieee.org/document/7518621/", "abstract": "Online monitoring of high-voltage (HV) equipment is a vital tool for early detection of insulation failure. Most insulation failures are caused by partial discharges (PDs) inside the HV equipment. Because of the very high cost of establishing HV equipment facility and the limitations of electromagnetic interference-screened laboratories, only a few educational and research institutes have facilities to carry out PD research studies. A remotely operated HV laboratory, i.e., the Virtual Instrumentation and Information and Communication Technologies (VI-ICT) facility, has been created to raise interest among students, researchers, and industrial users in the hands-on experimentation of PD activity inside HV power equipment. This paper describes the approaches to and mechanism for hands-on experimentation in PD detection and measurement and how this is conducted remotely using the facility. This remotely operated HVPD laboratory, as well as hosting the HV laboratory course, can provide training and testing for industry and utilities around the world.", "authors": [{"name": "Subrata Karmakar", "affiliation": "Department of Electrical Engineering, National Institute of Technology, Rourkela, India"}], "tags": ["HV laboratory course", "insulation failure", "Software", "Discharges (electric)", "partial discharge measurement", "online monitoring", "educational institutes", "virtual instrument", "Partial discharges", "power apparatus", "Corona", "high-voltage power equipment", "research institutes", "electromagnetic interference-screened laboratory", "electromagnetic interference", "Information and communication technologies (ICTs)", "Insulation", "hands-on laboratory experiment", "partial discharge detection", "virtual instrumentation", "Monitoring", "information technology", "partial discharges (PDs)", "Surface discharges", "student experiments", "communication technology", "online monitoring system"]}, {"title": "Innovative Mobile Robot Method: Improving the Learning of Programming Languages in Engineering Degrees", "link": "https://ieeexplore.ieee.org/document/7582486/", "abstract": "This paper describes a study of teaching a programming language in a C programming course by having students assemble and program a low-cost mobile robot. Writing their own programs to define the robot's behavior raised students' motivation. Working in small groups, students programmed the robots by using the control structures of structured programming. Over the course, there was a significant improvement in students' academic performance and motivation. The approach took into account four of the motivational factors that feature in the ARCS model: (1) attention; (2) relevance; (3) confidence; and (4) satisfaction. The main achievements of the approach were to be able to: (1) catch and hold students' attention throughout the course; (2) increase students' confidence in the learning process; (3) achieve a high student satisfaction level with their acquired skills; and (4) demonstrate to students the practical usefulness of the knowledge they had learned. This paper also determines the extent to which this strategy was effective in meeting the teaching goals.", "authors": [{"name": "Ruth Herrero Martín", "affiliation": "Fluids and Thermal Engineering Department, Universidad Politécnica de Cartagena, Murcia, Spain"}, {"name": "Pedro María Alcover Garau", "affiliation": "Department of Information and Communication Technologies, Universidad Politécnica de Cartagena, Murcia, Spain"}, {"name": "Juan Ángel Pastor Franco", "affiliation": "Department of Information and Communication Technologies, Universidad Politécnica de Cartagena, Murcia, Spain"}, {"name": "Octavio Ortiz Ortiz", "affiliation": "Departamento de Sistemas y Computación, Instituto Tecnológico, Morelia, Mexico"}], "tags": ["Challenge-based instruction", "relevance factor", "robot behavior", "motivational factors", "student motivation improvement", "student satisfaction level", "computer science education", "programming language teaching", "programming language learning improvement", "ARCS model", "educational courses", "confidence factor", "higher education", "mobile robot method", "satisfaction factor", "mobile robots", "Mobile robots", "learning process", "structured programming", "human factors", "problem-based learning", "student motivation", "robot programming", "student acquired skills", "control engineering education", "C programming course", "catch-and-hold student attention", "Robot sensing systems", "Education", "Programming profession", "C language", "teaching", "control structures", "student academic performance improvement", "engineering degrees", "student confidence", "engineering education", "team-based learning"]}, {"title": "Computational Creativity Exercises: An Avenue for Promoting Learning in Computer Science", "link": "https://ieeexplore.ieee.org/document/7940091/", "abstract": "Computational thinking and creative thinking are valuable tools both within and outside of computer science (CS). The goal of the project discussed here is to increase students' achievement in CS courses through a series of computational creativity exercises (CCEs). In this paper, the framework of CCEs is described, and the results of two separate studies on their impact on student achievement are presented. Students in introductory CS courses completed CCEs as part of those courses. Students in Study 1 came from a variety of programs, and students in Study 2 were engineering majors. A profiling approach was used to test whether the impact of the CCEs could be accounted for by differences in students' motivated and self-regulated engagement. Overall, CCEs had positive impacts on students' grades and knowledge test scores, and although there were differences in achievement across the profiles, the impact of the CCEs was generally consistent across profiles. The CCEs appear to be a promising way to increase student achievement in introductory CS courses. Implications and directions for future research are discussed.", "authors": [{"name": "Duane F. Shell", "affiliation": "Department of Educational Psychology, University of Nebraska-Lincoln, Lincoln, NE, USA"}, {"name": "Markeya S. Peteranetz", "affiliation": "Department of Educational Psychology, University of Nebraska-Lincoln, Lincoln, NE, USA"}, {"name": "Leen-Kiat Soh", "affiliation": "Department of Computer Science and Engineering, University of Nebraska-Lincoln, Lincoln, NE, USA"}, {"name": "Abraham E. Flanigan", "affiliation": "Department of Educational Psychology, University of Nebraska-Lincoln, Lincoln, NE, USA"}], "tags": ["CCE", "problem-solving", "Ciphers", "CS courses", "computer science education", "computational creativity", "learning promotion", "Creativity", "educational courses", "Computer science", "computer science", "creativity", "creative thinking", "Tools", "Engineering profession", "Algorithm design and analysis", "computational thinking", "self-regulated learning", "motivation", "student achievement", "computational creativity exercises", "Problem-solving", "Achievement"]}, {"title": "Preparing ICT Graduates for Real-World Challenges: Results of a Meta-Analysis", "link": "https://ieeexplore.ieee.org/document/7795180/", "abstract": "The information and communications technology (ICT) industry is making important contributions to economic growth both locally and globally. There is a high demand for ICT professionals that higher education institutions are still struggling to meet. An effective literature review is an important part of understanding the existing findings and issues in the education of future ICT professionals, and for planning future research directions. This comprehensive study presented here includes a review of 761 papers on the level of summary analysis and 155 papers in depth, according to ten research questions related to: curriculum design and delivery, knowledge and skills of future ICT professionals, teaching methods, collaboration between academia and industry, and future employment and career development of ICT professionals in the labor market. Based on the findings from a content and cluster analysis, the results indicate the need for a more holistic and strategic approach to the education of future ICT professionals, including career development support within formal processes of higher education.", "authors": [{"name": "Katarina Pažur Aničić", "affiliation": "Faculty of Organization and Informatics, University of Zagreb, Varaždin, Croatia"}, {"name": "Blaženka Divjak", "affiliation": "Faculty of Organization and Informatics, University of Zagreb, Varaždin, Croatia"}, {"name": "Krunoslav Arbanas", "affiliation": "Information Security in Paying Agency for Agriculture, Fisheries and Rural Development, Zagreb, Croatia"}], "tags": ["systematic literature review (SLR)", "information systems", "further education", "meta-analysis", "content analysis", "holistic approach", "curriculum design", "Employment", "employment", "curriculum delivery", "pattern clustering", "teaching methods", "higher education", "educational courses", "strategic approach", "ICT graduates", "Engineering profession", "metaanalysis", "higher education institutions", "Career development", "Europe", "information and communications technology (ICT) career", "educational institutions", "ICT professionals", "data analysis", "ICT education", "information and communications technology", "cluster analysis", "Content analysis", "Industries", "teaching", "educational administrative data processing", "Databases"]}, {"title": "Guest Editorial Special Issue on Maker Learning in Computer Science and Engineering Education", "link": "https://ieeexplore.ieee.org/document/7839306/", "abstract": "This special-issue section of the IEEE T\n<sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">ransactions on</sc>\n E\n<sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">ducation</sc>\n (ToE) consists of three papers centered around the theme of Maker Learning in Computer Science and Engineering Education. It is being published in tandem with a special “sister” issue of the IEEE T\n<sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">ransactions on</sc>\n L\n<sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">earning</sc>\n T\n<sc xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">echnologies</sc>\n (TLT) on the topic of Learning Through Wearable Technologies and the Internet of Things [item 1) in the Appendix].", "authors": [{"name": "Mark J. W. Lee", "affiliation": "School of Education, Charles Sturt University, Wagga, Wagga, NSW, Australia"}], "tags": ["Curriculum development", "Engineering education", "Computer science education", "Special issues and sections"]}, {"title": "Toward Modeling the Intrinsic Complexity of Test Problems", "link": "https://ieeexplore.ieee.org/document/7586116/", "abstract": "The concept of intrinsic complexity explains why different problems of the same type, tackled by the same problem solver, can require different times to solve and yield solutions of different quality. This paper proposes a general four-step approach that can be used to establish a model for the intrinsic complexity of a problem class in terms of solving time. Such a model allows prediction of the time to solve new problems in the same class and helps instructors develop more reliable test problems. A complexity model, furthermore, enhances understanding of the problem and can point to new aspects interesting for education and research. Students can use complexity models to assess and improve their learning level. The approach is explained using the K-map minimization problem as a case study. The implications of this research for other problems in electrical and computer engineering education are highlighted. An important aim of this paper is to stimulate future research in this area. An ideal outcome of such research is to provide complexity models for many, or even all, relevant problem classes in various electrical and computer engineering courses.", "authors": [{"name": "Abdulhadi Shoufan", "affiliation": "Department of ECE, Khalifa University, Abu Dhabi, UAE"}], "tags": ["Regression analysis", "Boolean functions", "Minimization", "Boolean function minimization", "problem solving time", "test problem intrinsic complexity", "intrinsic complexity", "Reliability", "problem definition", "Complexity theory", "computational complexity", "regression", "K-map minimization problem", "minimisation", "complexity model", "problem solving", "student assessment", "computer engineering courses", "Problem-solving", "Indexes"]}, {"title": "Blending Communities and Team-Based Learning in a Programming Course", "link": "https://ieeexplore.ieee.org/document/7967733/", "abstract": "In recent years, engineering education teachers have needed to incorporate technology-supported collaboration to enhance learning. Implementing these activities requires course redesign, which must be meticulous for their full potential to be reached. This can require a lot of work for first time users, which can be a barrier to implementation. Educational design patterns alleviate this burden by facilitating new course design with practices demonstrated to promote student engagement. This paper reports on the redesign of an introductory programming course and its experimental evaluation. The redesign was based on the community of inquiry learning framework (CoL), using design patterns from online Web communities and team-based learning (TBL). The evaluation included 562 students, 117 of them randomly assigned to two different experimental groups. One group used a CoL approach, and the other a blended TBL and CoL methodology. The remaining students were assigned to control groups. Results showed that students in the experimental groups outperformed those in the control group by the end of the semester, while the experimental CoL and TBL methodology helped students achieve a higher level of understanding in a shorter period of time due to increased participation rates. These data provide empirical evidence of the learning gains offered by online learning communities, and the way in which educational design patterns can facilitate course redesign.", "authors": [{"name": "Jorge Villalon", "affiliation": "Faculty of Economy and Business, Universidad Diego Portales, Santiago, Chile"}, {"name": "Jorge Chavez", "affiliation": "Faculty of Education, Universidad Andres Bello, Santiago, Chile"}, {"name": "Ignacio Cabrera", "affiliation": "Faculty of Engineering and Science, Universidad Adolfo Ibanez, Penalolen, Chile"}], "tags": ["student engagement", "community of inquiry learning framework", "computer science education", "programming", "online learning communities", "educational courses", "blended TBL", "course redesign", "online Web communities", "Engineering education", "Teamwork", "Internet", "object-oriented methods", "Collaborative work", "introductory programming course", "Blended learning", "CoL approach", "computer aided instruction", "Programming profession", "team-based learning", "educational design patterns", "learning communities"]}, {"title": "The Effects of a Robot Game Environment on Computer Programming Education for Elementary School Students", "link": "https://ieeexplore.ieee.org/document/7742384/", "abstract": "In the past, computer programming was perceived as a task only carried out by computer scientists; in the 21st century, however, computer programming is viewed as a critical and necessary skill that everyone should learn. In order to improve teaching of problem-solving abilities in a computing environment, extensive research is being done on teaching-learning methods, types of teaching software, the educational environment, and related tools. This paper, based on diverse experimental results, proposes an environment where elementary students can easily learn and practice computer programming. The proposed robot game environment used a tangible programming tool with which students can easily create robot programs, without learning syntax, and then validate their programming results; it can also provide various game activities to incite students' interest. Observation of elementary school students placed in the robot game environment confirmed the tool's usability and entertainment aspects, and students' attitudes toward programming and their understanding of programming concepts improved.", "authors": [{"name": "Wongyu Lee", "affiliation": "Department of Computer Science and Engineering, Korea University, Seoul, South Korea"}, {"name": "Daiyoung Kwon", "affiliation": "Department of Computer Science Education, Korea University, Seoul, South Korea"}, {"name": "Jaekwoun Shim", "affiliation": "Department of Computer Science Education, Korea University, Seoul, South Korea"}], "tags": ["Computer engineering", "elementary school students", "teaching software", "educational environment", "computer science education", "computer programming education", "robot game environment effect", "Computers", "elementary school", "robot programming", "problem-solving ability", "tangible programming tool", "control engineering education", "teaching-learning methods", "Education", "Robot sensing systems", "Programming profession", "teaching", "games", "problem solving", "Games", "computer games"]}, {"title": "Teaching Game Theory to Improve Adversarial Thinking in Cybersecurity Students", "link": "https://ieeexplore.ieee.org/document/7809088/", "abstract": "The ability to anticipate the strategic actions of hackers, including where, when, and how they might attack, and their tactics for evading detection, is a valuable skill for cybersecurity. Therefore, developing the strategic reasoning abilities of cybersecurity students is an important cybersecurity education learning objective. This paper proposes that basic game theory concepts should be taught to cybersecurity students in order to improve their strategic reasoning abilities. It details a pretest-posttest educational experiment that demonstrates that 2 h of basic game theory instruction results in a statistically significant improvement in students' abilities to anticipate the strategic actions of others. It also provides details of the game theory curriculum to help other cybersecurity educators replicate these results. Additionally, this paper suggests that another benefit of teaching game theory in a cybersecurity course is that it may fundamentally alter the way students view the practice of cybersecurity, helping to sensitize them to the human adversary element inherent in cybersecurity in addition to technology-focused best practices. This could result in a more naturally strategic-minded, and therefore better equipped, cybersecurity workforce.", "authors": [{"name": "Seth T. Hamman", "affiliation": "Cedarville University, Cedarville, OH, USA, Air Force Institute of Technology, Wright-Patterson AFB, OH, USA"}, {"name": "Kenneth M. Hopkinson", "affiliation": "Air Force Institute of Technology, Wright-Patterson AFB, OH, USA"}, {"name": "Ruth L. Markham", "affiliation": "Psychology Department, Cedarville University, Cedarville, OH, USA"}, {"name": "Gabrielle E. Metzler", "affiliation": "Psychology Department, Cedarville University, Cedarville, OH, USA"}, {"name": "Andrew M. Chaplik", "affiliation": "Psychology Department, Cedarville University, Cedarville, OH, USA"}], "tags": ["Adversarial thinking", "security of data", "cybersecurity workforce", "cybersecurity course", "hacker strategic actions", "cybersecurity students", "higher education", "adversarial thinking", "learning objectives", "educational courses", "professional skills", "time 2 h", "strategic reasoning", "game theory teaching", "Cognition", "human adversary element", "pretest-posttest educational experiment", "Game theory", "cybersecurity education learning objective", "strategic reasoning abilities", "cybersecurity", "Education", "computer aided instruction", "Games", "experimental research", "game theory", "Computer hacking", "technology-focused best practices"]}, {"title": "An Interactive Robotic Fish Exhibit for Designed Settings in Informal Science Learning", "link": "https://ieeexplore.ieee.org/document/7927730/", "abstract": "Informal science learning aims to improve public understanding of STEM. Free-choice learners can be engaged in a wide range of experiences, ranging from watching entertaining educational videos to actively participating in hands-on projects. Efforts in informal science learning are often gauged by their ability to elicit interaction, to foster learning, and to influence perceptions of STEM fields. This paper presents the installation of a biomimetic robotic fish controlled by an iDevice application at an informal science learning exhibit. Visitors to the exhibit are offered a unique experience that spans engineering and science, in which they can steer the robotic fish, choosing from three modes of control. Visitor engagement is examined through the lens of the Selinda model of visitor learning, while their behavior is examined using an adapted model of Borun's framework for behaviors indicative of learning. The evaluation of the efficacy of the exhibit is assessed through a post-experience survey questionnaire, an analysis of the application usage, and a behavior coding study. Data collected on visitor interactions with the exhibit indicate that free-choice learners value the importance of engineering research, and prefer interactive modes. Further, behavior coding results support the ability of the robotic fish platform to capture the visitors' attention. Findings offer compelling evidence that the exhibit is both highly engaging to visitors and a suitable format for science inquiry.", "authors": [{"name": "Maurizio Porfiri", "affiliation": "Education, and Human Development, New York University Steinhardt School of Culture, New York, NY, USA"}, {"name": "Paul Phamduy", "affiliation": "Education, and Human Development, New York University Steinhardt School of Culture, New York, NY, USA"}, {"name": "Catherine Milne", "affiliation": "Education, and Human Development, New York University Steinhardt School of Culture, New York, NY, USA"}, {"name": "Mary Leou", "affiliation": "Education, and Human Development, New York University Steinhardt School of Culture, New York, NY, USA"}], "tags": ["education robotics", "iDevice application", "Biologically-inspired robots", "engagement", "free-choice learning", "Encoding", "Selinda visitor learning model", "mobile robots", "educational robots", "biomimetic robotic fish", "STEM", "Tools", "informal learning", "control engineering education", "biomimetics", "informal science learning", "mobile applications", "interactive robotic fish exhibit", "mechanical engineering", "Fish", "Robot sensing systems", "exhibit"]}, {"title": "The Role of Gender in Students’ Ratings of Teaching Quality in Computer Science and Environmental Engineering", "link": "https://ieeexplore.ieee.org/document/7918606/", "abstract": "Students' ratings of teaching quality on course units in a computer science program and an environmental engineering program at a large Swedish university were obtained using the Course Experience Questionnaire; 8888 sets of ratings were obtained from men and 4280 sets were obtained from women over ten academic years. These student ratings from the two programs showed certain differences; in particular, teachers tended to receive higher ratings in subjects that were less typical for their gender than in subjects that were more typical for their gender. There were differences in the ratings given to male and female teachers, differences in the ratings given by male and female students, and interactions between these two effects. There was no systematic trend for students to give different ratings to teachers of the same gender as themselves than to teachers of the other gender. Nevertheless, without exception, even the statistically significant effects were small in magnitude and unlikely to be of theoretical or practical importance. It is concluded that the causes of differences in the career progression of male and female teachers in engineering education need to be sought elsewhere.", "authors": [{"name": "Ingrid Svensson", "affiliation": "Department of Biomedical Engineering, Lund University, Lund, Sweden"}, {"name": "Jonas Borell", "affiliation": "Ergonomics and Aerosol Technology, Lund University, Lund, Sweden"}, {"name": "Linda Price", "affiliation": "Technology Enhanced Learning, Kingston University, Kingston upon Thames, U.K."}, {"name": "John T. E. Richardson", "affiliation": "Institute of Educational Technology, Open University, Milton Keynes, U.K."}], "tags": ["Size measurement", "Swedish university", "engineering education", "Environmental engineering", "Engineering students", "teaching quality", "course experience questionnaire", "female teachers", "Computer science", "gender", "computer science", "engineering students", "environmental engineering", "teaching evaluations", "computer science education", "Engineering profession"]}]