[{"title": "Using a 3-D Printed Mechatronics Project to Simulate MEMS Design and Fabrication", "link": "https://ieeexplore.ieee.org/document/8337095/", "abstract": "Contribution: A semester-long project, geared towards a multidisciplinary group of undergraduate engineering students, to design and simulate a large-scale microelectromechanical systems (MEMS) 2-D optical scanner is presented. Background: MEMS component design and fabrication typically requires a cleanroom and costly high-vacuum equipment; these are not available at many small educational institutions. Conventionally, institutions without cleanroom access teach MEMS courses using lectures and videos, but this fails to engage and motivate students because of the absence of hands-on fabrication and design experience. Application Design: The mechatronics project has students use simple accessible tools, including 3-D printing, servomotors, a microcontroller, and mechanical simulation software to design and optimize a large-scale model of a MEMS optical scanner that simulates the 2-D motion of the actual device. Intended Outcomes: This project involves a hands-on approach designed to improve the participating students' understanding of MEMS devices; its design and process constraints closely resemble aspects of the MEMS industry. Application Design: In addition to a detailed description of the various components of the project, this paper describes methods to assess student progress, and gives reflections on the project's implementation. The effectiveness of the project is evaluated through assessment data obtained from a total of 65 students over three semesters. Findings: After introducing the project to the course, instructors saw a great increase in interest, and an improvement in performance. Students showed a significant improvement in their understanding of mask design and fabrication process description, as demonstrated by their final exam grades.", "authors": [{"name": "Sean Hart", "affiliation": "Division of Engineering Programs, State University of New York at New Paltz, New Paltz, NY, USA"}, {"name": "Kevin Hart", "affiliation": "Division of Engineering Programs, State University of New York at New Paltz, New Paltz, NY, USA"}, {"name": "Reena Dahle", "affiliation": "Division of Engineering Programs, State University of New York at New Paltz, New Paltz, NY, USA"}], "tags": ["three-dimensional printing", "Solid modeling", "MEMS industry", "student progress", "fabrication", "undergraduate engineering students", "interdisciplinary", "educational courses", "mechatronics", "mechanical simulation software", "process constraints", "micro-electromechanical (MEMS) devices", "optical scanners", "active learning", "MEMS optical scanner", "educational institutions", "mask design", "MEMS courses", "computer aided instruction", "MEMS design", "high-vacuum equipment", "mechatronics project", "large-scale model", "technology-enhanced learning", "Optical device fabrication", "Integrated optics", "large-scale microelectromechanical systems 2-D optical scanner", "Application Design", "engineering education", "MEMS component design", "microfabrication", "microactuators", "masks", "three-dimensional modeling", "semester-long project", "micromechanical devices", "cleanroom access", "teaching", "CAD", "Printing", "multidisciplinary group", "microcontrollers", "MEMS devices", "Optical design", "Micromechanical devices", "Design project"]}, {"title": "Practical Epistemic Cognition in a Design Project—Engineering Students Developing Epistemic Fluency", "link": "https://ieeexplore.ieee.org/document/8703388/", "abstract": "Contribution: This paper reports engineering students' practical epistemic cognition by studying their interactional work in situ. Studying “epistemologies in action” the study breaks away from mainstream approaches that describe this in terms of beliefs or of stage theories. Background: In epistemology, knowledge is traditionally seen as “justified true belief,” neglecting knowledge related to action. Interest has increased in studying the epistemologies people use in situated action, and their development of epistemic fluency. How appropriate such approaches are in engineering and design education need further investigation. Research Questions: 1) How do students in the context of a design project use epistemic tools in their interactional work? and 2) What are the implications of the findings in terms of how students' cognitive and epistemological development could be conceptualized? Methodology: A collaborative group of six students were video recorded on the 14th day of a fifth-semester design project, as they were preparing for a formal critique session. The entire, almost 6 h, session was recorded by four video cameras mounted in the design studio, with an additional fifth body-mounted camera. The video data collected was analyzed using video ethnographic, conversation analysis, and embodied interaction analysis methods. Findings: The results show that the students use a wealth of bodily material resources as an integral and seamless part of their interactions as epistemic tools, in their joint production of understanding and imagining. The analysis also suggests that students' epistemological and cognitive development, individually and as a group, should be understood in terms of developing “epistemic fluency.”", "authors": [{"name": "Thomas Ryberg", "affiliation": "Department of Communication and Psychology, Aalborg University, Aalborg, Denmark"}, {"name": "Anna-Karin Carstensen", "affiliation": "School of Engineering, Jönköping University, Jönköping, Sweden"}, {"name": "Jonte Bernhard", "affiliation": "Department of Science and Technology, Linköping University, Norrköping, Sweden"}, {"name": "Jacob Davidsen", "affiliation": "Department of Communication and Psychology, Aalborg University, Aalborg, Denmark"}], "tags": ["practical epistemic cognition", "design studio", "educational courses", "Cameras", "interaction analysis", "epistemic cognition", "human computer interaction", "fifth body-mounted camera", "situated action", "video ethnography", "Collaborative learning", "interactional work", "engineering students", "video cameras", "computer aided instruction", "fifth-semester design project", "epistemic tools", "Tools", "Cognition", "cognition", "epistemology", "epistemic fluency", "appropriate such approaches", "engineering education", "problem-based learning", "interaction analysis methods", "Engineering students", "Knowledge engineering", "design thinking"]}, {"title": "Visualizing Student Opinion Through Text Analysis", "link": "https://ieeexplore.ieee.org/document/8759085/", "abstract": "Contribution: An automated methodology that provides visualizations of students' free text comments from course satisfaction surveys. Focusing on sentiment, these visualizations reveal learning and teaching aspects of the course that either may require improvement or are performing well. They provide educators with a simple, systematic way to monitor their courses and make pedagogically sound decisions on teaching strategies. Background: Student course satisfaction surveys often solicit free text comments. This feedback can provide invaluable insights for educators, but because these comments often contain a large amount of data, they cannot easily be acted upon. Existing visualization methods are not suitable for this application, and needed additional capabilities. Research Questions: How can large quantities of student satisfaction data be summarized and visualized? How can these visualizations be used to learn meaningful information about courses? What are the recurring themes across semesters? Methodology: Several methods based on machine learning and text analysis techniques were used to visualize student satisfaction comments. The latent Dirichlet allocation (LDA) statistical method was used to identify aspects of student opinion of a course. The sentiment of the student comments were also identified. This information was then presented visually for educators in a case study that gives examples of these visualizations. Findings: The visualization methods explored provide educators with an overview of aspects and their associated sentiment. The summary visualizations allow easy comparison to be made between courses, or between teaching periods in the same course.", "authors": [{"name": "Wageeh Boles", "affiliation": "Queensland University of Technology, Brisbane, QLD, Australia"}, {"name": "Samuel Cunningham-Nelson", "affiliation": "Queensland University of Technology, Brisbane, QLD, Australia"}, {"name": "Mahsa Baktashmotlagh", "affiliation": "University of Queensland, St. Lucia, QLD, Australia"}], "tags": ["machine learning", "Sentiment analysis", "sentiment analysis", "student comments", "educational courses", "student opinion", "Text analysis", "statistical analysis", "latent Dirichlet allocation statistical method", "learning (artificial intelligence)", "Education", "Data visualization", "Electrical engineering", "teaching strategies", "computer aided instruction", "summary visualizations", "text analysis techniques", "research to practice", "data visualisation", "teaching evaluations", "text analysis", "student course satisfaction surveys", "Machine learning", "Visualization", "Resource management", "teaching", "courses", "undergraduate", "student satisfaction comments"]}, {"title": "MADM-Based Parametric Selection and Ranking of E-Learning Websites Using Fuzzy COPRAS", "link": "https://ieeexplore.ieee.org/document/8329446/", "abstract": "Contribution: The main contribution is to provide practitioners and researchers with an insight in efficiently and effectively employing multi-attribute decision making (MADM) methods in e-learning website selection problems. Background: Advances in information systems and the Internet have resulted in e-learning websites becoming an important interface for learners. The selection of a particular website directly affects the end users' performance, with the objectives and expected outcomes of e-learning being largely dependent on the quality of the teaching processes and the effectiveness of online access. Evaluation and selection of these websites has thus become a decisive issue for learners and developers. Intended Outcomes: This paper is expected to provide decision support to leaders in education and educational organizations in effectively analyzing and managing their e-learning system. A knowledge-based system may be developed to develop and assess e-learning websites in a meaningful way. Application Design: A hybrid MADM method, fuzzy complex proportional assessment (COPRAS) is used to evaluate, rank, and select e-learning websites of “C” programming language. The fuzzy COPRAS method is validated by comparison with the technique for order preference by similarity to ideal solution, on an existing selection problem of 12 websites available in the open literature. Findings: Fuzzy COPRAS provides a comprehensive ranking of e-learning websites based on fitness degree values. The case study results rated tutorialspoint.com as the best of the e-learning websites considered, and howstuffworks.com was rated lowest. This paper shows that fuzzy COPRAS could be useful for e-learning practitioners, developers, and the researchers.", "authors": [{"name": "Sandhya Garg", "affiliation": "Department of Applied Science and Management, Gateway Institute of Engineering and Technology, Sonepat, India"}, {"name": "Rakesh Garg", "affiliation": "Department of Computer Science and Engineering, Amity University, Noida, India"}, {"name": "Ramesh Kumar", "affiliation": "Department of Mechanical Engineering, Deenbandhu Chhotu Ram University of Science and Technology, Murthal, Sonepat, India"}], "tags": ["e-learning websites", "Linguistics", "Internet", "Web sites", "decision making", "multiattribute decision making", "fuzzy set theory", "MADM", "fuzzy COPRAS", "computer aided instruction", "Fuzzy sets", "e-learning system", "e-learning", "teaching evaluations", "C language", "Decision making", "teaching process", "Indexes", "data correlation", "C programming language", "ranking", "MADM-based parametric selection", "e-learning website selection problems", "selection indices", "Computer engineering", "Electronic learning", "learning technology"]}, {"title": "A Multidisciplinary Undergraduate Alternative Energy Engineering Course", "link": "https://ieeexplore.ieee.org/document/8392440/", "abstract": "Contribution: A novel multidisciplinary undergraduate course on alternative energy (AE) engineering that addresses gaps in current AE education, provides hands on skills, and matches topical coverage with societal needs. Background: Resource depletion and emissions associated with burning fossil fuels have led to growing worldwide interest in electricity production from non-fossil fuel, or alternative, energy sources. Recently there has been rapid growth of AE sources such as wind and solar photovoltaics. Societal and economic factors contribute to this continuing trend. Recent research has shown the urgent need for structured AE course curricula; engineering education in this multidisciplinary field is essential to support continued growth in this field. Intended Outcomes: A new approach to AE engineering education at the undergraduate level. Specifically, a comprehensive multidisciplinary approach that fills identified gaps in AE education. Application Design: The design of the course includes lectures, laboratories, and a hybrid power system design project focusing on economic integration of AE in power systems. Topics include principles of energy conversion, energy storage, and integration of solar thermal, solar photovoltaic, wind, hydroelectric and fuel cell AE sources into power systems. Societal needs are addressed through focus on industry structure, technology, economics and policies pertaining to AE. Findings: Learning outcome assessment demonstrate the validity of the proposed course for multidisciplinary alternative energy engineering education.", "authors": [{"name": "Aaron St. Leger", "affiliation": "Electrical Engineering and Computer Science Department, United States Military Academy, West Point, NY, USA"}], "tags": ["Wind energy", "Power systems", "Fuel cells", "current AE education", "Biological system modeling", "economic factors", "hybrid power systems", "multidisciplinary undergraduate alternative energy engineering course", "continuing trend", "multidisciplinary", "wind energy", "educational courses", "further education", "novel multidisciplinary undergraduate course", "energy storage", "multidisciplinary alternative energy engineering education", "higher education", "power systems", "educational institutions", "Laboratories", "solar energy", "laboratory", "solar photovoltaics", "energy conversion", "comprehensive multidisciplinary approach", "AE engineering education", "multidisciplinary field", "electrical engineering", "nonfossil fuel", "power engineering education", "hybrid power system design project", "undergraduate level", "continued growth", "Economics", "recent research", "fossil fuels", "energy sources", "burning fossil fuels", "Alternative energy", "societal factors", "topical coverage"]}, {"title": "Teacher Learner, Learner Teacher: Parallels and Dissonance in an Interdisciplinary Design Education Minor", "link": "https://ieeexplore.ieee.org/document/8666155/", "abstract": "Contribution: This paper analyzes reflective thinking within organizational structures in higher education and draws parallels between the challenges faced by educators developing interdisciplinary courses and their students working in ill-structured projects. Background: Interdisciplinarity as a learning goal is prevalent across engineering education literature. However, without organizational support structures to guide faculty members in developing interdisciplinary courses, interdisciplinarity as a student learning outcome is difficult to sustain. There is a need to evolve existing organizational structures faculty navigate when creating interdisciplinary courses, so that competing organizational systems do not stifle interdisciplinarity. Moreover, educators' effort in developing interdisciplinary courses is mirrored in the uncertain processes in which instructors engage students. Research Questions: In settings of interdisciplinary curriculum design and implementation, how do interdisciplinary faculty collaborations parallel that of their student design teams? How do organizational structures affect interdisciplinary faculty teams designing courses that span disciplines? Methodology: The study used a qualitative case, bound by three required courses in a new interdisciplinary undergraduate minor. Data was collected via interviews, class observations, and student reflection assignments. Analysis was guided by the conceptual frameworks of King and Kitchener's reflective judgment model and strange and banning's conceptualization of campus learning environments. Findings: Both educators and students develop through the discomfort with uncertainty-a prevalent theme in complex problem-solving. Forms of summative assessment pose an added challenge for both groups as they negotiate organizational structures. Lastly, discipline-specific expectations and ways of valuing knowledge contribute to uncertainty through the interactions among groups.", "authors": [{"name": "Lisa D. Mcnair", "affiliation": "Engineering Education Department, Virginia Tech, Blacksburg, VA, USA"}, {"name": "Diana Bairaktarova", "affiliation": "Engineering Education Department, Virginia Tech, Blacksburg, VA, USA"}, {"name": "Desen S. Ozkan", "affiliation": "Engineering Education Department, Virginia Tech, Blacksburg, VA, USA"}], "tags": ["learner teacher", "interdisciplinary design education minor", "educational courses", "further education", "interdisciplinary", "multidisciplinary design", "student reflection assignments", "higher education", "Organizations", "student learning outcome", "organizational systems", "interdisciplinary faculty collaborations", "interdisciplinary faculty teams", "Uncertainty", "qualitative", "reflective thinking", "engineering education literature", "Collaboration", "Engineering education", "Campus learning environment", "Navigation", "engineering education", "team teaching", "campus learning environments", "student design teams", "interdisciplinary courses", "Buildings", "teacher learner", "interdisciplinary curriculum design"]}, {"title": "A Cost-Effective Modified Bright-Mode Automatic Prism Coupler for Planar Optical Waveguide Characterization", "link": "https://ieeexplore.ieee.org/document/8401843/", "abstract": "Contribution: Prior studies indicate that students experimenting with characterization of optical planar waveguides use expensive ready-made prism couplers without clear understanding about construction of the entire optical measurement system. This paper presents a cost-effective modified bright-mode prism coupler that helps students learn optical waveguides, and enhances their knowledge and skills for building an optical system. Background: Commercial dark-mode prism couplers have little educational value, while measurement error for homemade manual dark-mode prism couplers is likely to be unacceptable. Therefore, students need an automated, accurate prism coupler system to learn basic concepts of the design, assembly, testing and validation of an entire optical system. Intended Outcomes: An automatic measurement system can help students learn optical waveguides and prism coupling. Assembling a prism coupler system helps them understand the software and hardware design, testing and validation of an optical system. Then, conducting experiments helps them develop their abilities in implementing an optical system. Application Design: Four design principles were followed: the modified bright-mode automatic prism coupler equipment had to be: 1) inexpensive; 2) open, with each part of the system being visible to, and adjustable by students; 3) sufficiently robust to withstand their unskilled adjustments; and 4) capable of being assembled and maintained by students. Findings: Use of this equipment significantly increased students' knowledge and skills in building and operating a prism coupler system. Students found the concept of waveguide coupling easier to understand through using the bright-mode prism coupler system instead of a commercial dark-mode prism coupler.", "authors": [{"name": "Huai-Yi Chen", "affiliation": "Electronic Engineering Department, Huafan University, New Taipei City, Taiwan"}, {"name": "Chien-Ming Wu", "affiliation": "Department of Technology Development, United Semi Corporation, Xiamen, China"}, {"name": "Chiung-Hui Lai", "affiliation": "Electronics Engineering Department, Chung Hua University, Hsinchu, Taiwan"}], "tags": ["Optical variables control", "design principles", "optical planar waveguides", "optical design techniques", "project-based learning", "bright-mode prism coupler system", "measurement error", "automatic measurement system", "optical testing", "software design", "hardware design", "accurate prism coupler system", "Optical refraction", "Optical waveguides", "bright-mode automatic prism coupler equipment", "engineering education", "knowledge gain", "prism coupler", "Couplings", "technology applications", "Couplers", "Optical coupling", "Adaptive optics", "optical prisms", "planar optical waveguide characterization", "dark-mode prism couplers", "optical measurement system", "optical couplers", "instructional design", "prism coupling", "Automatic test equipment", "cost-effective modified bright-mode automatic prism coupler"]}, {"title": "Mapping Engineering Students’ Learning Outcomes From International Experiences: Designing an Instrument to Measure Attainment of Knowledge, Skills, and Attitudes", "link": "https://ieeexplore.ieee.org/document/8472791/", "abstract": "Contribution: This paper developed a diagnostic tool to target various learning outcomes of international programs for engineering students, addressing both broad competencies and engineering specific outcomes. Background: Research has shown that international engineering learning activities provide students with opportunities to develop global competencies. Multiple instruments have been developed to target either students' broad competencies or engineering-related outcomes. While these previous instruments proved to be helpful in linking students' intercultural competencies with outcomes, in measuring engineering specific outcomes, or in assessing engineering students' products or projects, no tool was available to measure the full range of possible learning outcomes from engineering students' international learning experiences. Research Questions: 1) How can an instrument be developed to target various possible outcomes of engineering students from international learning experiences? 2) How does the instrument perform against established standards for validity and reliability? Methodology: Framed in the dimensions of knowledge, skills, and attitudes, a learning outcome survey was compiled based upon previous qualitative research. The instrument was assessed for structural validity by conducting an exploratory factor analysis, and its reliability by testing Cronbach's alpha (n = 407). Results from two sample programs were presented to demonstrate applicability. Fourteen follow-up interviews were analyzed to verify the survey content. Findings: The resulting survey showed a three-factor structure, each corresponding to knowledge, skills, and attitudes, and having high reliability in each dimension (alpha>0.85). Qualitative evidence verified the survey validity by demonstrating the close link between interview results and survey items, and the impact of learning activities on outcomes.", "authors": [{"name": "Bing Chen", "affiliation": "Graduate School, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Tianyi Zheng", "affiliation": "Graduate School of Education, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Juebei Chen", "affiliation": "Graduate School of Education, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Nathan McNeill", "affiliation": "CMU/CU-Boulder Mechanical Engineering Program, Colorado Mesa University, Grand Junction, CO, USA"}, {"name": "Jun Cai", "affiliation": "School of Environmental Science and Engineering, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Jiabin Zhu", "affiliation": "Graduate School of Education, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Qunqun Liu", "affiliation": "Dongying Federation of Social Science Associations, Dongying, China"}], "tags": ["further education", "Taxonomy", "engineering student learning outcomes", "Interviews", "validity", "Instruments", "reliability", "Global communication", "engineering students", "computer aided instruction", "international engineering learning activities", "Cultural differences", "survey", "outcomes", "engineering education", "globalisation", "possible learning outcomes", "International programs", "international learning experiences", "international experiences", "international programs", "Engineering students", "Knowledge engineering", "global competencies", "engineering-related outcomes"]}, {"title": "Integrating Model-Based Approaches Into a Neuroscience Curriculum—An Interdisciplinary Neuroscience Course in Engineering", "link": "https://ieeexplore.ieee.org/document/8434240/", "abstract": "Contribution: This paper demonstrates curricular modules that incorporate engineering model-based approaches, including concepts related to circuits, systems, modeling, electrophysiology, programming, and software tutorials that enhance learning in undergraduate neuroscience courses. These modules can also be integrated into other neuroscience courses. Background: Educators in biological and physical sciences urge incorporation of computation and engineering approaches into biology. Model-based approaches can provide insights into neural function; prior studies show these are increasingly being used in research in biology. Reports about their integration in undergraduate neuroscience curricula, however, are scarce. There is also a lack of suitable courses to satisfy engineering students' interest in the challenges in the growing area of neural sciences. Intended Outcomes: (1) Improved student learning in interdisciplinary neuroscience; (2) enhanced teaching by neuroscience faculty; (3) research preparation of undergraduates; and 4) increased interdisciplinary interactions. Application Design: An interdisciplinary undergraduate neuroscience course that incorporates computation and model-based approaches and has both software- and wet-lab components, was designed and co-taught by colleges of engineering and arts and science. Findings: Model-based content improved learning in neuroscience for three distinct groups: 1) undergraduates; 2) Ph.D. students; and 3) post-doctoral researchers and faculty. Moreover, the importance of the content and the utility of the software in enhancing student learning was rated highly by all these groups, suggesting a critical role for engineering in shaping the neuroscience curriculum. The model for cross-training also helped facilitate interdisciplinary research collaborations.", "authors": [{"name": "David A. Bergin", "affiliation": "Educational, School and Counseling Psychology, University of Missouri, Columbia, MO, USA"}, {"name": "Vinay Guntu", "affiliation": "Electrical Engineering and Computer Science Department, University of Missouri, Columbia, MO, USA"}, {"name": "Benjamin Latimer", "affiliation": "Electrical Engineering and Computer Science Department, University of Missouri, Columbia, MO, USA"}, {"name": "Satish S. Nair", "affiliation": "Electrical Engineering and Computer Science Department, University of Missouri, Columbia, MO, USA"}, {"name": "David J. Schulz", "affiliation": "Department of Biological Sciences, University of Missouri, Columbia, MO, USA"}], "tags": ["brain modeling", "Biological system modeling", "neurophysiology", "educational courses", "Programming", "further education", "neuroscience curriculum", "experiential learning", "Integrated circuit modeling", "physical sciences", "biological sciences", "Computational modeling", "model-based content improved learning", "interdisciplinary undergraduate neuroscience course", "educational institutions", "Biological neural networks", "neural engineering", "interdisciplinary research collaborations", "student learning", "engineering students", "computer aided instruction", "computational neuroscience", "Neuroscience", "teaching", "biomedical engineering", "neural sciences", "undergraduate neuroscience curricula", "undergraduate neuroscience courses", "Mathematical model"]}, {"title": "Using Topic Modeling to Extract Pre-Service Teachers’ Understandings of Computational Thinking From Their Coding Reflections", "link": "https://ieeexplore.ieee.org/document/8760527/", "abstract": "Contribution: This paper employs the automatic scoring of short essays as a novel way to determine pre-service teachers' knowledge of and attitudes toward computational thinking (CT) from their written reflections. Implications about designing CT courses for pre-service teachers are discussed. Background: CT is an essential 21st-century competency that supports the development of problem-solving skills. Inspired by computing science problem-solving practices, CT should transcend disciplines, but few universities or colleges include CT courses or CT content in their core courses. It is also difficult to know what pre-service teachers think about CT and their role in promoting it. Research Questions: Do pre-service teachers' coding reflections reveal any important information about their knowledge of, skills in, and attitudes toward CT? Methodology: Traditional qualitative techniques based on human raters are impractical in analyzing hundreds of essays. Topic modeling, an unsupervised machine learning modeling technique, was employed to extract topical features from participants' reflections. In one section of an undergraduate Introduction to Educational Technology course offered at a large university in Western Canada, n = 139 pre-service teachers wrote a short reflection on their experience following a 20 h Accelerated Intro to Computer Science Code.org course. Topics were identified by analyzing contextual trends in participants' written reflections. Findings: Results showed that pre-service teachers' reflections included CT concepts, practices, and perspectives. Specifically, participants connected the coding activity to prior knowledge and experiences.", "authors": [{"name": "Maria Cutumisu", "affiliation": "University of Alberta, Edmonton, AB, Canada"}, {"name": "Qi Guo", "affiliation": "University of Alberta, Edmonton, AB, Canada"}], "tags": ["science problem-solving practices", "computational thinking", "educational courses", "educational technology", "CT courses", "CT concepts", "higher education", "programming", "coding reflections", "Computational modeling", "Computational thinking", "Education", "educational institutions", "CT content", "Feature extraction", "computer aided instruction", "Problem-solving", "Tools", "written reflections", "computer science code.org course", "problem-solving skills", "topic modeling", "Data mining", "Encoding", "computer science education", "computing skills", "teaching", "pre-service teachers", "problem solving"]}, {"title": "Design Experiences, Engineering Identity, and Belongingness in Early Career Electrical and Computer Engineering Students", "link": "https://ieeexplore.ieee.org/document/8713555/", "abstract": "Contribution: This paper found that design experiences can foster engineering identity and belongingness for early career electrical and computer engineering students. Students had different interpretations of what it meant to be an engineer (identity) and their belongingness in engineering. This paper provides novel insights into how students may be developing identities and belongingness in engineering, both critical for student retention and success. Background: Design experiences are crucial for engineering students, both for developing academic competencies and allowing students to see how they can become engineers. Existing literature has mixed results with respect to the influence of team-based design experiences on engineering identity and belongingness. Research Questions: 1) How do design experiences influence early career electrical and computer engineering students' identification and belongingness in engineering? and 2) How do these students describe what it means to identify as an engineer and belong in engineering? Methodology: The beliefs of electrical and computer engineering students were examined using mixed methods to understand the intersection of design experiences, engineering identity, and belongingness. Findings: Students interpreted their engineering identity and belongingness differently, particularly, with respect to how design experiences can shape these attitudes. Whereas students interpreted engineering identity through their performance and interest in authentic engineering tasks, they interpreted belongingness as a means of comparing themselves to their peers. The findings have implications for engineering education researchers, and design instructors, to foster ways of being and belonging in engineering.", "authors": [{"name": "Dina Verdín", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Jacqueline Rohde", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Lisa Benson", "affiliation": "Department of Engineering and Science Education, Clemson University, Clemson, SC, USA"}, {"name": "Adam Kirn", "affiliation": "College of Education, University of Nevada, Reno, NV, USA"}, {"name": "Brianna Benedict", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Allison Godwin", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Geoff Potvin", "affiliation": "STEM Transformation Institute, Florida International University, Miami, FL, USA"}, {"name": "Lisa Musselman", "affiliation": "Department of Civil Engineering, University of Dayton, Dayton, OH, USA"}], "tags": ["design experiences", "computer engineering students", "Particle measurements", "Interviews", "Shape", "design instructors", "identity", "engineering education researchers", "design", "Belongingness", "electrical engineering education", "engineering identity", "Engineering profession", "Atmospheric measurements", "electrical engineering", "computer science education", "electrical engineering students", "Engineering students", "mixed methods research"]}, {"title": "Rotational Blended Learning in Computer System Engineering Courses", "link": "https://ieeexplore.ieee.org/document/8648287/", "abstract": "Contribution: An original application of individual rotation to blended learning, which mixes e-learning, discussion groups (seminars), practical laboratory work, and self-motivated tasks called “mini-projects.” Background: In examining the changing practices toward students' transferable skills in higher education, current teaching needs to devote much more attention to using multi-modular teaching methods to foster students' key transferable skills, such as logical, analytical, and creative thinking. Intended Outcomes: Rotational blended learning is intended to maximize students' engagement and improve educational outcomes during the learning process. Application Design: A rotated form of existing teaching methods-e-learning, seminars, and group projects-was proposed. A quasi-experimental design, involving classroom observation, student surveys, and overall results, was used with two cohorts of computer system engineering students, one a controlled cohort taught using traditional techniques and the other an experimental cohort taught using a novel rotational blended system. Findings: The influence of blended learning on the subsequent development of critical transferable skills was demonstrated. Results suggest that rotational blended learning is an ideal way to address these challenges, since it allows computer engineering students to reassess and enhance the core skills and competencies they need to acquire in their learning experiences.", "authors": [{"name": "Shufan Yang", "affiliation": "University of Glasgow, Glasgow, UK"}, {"name": "Robert Newman", "affiliation": "University of Wolverhampton, Wolverhampton, UK"}], "tags": ["Seminars", "learning process", "educational courses", "further education", "computer engineering students", "group projects", "mutual learning model", "multimodular teaching methods", "Task analysis", "computer aided instruction", "computer engineering", "rotational blended learning", "e-learning", "computer system engineering courses", "computer science education", "Blended learning", "Learning systems", "teaching", "Conferences", "mixed methods research", "Electronic learning"]}, {"title": "A Systematic Literature Review on Teaching and Learning Introductory Programming in Higher Education", "link": "https://ieeexplore.ieee.org/document/8447543/", "abstract": "Contribution: This paper adds to the results of previous systematic literature reviews by addressing a more contemporary context of introductory programming. It proposes a categorization of introductory programming challenges, and highlights key issues for a research roadmap on introductory programming learning and teaching in higher education. Background: Despite the advances in methods and tools for teaching and learning introductory programming, dropout and failure rates are still high. Published surveys and reviews either cover papers only up to 2007, or focus on methods and tools for teaching introductory programming. Research Questions: 1) What previous skills and background knowledge are key for a novice student to learn programming? 2) What difficulties do novice students encounter in learning how to program? 3) What challenges do teachers encounter in teaching introductory programming? Methodology: Following a formal protocol, automatic and manual searches were performed for work from 2010 to 2016. Of 100 papers selected for data extraction, 89 were retained after quality assessment. Findings: The most frequently cited skills necessary for learning programming were related to problem solving and mathematical ability. Problem solving was also cited as a learning challenge, followed by motivation and engagement, and difficulties in learning the syntax of programming languages. The main teaching challenges concern the lack of appropriate methods and tools, as well as scaling and personalized teaching.", "authors": [{"name": "Rodrigo Pessoa Medeiros", "affiliation": "Centro de Informática, Universidade Federal de Pernambuco, Recife, Brazil"}, {"name": "Geber Lisboa Ramalho", "affiliation": "Centro de Informática, Universidade Federal de Pernambuco, Recife, Brazil"}, {"name": "Taciana Pontual Falcão", "affiliation": "Departamento de Computação, Universidade Federal Rural de Pernambuco, Recife, Brazil"}], "tags": ["personalized teaching", "learning introductory programming", "educational courses", "further education", "systematic literature review", "programming", "higher education", "STEM", "Manuals", "faculty development", "student experience", "Education", "novice student", "programming languages", "Programming profession", "teaching introductory programming", "computer aided instruction", "Achievement", "Tools", "Systematics", "computer science education", "introductory programming", "programming languages syntax", "teaching", "systematic review", "problem solving", "introductory programming learning", "Bibliographies"]}, {"title": "Cybersecurity Interventions for Teens: Two Time-Based Approaches", "link": "https://ieeexplore.ieee.org/document/8548564/", "abstract": "Contribution: Intervention effectiveness is shown to vary in its influence on teenagers' outcomes with cybersecurity problem-solving and engagement. In-depth, high-intensity types of intervention may be more effective for female students. Background: Instructional interventions are being developed to address both the critical shortage in cybersecurity talent and gender gaps in the cyber workforce. These interventions need rigorous evaluation. Specific types of instructional strategies are particularly effective for STEM learning. Also, gender differences are found in the benefit students derive from certain instructional methods. An important question is whether certain instructional methods are particularly effective for cybersecurity learning, and consistent in both male and female students. Research Questions: Do cybersecurity interventions affect problem-solving, cybersecurity engagement, and/or cybersecurity self-efficacy? Are there gender differences in terms of intervention effectiveness? Methodology: Study 1 (n = 79) included a 60-min workshop model where participants, assigned to treatment and control groups, completed surveys pre- and post-intervention. The treatment group experienced a workshop on computer networking, without any technology. The control group did not receive the workshop. Study 2 (n = 34) was a week-long intervention whose participants had formal lessons, built websites, and defended themselves from an ongoing simulated cyberattack. Participants completed a survey on cybersecurity learning and engagement three times during the intervention. Findings: Study 1 showed no main treatment effect, but females experienced greater gains in problem-solving than males. In Study 2, there was positive growth over time and females experienced greater growth in cybersecurity self-efficacy relative to males.", "authors": [{"name": "Emma Frank", "affiliation": "Department of Organizational Behavior, University of Georgia, Athens, GA, USA"}, {"name": "Shambhu Upadhyaya", "affiliation": "Department of Computer Science and Engineering, State University of New York at Buffalo, Buffalo, NY, USA"}, {"name": "Ruochen Liao", "affiliation": "Management Science and Systems Department, State University of New York at Buffalo, Buffalo, NY, USA"}, {"name": "H. Raghav Rao", "affiliation": "Department of Information Systems and CyberSecurity, University of Texas at San Antonio, San Antonio, TX, USA"}, {"name": "Laura C. Amo", "affiliation": "Management Science and Systems Department, State University of New York at Buffalo, Buffalo, NY, USA"}], "tags": ["security of data", "cybersecurity learning", "control groups", "cybersecurity education", "cybersecurity interventions", "cybersecurity engagement", "cybersecurity self-efficacy", "middle school", "Computer science", "Computational modeling", "engagement", "female students", "Education", "computer aided instruction", "instructional interventions", "Problem-solving", "gender differences", "gender", "Engineering profession", "time-based approaches", "gender issues", "cybersecurity problem-solving", "high-intensity types", "cybersecurity talent", "cyber skills", "intervention effectiveness", "scale development", "instructional strategies", "Conferences", "Computer awareness"]}, {"title": "Improving Student Engagement in Teaching Electric Machines Through Blended Learning", "link": "https://ieeexplore.ieee.org/document/8734000/", "abstract": "Contribution: This paper has demonstrated that the use of blended learning in an electrical machines course has increased student engagement, pass rate, and scores across the GPA spectrum. Background: Lack of engagement by students in electric machine courses have been reported across the world. Interventions however, usually take the form of laboratory and simulation assignments. There is little information on, however, the use of blended learning and flipped classroom techniques to combat these problems. Intended Outcomes: Increased engagement in the course evidenced by exam performance. In particular, for the transformer, dc motor, induction motor, and synchronous motor the students should be able to explain the construction and principle of operation, and compute voltages, currents and power for various operating conditions. Application Design: The approach involved online lectures, tutorial submissions, and peer feedback forums followed by face to face tutorial sessions. These were chosen because online activities would allow students to access material on devices with which they are accustomed to engaging deeply and because peer feedback has been shown to build community, and increase the quality of discourse for both students and lecturer. Findings: There was a significant improvement in exam performance when compared to previous years. The pass rate of the course moved from approximately 60% in previous years to 86%. The class average mark also increased from approximately 50% in previous years to 63%.", "authors": [{"name": "Arvind Singh", "affiliation": "University of the West Indies, St. Augustine, Trinidad and Tobago"}, {"name": "Craig J. Ramlal", "affiliation": "University of the West Indies, St. Augustine, Trinidad and Tobago"}, {"name": "Sean Rocke", "affiliation": "University of the West Indies, St. Augustine, Trinidad and Tobago"}, {"name": "Akash Pooransingh", "affiliation": "University of the West Indies, St. Augustine, Trinidad and Tobago"}], "tags": ["positive interdependence", "educational courses", "dc motor", "Educational courses", "Tutorials", "GPA spectrum", "blended learning", "electric machine courses", "engagement", "Electrical engineering education", "synchronous motors", "electric machines", "computer aided instruction", "electric machines teaching", "electrical engineering education", "synchronous motor", "Computer aided instruction", "electrical engineering", "Synchronous motors", "DC motors", "Blended learning", "teaching", "simulation assignments", "flipped classroom", "student engagement"]}, {"title": "Improving Student Assessment of a Server Administration Course Promoting Flexibility and Competitiveness", "link": "https://ieeexplore.ieee.org/document/8329010/", "abstract": "Contribution: This paper describes a highly flexible design for a master's-level server administration course that uses updated technologies, addresses the most important course design challenges and extracts useful feedback from student work. The main contribution of this design is eliminating the self-regulation challenge students encounter in similar highly flexible computer-related courses. This is attributed to the introduction of orientation lectures and a competitive element; these may have helped students to achieve their goals on time. Background: The Web server administration course on the master's of the Web engineering program was intended to inculcate a series of competences, such as common administration techniques, procedures to increase security, efficient website deployment, and an introduction to clusters and infrastructure deployment automation. The course generally failed to transmit these competencies effectively; complaints were made about the difficulty of the course and the low applicability of its contents. Intended Outcomes: The design facilitates students finding assessment activities that better suit their profiles or previous experience, and enables them to customize their assessment, thus encouraging them and giving future value to their work. Application Design: The course design maximizes assessment flexibility by providing students with many optional activities from which to choose. It also promotes a healthy competitive spirit to improve student's motivation and results. Findings: Complaints about the difficulty or lack of applicability were no longer made. The course is highly valued by the students, achieving a very high pass rate and average score.", "authors": [{"name": "Jose Manuel Redondo", "affiliation": "Department of Computer Science, University of Oviedo, Oviedo, Spain"}], "tags": ["Web server administration course", "high pass rate", "useful feedback", "common administration techniques", "healthy competitive spirit", "competitive element", "course design", "educational courses", "Internet", "infrastructure deployment automation", "Computational modeling", "flexibility", "student assessment", "Competitivity", "similar highly flexible computer-related courses", "master’s students", "Creativity", "file servers", "efficient website deployment", "Face", "computer aided instruction", "Web servers", "application design", "assessment flexibility", "computer engineering", "server administration course", "assessment activities", "Europe", "updated technologies", "computer science education", "important course design challenges", "self-regulation challenge students", "flipped classroom", "Security", "highly flexible design", "Web engineering program", "student work"]}, {"title": "Investigating Students’ Habits of Mind in a Course on Digital Signal Processing", "link": "https://ieeexplore.ieee.org/document/8763898/", "abstract": "Contribution: Knowledge of students' Habits of Mind in a signal processing course, and a method for education research. The method identifies factors that may influence students' performance, but are not evident when analyzing agglomerated data; it is an alternative to the traditional case study method as it derives the cases after applying a clustering approach. Background: Habits of Mind refer to mathematical, logical, and attitudinal modes of thinking required for students of science, mathematics, technology, and engineering to become effective problem solvers, capable of transferring such modes to new contexts. These are particularly relevant in a signal processing course in which students must learn to address engineering problems using tools and techniques previously acquired in an abstract context (mathematics). Research Questions: 1) What are the different Habits of Mind patterns exhibited by the students? 2) Are some of these patterns associated with differences in course grades? Methodology: A qualitative method is combined with random signal modeling and machine learning. Students' work is first annotated manually based on a custom-built rubric of Habits of Mind. Data is modeled and clustered to obtain statistically significant patterns of Habits of Mind corresponding to divisions of the students into groups. Findings: The data obtained suggests that the student group is inhomogeneous in terms of their Habits of Mind, and this inhomogeneity is associated with grade differences. In particular, the course grade is found to be dependent on inhomogeneity based on at least two Habits of Mind: 1) computation and estimation and 2) values and attitudes.", "authors": [{"name": "Tarun Yellamraju", "affiliation": "Purdue University, West Lafayette, IN, USA"}, {"name": "Mireille Boutin", "affiliation": "Purdue University, West Lafayette, IN, USA"}, {"name": "Alejandra J. Magana", "affiliation": "Purdue University, West Lafayette, IN, USA"}], "tags": ["communication skills", "pattern clustering", "machine learning", "mathematical modes", "random signal modeling", "attitudinal modes", "agglomerated data", "educational courses", "habits of mind", "signal processing course", "engineering problems", "digital signal processing", "peer review", "science mathematics technology and engineering", "signal processing", "rubric", "STEM", "learning (artificial intelligence)", "Clustering", "Data models", "computer aided instruction", "students performance", "education research", "critical thinking", "Market research", "peer instruction", "Digital signal processing", "grade differences", "engineering education", "Random processes", "course grade", "computing skills", "Machine learning", "clustering approach", "engineering computing", "logical modes", "problem solvers"]}, {"title": "Latent Class Modeling of Children’s Preference Profiles on Tangible and Graphical Robot Programming", "link": "https://ieeexplore.ieee.org/document/8529248/", "abstract": "Contribution: Prior studies on tangible versus graphical user interfaces have reported controversial findings concerning children's preferences. This paper shows that their preference profiles in the domain of introductory programming are associated with gender and age for both interfaces. Background: The relevant literature mainly consists of empirical research into the possible advantages and weaknesses of tangible user interfaces versus graphical user interfaces in the domain of programming for children. Research designs have considered aspects of usability, attractiveness and users' collaboration. Existing findings are not clear. Methodological issues, e.g., limitations of simple statistics, may have limited the clarify and usefulness of findings to date. The present study explores children's preferences profiles. Research Questions: Two research questions were posited: the first focused on the latent profiles of children's preferences for the two programming interfaces (tangible or graphical), and the second focused on the association of these profiles with gender and age. Methodology: Children (N=148) aged from six to 13 years old participated in this paper. Eight variables related to the attractiveness, collaboration, and usability factors for the tangible and graphical programming interfaces were measured and analyzed by Latent Class Analysis, a model-based clustering method that can reveal distinct preference-profiles and associate them with individual differences. Findings: The patterns of responses are consistent across items for both interfaces. The graphical programming interface strongly trisects children's preferences profiles; the three latent profiles encountered were associated with gender and age.", "authors": [{"name": "Theodosios Sapounidis", "affiliation": "Department of Informatics, Aristotle University of Thessaloniki, Thessaloniki, Greece"}, {"name": "Stavros Demetriadis", "affiliation": "Department of Informatics, Aristotle University of Thessaloniki, Thessaloniki, Greece"}, {"name": "Dimitrios Stamovlasis", "affiliation": "Faculty of Philosophy, Aristotle University of Thessaloniki, Thessaloniki, Greece"}], "tags": ["pattern clustering", "games", "Robot programming", "robot programming", "model-based clustering method", "tangible robot programming", "tangible programming interfaces", "statistical analysis", "graphical programming interfaces", "Programming profession", "computer interfaces", "Collaboration", "Usability", "Graphical user interfaces", "elementary education", "computer science education", "Aging", "introductory programming", "tangible programming", "tangible user interfaces", "children preference profiles", "graphical robot programming", "Latent class modeling", "problem solving", "graphical user interfaces", "Computer engineering"]}, {"title": "Creativity in Electrical Engineering Degree Programs: Where Is the Content?", "link": "https://ieeexplore.ieee.org/document/8705305/", "abstract": "Contribution: This paper demonstrated on a large scale that explicit articulation of creativity-related learning goals on engineering syllabi is quite limited, and primarily limited to the first year of study. Engineering educators may need to do more to ensure creativity is explicitly addressed as an expected learning outcome within engineering syllabi. Background: Prior studies have shown inclusion of creativity within engineering syllabi and course activities are generally limited. Students may perceive educators do not value creativity, and their studies have limited influence on their creative skills. Studies conflict on whether creativity skills increase over completing an engineering degree. Creativity has been demonstrated to be an important skill for engineering professionals, but one not necessarily appropriately addressed in engineering programs. Few studies have attempted to quantify coverage of creativity material on a nation-wide scale, as opposed to in a single or select few institutions. Research Questions: 1) To what extent do engineering educators explicitly articulate creativity and innovation-related learning goals and material on their course syllabi? and 2) To what extent do engineering educators explicitly articulate exposure to, or instruction in the use of, creativity heuristics within their course syllabi? Methodology: The online publicly accessible course outlines of 1109 compulsory courses from 42 degree programs accredited by two national engineering accreditation bodies were qualitatively analyzed in a two-stage approach using document analysis. Findings: Approximately 2% of compulsory electrical engineering course outlines explicitly articulate creativity-related material; only one course articulated engaging students in using creativity heuristics.", "authors": [{"name": "Iouri Belski", "affiliation": "RMIT University, Melbourne, VIC, Australia"}, {"name": "Margaret Hamilton", "affiliation": "RMIT University, Melbourne, VIC, Australia"}, {"name": "Scott Adams", "affiliation": "Deakin University, Geelong, VIC, Australia"}, {"name": "Andrew Valentine", "affiliation": "University of Western Australia, Perth, WA, Australia"}], "tags": ["educational courses", "creative skills", "Educational courses", "expected learning outcome", "engineering educators explicitly articulate creativity", "creativity skills", "creativity heuristics", "electrical engineering computing", "Innovation management", "Electrical engineering education", "innovation management", "Creativity", "course syllabi", "engineering curriculum", "computer aided instruction", "electrical engineering education", "creativity-related learning goals", "value creativity", "compulsory electrical engineering course outlines", "innovation", "explicit articulation", "Computer aided instruction", "engineering syllabi", "Technological innovation", "national engineering accreditation bodies", "electrical engineering", "creativity-related material", "creativity material", "studies conflict", "electrical engineering degree programs", "engineering professionals", "Engineering students", "undergraduate", "Electrical engineering computing"]}, {"title": "How a Flexible Classroom Affords Active Learning in Electrical Engineering", "link": "https://ieeexplore.ieee.org/document/8470966/", "abstract": "Contribution: This paper presents evidence demonstrating ways in which flexible classrooms (which have movable tables and chairs that can be rearranged into different layouts) afford active learning. It highlights the quantitative increase in active learning that occurs for one instructor and discusses how the affordances of the flexible classroom support qualitatively better instructor-student and student-peer interaction during active learning. Background: Research has shown that students benefit from active learning, but instructors still perceive many barriers to implementing it. Flexible classrooms may reduce some of these barriers, and their affordances may promote better student engagement and allow instructors to use more active learning than traditional lecture-style classrooms do. Research Questions: What are the differences in the amount of active learning used by an instructor between flexible classrooms and traditional classrooms? How do instructors and students use the affordances of flexible classrooms during active learning? Methodology: An instructor at a large Midwestern university taught the course Introduction to Electronics Circuits in a traditional classroom one semester and in a flexible classroom the next. The two research questions were addressed through complementary quantitative and qualitative analyses of video data, classroom observations, and instructor interviews to detail the amount of active learning and the way the instructor facilitated it in the flexible classroom. Findings: The time the instructor devoted to active learning increased in the flexible classroom, while the time she devoted to instructor-led examples decreased. The affordances of the flexible classroom also encouraged more frequent and better student-instructor and student-peer interaction.", "authors": [{"name": "Max W. Blackburn", "affiliation": "Electrical Engineering and Computer Science Department, University of Michigan, Ann Arbor, MI, USA"}, {"name": "Aaron W. Johnson", "affiliation": "Aerospace Engineering, University of Michigan, Ann Arbor, MI, USA"}, {"name": "Magel P. Su", "affiliation": "Materials Science and Engineering Department, University of Michigan, Ann Arbor, MI, USA"}, {"name": "Cynthia J. Finelli", "affiliation": "School of Education, University of Michigan, Ann Arbor, MI, USA"}], "tags": ["Electronic circuits", "Active learning", "educational courses", "student", "Educational courses", "instructor interviews", "Layout", "Electrical engineering education", "flexible classroom affords active learning", "computer aided instruction", "student-peer interaction", "flexible classroom support", "interaction", "electrical engineering education", "classroom", "instructor-student interaction", "Midwestern university", "Computer aided instruction", "electrical engineering", "video data", "classroom observations", "instruction", "Portable computers", "student engagement", "faculty", "electronics circuits"]}, {"title": "A Genetic Algorithm-Based Personalized Remedial Learning System for Learning Object-Oriented Concepts of Java", "link": "https://ieeexplore.ieee.org/document/8573864/", "abstract": "Contribution: An online genetic algorithm-based remedial learning system is presented in order to strengthen students' understanding of object-oriented programming (OOP) concepts by tailoring personalized learning materials according to each student's strengths and weaknesses. Background: Prior studies on computer programming education have analyzed methods of learning OOP, and shown that teaching this topic is a challenge. A simple and personalized learning system for generating remedial learning materials would therefore be valuable, but had yet to be designed. Intended Outcomes: Students' grasp of OOP concepts is expected to improve through study of the tailored remedial learning materials generated by the system. Application Design: Students who had previously studied OOP were recruited to test the learning system in a two-semester pre-experiment using a one-group pre-test-post-test design. The students first took a pre-test that determined their individual strengths and weaknesses in these concepts. They then read three sets of quiz-based remedial learning materials; each set was generated by the system according to the individual student's answers in the pre-test and previous quizzes. Findings: 1) Overall, the changes between learners' pre-and post-test scores were significant; 2) Score changes for different learners (junior, senior, low-achievement, and high-achievement learners) and for different learning styles (intensive and non-intensive) were also significant; and 3) Score changes for low-achievement learners were greater than those for high-achievement learners.", "authors": [{"name": "Che-Chern Lin", "affiliation": "National Kaohsiung Normal University, Kaohsiung, Taiwan"}, {"name": "Zi-Cheng Liu", "affiliation": "National Sun Yat-sen University, Kaohsiung, Taiwan"}, {"name": "Yu-Wen Lin", "affiliation": "National Kaohsiung Normal University, Kaohsiung, Taiwan"}, {"name": "Chih-Lin Chang", "affiliation": "National Cheng Kung University, Tainan, Taiwan"}], "tags": ["genetic algorithms", "quiz-based remedial learning materials", "two-semester pre-experiment", "Adaptive computer learning", "Java", "remedial learning", "Education", "computer programming education", "online genetic algorithm-based personalized remedial learning system", "Programming profession", "computer aided instruction", "individual differences", "OOP concepts", "personalized learning system", "Genetic algorithms", "one-group pre-test-post-test design", "computer science education", "object-oriented programming", "educational software", "remedial learning materials", "computer science", "Learning systems", "teaching", "learning styles", "simple learning system", "object-oriented programming concepts", "Biological cells"]}, {"title": "Various Interactive and Self-Learning Focused Tutorial Activities in the Power Electronic Course", "link": "https://ieeexplore.ieee.org/document/8628240/", "abstract": "Contribution: This paper introduces the real-world limitations and non-technical aspects of power electronics (PEs) projects to students through innovative tutorial activities. Background: Many electrical engineering curricula offer a PE courses (PECs) for third- or fourth-year undergraduate students. Prior research on PEs education mainly focused on improving students' experimental skills through developing practical experiments, laboratory activities, and problem/project-based learning. An instructional approach that instead employs real-world knowledge and skills is worth evaluating. Intended Outcomes: Students should be able to consider realworld technical and non-technical limitations when applying theory to design PE circuits and converters, and be able to select and carry out appropriate tests to troubleshoot circuits. Application Design: Prior research on engineering education emphasized the importance of introducing real-world limitations to the students as part of their curriculum. This paper suggests that the tutorial activities presented in a PEC can help students acquire skills in designing and troubleshooting a circuit or system according to desired technical aspects, real-world limitations, and available data. Findings: Evidence of the validity of this approach in a PEC at two Australian universities, over four academic years, is provided. Students receiving the new tutorial activities had percentage scores some 10-15 points higher than those who had traditional tutorials. Another evaluation reveals the students' vibrant participation in the activities during the new tutorial sessions.", "authors": [{"name": "Farhad Shahnia", "affiliation": "Murdoch University, Perth, WA, Australia"}, {"name": "Hadi Hosseinian Yengejeh", "affiliation": "Murdoch University, Perth, WA, Australia"}], "tags": ["PE circuit design", "educational courses", "further education", "PEC", "electrical engineering curricula", "power electronics course", "Tutorials", "PEs education", "power aware computing", "team-based learning", "Matlab", "interactive focused tutorial activities", "Education", "educational institutions", "Switches", "Power electronics", "logic design", "computer aided instruction", "laboratory activities", "Australian universities", "Engineering profession", "electronic engineering computing", "fourth-year undergraduate students", "Australia", "engineering education", "student satisfaction", "interactive systems", "problem-based learning", "tutorial sessions", "power electronic course", "PE courses", "electronic engineering education", "self-learning focused tutorial activities"]}, {"title": "Heuristics for the Development and Evaluation of Educational Robotics Systems", "link": "https://ieeexplore.ieee.org/document/8703426/", "abstract": "Contribution: This paper presents a model for educational robotics tools and a corresponding set of heuristics for their development and evaluation specifically adapted to the needs and expectations in formal education settings. Background: The increased use of educational robots in classrooms, and the steadily growing number of alternatives from which to choose, bring the requirement for appropriate methods to develop and evaluate these tools. Yet the current body of literature does not provide comprehensive frameworks that allow this question to be adequately addressed. Although previous research has studied the use of educational robotics in classrooms, there is still a lack of methods to support their development and evaluation. Intended Outcomes: An evaluation framework to support researchers, engineers, educators, and decision makers in taking informed decisions about educational robotics systems. Application Design: This paper proposes to consider activities involving educational robotics tools as a kind of “educational augmented tabletop game.” Within this framework, a set of fourteen heuristics was devised, based on literature on games and learning tools. The validity of these heuristics was examined with a heterogenous group of twelve school teachers, who tested five different educational robotics systems. Findings: The participating teachers had a high level of approval for the heuristics devised. A heuristic evaluation based on the framework proposed here appeared to more appropriately reflecting the teachers' needs than did conventional methods, namely the isolated comparison of system characteristics.", "authors": [{"name": "Alberto Piatti", "affiliation": "University of Applied Sciences and Arts of Southern Switzerland, Locarno, Switzerland"}, {"name": "Francesco Mondada", "affiliation": "École Polytechnique Fédérale de Lausanne, Lausanne, Switzerland"}, {"name": "Christian Giang", "affiliation": "École Polytechnique Fédérale de Lausanne, Lausanne, Switzerland"}], "tags": ["games", "educational augmented tabletop game", "Games", "formal education settings", "heuristic evaluation", "design principles", "learning tools", "STEM", "Education", "Task analysis", "computer aided instruction", "Tools", "educational robots", "educational robotics tools", "computer games", "educational robotics", "Erbium", "Educational robots", "Constructivist", "control engineering computing", "learning technology"]}, {"title": "Effects of New Supportive Technologies for Blind and Deaf Engineering Students in Online Learning", "link": "https://ieeexplore.ieee.org/document/8660410/", "abstract": "Contribution: A redesign of the Moodle platform to adapt digital educational content [learning objects (LOs)] to the specific needs of students with disabilities. The approach, extendable to a range of disciplines, was empirically tested with blind and deaf engineering students. Background: Previous studies identified difficulties that blind and deaf students face in accessing digital content for learning. General guidelines and specific tools are available to help educators adapt digital content and existing learning platforms for access by students with varying abilities/capacities. Such tools are usually for a specific disability rather than a range of capacities, and few provide empirical evidence of effectiveness. Intended Outcomes: The engineering-related digital content adapted using the techniques described in this paper should enable blind and/or deaf students to use an oscilloscope, understand communication channels, and distinguish the different types of telecommunication networks. Application Design: The Moodle learning platform was adapted using existing e-learning accessibility standards so that digital LOs could be automatically presented in formats accessible to blind and/or deaf students. This model is extendable for other types of disabilities, helping educators adapt existing content for access by students with differing capacities. The teacher adds content (in non-auditory and non-visual formats to describe content otherwise inaccessible to deaf or blind students) and students upload reusable profiles/metadata describing their specific accessibility needs to connect to suitably adjusted content. Findings: Learning improvement with the adjusted platform was evaluated via multiple choice pre- and post-tests. Students' learning performance improved significantly across all groups: blind (45%), deaf (46.25%) and deaf-blind (87.5%).", "authors": [{"name": "Concha Batanero", "affiliation": "Universidad de Alcalá, Alcala de Henares, Spain"}, {"name": "Luis de-Marcos", "affiliation": "Universidad de Alcalá, Alcala de Henares, Spain"}, {"name": "Salvador Otón", "affiliation": "Universidad de Alcalá, Alcala de Henares, Spain"}, {"name": "Jaana Holvikivi", "affiliation": "Metropolia University of Applied Sciences, Espoo, Finland"}, {"name": "José Ramón Hilera", "affiliation": "Universidad de Alcalá, Alcala de Henares, Spain"}], "tags": ["learning objects", "blind engineering students", "educational technology", "online learning", "distance learning", "students with disabilities", "ISO Standards", "Accessibility", "Metadata", "accessible education", "computer aided instruction", "Moodle learning platform", "Tools", "handicapped aids", "engineering education", "deaf engineering students", "Engineering students", "e-learning accessibility standards", "digital educational content", "learning management systems", "Electronic learning"]}, {"title": "Cognitive Distance and Research Output in Computing Education: A Case-Study", "link": "https://ieeexplore.ieee.org/document/8485649/", "abstract": "Contribution: This paper quantifies the phenomenon of more versus better research output in computing research education and elaborates on how the organizational variable known as cognitive distance plays a fundamental role in mediating such more versus better research output relation. Background: To improve the current educational system, investigation and quantification is needed of the “silos.” Cognitive distance-a measure of the differences in background, culture, and expertise between collaborators-may be a factor influencing the lack of quality and variety in research outputs. Addressing this is a key enabler for fruitful collaboration. Research Question: Does collaboration with similarly expert researchers yield better research? Methodology: A quantitative survey provides baseline data for cognitive distance while publication data allowed creation of a co-authorship network between 123 researchers in a European computing research department. The network was analyzed through quantitative and qualitative research methods. Findings: Increased expertise overlaps across sub-fields of computing is a strong predictor for further collaboration (quantity), but research impact (quality) decreases with larger overlaps. This reveals an educational silo effect in doctoral computing education and, consequently, a flaw in the connected research output. The lack of a single, agreed way to evaluate research impact across sub-fields further hinders cross-departmental collaboration among doctoral students. Conclusion: Three recommendations emerge for policy makers and educational leaders: 1) departments should be cross-functional and focused on societal interests; 2) communities of practice should be created at the level of doctoral education and upward; and 3) departments should hold matchmaking and speed-meeting events regularly within and across institutions.", "authors": [{"name": "Giuliano Casale", "affiliation": "Department of Computing, Imperial College London, London, U.K."}, {"name": "Damian A. Tamburri", "affiliation": "Jheronimus Academy of Data Science, Technical University of Eindhoven, Eindhoven, The Netherlands"}], "tags": ["diversity concerns", "publication data", "Medical services", "graduate-level education", "setting", "Organizational assessment", "research output relation", "Computer science", "organizational variable", "Education", "bias", "doctoral computing education", "computer aided instruction", "organisational aspects", "Statistics", "Collaboration", "cross-departmental collaboration", "cognitive distance", "research libraries", "workplace", "Europe", "computer science education", "computing research education", "data analysis", "Sociology", "academic libraries", "European computing research department", "educational leaders"]}, {"title": "Prediction of Engineering Identity in Engineering Graduate Students", "link": "https://ieeexplore.ieee.org/document/8667045/", "abstract": "Contribution: This paper shows that identification with engineering for engineering graduate students is positively and significantly predicted by engineering interest, competence, recognition, and interpersonal skills competence. Background: Prior studies of engineering identity on undergraduates identified several factors (e.g., engineering interest and engineering recognition) as positive predictors of identification of engineering. Engineering competence, achieved by participating in design projects, is a crucial part of students' efforts to become more innovative engineers. Identity theory is used to understand undergraduates' persistence in engineering, as students with stronger engineering identification are more likely to persist. More work is needed focusing on graduate students. Research Questions: Do engineering identity measurement frameworks studied for undergraduate students also apply to graduate students? Do they correlate with intention to complete the degree? What predicts the engineering identity of engineering master's and doctoral students? Methodology: Interviews informed development and adaptation of a multi-scale survey instrument. Factor analyses identified four factors that relate to graduate engineering identity: 1) engineering interest; 2) engineering recognition; 3) engineering competence; and 4) interpersonal skills competence. Three sequential multiple linear regression models were used to predict engineering graduate students' engineering identity. Findings: The final regression model, which includes student characteristics and the four factors resulting from confirmatory factor analysis, predicts 60% of the variance in engineering identity-substantially more than similar undergraduate engineering identity models. All four factors were significant and positive predictors of graduate students' engineering identity. The engineering recognition factor in particular needed adaptation to emphasize peers and faculty members over family, although family remained important.", "authors": [{"name": "Nathan Hyungsok Choe", "affiliation": "Center for Engineering Education, University of Texas at Austin, Austin, TX, USA"}, {"name": "Maura Borrego", "affiliation": "Department of Mechanical Engineering, University of Texas at Austin, Austin, TX, USA"}], "tags": ["engineering identity measurement frameworks", "engineering identification", "Factor analysis", "further education", "regression", "professional skills", "Medical services", "regression analysis", "Springs", "engineering recognition factor", "Interviews", "engineering graduate students", "doctoral students", "Instruments", "identity", "engineering competence", "Engineering education", "survey", "graduate", "Engineering profession", "engineering education", "undergraduate engineering identity models", "sequential multiple linear regression models", "Predictive models", "undergraduate students", "engineering master", "graduate engineering identity"]}, {"title": "Factors Influencing Engineering Identity Development of Latinx Students", "link": "https://ieeexplore.ieee.org/document/8693748/", "abstract": "Contribution: This paper explores the factors contributing to the development of engineering identity in Latinx students at two institutions. A better understanding of these factors will support the development of more inclusive engineering education environments and experiences. Background: Persistence of Latinx engineering students is of particular interest due to their underrepresentation in the field. Identity is a lens for understanding student persistence, but Latinx students are underrepresented in prior engineering identity studies. This paper seeks to identify the unique factors, academic and professional, that contribute to engineering identity development, and potential means for supporting the persistence of Latinx engineers. Research Questions: 1) What academic and professional affect factors predict engineering identity development of Latinx students? and 2) What role does the institution play in Latinx students' engineering identity development? Methodology: A mixed-methods approach was used to measure engineering identity based on a framework incorporating both academic and professional affect elements. Regression analyses were conducted on 892 responses to an online survey from Latinx engineering students, with additional insight from interviews with ten Latinx engineering students. Findings: Six of the nine factors analyzed (performance/competence, interest, recognition, analysis, framing and solving problems, and tinkering) were significant predictors of Latinx students' engineering identity, as were institution, gender, and having a parent with an engineering degree. Engineering identity was higher for Latinx students at the Hispanic Serving Institution, but none of the interaction terms were significant, so the relationship between these factors and engineering identity is similar at each institution.", "authors": [{"name": "Nathan Hyungsok Choe", "affiliation": "Center for Engineering Education, University of Texas at Austin, Austin, TX, USA"}, {"name": "Luis M. Procter", "affiliation": "Department of Engineering Education and Leadership, University of Texas at El Paso, El Paso, TX, USA"}, {"name": "Maura Borrego", "affiliation": "Center for Engineering Education, University of Texas at Austin, Austin, TX, USA"}, {"name": "Maya Denton", "affiliation": "Center for Engineering Education, University of Texas at Austin, Austin, TX, USA"}, {"name": "Meagan R. Kendall", "affiliation": "Department of Engineering Education and Leadership, University of Texas at El Paso, El Paso, TX, USA"}], "tags": ["professional affect factors", "Hispanic-serving institutions (HSIs)", "professional skills", "regression analysis", "Interviews", "engineering degree", "regression analyses", "engineering education environments", "Latinx engineering students", "computer aided instruction", "Statistics", "Engineering identity", "student persistence", "engineering education", "underrepresentation", "engineering identity development", "Latinx", "Sociology", "race/ethnicity", "engineering computing", "academic affect factors", "Engineering students", "undergraduate", "mixed methods research", "Lenses", "Hispanic Serving Institution"]}, {"title": "Engineering Students’ Epistemological Thinking in the Context of Project-Based Learning", "link": "https://ieeexplore.ieee.org/document/8697141/", "abstract": "Contribution: This paper qualitative research delineates the thinking and behavioral patterns that reflect students' advanced level of epistemological thinking in project-based learning (PBL) activities and the associated impact factors. Background: PBL has been widely adopted in engineering education for its effectiveness in improving students' problem-solving abilities, collaboration skills, and academic achievement. The four stages of Perry's theory-Dualism, Multiplicity, Relativism, and Commitment (within Relativism)-depict students' epistemological development from dualistic to contextual relativistic thinking. Prior research suggested that participation in PBL could benefit students' development to relativistic thinking-the most revolutionary change in Perry's model. Nevertheless, how epistemological thinking was exhibited in the context of PBL, and the relationship between students' epistemological thinking and PBL learning activities both remain unclear. Research Questions: 1) What are demonstrations of students' relativistic thinking in PBL activities? and 2) What are the factors in regard to students' relativistic thinking in PBL activities? Methodology: Built upon quantitative results obtained using a modified Zhang's cognitive development inventory (ZCDI) developed in the context of Perry's theory, this paper explored demonstrations of students' relativistic thinking in PBL in a qualitative manner, and analyzed the associated factors based upon one-on-one interviews with 17 engineering students. Findings: In PBL activities, students' epistemological thinking is reflected in their solving problems within constraints, conducting feasibility analyses, exhibiting commercial awareness, having their thinking broadened, and more. Their epistemological thinking can be impacted by factors, such as guidance from professors, collaborations with peers, communications with other stakeholders, and complexity level of projects.", "authors": [{"name": "Tianyi Zheng", "affiliation": "Graduate School of Education, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Zhinan Zhang", "affiliation": "School of Mechanical Engineering, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Rongrong Liu", "affiliation": "Graduate School of Education, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Jiabin Zhu", "affiliation": "Graduate School of Education, Shanghai Jiao Tong University, Shanghai, China"}, {"name": "Qunqun Liu", "affiliation": "Dongying Federation of Social Science Associations, Dongying, China"}], "tags": ["modified ZCDI", "Mechanical engineering", "Interviews", "mixed methods research", "Instruments", "Perry's theory-Dualism", "behavioral patterns", "PBL activities", "collaboration skills", "Perry’s model of intellectual development", "Zhang's cognitive development inventory", "computer aided instruction", "Problem-solving", "Collaboration", "cognition", "relativistic thinking", "students' problem-solving abilities", "engineering education", "contextual relativistic thinking", "project-based learning activities", "Engineering students", "Epistemology", "project-based learning", "engineering students epistemological thinking"]}, {"title": "Using Studio Culture to Foster Epistemic Change in an Engineering Senior Design Course", "link": "https://ieeexplore.ieee.org/document/8653950/", "abstract": "Contribution: This paper furthers understanding of how to use studio culture to develop instruction that supports learners' epistemic development in the context of an engineering senior design course, with a focus on student development of epistemic frames. Background: Current capstone engineering design courses do not integrate the educational theories and practice of cognitive apprenticeship combined with studio culture. Combined, these can be useful constructs for developing instruction that encourages creativity and innovation in a situated, student-centered, and activity-focused environment. Prior research and evidence-based instructional methods from other non-engineering contexts were used to create an instructional environment that engenders epistemic change. Research Questions: How do instructional design methods based on studio culture impact the cognitive and epistemic development of engineering students in a Senior Design course? Methods: This exploratory case study examines the effects of instructional design methods based on studio culture to change an Engineering Senior Design course from lecture-based to activity-based instruction in a collaborative environment. The case study emerges from a design-based research intervention, and uses mixed methods data collection from multiple sources, including video interviews, classroom footage, and written debrief reflections. Data analysis applied an integrated thematic approach. Implications were developed through an emergent coding process. Findings: Cognitive apprenticeship methods used in a studio culture-based classroom provide learning experiences that benefit epistemic and cognitive growth for engineering students in a Senior Design course.", "authors": [{"name": "Lisa C. Benson", "affiliation": "Engineering and Science Education Department, Clemson University, Clemson, SC, USA"}, {"name": "Erica B. Walker", "affiliation": "Department of Graphic Communications, Clemson University, Clemson, SC, USA"}, {"name": "D. Matthew Boyer", "affiliation": "Digital Media and Learning Department, Clemson University, Clemson, SC, USA"}], "tags": ["educational theories", "engineering profession", "evidence-based instructional methods", "activity-focused environment", "educational courses", "instructional environment", "Design methodology", "collaborative learning", "studio culture-based classroom", "Cognitive apprenticeship", "engineering senior design course", "design-based research intervention", "learner epistemic development", "integrated thematic approach", "Task analysis", "instructional design methods", "Cognitive apprenticeship methods", "cognition", "classroom footage", "epistemic frames", "engineering education", "cognitive epistemic change", "collaborative environment", "data analysis", "Sociology", "video interviews", "nonengineering contexts", "student development", "epistemic change", "activity-based instruction", "coding process", "instructional design", "Engineering students", "Knowledge engineering", "data collection"]}, {"title": "Assessing the Impact of Reflective Activities in Digital and Analog Electronics Courses", "link": "https://ieeexplore.ieee.org/document/8584416/", "abstract": "Contribution: This paper demonstrates positive outcomes from reflection-on-action by engineering students, including meaningful insights on their performance, professional and academic practices, and design knowledge as well as promising preliminary exam results. Background: Literature from the engineering education community underlines the benefits of reflection-based upon theories, such as Experiential Learning Theory, and calls for additional use of reflection in engineering education and associated scholarly work. Intended Outcomes: The authors intended for students to obtain meaningful academic and professional insights with implications for their future performance and to perform better on subsequent related exams via reflection. Application Design: Post-quiz and post-design reflective exercises were implemented in two electrical and computer engineering courses, Microelectronic Circuits and Advanced Digital Design, to drive student analysis of differences between their designs or calculations and the “standard solution” using simulation software and question prompts. Reflection-on-action was chosen to enhance students' post-activity understanding and insight, as ultimate learning requires reflection whereby students identify errors and strategies for improvement. Findings: Results demonstrated the value of reflection-on-action using post-activity comparisons and simulation. The students' reflective content and interviews demonstrated substantial professional and academic insights from and appreciation for reflection. On the Microelectronics final exam, a medium effect was associated with the reflection, and for the Digital Design exam, the effect was small to medium. Differences in depth levels of the students' reflections associated with the two types of problems (quiz questions versus design) were evident, suggesting problem type may impact depth.", "authors": [{"name": "Samuel J. Dickerson", "affiliation": "Swanson School of Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}, {"name": "Renee M. Clark", "affiliation": "Swanson School of Engineering, University of Pittsburgh, Pittsburgh, PA, USA"}], "tags": ["Hardware", "student analysis", "hardware description languages", "reflection-on-action", "educational courses", "digital design exam", "professional skills", "Content analysis", "microelectronics final exam", "Integrated circuit modeling", "electronics", "finite state machines", "Microelectronics", "engineering students", "computer aided instruction", "post-design reflective exercises", "experiential learning theory", "Engineering education", "simulation", "reflection", "digital electronics courses", "design knowledge", "SPICE", "engineering education", "Ear", "academic practices", "advanced digital design", "engineering education community", "electrical computer engineering courses", "simulation software", "analog electronics courses", "professional practices"]}, {"title": "The Role of Prosocial Goal Congruity on Student Motivation in Electrical Engineering", "link": "https://ieeexplore.ieee.org/document/8667080/", "abstract": "Contribution: Prior studies on goal congruity show that students are more motivated to pursue careers that allow them to work with and help others and give back to their community (i.e., careers that afford prosocial value). This paper discovers this same pattern in electrical engineering (EE) and discovers that prosocial affordance beliefs are significantly associated with intensions to persist, while agency beliefs are not. Background: Goal congruity theory finds that people are more motivated to pursue a career if it aligns with values they endorse. This theory can shed light on why some students do not persist in EE because of the stereotype that the profession does not allow working with and helping others. Research Questions: This paper seeks to answer whether EE students perceive the profession as affording prosocial value, and to test associations between prosocial perceptions and motivation to persist in the field. Methodology: The first study in this paper was conducted on students in an introductory EE course (n = 79) that measured affordance beliefs about the EE profession and tested associations with intensions to persist. The second study compared affordance beliefs and trait endorsements held by students in the introductory level course with those in an advanced EE courses (n = 51). Findings: Mediation analysis revealed that the more novice students believe that EE allows them to fulfill prosocial goals, the greater their persistence intentions (95% CI: 0.01 to 0.34). This analysis also showed that agency beliefs were not strongly associated with persistence intensions.", "authors": [{"name": "Brock J. Lameres", "affiliation": "Montana State University, Bozeman, MT, USA"}, {"name": "Maxwell S. Burns", "affiliation": "Montana State University, Bozeman, MT, USA"}, {"name": "Dustin B. Thoman", "affiliation": "San Diego State University, San Diego, CA, USA"}, {"name": "Jessi L. Smith", "affiliation": "University of Colorado at Colorado Springs, Colorado Springs, CO, USA"}], "tags": ["Expert-novice", "prosocial perceptions", "trait endorsements", "prosocial affordance beliefs", "persistence", "educational courses", "affordance beliefs", "Educational courses", "student motivation", "introductory level course", "persistence intensions", "introductory EE course", "motivation", "Electrical engineering education", "goal congruity theory", "electrical engineering education", "prosocial goals", "Engineering profession", "electrical engineering", "goal congruity", "social responsibility", "prosocial value", "EE students", "prosocial goal congruity"]}, {"title": "Guest Editorial Special Issue on Using Enquiry- and Design-Based Learning to Spur Epistemological and Identity Development of Engineering Students", "link": "https://ieeexplore.ieee.org/document/8786829/", "abstract": "This Special Issue of the IEEE Transactions on Education focuses on using enquiry-based design projects to spur engineering students’ development, so as to increase understanding and application of the relevant theories, foster higher rates of student development and achieve this in healthy and productive ways.", "authors": [{"name": "Bill Williams", "affiliation": "CREATE Research Group, Technological University Dublin, Dublin D1, Ireland"}, {"name": "Lorraine N. Fleming", "affiliation": "College of Engineering and Architecture, Howard University, Washington, DC, USA"}, {"name": "Shannon M. Chance", "affiliation": "School of Multidisciplinary Technologies, Technological University Dublin, Dublin D1, Ireland"}, {"name": "Robin S. Adams", "affiliation": "School of Engineering Education, Purdue University, West Lafayette, IN, USA"}, {"name": "Tom Goldfinch", "affiliation": "Faculty of Engineering, University of Sydney, Sydney, NSW, Australia"}], "tags": ["Cognition", "Special issues and sections", "Engineering education", "Engineering profession", "Uncertainty", "Engineering students"]}, {"title": "Developing and Assessing MATLAB Exercises for Active Concept Learning", "link": "https://ieeexplore.ieee.org/document/8319918/", "abstract": "Contribution: A systematic approach to MATLAB problem design and automated assessment is described, based on the experience working with the MATLAB server provided by MathWorks and integrated with the edX massive online open class (MOOC) platform. Background: New technologies, such as MOOCs, provide innovative methods to tackle new challenges in teaching and learning. However, they also bring challenges in course delivery and assessment, due to factors such as less direct student-instructor interaction. These challenges are especially severe in engineering education, which relies heavily on experiential learning, such as laboratory exercises and computer simulations, to assist students in understanding concepts. As a result, effective design of experiential learning components is extremely critical for engineering MOOCs. Intended Outcomes: This paper shares the experience gained through developing and offering an MOOC on communication systems, with special focus on the development and the automated assessment of MATLAB exercises for active concept learning. Application Design: The proposed approach introduced students to concepts by using learning components commonly provided by many MOOC platforms (e.g., online lectures and quizzes), and augmented the student experience with MATLAB-based computer simulations and exercises to enable more concrete and detailed understanding of the material. Findings: The effectiveness of the instructional methods was supported by evaluation of students' learning performance.", "authors": [{"name": "Albert Lo", "affiliation": "Hong Kong Virtual University, Hong Kong University of Science and Technology, Hong Kong"}, {"name": "Tony W. K. Fung", "affiliation": "Hong Kong Virtual University, Hong Kong University of Science and Technology, Hong Kong"}, {"name": "Amy Chong", "affiliation": "Center for Education Innovation, Hong Kong University of Science and Technology, Hong Kong"}, {"name": "Marco Antonelli", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Hong Kong"}, {"name": "S. H. Song", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Hong Kong"}, {"name": "Brandon D. Armstrong", "affiliation": "Training Services, MathWorks, Natick, MA, USA"}, {"name": "Bertram E. Shi", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Hong Kong"}], "tags": ["course delivery", "MATLAB exercises", "Object oriented modeling", "Programming", "educational courses", "experiential learning", "laboratory exercises", "edX massive online open class platform", "experiential learning components", "Computational modeling", "student assessment", "Matlab", "Communication systems", "student experience", "Computer simulation", "Task analysis", "MATLAB problem design", "Automated grading", "computer aided instruction", "application design", "MATLAB simulation", "MATLAB-based computer simulations", "mathematics computing", "course teaching", "engineering education", "massive open online classes (MOOCs)", "MATLAB server", "active concept learning", "teaching", "engineering MOOCs", "MOOC platforms", "direct student-instructor interaction"]}, {"title": "Dynamic Learner-Assisted Interactive Learning Tools for Power Systems Engineering Courses", "link": "https://ieeexplore.ieee.org/document/8606423/", "abstract": "Contribution: Interactive learning tools with multiple learning support functionalities are nonexistent in power engineering education. An interactive learning tool for supporting student learning in power engineering is shown to improve analytical skills of students. Background: Power network architectures are becoming increasingly complex, requiring the development of educational tools to familiarize students with challenging engineering problems associated with these emerging architectures. Interactive functionalities offered by existing learning tools are inadequate to achieve the learning objectives of the evolving power engineering curriculum. Intended Outcomes: It is expected to improve students' conceptual understanding and analytical skill base by recognizing the correct base-values and actual ratings of power system devices in per-unit calculations, hence students will able to score high marks in exams. Application Design: It is essential to assess the knowledge level of the student for creating effective learning exercises. The proposed interactive learning tools first assess the student's knowledge level, then based on the results create a specific exercise giving a network model, and a unique set of parameters. The tools include solving assistance with three support-levels; in each level more information is provided to assist with solution process enabling students to recognize specific mistakes in their calculations. Once a given exercise is successfully completed, the student is prompted to undertake more challenging exercises, which will assist their progressive cognitive development. Findings: The average mark for the per-unit calculation question in the MST was improved by $ {\\approx }40$ % after implementing the proposed learning tool, demonstrating its effectiveness.", "authors": [{"name": "Chathura Thilakarathne", "affiliation": "Electrical and Biomedical Engineering, School of Engineering, RMIT University, Melbourne, VIC, Australia"}, {"name": "Lasantha Gunaruwan Meegahapola", "affiliation": "Electrical and Biomedical Engineering, School of Engineering, RMIT University, Melbourne, VIC, Australia"}], "tags": ["interactive functionalities", "Power systems", "interactive learning tool", "smart grids", "educational courses", "educational tools", "Educational courses", "learning exercises", "challenging engineering problems", "power systems", "student experience", "power system devices", "Smart grids", "Interactive systems", "student learning", "students", "power engineering curriculum", "dynamic learner-assisted Interactive learning tools", "computer aided instruction", "Engineering education", "cognition", "Conceptual learning", "power network architectures", "multiple learning support functionalities", "Computer aided instruction", "electrical engineering", "power engineering education", "interactive systems", "learning objectives", "renewable energy", "interactive learning tools", "power systems engineering courses", "learning technology"]}, {"title": "Introductory Engineering Decision-Making: Guiding First-Year Students to Relativism in Software Design", "link": "https://ieeexplore.ieee.org/document/8737870/", "abstract": "Contribution: A semester-long, open-ended design project was implemented to promote intellectual development of first-year students while reinforcing event-driven/procedural programming principles. This paper describes this approach, and an evaluation strategy using Perry's model for intellectual development. The results show that students can reach the relativism stage of Perry's model in their first year of studies. Background: Students must move beyond a dualistic worldview to be engineers. Felder and Brent provided a list of recommendations to promote this type of intellectual development in students; active learning strategies strongly align with these recommendations. While active learning is common in programming courses (sometimes taking the form of project-based learning), they are typically tightly controlled by the instructor, and limited in scope (both in time and complexity), potentially reducing their impact on students. Intended Outcomes: This course and term-long project provided students a supportive environment in which to develop their decision-making skills, and promoted their intellectual development through Perry's stages related to software design. Application Design: Aligned with Felder and Brent's recommendations and Kuh's High Impact Practices, a course was built to: 1) teach students procedural programming, with 2) a focus on software design and open-ended problem solving, while maintaining 3) a supportive environment for skill acquisition. Findings: A mixed methods study showed the majority of students align themselves with the relativism stage of intellectual development at the end of the course. This study also illuminated the decision-making processes of teams of students in a first-year software design course.", "authors": [{"name": "Christopher Rennick", "affiliation": "Department of Management Sciences, University of Waterloo, Waterloo, ON, Canada"}, {"name": "Kenneth N. McKay", "affiliation": "Department of Management Sciences, University of Waterloo, Waterloo, ON, Canada"}, {"name": "Carol C. W. Hulls", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Waterloo, Waterloo, ON, Canada"}], "tags": ["Mechanical engineering", "educational courses", "first-year software design course", "programming courses", "Software design", "introductory engineering decision-making", "team-based learning", "decision making", "relativism stage", "Programming profession", "first-year students", "computer aided instruction", "application design", "procedural programming", "design projects", "Decision making", "active learning strategies", "Perry's model", "Computing skills", "computer science education", "teaching", "Educational robots", "open-ended design project", "instructional design", "project-based learning"]}, {"title": "Assessing a Virtual Laboratory in Optics as a Complement to On-Site Teaching", "link": "https://ieeexplore.ieee.org/document/8501949/", "abstract": "Contribution: There are many on-line resources available to learn about optics and photonics, but no assessment tools exist to evaluate the learning achievements. This paper presents an assessment framework whose validity has been proven on a course with over 70 engineering students. Background: There is evidence that on-line resources complement the learning experience in many engineering fields. In the context of optics and photonics, it may be worthwhile to assess the learning experience of engineering students taking a virtual lab as a complement to on-site, traditional lab. The assessment should use empiric, measurable results that demonstrates the effectiveness of the didactic innovation proposed, based on the Technology Acceptance Model. Intended Outcomes: Students using OPTILAB software are expected to be able to demonstrate their learning of optics and photonics by having a good score in the specific question about optical diffraction included in the final exam. Application Design: OPTILAB software, simulating the optical diffraction produced by different apertures, was developed. Students use OPTILAB to check, in advance, the experimental results they will obtain in the on-site lab, with various optical apertures and settings. This is expected to make the on-site lab session more efficient, minimize errors that inevitably occur when students are confronted with a new physical phenomenon, and ultimately increase the students learning experience. Findings: The marks obtained in the exercise about optics in the final exam by the experimental set (~67.3%) and control set (~49.2%) demonstrate that OPTILAB can improve students' learning experience in optics. The findings from the survey based on the Technology Acceptance Model are also discussed.", "authors": [{"name": "Javier Gamo", "affiliation": "Division of Science and Engineering, Saint Louis University—Madrid Campus, Madrid, Spain"}], "tags": ["Photonics", "virtual instrumentation", "Software", "educational courses", "virtual laboratory", "higher education", "optical diffraction", "teaching assessment", "Diffraction", "photonics", "optics", "Computational modeling", "Education", "physics education", "OPTILAB software", "computer aided instruction", "technology acceptance model", "light diffraction", "e-learning", "on-site teaching", "Apertures", "optics and photonics", "Technology Acceptance Model", "teaching", "physics computing", "Optics", "optical apertures", "Educational software"]}]