[{"title": "Integrating Asynchronous Digital Design Into the Computer Engineering Curriculum", "link": "https://ieeexplore.ieee.org/document/5233837/", "abstract": "As demand increases for circuits with higher performance, higher complexity, and decreased feature size, asynchronous (clockless) paradigms will become more widely used in the semiconductor industry, as evidenced by the International Technology Roadmap for Semiconductors' (ITRS) prediction of a likely shift from synchronous to asynchronous design styles in order to increase circuit robustness, decrease power, and alleviate many clock-related issues , . ITRS shows that asynchronous circuits accounted for 11% of chip area in 2008, compared to 7% in 2007, and estimates they will account for 23% of chip area by 2014 and 35% of chip area by 2019 . To meet this growing industry need, computer engineering students should be introduced to asynchronous circuit design to make them more marketable and more prepared for the challenges faced by the digital design community for years to come. This paper introduces asynchronous logic design in the context of the familiar synchronous logic, then provides a description of course modules developed for NULL Convention Logic (NCL), an asynchronous logic paradigm that is very similar to the synchronous paradigm. This approach ensures that students can easily relate asynchronous design and optimization techniques to the corresponding synchronous techniques. The materials presented in this paper have been used in a number of undergraduate and graduate courses and have been well received by the students.", "authors": [{"name": "Waleed K. Al-Assadi", "affiliation": "Department of Electrical and Computer Engineering, Missouri University of Science and Technology, Rolla, MO, USA"}, {"name": "Scott C. Smith", "affiliation": "Department of Electrical Engineering, University of Arkansas, Fayetteville, AR, USA"}, {"name": "Jia Di", "affiliation": "Department of Computer Science and Computer Engineering, University of Arkansas, Fayetteville, AR, USA"}], "tags": ["Logic gates", "Computers", "asynchronous digital design", "synchronous logic", "asynchronous circuit design", "asynchronous circuits", "computer engineering curriculum", "Materials", "quad-rail design", "input-completeness", "International Technology Roadmap for Semiconductors", "Asynchronous logic", "optimization techniques", "Delay", "Wires", "observability", "NULL Convention Logic (NCL)", "pipelining", "optimisation", "Synchronization", "computer science education", "Registers", "asynchronous logic design", "dual-rail design", "logic design", "NULL convention logic"]}, {"title": "Learning Machine Learning: A Case Study", "link": "https://ieeexplore.ieee.org/document/5378480/", "abstract": "This correspondence reports on a case study conducted in the Master's-level Machine Learning (ML) course at Blekinge Institute of Technology, Sweden. The students participated in a self-assessment test and a diagnostic test of prerequisite subjects, and their results on these tests are correlated with their achievement of the course's learning objectives.", "authors": [{"name": "Niklas Lavesson", "affiliation": "School of Computing, Blekinge Institute of Technology, Ronneby, Sweden"}], "tags": ["learning (artificial intelligence)", "Blekinge Institute of Technology", "Artificial intelligence", "Machine learning", "Learning systems", "self-assessment test", "prerequisite subjects", "Artificial intelligence (AI)", "study results", "learning systems", "education", "prior knowledge", "diagnostic test", "machine learning", "Mathematics"]}, {"title": "Robotics-Centered Outreach Activities: An Integrated Approach", "link": "https://ieeexplore.ieee.org/document/5208215/", "abstract": "Nowadays, universities are making extensive efforts to attract prospective students to the fields of electrical, electronic, and computer engineering. Thus, outreach is becoming increasingly important, and activities with schoolchildren are being extensively carried out as part of this effort. In this context, robotics is a very attractive and effective tool for fostering interest in science and technology among children and young people and for attracting them toward engineering. In this article, experience with different robotics-centered outreach activities in the Universidad de Chile (UCH), Santiago, Chile, will be shared. These activities include robotics courses for children, social robots as keynote speakers, mechatronics design courses, and participation in international robotics competitions, which contribute synergistically to the goal of attracting students to UCH's Electrical Engineering (EE) Department. Owing to its novelty, the use of social robots as keynote speakers for schoolchildren will be described in detail. Experimental results that demonstrate how sophisticated social robots can be used to foster the interest of young people in technology will be shown. Altogether, more than 3000 schoolchildren have participated directly in these outreach activities here in Chile, creating a sizeable impact in this country.", "authors": [{"name": "Javier Ruiz-del-Solar", "affiliation": "Department of Electrical Engineering and the Advanced Mining Technology Center, Universidad de Chile, Santiago, Chile"}], "tags": ["engineering education", "social robots", "Pediatrics", "robotics outreach", "educational courses", "robotics centered outreach activities", "Mechatronics", "international robotics competitions", "science and technology", "robots", "robotics courses", "Laboratories", "keynote speakers", "Humans", "mechatronics design courses", "Educational institutions", "universities", "educational institutions", "Educational robots", "school children", "LEGO Mindstorms", "mechatronics"]}, {"title": "System-on-Chip Design and Implementation", "link": "https://ieeexplore.ieee.org/document/5196691/", "abstract": "The system-on-chip module described here builds on a grounding in digital hardware and system architecture. It is thus appropriate for third-year undergraduate computer science and computer engineering students, for post-graduate students, and as a training opportunity for post-graduate research students. The course incorporates significant practical work to illustrate the material taught and is centered around a single design example of a drawing machine. The exercises are composed so that students can regard themselves as part of a design team where they undertake the complete design of their own particular section of the system. These design tasks range from algorithmic specification and transaction-level modeling (TLM) of the architecture down to describing the design at the register transfer level (RTL) with subsequent verification of their prototype on a field-programmable gate array (FPGA). With this approach, students are able to explore and gain experience of the different techniques used at each level of the design hierarchy and the problems in translating to the next level down. Throughout the module, there is emphasis on using industry standard tools for the modeling and simulation, leading to the use of the SystemC and Verilog hardware description languages and Cadence for the simulation environment.", "authors": [{"name": "Jeffrey Pepper", "affiliation": "School of Computer Science, University of Manchester, Institute of Science and Technology, Manchester, UK"}, {"name": "Linda E. M. Brackenbury", "affiliation": "School of Computer Science, University of Manchester, Institute of Science and Technology, Manchester, UK"}, {"name": "Luis A. Plana", "affiliation": "School of Computer Science, University of Manchester, Institute of Science and Technology, Manchester, UK"}], "tags": ["Hardware", "field programmable gate array", "algorithmic specification", "transaction level modeling", "register transfer level", "system-on-chip design", "educational courses", "large-scale systems modeling", "Verilog hardware description language", "Integrated circuit design", "Time domain analysis", "systems engineering education", "digital hardware", "Shape", "system-on-chip", "SystemC hardware description language", "Computational modeling", "Software", "integrated circuit design", "hardware description languages", "Solid modeling", "electronic engineering education", "System-on-a-chip", "transaction-level modeling (TLM)", "system-level design", "Cadence", "computer science education", "FPGA", "field programmable gate arrays", "design team"]}, {"title": "Generation NXT: Building Young Engineers With LEGOs", "link": "https://ieeexplore.ieee.org/document/5233832/", "abstract": "This paper describes key success factors for the implementation and development of a LEGO robotics engineering outreach program for elementary school students in West Texas. The outreach program not only aims at getting young students excited about engineering but at the same time aims at improving retention rates among electrical and computer engineering freshman-level college students by involving them as paid mentors. It particularly takes into consideration the rural character of West Texas, which provides hardly any electrical and computer engineering job opportunities, and the fact that a university with a college of engineering serves as academic hub for the area.", "authors": [{"name": "Laura A. Lowe", "affiliation": "Sociology, Anthropology, and Social Work Department, Texas Tech University, Lubbock, TX, USA"}, {"name": "Richard Gale", "affiliation": "Electrical and Computer Engineering Department, Texas Tech University, Lubbock, TX, USA"}, {"name": "Eric Beutlich", "affiliation": "Electrical Engineering Department, Texas Tech University, Lubbock, TX, USA"}, {"name": "Tanja Karp", "affiliation": "Electrical and Computer Engineering Department, Texas Tech University, Lubbock, TX, USA"}, {"name": "Vickie Medina", "affiliation": "Trust Point Hospital, Lubbock, TX, USA"}], "tags": ["engineering education", "computer engineering college students", "paid mentors", "educational courses", "university", "robotics outreach", "LEGO robotics engineering", "Buildings", "informal K-12 education", "LEGO Mindstorms NXT", "elementary school students", "Gears", "Programming", "Educational institutions", "undergraduate retention", "outreach program", "Engineering outreach", "robot programming", "West Texas", "educational institutions", "Educational robots", "Games", "electrical engineering college students"]}, {"title": "Reverse Engineering and Software Products Reuse to Teach Collaborative Web Portals: A Case Study With Final-Year Computer Science Students", "link": "https://ieeexplore.ieee.org/document/5357402/", "abstract": "The development of collaborative Web applications does not follow a software engineering methodology. This is because when university students study Web applications in general, and collaborative Web portals in particular, they are not being trained in the use of software engineering techniques to develop collaborative Web portals. This paper presents a strategy for teaching collaborative Web portals based on reverse engineering and reuse mechanisms to engineer the collaborative Web portals' development. This strategy was successfully used in a final-year course of a Computer Science program at Carlos III University of Madrid, Spain. Its use has demonstrated an improvement in the maintainability of the Web projects developed as well as a decrease in the number of failures during the test phase. This is a very important step toward the engineering of Web applications. The students' grades for the same subject, with the same content and lecturers, also improved compared to those from previous years. The strategy, the details of its use, the results obtained after analyzing the projects the students developed, and their final grades are described in this paper.", "authors": [{"name": "Antonio Amescua", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Arturo Mora-Soto", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Maria-Isabel Sanchez-Segura", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Fuensanta Medina-Dominguez", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}], "tags": ["Portals", "software engineering methodology", "Carlos III University", "Computer science education", "software products", "product patterns", "software reusability", "Reverse engineering", "computer science students", "groupware", "Unified modeling language", "portals", "computer aided instruction", "software engineering", "Software engineering", "collaborative Web portals", "teaching", "reverse engineering", "computer science education", "Collaboration"]}, {"title": "Teaching Modules on Modeling and Control of Piezoactuators for System Dynamics, Controls, and Mechatronics Courses", "link": "https://ieeexplore.ieee.org/document/5238561/", "abstract": "Piezoelectric actuators (or piezoactuators) are known for their nanoresolution and high-speed positioning capabilities. Therefore, they are used in scanning probe microscopes and in the design of innovative surgical tools and biomedical devices. The expected growth of engineering jobs in the nano- and bio-related fields, in which piezoactuators will play a significant role, motivated the development of a suite of teaching modules (lecture and laboratory materials) for the undergraduate mechanical engineering (ME) curriculum that focus on modeling and precision control of piezoactuators. Four laboratory exercises were designed to provide students with hands-on experience in data acquisition, sensors, and controller implementation. The developed modules were implemented in three undergraduate courses. The hypothesis being tested is that students who interact with these modules will gain a better understanding of piezoactuators and their application in nanotechnology and biotechnology. Through linked pre- to post-module comparisons, it is shown that students did, in fact, experience a positive change in their knowledge and understanding of the material.", "authors": [{"name": "Kam K. Leang", "affiliation": "Department of Mechanical Engineering, University of Nevada,슠Reno, Reno, NV, USA"}, {"name": "Qingze Zou", "affiliation": "Department of Mechanical Engineering, Iowa State University, Ames, IA, USA"}, {"name": "Gina Pannozzo", "affiliation": "Department of Education, Virginia Commonwealth University, Richmond, VA, USA"}], "tags": ["piezoelectric actuators", "engineering education", "Gain", "nanotechnology", "nanoresolution capability", "system dynamics course", "mechanical engineering curriculum", "Mathematical model", "hysteresis", "Feedforward neural networks", "Hysteresis", "nanopositioning", "biotechnology", "mechatronics courses", "Education", "controls course", "Piezoelectric materials", "Dynamics and control", "mechatronics", "piezoactuators"]}, {"title": "A Project-Based Laboratory for Learning Embedded System Design With Industry Support", "link": "https://ieeexplore.ieee.org/document/5152939/", "abstract": "A project-based laboratory for learning embedded system design with support from industry is presented in this paper. The aim of this laboratory is to motivate students to learn the building blocks of embedded systems and practical control algorithms by constructing a line-following robot using the quadratic interpolation technique to predict the line position. For those students who have acquired basic microcontroller hardware and software programming skills from previous courses, the hands-on exercises in the laboratory include several specific hardware circuits and software algorithms for the final project of constructing the line-following robot. The students are allowed to discuss the hardware and software problems with each other while solving each exercise, although they have to answer the teacher's questions individually to earn the score. To enhance the learning outcomes, a racing contest for the students' line-following robots is also organized to see how well the techniques learned in the laboratory are applied in the final project. The support from the local branch of Microchip Inc. allows students to obtain C-compilers and microcontrollers at no cost. The feedback from students shows that the final project of constructing line-following robots and the racing contest motivates the students to learn actively all the skills included in the laboratory for embedded system design.", "authors": [{"name": "Chyi-Shyong Lee", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}, {"name": "Juing-Huei Su", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}, {"name": "Jia-Hao Chang", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}, {"name": "Kuo-En Lin", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}, {"name": "Gu-Hong Lin", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}], "tags": ["microcontroller hardware", "Embedded system", "program compilers", "C-compilers", "project management", "embedded systems", "robots", "project-based", "Microcontrollers", "laboratories", "Laboratories", "line-following robot", "project-based laboratory", "Robot sensing systems", "microcontrollers", "control engineering education", "Optical sensors", "software programming skills", "learning embedded system design"]}, {"title": "MATLAB Meets LEGO Mindstorms—A Freshman Introduction Course Into Practical Engineering", "link": "https://ieeexplore.ieee.org/document/5208321/", "abstract": "In today's teaching and learning approaches for first-semester students, practical courses more and more often complement traditional theoretical lectures. This practical element allows an early insight into the real world of engineering, augments student motivation, and enables students to acquire soft skills early. This paper describes a new freshman introduction course into practical engineering, which has been established within the Bachelor of Science curriculum of Electrical Engineering and Information Technology of RWTH Aachen University, Germany. The course is organized as an eight-day, full-time block laboratory for over 300 freshman students, who were supervised by more than 60 tutors from 23 institutes of the Electrical Engineering Department. Based on a threefold learning concept comprising mathematical methods, MATLAB programming, and practical engineering, the students were required to transfer mathematical basics to algorithms in MATLAB in order to control LEGO Mindstorms robots. Toward this end, a new toolbox, called the ¿RWTH-Mindstorms NXT Toolbox,¿ was developed, which enables the robots to be controlled remotely via MATLAB from a host computer. This paper describes how the laboratory course is organized and how it induces students to think as actual engineers would in solving real-world tasks with limited resources. Evaluation results show that the project improves the students' MATLAB programming skills, enhances motivation, and enables a peer learning process.", "authors": [{"name": "Alexander Behrens", "affiliation": "Institute of Imaging and Computer Vision Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Johannes Balle", "affiliation": "Institute of Communications Engineering, Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Tobias G. Noll", "affiliation": "Institute of Imaging and Computer Vision Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Bernd Neumann", "affiliation": "Automotive Electronics, Robert Bosch GmbH, Reutlingen, Germany"}, {"name": "Rainer Schnitzler", "affiliation": "Institute of Imaging and Computer Vision Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Thomas Herold", "affiliation": "Institute of Electrical Machines, Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Kay Hameyer", "affiliation": "Institute of Electrical Machines, Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Til Aach", "affiliation": "Institute of Imaging and Computer Vision Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Linus Atorf", "affiliation": "Institute of Imaging and Computer Vision Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Aulis Telle", "affiliation": "Institute of Communications Systems and Data Processing, Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}, {"name": "Robert Schwann", "affiliation": "Institute of Imaging and Computer Vision Faculty of Electrical Engineering and Information Technology, RWTH Aachen University, Aachen, Germany"}], "tags": ["practical engineering", "telecontrol", "information science education", "educational courses", "Robots", "remote control", "Electrical engineering", "Bluetooth", "laboratory course", "Bachelor of Science curriculum", "MATLAB", "mathematics computing", "robots", "RWTH Aachen University", "robotic laboratory", "electrical engineering education", "project-based learning", "Laboratories", "peer learning process", "first-semester students", "Sensors", "Programming", "mathematical methods", "LEGO Mindstorms robots", "electrical engineering", "LEGO mindstorms", "MATLAB programming", "robot programming", "teaching", "information technology", "introduction to programming", "Freshman course", "Germany", "RWTH-Mindstorms NXT toolbox", "freshman introduction course"]}, {"title": "A Wireless Communications Systems Laboratory Course", "link": "https://ieeexplore.ieee.org/document/5288553/", "abstract": "A novel wireless communications systems laboratory course is introduced. The course teaches students how to design, test, and simulate wireless systems using modern instrumentation and computer-aided design (CAD) software. One of the objectives of the course is to help students understand the theoretical concepts behind wireless communication systems through hands-on experiments and to make them more confident both in system design and analysis. The course also aims at increasing the interest of students in engineering and technology. Therefore, laboratory experiments that are complementary to the materials discussed in the theoretical part of the course are designed specifically to incorporate the use of several wireless devices that students probably use extensively in their daily lives. Complementing and expanding upon the materials covered in other communication courses is another merit of this laboratory-based course. Meeting the course requirements also helps students improve their oral presentation and report preparation abilities. The evaluation of the course indicates that most of the objectives are achieved. This paper discusses the experiments designed to teach various wireless communication concepts to the students on a weekly basis, as well as the interesting projects and the other course requirements, which could be replicated by other universities.", "authors": [{"name": "Sabih Guzelgoz", "affiliation": "Department of Electrical Engineering, University of South Florida, Tampa, FL, USA"}, {"name": "Hüseyin Arslan", "affiliation": "Department of Electrical Engineering, University of South Florida, Tampa, FL, USA"}], "tags": ["Laboratories", "Wireless sensor networks", "Electrical engineering education", "Wireless communication", "computer aided instruction", "Student experiments", "MATLAB", "telecommunication engineering education", "wireless devices", "testing and measurement", "wireless communications", "educational courses", "computer-aided design software", "radiocommunication", "wireless communications systems laboratory course", "hands-on experience", "electrical engineering education", "CAD"]}, {"title": "Design and Implementation of a Mechatronics Learning Module in a Large First-Semester Engineering Course", "link": "https://ieeexplore.ieee.org/document/5233770/", "abstract": "Since 2005, the first-year engineering program at Virginia Tech, Blacksburg, has been significantly restructured to include more hands-on learning. A major grant (2004-2009) under the department level reform (DLR) program of the National Science Foundation (NSF) facilitated this restructuring. A number of hands-on learning modules were developed and implemented within a required first-semester undergraduate course. One of the modules introduced mechatronics. The goal of this module is to introduce first-year engineering students to a portion of the mechanical engineering, electrical engineering, and computer engineering disciplines within a collaborative setting. Interestingly, while the largest portion of engineering students in the United States are enrolled in electrical and mechanical engineering programs, there is a disparity between the percentage of male engineering students and female engineering students within those disciplines relative to the overall distribution of all students among the various engineering disciplines. By introducing all engineering students to mechatronics before students declare their specific discipline, the college hopes to attract more females to programs that suffer from a greater gender disparity than is already found within the science, technology, engineering, and mathematics (STEM) disciplines. This paper discusses the details of the implementation of the mechatronics initiative and gives student feedback that includes overall perception of the initiative and perception by gender.", "authors": [{"name": "Pushkin Kachroo", "affiliation": "Department of Electrical and Computer Engineering, University of Nevada, Las Vegas, Las Vegas, NV, USA, Department of Engineering Education, Virginia Polytechnic Institute and State University, Blacksburg, VA, USA"}, {"name": "Vinod K. Lohani", "affiliation": "Department of Engineering Education, Virginia Polytechnic Institute and State University, Blacksburg, VA, USA"}, {"name": "Ricky T. Castles", "affiliation": "Bradley Department of Electrical and Computer Engineering, Virginia Polytechnic Institute and State University, Blacksburg, VA, USA"}, {"name": "Tasha Zephirin", "affiliation": "Bradley Department of Electrical and Computer Engineering, Virginia Polytechnic Institute and State University, Blacksburg, VA, USA"}], "tags": ["student experiments", "engineering education", "Virginia Tech", "engineering course", "educational courses", "Robots", "Mechatronics", "Conferences", "DC motors", "mechatronics learning module", "science-technology-engineering-mathematics disiplines", "hands-on learning modules", "National Science Foundation", "electrical engineering", "mechanical engineering", "Assembly", "mobile robots", "Circuits", "computer engineering", "Engineering students", "first-year curriculum", "mechatronics", "Voltage control"]}, {"title": "Implementation of an Integrated, Portable Transformer Condition Monitoring Instrument in the Classroom and On-Site", "link": "https://ieeexplore.ieee.org/document/5280247/", "abstract": "The development of integrated, portable, transformer condition monitoring (TCM) equipment for classroom demonstrations as well as for student exercises conducted in the field is discussed. Demonstrations include experimentation with real-world transformers to illustrate concepts such as polarization and depolarization current through oil-paper composite insulation. The developed equipment has also been used to understand and illustrate the phenomenon of recovery voltage. Finally, the portability and robustness of the equipment enables students to collect data from transformers installed on-site for the purpose of validating the nature of curves obtained in real-world environments.", "authors": [{"name": "Sivaji Chakravorti", "affiliation": "Electrical Engineering Department, Jadavpur University, Kolkata, India"}, {"name": "Biswendu Chatterjee", "affiliation": "Electrical Engineering Department, Jadavpur University, Kolkata, India"}, {"name": "Debangshu Dey", "affiliation": "Electrical Engineering Department, Jadavpur University, Kolkata, India"}], "tags": ["portable instruments", "Electrical engineering education", "recovery voltage measurement", "real-world transformers", "polarization current", "transformer condition monitoring instrument", "depolarization current", "Oil insulation", "oil-paper composite insulation", "Instruments", "polarization and depolarization current", "Partial discharges", "electrical engineering education", "classroom demonstrations", "Data acquisition", "high-voltage techniques", "Condition monitoring", "transformer condition monitoring (TCM)", "Power transformer insulation", "condition monitoring", "student exercises", "transformer oil"]}, {"title": "Professional Skills in the Engineering Curriculum", "link": "https://ieeexplore.ieee.org/document/5290068/", "abstract": "Faculty from the Department of Electrical and Computer Engineering and the College of Education at the University of Missouri (MU), Columbia, developed a novel course for engineering graduate students emphasizing pedagogy and professional skills. The two-semester course sequence, titled “Preparing Engineering Faculty and Professionals,” includes readings from books that cover several different areas: How People Learn, with focus on the latest findings from cognitive science and their applicability to teaching; The 7 Habits of Highly Effective People for discussion of other professional skills; and The World is Flat for discussion of global trends and its effects on professionals. Other components of the course include lectures by guest speakers on topics ranging from how universities work and how to run successful research centers to leadership traits for engineers. A pilot survey of students at the end of the two-course sequence revealed that students had acquired little knowledge about pedagogy and professional skills from other courses in their undergraduate and graduate engineering curriculum; this course addresses such deficits by raising awareness and knowledge of these skills.", "authors": [{"name": "John Lannin", "affiliation": "Department of Learning, Teaching, and Curriculum, College of Education, University of Missouri, Columbia, MO, USA"}, {"name": "Satish S. Nair", "affiliation": "Department of Electrical and Computer Engineering, University of Missouri, Columbia, MO, USA"}, {"name": "Christa Jackson", "affiliation": "Department of Learning, Teaching, and Curriculum, College of Education, University of Missouri, Columbia, MO, USA"}, {"name": "Ashwin Mohan", "affiliation": "Department of Electrical and Computer Engineering, University of Missouri, Columbia, MO, USA"}, {"name": "Dominike Merle", "affiliation": "Department of Learning, Teaching, and Curriculum, College of Education, University of Missouri, Columbia, MO, USA"}], "tags": ["research centers", "Engineering education", "Proposals", "cognitive science", "educational courses", "College of Education", "Professional activities", "two-semester course sequence", "Missouri University", "Columbia", "Global communication", "undergraduate engineering curriculum", "proposal writing", "Ethical aspects", "electrical engineering education", "global workplace", "pedagogy", "educational institutions", "professional skills", "Department of Electrical and Computer Engineering", "engineering graduate student course", "Teamwork"]}, {"title": "Perception and Intention in Relation to Engineering: A Gendered Study Based on a One-Day Outreach Activity", "link": "https://ieeexplore.ieee.org/document/5191065/", "abstract": "This paper explores both how male and female high school pupils (15-16 years old) perceive the engineering profession and their willingness to pursue a career in this area. A study was performed around a one-day outreach activity, Girls' Day, organized for the first time in Spain. During Girls' Day, students were exposed to specific activities developed for them in engineering research labs and companies, carried out by young female researchers and professionals. The study, based on two questionnaires answered before and after the activity, focuses on the differences between groups of female and male students having differing degrees of interest in studying engineering. The educational level of mothers, the presence of engineers in families, and perceived family support emerged as important factors influencing the probability of a young person's considering pursuing engineering studies. Nevertheless, the need to expose children to outreach activities at a younger age and to involve the students' families and teachers has become clear. If planned properly and thoughtfully, even a single day's experience can contribute to changing the perception of what an engineer is.", "authors": [{"name": "Sandra Baldassarri", "affiliation": "Computer Science and Systems Engineering Department, Centro Politécnico Superior, Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Maria Villarroya-Gaudo", "affiliation": "Computer Science and Systems Engineering Department, Centro Politécnico Superior, Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Eva Cerezo", "affiliation": "Computer Science and Systems Engineering Department, Centro Politécnico Superior, Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Pilar Molina-Gaudo", "affiliation": "Department of Electronics Engineering and Communications, Centro Politécnico Superior, Universidad de Zaragoza, Zaragoza, Spain"}], "tags": ["Companies", "Laboratories", "Engineering profession", "engineering education", "outreach activities", "engineering profession perception", "laboratory techniques", "engineering profession", "engineering studies", "Engineering perception", "gender issues", "Data mining", "Educational institutions", "engineering research laboratory", "Knowledge engineering"]}, {"title": "Teaching Camera Calibration by a Constructivist Methodology", "link": "https://ieeexplore.ieee.org/document/5406012/", "abstract": "This article describes the Metrovisionlab simulation software and practical sessions designed to teach the most important machine vision camera calibration aspects in courses for senior undergraduate students. By following a constructivist methodology, having received introductory theoretical classes, students use the Metrovisionlab application to carry out a series of practical exercises with the aim of learning in a simple way: 1) the basic functioning of a camera; 2) how to calibrate a camera; 3) the most important calibration methods and their special characteristics; and 4) the generation and use of synthetic calibration points. Evaluations based on student feedback confirm that the use of Metrovisionlab as a teaching tool facilitates the learning process.", "authors": [{"name": "Juan José Aguilar", "affiliation": "Design and Manufacturing Engineering Department, Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Jorge Juan Pastor", "affiliation": "Design and Manufacturing Engineering Department, Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Jorge Santolaria", "affiliation": "Design and Manufacturing Engineering Department, Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "David Samper", "affiliation": "Design and Manufacturing Engineering Department, Universidad de Zaragoza, Zaragoza, Spain"}], "tags": ["learning process", "computer vision", "calibration", "engineering education", "Collaborative work", "constructivist methodology", "machine vision camera calibration", "simulation software", "Engineering education", "Simulation", "Cameras", "teaching tool", "senior undergraduate students", "collaborative work", "cameras", "Calibration", "Machine vision", "Metrovisionlab"]}, {"title": "Active Methodologies in a Queueing Systems Course for Telecommunication Engineering Studies", "link": "https://ieeexplore.ieee.org/document/5238629/", "abstract": "This paper presents the results of a one-year experiment in incorporating active methodologies in a Queueing Systems course as part of the Telecommunication Engineering degree at the University of Zaragoza, Spain, during the period of adaptation to the European Higher Education Area. A problem-based learning methodology has been introduced, and the academic results showed that students achieved higher grades (improvement ranging from 27% up to 50%). The additional effort of students and faculty staff has also been evaluated.", "authors": [{"name": "Ángela Hernandez", "affiliation": "Communications Technologies Group (GTC), Aragón Institute of Engineering Research (I3A), Polytechnic Center, University of Zaragoza, Zaragoza, Spain"}, {"name": "José Garcia", "affiliation": "Communications Technologies Group (GTC), Aragón Institute of Engineering Research (I3A), Polytechnic Center, University of Zaragoza, Zaragoza, Spain"}], "tags": ["problem-based learning (PBL)", "faculty staff", "Queueing analysis", "telecommunication engineering education", "Communications technology", "University of Zaragoza", "Communication networks", "learning methodologies", "queueing systems course", "Planning", "problem-based learning methodology", "Data mining", "queueing systems", "queueing theory", "further education", "Spain", "students effort", "European higher education area", "telecommunication engineering studies", "European Higher Education Area (EHEA)", "Europe", "Education", "Markov processes"]}, {"title": "A Methodology to Teach Advanced A/D Converters, Combining Digital Signal Processing and Microelectronics Perspectives", "link": "https://ieeexplore.ieee.org/document/5276802/", "abstract": "ADCs (analog-to-digital converters), especially Pipeline and Sigma-Delta (Σ-Δ) converters, are designed using complex architectures in order to increase their sampling rate and/or resolution. Consequently, the learning of ADC devices also encompasses complex concepts such as multistage synchronization, latency, oversampling, modulation, noise shaping, filtering, or decimation. This paper is focused on a new learning methodology, based on the simulation of the main circuit topologies used in commercial ADCs, in order to understand their working principles more thoroughly. At the same time, the ADC dynamic and static tests are obtained from the simulation results, and their characterization is obtained at an application level. In this way, the methodology combines the microelectronics perspective, at the design level, with the digital signal processing perspective. This methodology saves time in practical classes and encourages self-learning because it does not require special hardware. Moreover, it uses only software tools that are common in electronic engineering, like the OrCAD PSpice simulator, a C compiler, or a hardware description language (HDL) simulator. The methodology has been validated during two consecutive offerings of academic courses in the Telecommunication Engineering curriculum at Vigo University, Vigo, Spain, and the results obtained are discussed.", "authors": [{"name": "Manuel Castro", "affiliation": "Electrical and Computer Engineering Department, Spanish University of Distance Education, Madrid, Spain"}, {"name": "María J. Moure", "affiliation": "Electronic Technology Department, University of Vigo, Vigo, Spain"}, {"name": "Camilo Quintans", "affiliation": "Electronic Technology Department, University of Vigo, Vigo, Spain"}, {"name": "Antonio Colmenar", "affiliation": "Electrical and Computer Engineering Department, Spanish University of Distance Education, Madrid, Spain"}, {"name": "Enrique Mandado", "affiliation": "Electronic Technology Department, University of Vigo, Vigo, Spain"}], "tags": ["Hardware", "Pipeline processing", "circuit topologies simulation", "C compiler", "multistage synchronization", "ADC static tests", "Σ-Δ converters", "learning systems", "hardware description language", "Sigma–Delta modulation", "Vigo University", "circuit testing", "signal processing", "microelectronics perspectives", "oversampling", "integrated circuit testing", "telecommunication engineering curriculum", "filtering", "simulation", "SPICE", "software tools", "ADC dynamic tests", "digital signal processing", "Spain", "noise shaping", "sigma-delta converters", "HDL simulator", "sigma-delta modulation", "circuit simulation", "decimation", "analog-to-digital converters", "learning methodology", "Vigo", "OrCAD PSpice simulator", "Converters", "Integrated circuit modeling", "Analog–digital (A/D) conversion", "Synchronization", "field programmable gate arrays (FPGAs)", "modulation", "Pipelines", "sampling rate", "digital signal processing chips"]}, {"title": "Inferring Learning Style From the Way Students Interact With a Computer User Interface and the WWW", "link": "https://ieeexplore.ieee.org/document/5392998/", "abstract": "Recent significant advances in automatically predicting user learning styles are described. The system works with new client-based systems that filter Web pages and provide easy, structured, focused, and controlled access to the Internet. A first system called iLessons was embedded within Microsoft Internet Explorer 6 and provided teachers with tools to create lesson Web pages, define zones of the Internet that could be accessed during a lesson, and enforce these settings in a set of computers. A second system enabled students to investigate and collaborate using the Internet. The system filtered Web pages based on the relevance of their contents and assisted students by inferring their learning style (active or reflective) and by recommending pages found by fellow students based on page relevancy, student learning style, and state of mind measured by activity. The system infers learning style in real time by monitoring user activity, and recent significant advances in the research are described.", "authors": [{"name": "David Adrian Sanders", "affiliation": "Faculty of Technology, University of Portsmouth, Portsmouth, UK"}, {"name": "Jorge Bergasa-Suso", "affiliation": "Fortek Computers Limited, Gosport, UK"}], "tags": ["Internet", "Collaborative work", "navigation", "Artificial intelligence", "Microsoft Internet Explorer 6", "user interfaces", "computer aided instruction", "Learning systems", "Monitoring", "intelligent tutoring systems", "student learning style", "distributed learning", "iLessons", "Cooperative/collaborative learning", "Software tools", "World Wide Web", "computer user interface", "Web pages"]}, {"title": "Teaching Sustainability Analysis in Electrical Engineering Lab Courses", "link": "https://ieeexplore.ieee.org/document/5152983/", "abstract": "Laboratory courses represent an incompletely tapped opportunity to teach sustainability concepts. This work introduces and evaluates a simple strategy used to teach sustainability concepts in electrical engineering laboratory courses. The technique would readily adapt to other disciplines. The paper presents assessment data and a wiki containing student sustainability analyses.", "authors": [{"name": "David Braun", "affiliation": "California Polytechnic State University, San Louis Obispo, CA, USA"}], "tags": ["Electrical engineering", "Computers", "Laboratories", "Education", "teaching", "sustainability analysis", "Electrical engineering education", "integrated circuits", "sustainability", "Probability density function", "student sustainability analyses", "Data mining", "Environmental factors", "educational courses", "electrical engineering lab courses", "technology social factors", "systems engineering", "electrical engineering education"]}, {"title": "An Undergraduate Course and Laboratory in Digital Signal Processing With Field Programmable Gate Arrays", "link": "https://ieeexplore.ieee.org/document/5393015/", "abstract": "In this paper, an innovative educational approach to introducing undergraduates to both digital signal processing (DSP) and field programmable gate array (FPGA)-based design in a one-semester course and laboratory is described. While both DSP and FPGA-based courses are currently present in different curricula, this integrated approach reduces the number of electives students would have to take and at the same time provides a hands-on DSP experience. Developing such a new course with no textbook available is challenging. Therefore, the educational materials developed, the software tool evaluations, and topics to be covered in lectures and laboratories are described. Detailed evaluations of the selection of appropriate software and hardware platforms, topics to cover, and student feedback are provided.", "authors": [{"name": "Anke Meyer-Bäse", "affiliation": "FAMU-FSU, Tallahassee, FL, USA"}, {"name": "Uwe Meyer-Bäse", "affiliation": "FAMU-FSU, Tallahassee, FL, USA"}, {"name": "Reginald J. Perry", "affiliation": "FAMU-FSU, Tallahassee, FL, USA"}, {"name": "Marios S. Pattichis", "affiliation": "ECE Dept., University of New Mexico, Albuquerque, NM, USA"}, {"name": "Alonzo Vera", "affiliation": "ECE Dept., University of New Mexico, Albuquerque, NM, USA"}], "tags": ["innovative educational approach", "Curriculum development", "undergraduate course", "SystemGenerator", "educational courses", "Software tools", "laboratory", "digital signal processing chips", "MatLab/Simulink", "digital signal processing", "Laboratories", "laboratory techniques", "Digital signal processing", "Digital signal processing (DSP)", "Hardware design languages", "Field programmable gate arrays", "DSPbuilder", "educational materials", "software tool evaluations", "field programmable gate array (FPGA)", "field programmable gate arrays"]}, {"title": "Linearization: Students Forget the Operating Point", "link": "https://ieeexplore.ieee.org/document/5272082/", "abstract": "Linearization is a standard part of modeling and control design theory for a class of nonlinear dynamical systems taught in basic undergraduate courses. Although linearization is a straight-line methodology, it is not applied correctly by many students since they often forget to keep the operating point in mind. This paper explains the topic and suggests a way to improve the teaching of the methodology in control courses. The idea is presented on a model of an inverted pendulum on a cart-a classical laboratory model used in the control theory education process.", "authors": [{"name": "Petr Husek", "affiliation": "Department of Control Engineering Faculty of Electrical Engineering, Czech Technical University, Prague, Czech Republic"}, {"name": "Jirka Roubal", "affiliation": "Department of Control Engineering Faculty of Electrical Engineering, Czech Technical University, Prague, Czech Republic"}, {"name": "Jan Stecha", "affiliation": "Department of Control Engineering Faculty of Electrical Engineering, Czech Technical University, Prague, Czech Republic"}], "tags": ["nonlinear dynamical systems", "cart-a classical laboratory model", "control design theory", "linear model", "laboratory model", "pendulums", "Mathematical model", "Equations", "Dynamical model", "linearization", "control system synthesis", "nonlinear control systems", "nonlinear model", "Data mining", "Nonlinear systems", "Laboratories", "inverted pendulum model", "control engineering education", "Education", "linearisation techniques", "control theory education process", "control courses", "Control theory", "linearization method"]}, {"title": "Problem-Based Learning in Instrumentation: Synergism of Real and Virtual Modular Acquisition Chains", "link": "https://ieeexplore.ieee.org/document/5152984/", "abstract": "As part of an instrumentation course, a problem-based learning framework was selected for laboratory instruction. Two acquisition chains were designed to help students carry out realistic instrumentation problems. The first tool is a virtual (simulated) modular acquisition chain that allows rapid overall understanding of the main problems in instrumentation. The second tool is an actual modular chain allowing students to test these modules in practice and fine-tune the results. The didactic impact of the laboratory-and especially of the two acquisition chains-was evaluated using three approaches: an evaluation questionnaire, the problem outcomes, and a written examination. These results show that the students valued the laboratory-based coursework and found both tools useful. Furthermore, they were able to address problems at a high cognitive level.", "authors": [{"name": "Erwan Leroy", "affiliation": "Bio, Electro and Mechanical Systems (BEAMS), Université Libre de Bruxelles, Brussels, Belgium"}, {"name": "David Lopez Martinez", "affiliation": "Bio, Electro and Mechanical Systems (BEAMS), Université Libre de Bruxelles, Brussels, Belgium"}, {"name": "Alexis Vander Biest", "affiliation": "Bio, Electro and Mechanical Systems (BEAMS), Université Libre de Bruxelles, Brussels, Belgium"}, {"name": "Antoine Nonclercq", "affiliation": "Bio, Electro and Mechanical Systems (BEAMS), Université Libre de Bruxelles, Brussels, Belgium"}, {"name": "Frédéric Robert", "affiliation": "Bio, Electro and Mechanical Systems (BEAMS), Université Libre de Bruxelles, Brussels, Belgium"}, {"name": "Kevin De Cuyper", "affiliation": "Bio, Electro and Mechanical Systems (BEAMS), Université Libre de Bruxelles, Brussels, Belgium"}], "tags": ["Hardware", "laboratory-based coursework", "Electrocardiography", "problem-based learning", "collaborative work", "measurement", "Biomedical measurements", "Noise", "synergism", "simulation", "Data mining", "Instruments", "groupware", "Laboratories", "Probability density function", "problem-solving", "learning by example", "modular acquisition chains", "biomedical measurement", "data acquisition"]}, {"title": "A 10-Year Mechatronics Curriculum Development Initiative: Relevance, Content, and Results—Part I", "link": "https://ieeexplore.ieee.org/document/5169909/", "abstract": "This paper describes the first phase of a Mechatronics Curriculum Development effort-the design of an ¿Introduction to Mechatronics¿ course, the infusion of mechatronics activities throughout the curriculum and in outreach activities, and assessment results. In addition, the relevance and impact of such a curriculum on the education of engineers in relation to the evolving global economy is discussed. The second and third phases of this effort included development of two advanced mechatronics courses and the formulation of a mechatronics curriculum, which will be addressed in a companion paper, ¿A 10-Year Mechatronics Curriculum Development Initiative: Relevance, Content, and Results-Part II¿ (IEEE Transactions on Education, vol. 53, no. 2, May 2010).", "authors": [{"name": "Mohan Krishnan", "affiliation": "Department of Electrical and Computer Engineering, University of Detroit Mercy, Detroit, MI, USA"}, {"name": "Shuvra Das", "affiliation": "Department of Mechanical and Manufacturing Engineering, University of Detroit Mercy, Detroit, MI, USA"}, {"name": "Sandra A. Yost", "affiliation": "Department of Electrical and Computer Engineering, University of Detroit Mercy, Detroit, MI, USA"}], "tags": ["Microcontrollers", "Servomotors", "global economy", "project-based learning", "Curriculum development", "Mechatronics", "engineering education", "precollege outreach", "mobile robotics", "Sensors", "mechatronics education", "mechatronics curriculum development", "course", "educational courses", "mechatronics", "Mobile robots"]}, {"title": "Ontology for E-Learning: A Bayesian Approach", "link": "https://ieeexplore.ieee.org/document/5196690/", "abstract": "In the last decade, the evolution of educational technologies has forced an extraordinary interest in new methods for delivering learning content to learners. Today, distance education represents an effective way for supporting and sometimes substituting the traditional formative processes, thanks to the technological improvements achieved in the field in recent years. However, the role of technology has often been overestimated. The amount of information students can obtain from the Internet is huge, and as a result, they can easily be confused. Teachers can also be disconcerted by this vast quantity of content and are often unable to suggest the correct content to their students. In the open scientific literature, it is widely recognized that an important factor for success in delivering learning content is related to the capability for customizing the learning process for the specific needs of a given learner. This task is still far from having been fully accomplished, and there is a real interest in investigating new approaches and tools to adapt the formative process to specific individual needs. In this scenario, the introduction of ontology formalism can improve the quality of the formative process, allowing the introduction of new and effective services. Ontologies can lead to important improvements in the definition of a course's knowledge domain, in the generation of an adapted learning path, and in the assessment phase. This paper provides an initial discussion of the role of ontologies in the context of e-learning. The improvements related to the introduction of ontologies formalism in the e-learning field are discussed, and a novel algorithm for ontology building through the use of Bayesian networks is shown. Finally, the application of this algorithm in the assessment process and some experimental results are illustrated.", "authors": [{"name": "Massimo De Santo", "affiliation": "Department of Electrical and Information Engineering, Università di Salerno, Fisciano, Italy"}, {"name": "Francesco Colace", "affiliation": "Department of Electrical and Information Engineering, Università di Salerno, Fisciano, Italy"}], "tags": ["educational technology", "formative process quality", "Bayesian methods", "Adaptive assessment tool", "distance education", "adaptive hypermedia system", "Bayesian approach", "Buildings", "Vocabulary", "Data mining", "ontologies (artificial intelligence)", "e-learning", "Bayesian network", "belief networks", "Electronic learning", "Internet", "ontology", "learning technology", "course knowledge domain", "computer aided instruction", "Ontologies", "distance learning", "ontology formalism", "adapted learning path"]}, {"title": "Working Together for Better Student Learning: A Multi-University, Multi-Federal Partner Program for Asynchronous Learning Module Development for Radar-Based Remote Sensing Systems", "link": "https://ieeexplore.ieee.org/document/5299239/", "abstract": "Students are not exposed to enough real-life data. This paper describes how a community of scholars seeks to remedy this deficiency and gives the pedagogical details of an ongoing project that commenced in the Fall 2004 semester. Fostering deep learning, this multiyear project offers a new active-learning, hands-on interdisciplinary laboratory program in which engineering, geoscience, and meteorology students are encouraged to participate actively. Storms, tornadoes, and hazardous weather cause damage and loss that could be minimized through enhanced radar technologies and longer warning lead times. To study these topics, the program has generated a unique, interdisciplinary research-oriented learning environment that will train future engineers and meteorologists in the full set of competencies needed to take raw radar data and transform them into meaningful interpretations of weather phenomena.", "authors": [{"name": "Guifu Zhang", "affiliation": "School of Meteorology, University of Oklahama, Norman, OK, USA"}, {"name": "Robert D. Palmer", "affiliation": "School of Meteorology, University of Oklahama, Norman, OK, USA"}, {"name": "Hector Monroy", "affiliation": "School of Electrical and Computer Engineering, University of Puerto Rico, Mayaguez, Puerto Rico"}, {"name": "Kelly Ann Mitchell", "affiliation": "College of Journalism, University of Oklahama, Norman, OK, USA"}, {"name": "Mark B. Yeary", "affiliation": "School of Electrical and Computer Engineering, University of Oklahama, Norman, OK, USA"}, {"name": "Isabelle Ruin", "affiliation": "Institute of the Study of Society and Environment, National Center for Atmospheric Research, Boulder, CO, USA"}, {"name": "Christopher Weiss", "affiliation": "Department of Geosciences, Texas Tech University, Lubbock, TX, USA"}, {"name": "Phillip B. Chilson", "affiliation": "School of Meteorology, University of Oklahama, Norman, OK, USA"}, {"name": "Tian-You Yu", "affiliation": "School of Electrical and Computer Engineering, University of Oklahama, Norman, OK, USA"}, {"name": "L. Dee Fink", "affiliation": "Instructional Consultant in Higher Education, Norman, OK, USA"}, {"name": "Michael Irwin Biggerstaff", "affiliation": "School of Meteorology, University of Oklahama, Norman, OK, USA"}], "tags": ["Doppler radar", "Meteorology", "remote sensing", "radar-based remote sensing systems", "radar systems", "hands-on interdisciplinary laboratory program", "weather environment", "interdisciplinary research-oriented learning environment", "Radar imaging", "electrical engineering education", "educational modules", "Internet", "multifederal partner program", "fostering deep learning", "asynchronous learning module", "Radar measurements", "radar technology", "multiuniversity", "remote sensing by radar", "educational institutions", "Radar polarimetry", "Active learning", "Meteorological radar", "student learning"]}, {"title": "Assessing Student Learning in a Virtual Laboratory Environment", "link": "https://ieeexplore.ieee.org/document/5152943/", "abstract": "Laboratory experience is a key factor in technical and scientific education. Virtual laboratories have been proposed to reduce cost and simplify maintenance of lab facilities while still providing students with access to real systems. It is important to determine if such virtual labs are still effective for student learning. In the assessment of a graduate computer networks course, the author quantifies the amount of learning that is observed in lectures and labs. The results not only show that learning indeed occurs during lab sessions, but almost equally as much (45.9%) as in lectures (54.1%). Also, it is observed that even students who have prior experience in networking benefit from virtual labs.", "authors": [{"name": "Tilman Wolf", "affiliation": "Department of Electrical and Computer Engineering, University of Massachusetts, Amherst, Amherst, MA, USA"}], "tags": ["educational technology", "Hardware", "Computer networks", "graduate computer networks course", "learning (artificial intelligence)", "computer networks education", "Data mining", "virtual instrumentation", "virtual laboratory environment", "virtual laboratory", "Laboratories", "computer aided instruction", "Probability density function", "learning events", "Software", "Assessment", "Education", "computer science education", "student learning"]}, {"title": "A Computer Model for Teaching the Dynamic Behavior of AC Contactors", "link": "https://ieeexplore.ieee.org/document/5152940/", "abstract": "Ac-powered contactors are extensively used in industry in applications such as automatic electrical devices, motor starters, and heaters. In this work, a practical session that allows students to model and simulate the dynamic behavior of ac-powered electromechanical contactors is presented. Simulation is carried out using a rigorous parametric model of the ac contactor that avoids simplification assumptions and is thoroughly explained. The goal of this practical is to introduce students to the topic of dynamic simulation of real devices. It covers both the transient and the steady-state response of the electromechanical system under study. The proposed methodology is flexible and not particularly time-consuming, and it allows the students easily to change the electromechanical constants of the contactor they are studying. The results of the simulations were compared with experimental data acquired by the students; a close similarity between real and simulated data was observed. The Technical University of Catalonia (UPC), Spain, has incorporated the simulation methodology proposed in this paper in a practical session of an electrical engineering course.", "authors": [{"name": "Luis Romeral", "affiliation": "Electronic Engineering Department, Universitat Poliltècnica de Catalunya, Terrassa, Spain"}, {"name": "Jordi-Roger Riba Ruiz", "affiliation": "Electrical Engineering Department, Universitat Poliltècnica de Catalunya, Igualada, Spain"}, {"name": "Antonio Garcia Espinosa", "affiliation": "Electrical Engineering Department, Universitat Poliltècnica de Catalunya, Terrassa, Spain"}], "tags": ["students", "shading rings", "Technical University of Catalonia", "Contactors", "Mathematical model", "educational courses", "education", "Equations", "electrical engineering course", "Computer-assisted learning", "simulation", "computer model", "ac-powered electromechanical contactors", "Magnetic cores", "electromechanical system", "dynamic modeling", "electrical engineering education", "Springs", "Spain", "computer aided instruction", "electromechanical contactor", "Magnetic circuits", "contactors", "teaching", "Coils", "AC machines"]}, {"title": "Microcontroller-Based Experimental Setup and Experiments for SCADA Education", "link": "https://ieeexplore.ieee.org/document/5272087/", "abstract": "In the field of automation technology, research and development for industrial applications has increased rapidly in recent years. Therefore, industrial automation and control education is a very important element of the industrialization process in developing countries, such as Turkey, which needs to keep abreast for the latest developments in the field. However, there are several challenges in industrial automation education in a developing country. First, a course that includes instrumentation and automation needs a significant budget. Moreover, the necessary instrumentation is generally confusing to use, which reduces the motivation of the students. Another challenge is that real industrial processes cannot be set up in the laboratory because these may be hazardous for students. To overcome these challenges, this paper gives a detailed description of some laboratory experiments in virtual-instrument-aided supervisory control and data acquisition (SCADA) systems. These experiments have been developed as part of implementing an inductive education strategy in the Automation Laboratory of Ege Vocational School, Ege University, İzmir, Turkey. The experiments described here are designed to show how an economically feasible SCADA system could be built. The advantages and the challenging points of these experiments are also discussed and evaluated. A quantitative evaluation was achieved using a one-way ANOVA test performed on the exam results of the students. The qualitative evaluation was performed using a survey given to the students. The results indicated that the performance of the students was improved compared to the previous years' students.", "authors": [{"name": "S. Sahin", "affiliation": "Department of Industrial Automation, Ege University, Bornova, İzmir, Turkey"}, {"name": "Y. Isler", "affiliation": "Department of Electrical and Electronics Engineering, Dokuz Eylül University, Bornova, İzmir, Turkey"}, {"name": "Mehmet Olmez", "affiliation": "Teknik Programlar Bölümü, Dokuz Eylül University, Bornova, İzmir, Turkey"}], "tags": ["educational technology", "Control engineering education", "Automation", "Turkey", "SCADA system", "control education", "microcontroller", "supervisory control and data acquisition", "virtual instrumentation", "Instruments", "social aspects of automation", "supervisory control and data acquisition (SCADA) systems", "Laboratories", "digital control", "Software", "microcontrollers", "control engineering education", "virtual instrument", "Education", "factory automation", "SCADA systems", "industrial automation education", "Temperature sensors", "automation technology"]}, {"title": "Using Antenna Arrays to Motivate the Study of Sinusoids", "link": "https://ieeexplore.ieee.org/document/4914746/", "abstract": "Educational activities involving antenna arrays to motivate the study of sinusoids are described. Specifically, using fundamental concepts related to phase and simple geometric arguments, students are asked to predict the location of interference nulls in the radiation pattern of two-element phased array antennas. The location of the radiation nulls are then verified experimentally. The activities have been employed both in a freshman-level electrical engineering course and, in expanded form, a summer research experience for high school students. Details of the experiments are given, as are results of student assessment and suggestions for further development.", "authors": [{"name": "James P. Becker", "affiliation": "Department of Electrical and Computer Engineering, Montana State University, Bozemon, MT, USA"}], "tags": ["radiation nulls", "Antennas", "antenna radiation patterns", "assessment", "educational courses", "education", "Antenna measurements", "Antenna radiation patterns", "microstrip circuits", "radiation pattern", "sinusoids", "electrical engineering education", "Patch antennas", "antennas", "Delay", "Antenna arrays", "freshman-level electrical engineering course", "antenna arrays", "Phased arrays", "educational activities"]}, {"title": "An Empirical Evaluation of Puzzle-Based Learning as an Interest Approach for Teaching Introductory Computer Science", "link": "https://ieeexplore.ieee.org/document/5378490/", "abstract": "This correspondence describes an adaptation of puzzle-based learning to teaching an introductory computer programming course. Students from two offerings of the course-with and without the puzzle-based learning-were surveyed over a two-year period. Empirical results show that the synthesis of puzzle-based learning concepts with existing course content improves students' learning experience by increasing their interest and participation in the course and developing their critical thinking skills.", "authors": [{"name": "Kathryn E. Merrick", "affiliation": "School of Engineering and Information Technology, University of New South Wales, Canberra, ACT, Australia"}], "tags": ["puzzle-based learning", "Laboratories", "teaching", "Problem-solving", "empirical evaluation", "problem solving", "Learning systems", "Computer science education", "introductory computer programming course", "computer science education", "educational courses", "interest approaches"]}, {"title": "State-Space Formulation for Circuit Analysis", "link": "https://ieeexplore.ieee.org/document/5280352/", "abstract": "This paper presents a new state-space approach for temporal analysis of electrical circuits. The method systematically obtains the state-space formulation of nondegenerate linear networks without using concepts of topology. It employs nodal/mesh systematic analysis to reduce the number of undesired variables. This approach helps students to understand how a circuit works with energy-storage elements. In addition, students perceive the method to be an extension of the analysis of static networks, integrating the new concepts in an unified framework. The assessment results show that significantly more of the students who achieve higher scores in circuit analysis have learned the state-space approach rather than the conventional methods.", "authors": [{"name": "Tomas Martinez-Marin", "affiliation": "Department of Physics, Systems Engineering and Signal Theory, University of Alicante, Alicante, Spain"}], "tags": ["circuit transient analysis", "state-space formulation", "Circuit modeling", "Mathematical model", "Equations", "linear network analysis", "nondegenerate linear networks", "linear circuits", "static network", "state-space methods", "electrical circuit analysis", "electrical engineering education", "Capacitors", "energy storage elements", "Laplace equations", "RLC circuits", "Inductors", "Generators", "state-space models"]}, {"title": "Some Little-Known Facts About Transmission Lines and Some New Results", "link": "https://ieeexplore.ieee.org/document/5290095/", "abstract": "The study of transmission lines forms an integral part of any curriculum in electrical engineering. This paper presents some little-known but interesting facts about transmission lines, which are generally not found in textbooks, along with some new facts, which arose as extensions of these little-known ones. The facts highlighted in this paper are that: 1) the real part of the characteristic impedance is always greater than the magnitude of its imaginary part; 2) the real and imaginary parts of the characteristic impedance and the propagation constant are interrelated by four inequalities; 3) the magnitude of the load reflection coefficient may exceed unity, even for a passive load; 4) the concepts of incident power and reflected power, as usually employed in dealing with lossless lines, are not, in general, valid in a lossy line; 5) the law of power conservation is not violated because of Fact 3; and that 6) the maximum value of depends on whether the load or the characteristic impedance is variable and whether the load is active or passive.", "authors": [{"name": "Suhash C. Dutta Roy", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology Delhi, New Delhi, India"}], "tags": ["Power transmission lines", "Impedance", "power transmission lines", "transmission lines", "Electrical engineering education", "Propagation losses", "electrical engineering curriculum", "passive load", "inequality", "Energy conservation", "power conservation", "characteristic impedance", "propagation constant", "Load reflection coefficient", "electrical engineering education"]}, {"title": "Simulation Tools for Power Electronics Courses Based on Java Technologies", "link": "https://ieeexplore.ieee.org/document/5340652/", "abstract": "This paper presents interactive power electronics educational tools. These interactive tools make use of the benefits of Java language to provide a dynamic and interactive approach to simulating steady-state ideal rectifiers (uncontrolled and controlled; single-phase and three-phase). Additionally, this paper discusses the development and use of Java applet programs to assist the teaching of conventional power electronics rectifier circuits and to serve as a first design tool for basic laboratory experiments in power electronics courses. Comparison was made among results obtained using a well-known simulator package, experimental results, and the developed interactive simulation applets in order to validate the latter.", "authors": [{"name": "Flávio A. S. Goncalves", "affiliation": "UNESP-FEIS, Department of Electrical Engineering, São Paulo State University, Sao Paulo, Brazil"}, {"name": "Leonardo P. Sampaio", "affiliation": "UNESP-FEIS, Department of Electrical Engineering, São Paulo State University, Sao Paulo, Brazil"}, {"name": "Carlos A. Canesin", "affiliation": "UNESP-FEIS, Department of Electrical Engineering, São Paulo State University, Sao Paulo, Brazil"}], "tags": ["student experiments", "educational courses", "Java applet programs", "education", "rectifying circuits", "Power electronics", "Student experiments", "Java", "steady-state ideal rectifiers", "Circuit simulation", "Java technology", "basic laboratory experiments", "thyristors", "computer aided instruction", "electronic engineering education", "power electronics", "Integrated circuit modeling", "power electronics courses", "interactive educational tools", "rectifier circuits", "Thyristors", "simulator package", "electronic engineering computing", "Java language"]}, {"title": "Planning and Development of Lab Training Activities for Powerline Communications", "link": "https://ieeexplore.ieee.org/document/5238603/", "abstract": "This paper discusses the planning and development of student training and activities for the Powerline Communications Laboratory at the Technical Education Institute (TEI), Patras, Greece. Powerline communications is currently an active area of research and development that combines three separate specializations from the standard training of electrical engineers: communications, power, and control systems. A course on powerline communications toward the end of the standard electrical engineer's training provides a useful practice in applying what the students have already been taught in an area that has high potential in modern consumer electronics. The planning of suitable training activities for the students takes into account their background and training at that stage of the course and combines concepts and practices common to communication, power, and control systems. In detail, the training activities involve: (1) familiarization and training with currently available market products for automation/control and broadband powerline communications; (2) open-source software that can be used in the design and simulation of such systems; and (3) fabrication and testing of simple passive filter circuits that can be used for signal coupling into the mains power lines for custom applications.", "authors": [{"name": "Anastasios Drosopoulos", "affiliation": "Department of Electrical Engineering, Technical Educational Institute of Patras, Patras, Greece"}, {"name": "Marios Hatziprokopiou", "affiliation": "Department of Electrical Engineering, Technical Educational Institute of Patras, Patras, Greece"}], "tags": ["Communication systems", "Automation", "TEI", "power systems", "market products", "education", "Technical Education Institute", "Testing", "control systems", "signal coupling", "Planning", "power transmission planning", "Greece", "power engineering education", "Patras", "student training", "laboratories", "Control systems", "planning and development", "consumer electronics", "passive filter circuits testing", "powerline communications laboratory", "Throughput", "carrier transmission on power lines", "lab training activities", "mains power lines", "electrical engineers training", "Training", "Protocols", "training", "open source software"]}, {"title": "IT-Adventures: A Program to Spark IT Interest in High School Students Using Inquiry-Based Learning With Cyber Defense, Game Design, and Robotics", "link": "https://ieeexplore.ieee.org/document/5262961/", "abstract": "The IT-Adventures program is dedicated to increasing interest in and awareness of information technology among high school students using inquiry-based learning focused on three content areas: cyber defense, game design programming, and robotics. The program combines secondary, post-secondary, and industry partnerships in educational programming, competitive events, and service learning projects targeted at high school students to accomplish its goals. This paper provides details about the IT-Adventures program as well as the capstone event for students-the IT-Olympics. Project assessment findings, such as differences between students who compete in different content areas, and descriptive measures about the participants are also provided.", "authors": [{"name": "Doug Jacobson", "affiliation": "Department of Electrical and Computer Engineering, Iowa State University, Ames, IA, USA"}, {"name": "Andy Luse", "affiliation": "Department of Electrical and Computer Engineering, Iowa State University, Ames, IA, USA"}, {"name": "Julie A. Rursch", "affiliation": "Department of Electrical and Computer Engineering, Iowa State University, Ames, IA, USA"}], "tags": ["secondary partnership", "high school students", "game design programming area", "Cyber defense competition", "educational programming project", "Robots", "Operating systems", "game design", "Programming profession", "robotics area", "IT-Adventures", "industry partnership", "Tutorials", "partnerships", "service learning project", "K-12", "IT-Adventures program", "computer aided instruction", "Industries", "STEM enrollment", "inquiry-based learning", "robotics", "competitive events project", "computer science education", "post-secondary partnership", "Games", "cyber defense area"]}, {"title": "A Wireless Communications Laboratory on Cellular Network Planning", "link": "https://ieeexplore.ieee.org/document/5406029/", "abstract": "The field of radio network planning and optimization (RNPO) is central for wireless cellular network design, deployment, and enhancement. Wireless cellular operators invest huge sums of capital on deploying, launching, and maintaining their networks in order to ensure competitive performance and high user satisfaction. This work presents a lab course composed of 10 experiments that cover the different phases of RNPO for various state-of-the-art wireless technologies such as GSM, UMTS, and WiMAX. Each experiment constitutes a complete entity including the necessary theoretical background and references, the lab tasks based on real-world scenarios, and a research component consisting of general questions. The proposed lab course represents a novel initiative to increase interactive learning by integrating communications theory fundamental knowledge with state-of-the-art wireless communications software tools and measurement equipment. The experiments are carefully designed to enhance the analytical skills and to advance the academic and practical knowledge of the students.", "authors": [{"name": "Lina Al-Kanj", "affiliation": "Department of Electrical and Computer Engineering, American University of Beirut, Lebanon"}, {"name": "Elias Yaacoub", "affiliation": "Department of Electrical and Computer Engineering, American University of Beirut, Lebanon"}, {"name": "Zaher Dawy", "affiliation": "Department of Electrical and Computer Engineering, American University of Beirut, Lebanon"}, {"name": "Ahmad Husseini", "affiliation": "Ericsson-GSDC Lebanon, Beirut, Lebanon"}], "tags": ["user satisfaction", "interactive learning", "WiMAX", "cellular network planning", "lab course", "WiMax", "Wireless communication", "3G mobile communication", "Student experiments", "cellular radio", "software tools", "telecommunication network planning", "measurement equipment", "wireless communications", "wireless cellular network", "wireless communications laboratory", "GSM", "optimization", "optimisation", "UMTS", "radio network planning", "Cellular network planning", "Cellular networks", "drive testing"]}, {"title": "Signals in Communication Engineering History", "link": "https://ieeexplore.ieee.org/document/5373853/", "abstract": "This paper is a study of various electric signals, which have been employed throughout the history of communication engineering in its two main landmarks: the telegraph and the telephone. The signals are presented in their time and frequency domain representations. The historical order has been followed in the presentation: wired systems, spark gap wireless, continuous wave (CW) and amplitude modulation (AM), detection by rectification, and frequency modulation (FM). The analysis of these signals is meant to lead into a better understanding of the evolution of communication technology. The material presented in this work could be used to illustrate “Signals and Systems” and “Communication Systems” courses by taking advantage of its technical as well as historical contents.", "authors": [{"name": "Magno T. M. Silva", "affiliation": "Department of Electronic Systems Engineering, Escola Politécnica, University of São Paulo, Sao Paulo, Brazil"}, {"name": "Denise Consonni", "affiliation": "Federal University of ABC, Sao Paulo, Brazil, Department of Electronic Systems Engineering, Escola Politécnica, University of São Paulo, Sao Paulo, Brazil"}], "tags": ["Amplitude modulation", "Spark gaps", "Communication systems", "telecommunication engineering education", "History", "telephone sets", "spectra", "Wireless communication", "systems", "telephone", "communication engineering history", "Communication signals", "continuous wave modulation", "Telephony", "engineering history", "telegraphy", "signals", "Frequency modulation", "frequency modulation", "amplitude modulation", "telegraph", "Communication engineering education"]}, {"title": "High-Frequency Wireless Communications System: 2.45-GHz Front-End Circuit and System Integration", "link": "https://ieeexplore.ieee.org/document/5378465/", "abstract": "In this article, a course on high-frequency wireless communications systems is presented. With the 145-MHz baseband subsystem available from a prerequisite course, the present course emphasizes the design and implementation of the 2.45-GHz front-end subsystem as well as system integration issues. In this curriculum, the 2.45-GHz front-end subsystem includes only the antenna and the low-noise amplifier. Laboratory sessions are an essential part of the course. Successive completion of the laboratories automatically leads students to having a “working” 2.45-GHz wireless communications system. This course is beneficial to students who will pursue a career in wireless communication technology and related fields.", "authors": [{"name": "Yi-Chuan Ting", "affiliation": "Department of Electronic Engineering, National Kaohsiung First University of Science and Technology, Kaohsiung, Taiwan"}, {"name": "Ming-Chih Huang", "affiliation": "Yung Tai Junior College of Technology and Commerce, Pingdong, Taiwan"}, {"name": "Ming-Huei Chen", "affiliation": "Department of Electronic Engineering, National Kaohsiung First University of Science and Technology, Kaohsiung, Taiwan"}, {"name": "Hao-Hui Chen", "affiliation": "Department of Electronic Engineering, National Kaohsiung First University of Science and Technology, Kaohsiung, Taiwan"}, {"name": "Tsung-Lung Li", "affiliation": "Department of Applied Physics, National Chiayi University, Chiayi, Taiwan"}], "tags": ["Antennas", "Radio frequency", "Communication systems", "Low-noise amplifiers", "front-end circuit", "Electrical engineering education", "Wireless communication", "system integration", "2.45-GHz RF circuit", "high-frequency wireless communications system", "telecommunication engineering education", "plane path antenna", "educational courses", "low noise amplifiers", "low-noise amplifier (LNA)", "electrical engineering education"]}, {"title": "A Constrained and Guided Approach for Managing Software Engineering Course Projects", "link": "https://ieeexplore.ieee.org/document/5286256/", "abstract": "This paper documents several years of experimentation with a new approach to organizing and managing projects in a software engineering course. The initial failure and subsequent refinements that the new approach has been through since 2004 are described herein. The “constrained and guided” approach, as it is called, has helped to reduce project failure rates, increase specification fulfillment rates, and improve the design quality of student projects. It has also enabled the instructor to evaluate student projects more objectively. The questionnaire survey conducted in this study also shows that students greatly appreciated the new approach because it enabled them to manage projects more effectively.", "authors": [{"name": "Yung-Pin Cheng", "affiliation": "Department of Computer and Information Engineering, National Taiwan Normal University, Taipei, Taiwan"}, {"name": "Janet Mei-Chuen Lin", "affiliation": "Graduate Institute of Information and Computer Education, National Taiwan Normal University, Taipei, Taiwan"}], "tags": ["software engineering course", "Prototypes", "Programming profession", "Education", "project management", "constrained-and-guided approach", "software engineering", "Computer science education", "computer science education", "Games", "Software", "educational courses", "Software engineering"]}, {"title": "Bridging Physics to Electronics—An Outreach Effort", "link": "https://ieeexplore.ieee.org/document/5200364/", "abstract": "Physics has been an important part of the science curriculum in high schools. Without the appropriate high school physics background, it is difficult for a student subsequently to pursue an electronics engineering program at the university level since a good understanding of many concepts in physics is required to comprehend the material covered in electronics-related courses. Unfortunately, a phenomenon observed in today's high schools is a clear diminution of student interest in physics, leading to dwindling physics class sizes compared to a decade ago. The lack of interest in and passion for physics at the high school level ultimately leads to smaller intakes at the university level for electronics engineering courses and/or lower qualification cutoffs for students entering the programs. This results in a significant reduction in good students graduating from engineering programs. This paper will first share survey results that reveal possible reasons behind the decreasing number of students entering engineering programs. Two concerted efforts launched from the National University of Singapore (NUS) to arrest the declining interest in high schools will then be presented.", "authors": [{"name": "Vivian Ng", "affiliation": "Department of Electrical and Computer Engineering, National University of Singapore, Singapore, Singapore"}, {"name": "Tong-Heng Lee", "affiliation": "Department of Electrical and Computer Engineering, National University of Singapore, Singapore, Singapore"}, {"name": "Kok-Kiong Tan", "affiliation": "Department of Electrical and Computer Engineering, National University of Singapore, Singapore, Singapore"}, {"name": "Kok-Zuea Tang", "affiliation": "Department of Electrical and Computer Engineering, National University of Singapore, Singapore, Singapore"}, {"name": "Arthur Tay", "affiliation": "Department of Electrical and Computer Engineering, National University of Singapore, Singapore, Singapore"}, {"name": "Shih-Cheng Yen", "affiliation": "Department of Electrical and Computer Engineering, National University of Singapore, Singapore, Singapore"}], "tags": ["student experiments", "high school physics", "Automation", "physics education", "educational courses", "engineering education outreach", "Transportation", "electronics engineering education", "Data mining", "light-emitting diodes (LEDs)", "piezoelectricity", "optoelectronic devices", "Temperature control", "teaching demonstrations", "physics", "Manufacturing", "Educational institutions", "electronic engineering education", "electronics engineering courses", "Physics"]}, {"title": "How to Motivate Students to Work in the Laboratory: A New Approach for an Electrical Machines Laboratory", "link": "https://ieeexplore.ieee.org/document/5280276/", "abstract": "Many laboratory courses have become iterative processes in which students only seek to meet the requirements and pass the course. Some students believe these courses are boring and do not give them training as engineers. To provide a solution to the poor motivation of students in laboratories with few resources, this work proposes the method \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Laboratory Practice Based on Questions</i>\n (LPBQ), which is based on Vee mapping. The results show that the method allows for more enjoyable, interesting, creative, and motivating laboratory practices. The method does not require investments in specialized equipment.", "authors": [{"name": "Andrés Julián Saavedra Montes", "affiliation": "Escuela de Ingeniería Eléctrica yMecánica, Universidad Nacional de Colombia, Medellin, Colombia"}, {"name": "Jesús Antonio Hernandez Riveros", "affiliation": "Escuela de Ingeniería Eléctrica yMecánica, Universidad Nacional de Colombia, Medellin, Colombia"}, {"name": "Héctor Antonio Botero Castro", "affiliation": "Escuela de Ingeniería Eléctrica yMecánica, Universidad Nacional de Colombia, Medellin, Colombia"}], "tags": ["iterative methods", "Electrical engineering education", "educational courses", "Electrical engineering", "Laboratory Practice Based on Questions", "laboratory classes", "Data mining", "power engineering education", "Instruments", "electrical engineering education", "Laboratories", "laboratory techniques", "teaching engineering laboratories", "Training", "Vee mapping", "students motivation", "iterative processes", "electric machines", "Teamwork", "electrical machines laboratory"]}, {"title": "Applying Peer Reviews in Software Engineering Education: An Experiment and Lessons Learned", "link": "https://ieeexplore.ieee.org/document/5152941/", "abstract": "Based on the demonstrated value of peer reviews in the engineering industry, numerous industry experts have listed it at the top of the list of desirable development practices. Experience has shown that problems (defects) are eliminated earlier if a development process incorporates peer reviews and that these reviews are as effective as or even more effective than testing. It is therefore important for engineering students to peer review each other's work during design projects. However, surprisingly, few engineering courses in universities and colleges include peer-review activities in their design projects. The author thus decided to incorporate peer reviews in the design project of a senior software engineering course in two offerings of the course. The purpose of this article is to present the experimental findings, lessons learned, possible challenges, and recommendations that may be used to promote learning and also the use of peer-review activities in teaching other software, electrical, and computer engineering courses. The results of the experiment show promising signs of using peer review in the design project of the course.", "authors": [{"name": "Vahid Garousi", "affiliation": "Software Quality Engineering Research Group (Soft-Qual), Department of Electrical and Computer Engineering, Schulich School of Engineering, University of Calgary, Calgary, AB, Canada"}], "tags": ["lessons learned", "senior software engineering course", "educational courses", "peer reviews", "quantitative and qualitative analysis", "Design projects", "software reviews", "software engineering education", "Unified modeling language", "software engineering", "Software", "Educational institutions", "Software engineering", "peer review", "design projects", "Book reviews", "experimental study", "computer science education", "design engineering", "Inspection"]}, {"title": "Using a Didactic Manipulator in Mechatronics and Industrial Engineering Courses", "link": "https://ieeexplore.ieee.org/document/5340651/", "abstract": "One of the most difficult and most important engineering tasks is the integration of a robot-manipulator into material handling, assembly, and production processes, offering the possibility of supervision and control. The knowledge and skills required for these kinds of tasks are purely mechatronic and, thus, multidisciplinary. This paper describes a didactic manipulator, MRA-M01, designed and produced in a mechatronics laboratory of the Faculty of Technical Sciences Novi Sad, Republic of Serbia. This manipulator serves as part of the laboratory equipment used by students enrolled in courses in the Departments of Mechatronics and Industrial Engineering. The manipulator was created to enable students to gain practical knowledge of the integration of diverse engineering fields, including electro-pneumatics, sensors, actuators, programmable logic controllers (PLC), field bus systems, supervisory control and data acquisition (SCADA) systems, material handling, industrial engineering, and intelligent control systems. The manipulator MRA-M01 is a three-degrees-of-freedom manipulator, with three linear actuators. Two of those are pneumatic (one controlled in a standard way by a control valve, and the other using servo-pneumatics), and one is electromechanical (with a dc motor). This manipulator supports hands-on activities in class by assisting students in material-handling tasks, which involve them learning about the structure of the manipulator and its components. Through this learning process, students are able to evaluate the use of different methods of manipulator design. One of the most important learning gains is that of understanding manipulator implementation by working through different scenarios that simulate industrial tasks and conditions.", "authors": [{"name": "Stevan Stankovski", "affiliation": "Faculty of Technical Sciences-Mechatronics, University of Novi Sad, Novi Sad, Serbia"}, {"name": "Dragana Skrinjar", "affiliation": "Faculty of Technical Sciences-Mechatronics, University of Novi Sad, Novi Sad, Serbia"}, {"name": "Laslo Tarjan", "affiliation": "Faculty of Technical Sciences-Mechatronics, University of Novi Sad, Novi Sad, Serbia"}, {"name": "Ivana Senk", "affiliation": "Center of Automation and Mechatronics, University of Novi Sad, Novi Sad, Serbia"}, {"name": "Gordana Ostojic", "affiliation": "Center of Automation and Mechatronics, University of Novi Sad, Novi Sad, Serbia"}], "tags": ["industrial engineering courses", "Manipulators", "actuators", "field bus systems", "MRA-M01", "Field buses", "three-degrees-of-freedom manipulator", "educational courses", "linear actuators", "manipulator", "Mechatronics", "programmable logic controllers", "Industrial engineering", "laboratory", "SCADA", "manipulators", "Republic of Serbia", "supervisory control and data acquisition", "production processes", "Novi Sad", "Laboratories", "intelligent control systems", "Intelligent control", "PLC", "Actuators", "material handling", "control engineering education", "Education", "industrial engineering", "robot manipulator", "Faculty of Technical Sciences", "sensors", "electropneumatics", "SCADA systems", "didactic manipulator", "mechatronics laboratory equipment", "mechatronics"]}, {"title": "Tool for Experimenting With Concepts of Mobile Robotics as Applied to Children's Education", "link": "https://ieeexplore.ieee.org/document/5232817/", "abstract": "This paper describes the design and implementation of a tool for experimenting with mobile robotics concepts, primarily for use by children and teenagers, or by the general public, without previous experience in robotics. This tool helps children learn about science in an approachable and interactive way, using scientific research principles in captivating activities that help the child develop problem-solving skills within his group. This initiative seeks to spark interest in scientific and engineering careers as a response to diminished enrollment in such courses by young students. The application of this tool was tested on groups of people ranging from schoolchildren to college students with diverse backgrounds and varying levels of robotics experience and knowledge. The following performance parameters were measured: time to build the robotic platform, time to finalize challenges, and the percentage of challenges successfully accomplished.", "authors": [{"name": "Eduardo Caicedo Bravo", "affiliation": "Escuela de Ingenieria Electronica, Universidad del Valle, Cali, Valle, Colombia"}, {"name": "Eval Bladimir Bacca Cortes", "affiliation": "Escuela de Ingenieria Electronica, Universidad del Valle, Cali, Valle, Colombia"}, {"name": "Edith Milena Jimenez Jojoa", "affiliation": "Escuela de Ingenieria Electronica, Universidad del Valle, Cali, Valle, Colombia"}], "tags": ["scientific career", "Mobile communication", "educational computing", "mobile robots", "mobile robotics", "Pediatrics", "Legged locomotion", "experimentation tool", "experimentation in robotics", "children education", "Collision avoidance", "educational courses", "problem solving skills", "Children", "education", "outreach", "engineering career", "Robot sensing systems"]}, {"title": "An Electrical Engineering Summer Academy for Middle School and High School Students", "link": "https://ieeexplore.ieee.org/document/5208214/", "abstract": "An Electrical Engineering Summer Academy for Pre-College Students was held at the University of Tulsa, Tulsa, OK, during the summers of 2007 and 2008. The Academy participants included students having just completed 7th to 11th grade and teachers from middle school through high school. The students and teachers participated in team-building, professional development, and technical activities designed to teach them about the engineering profession and the field of electrical engineering. Activities included laboratories in electrical circuits, designing an electric car, soldering, a field trip, and discussion about ethics. Students worked in two- and four-person teams and made presentations on their experiences. The Academy was evaluated using formal assessment instruments and faculty observations. Both individual activities and the overall program were evaluated. The evaluation of the 2007 Academy revealed ratings of 4.5 or greater out of 5 on most aspects of the Academy, though some areas indicated a need for improvement, such as clarity of written materials and the availability of additional material for advanced students who finished early. Improvement in knowledge was demonstrated on over 50% of the questions on a survey administered at the beginning and again at the end of the Academy. Changes were proposed and implemented for the 2008 Academy in response to the assessment data. The impact of these changes and the lessons learned in the process are also presented.", "authors": [{"name": "Theodore W. Manikas", "affiliation": "Department of Electrical Engineering, University of Tulsa, Tulsa, OK, USA"}, {"name": "Peter G. LoPresti", "affiliation": "Department of Electrical Engineering, University of Tulsa, Tulsa, OK, USA"}, {"name": "Jeff G. Kohlbeck", "affiliation": "Department of Electrical Engineering, University of Tulsa, Tulsa, OK, USA"}], "tags": ["middle school-high school students", "team-building", "electric car designing", "professional development", "Electrical engineering", "high school", "Data mining", "soldering", "electrical engineering education", "Electrical Engineering Summer Academy", "electric vehicles", "teachers", "Laboratories", "data assessment", "summer programs", "middle school", "Capacitors", "Communication skills", "electrical engineering", "Educational institutions", "Ethics", "Tulsa University", "Resistors"]}, {"title": "The Implementation and Evaluation of a University-Based Outreach Laboratory Program in Electrical Engineering", "link": "https://ieeexplore.ieee.org/document/5208216/", "abstract": "In the current climate of shortages of high-quality engineering graduates, exacerbated by reduced high school enrollments in physics and mathematics, engineering faculties are becoming increasingly aware of the importance of K-12 outreach programs. Such programs can result in students being better prepared for and better informed about engineering careers, with a consequent increase in the number of engineering undergraduates. Almost all outreach programs described in the literature are school-based; by contrast, this paper describes a university-based program. The program was born out of a desire for a university department and a neighboring high school to forge closer links and a need for the high school to provide its students with certain laboratory experiences that would best be realized with the use of specialist equipment. The outreach program provides both formal laboratory experiences and informal presentations by graduate students of their research interests. Follow-up surveys showed that the high school students found the experiences both instructive and motivating, and their knowledge of and interest in electrical engineering increased significantly as a result. All final-year physics students from the high school took part in the 2007 outreach program, and 42% of these students subsequently enrolled in the Bachelor of Engineering degree at the university in 2008.", "authors": [{"name": "Chris R. Smaill", "affiliation": "Department of Electrical and Computer Engineering, University of Auckland, Auckland, New Zealand"}], "tags": ["university-based outreach laboratory program", "Computers", "Laboratories", "physics engineering faculties", "mathematics engineering faculties", "K-12 outreach programs", "Electrical engineering education", "outreach program", "high school enrollments", "electrical engineering", "Educational institutions", "K-12 education", "Robots", "student feedback", "Physics", "laboratory experiences", "electrical engineering education", "Oscilloscopes"]}, {"title": "Attracting Prospective Engineering Students in the Emerging European Space for Higher Education", "link": "https://ieeexplore.ieee.org/document/5208320/", "abstract": "A set of outreach activities implemented by the College of Engineering of the Public University of Navarra, Spain, is described. They represent different initiatives aimed to improve recruitment of young engineers in the difficult context of declining interest in engineering and the educational changes Europe is facing nowadays. The initiatives include didactic materials and activities specifically targeted to high schools and other events aimed to increase awareness about the relevance of science and engineering in the society. During the three years the outreach program has been applied, an increase in the number of engineering students of 12.5% has been experienced, which is in contrast to the decrease of 1.6% in the number of new university students during the same period.", "authors": [{"name": "Antonio J. Lopez-Martin", "affiliation": "Department of Electrical and Electronic Engineering, Public University of Navarra, Pamplona, Spain"}], "tags": ["higher education", "engineering education", "European space", "Public University of Navarra", "Conferences", "engineering students", "student recruitment", "Spain", "Engineering profession", "outreach programs", "European Space for Higher Education (ESHE)", "on-site outreach", "Educational institutions", "College of Engineering", "university students", "Engineering outreach", "Europe", "educational institutions", "Engineering students", "Communities"]}, {"title": "Innovative Teaching of IC Design and Manufacture Using the Superchip Platform", "link": "https://ieeexplore.ieee.org/document/5191121/", "abstract": "This paper describes how an intelligent chip architecture has allowed a large cohort of undergraduate (UG) students to be given effective practical insight into integrated circuit (IC) design by designing and manufacturing their own ICs. To achieve this, an efficient chip architecture, the ¿Superchip,¿ was developed, which allows multiple student designs to be fabricated on a single IC, and encapsulated in a standard package without excessive cost in terms of time or resources. This paper demonstrates how the practical process has been tightly coupled with theoretical aspects of the degree course and how transferable skills are incorporated into the design exercise. Furthermore, the students are introduced at an early stage to the key concepts of teamwork, exposure to real deadlines, and collaborative report writing. This paper provides details of the teaching rationale, design exercise overview, design process, chip architecture, and test regime.", "authors": [{"name": "Iain McNally", "affiliation": "School of Electronics and Computer Science, University of Southampton, Southampton, UK"}, {"name": "Matthew Swabey", "affiliation": "School of Electronics and Computer Science, University of Southampton, Southampton, UK"}, {"name": "Peter R. Wilson", "affiliation": "School of Electronics and Computer Science, University of Southampton, Southampton, UK"}, {"name": "Reuben Wilcock", "affiliation": "School of Electronics and Computer Science, University of Southampton, Southampton, UK"}], "tags": ["Logic gates", "integrated circuit manufacture", "innovative teaching", "undergraduate students", "Integrated circuits (ICs)", "superchip platform", "Layout", "IC manufacture", "design", "IC design", "integrated circuit design", "Software", "intelligent chip architecture", "electronic engineering education", "Education", "teaching", "Integrated circuit modeling", "Metals", "microelectronics"]}, {"title": "Debugging From the Student Perspective", "link": "https://ieeexplore.ieee.org/document/5238628/", "abstract": "Learning to debug is a difficult, yet essential, aspect of learning to program. Students in this multi-institutional study report that finding bugs is harder than fixing them. They use a wide variety of debugging strategies, some of them unexpected. Time spent on understanding the problem can be effective. Pattern matching, particularly at the syntactic level, is an important technique for beginners. The Web has emerged as an obvious first place to look for similar examples. Lack of Web materials at an appropriate beginner level leads to flailing. Hypothesizing about the cause of bugs is an underdeveloped skill.", "authors": [{"name": "Brian Hanks", "affiliation": "Fort Lewis College, Durango, CO, USA"}, {"name": "Sue Fitzgerald", "affiliation": "Metropolitan State University, Saint Paul, MN, USA"}, {"name": "Renée McCauley", "affiliation": "College of Charleston, Charleston, SC, USA"}, {"name": "Beth Simon", "affiliation": "University of California, San Diego, CA, USA"}, {"name": "Laurie Murphy", "affiliation": "Pacific Lutheran University, Tacoma, WA, USA"}, {"name": "Carol Zander", "affiliation": "University of Washington, Bothell, WA, USA"}], "tags": ["computing education", "Testing", "Programming profession", "Bugs", "Computer bugs", "Data mining", "program debugging", "Internet", "student perspective", "debugging", "pedagogy", "Interviews", "debugging strategies", "pattern matching", "Debugging", "debugging strategy", "computer science education", "novice programmers", "Web materials", "education-based research"]}, {"title": "The Impact of a Peer-Learning Agent Based on Pair Programming in a Programming Course", "link": "https://ieeexplore.ieee.org/document/5196685/", "abstract": "This paper analyzes the educational effects of a peer-learning agent based on pair programming in programming courses. A peer-learning agent system was developed to facilitate the learning of a programming language through the use of pair programming strategies. This system is based on the role of a peer-learning agent from pedagogical and technical aspects and simulates the \"tutor\" and \"tutee.\" The peer-learning agent uses artificial intelligence methods with a Bayesian network as well as teaching and learning methods that simulate pair programming. This paper develops a model for determining students' programming abilities. In addition, the roles of the tutor and tutee are like the roles of a navigator and driver in pair programming. The developed agent system is demonstrated to have positive effects on knowledge retention and transfer in a programming course, with a greater influence on transfer than on retention. This model combining peer-learning agents with a teaching and learning strategy is more effective in helping learners to acquire programming skills.", "authors": [{"name": "YoungJun Lee", "affiliation": "Department of Computer Education, Korea National University of Education, Chungbuk, South Korea"}, {"name": "EunKyoung Lee", "affiliation": "CheongWun Middle Sch., Gyouggi, South Korea"}, {"name": "Keun-Woo Han", "affiliation": "Sun-bu Middle Sch., Gyouggi, South Korea"}], "tags": ["teaching methods", "learning systems", "student programming", "Driver circuits", "artificial intelligence methods", "Programming profession", "pair programming course", "knowledge retention", "programming skills", "Learning systems", "intelligent tutoring systems", "cooperative systems", "Bayesian network", "peer-learning agent", "belief networks", "programming language", "Collaborative work with agent", "programming education", "Humans", "courseware", "Education", "programming languages", "computer science education", "software tools for programming education"]}, {"title": "Remote Spectroscopy in the Visible Using Fibers on the Optical Internet Network", "link": "https://ieeexplore.ieee.org/document/5373854/", "abstract": "The work presented here demonstrates the feasibility of using the single-mode fibers of an optical Internet network to deliver visible light between separate laboratories as a way to perform remote spectroscopy in the visible for teaching purposes. The coupling of a broadband light source into the single-mode fiber (SMF) and the characterization of optical losses as a function of the wavelength are discussed. Sample spectra were measured with a portable spectrometer controlled by an acquisition program developed with the LabVIEW software that allows the data to be collected and analyzed.", "authors": [{"name": "Sérgio C. Zilio", "affiliation": "Instituto de Física de São Carlos, Universidade de São Carlos, Sao Paulo, Brazil"}, {"name": "Anderson R. de Oliveira", "affiliation": "Instituto de Física de São Carlos, Universidade de São Carlos, Sao Paulo, Brazil"}, {"name": "Rafael A. S. Ribeiro", "affiliation": "Instituto de Física de São Carlos, Universidade de São Carlos, Sao Paulo, Brazil"}], "tags": ["visible spectroscopy", "Optical fiber networks", "visible light", "optical fibre losses", "optical fibre networks", "optical losses", "light sources", "Spectroscopy", "WebLab", "Web-based education", "optical Internet network", "broadband light source", "Laboratories", "remote spectroscopy", "single-mode fibers", "Optical fiber", "Optical fibers", "Servers", "Optical losses"]}, {"title": "Student Behavior and Interaction Patterns With an LMS as Motivation Predictors in E-Learning Settings", "link": "https://ieeexplore.ieee.org/document/5276801/", "abstract": "Student motivation is an important factor for the successful completion of an e-learning course. Detecting motivational problems for particular students at an early stage of a course opens the door for instructors to be able to provide additional motivating activities for these students. This paper analyzes how the behavior patterns in the interaction of each particular student with the contents and services in a learning management system (LMS) can be used to predict student motivation and if this student motivation can be used to predict the successful completion of an e-learning course. The interactions of 180 students of six different universities taking a course in three consecutive years are analyzed.", "authors": [{"name": "Mario Munoz-Organero", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Pedro J. Munoz-Merino", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Carlos Delgado Kloos", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}], "tags": ["student experiments", "higher education", "Educational technology", "learning systems", "Multimedia communication", "educational courses", "Correlation", "interaction patterns", "Data mining", "Electronic learning", "pattern recognition", "prediction methods", "computer aided instruction", "Indexes", "Analysis of variance", "student motivation", "Least squares approximation", "learning management systems", "computer science education", "student behavior", "e-learning course"]}, {"title": "OPEE: An Outreach Project for Engineering Education", "link": "https://ieeexplore.ieee.org/document/5232816/", "abstract": "During the last few years, the number of university students choosing to follow engineering degrees has decreased dramatically in Spain. For that reason, several university departments, in collaboration with some high schools, have developed a range of activities in order to promote a higher enrollment rate, to improve the level of mathematics and physics that students have when entering university, to explode the myth of engineering degrees being difficult studies not within everyone's reach, and to rationalize the curricula of engineering degrees, coordinating all their courses and directing them toward the global objectives of the degree. In this paper, the results of an Outreach Project for Engineering Education (OPEE) comprising four successful activities developed over the last decade at the Higher Technical School of the University of Cordoba, Spain, are reported. Most important is that in the face of the significant decrease of the amount of engineering first-year students observed in Spain in general, and Cordoba in particular, enrollment in the Higher Technical School of the University of Cordoba has remained constant.", "authors": [{"name": "Antonio J. Cubero-Atienza", "affiliation": "Department of Projects Engineering, University of Cordoba, Cordoba, Spain"}, {"name": "Marta Varo-Martinez", "affiliation": "Department of Applied Physics, University of Cordoba, Cordoba, Spain"}, {"name": "Pilar Martinez-Jimenez", "affiliation": "Department of Applied Physics, University of Cordoba, Cordoba, Spain"}, {"name": "Lorenzo Salas-Morera", "affiliation": "Department of Projects Engineering, University of Cordoba, Cordoba, Spain"}, {"name": "Gerardo Pedros-Perez", "affiliation": "Department of Applied Physics, University of Cordoba, Cordoba, Spain"}], "tags": ["Laboratories", "engineering education", "Engineering curriculum", "Cordoba University", "K-12 outreach", "outreach project for engineering education", "OPEE", "Engineering education", "virtual laboratories", "engineering degree", "Educational institutions", "educational courses", "higher technical school", "engineering curriculum", "Physics", "undergraduate engineering enrollment", "Mathematics", "Knowledge engineering"]}, {"title": "A 10-Year Mechatronics Curriculum Development Initiative: Relevance, Content, and Results—Part II", "link": "https://ieeexplore.ieee.org/document/5170019/", "abstract": "This paper describes the second and third phases of a comprehensive mechatronics curriculum development effort. They encompass the development of two advanced mechatronics courses (¿Simulation and Modeling of Mechatronic Systems¿ and ¿Sensors and Actuators for Mechatronic Systems¿), the formulation of a Mechatronics concentration, and offshoot research activities in the mechatronics area. The first phase involved the design of an ¿Introduction to Mechatronics¿ course and the infusion of mechatronic activities throughout the curriculum and in outreach activities and has been described in a companion paper ¿A 10-Year Mechatronics Curriculum Development Initiative: Relevance, Content, and Results-Part I¿ (IEEE Transactions on Education, vol. 53, no. 2, May 2010).", "authors": [{"name": "Shuvra Das", "affiliation": "Department of Mechanical and Manufacturing Engineering, University of Detroit Mercy, Detroit, MI, USA"}, {"name": "Mohan Krishnan", "affiliation": "Department of Electrical and Computer Engineering, University of Detroit Mercy, Detroit, MI, USA"}, {"name": "Sandra A. Yost", "affiliation": "Department of Electrical and Computer Engineering, University of Detroit Mercy, Detroit, MI, USA"}], "tags": ["Curriculum development", "time 10 yr", "mechatronics education", "Mathematical model", "educational courses", "Sensor systems", "Biological system modeling", "Mechatronics", "outreach activities", "mechatronics concentration", "system modeling", "electrical engineering education", "project-based learning", "mechatronic activities", "mechatronics curriculum development", "Actuators", "mechanical engineering", "mechatronics courses", "sensors", "Integrated circuit modeling", "mechatronics"]}, {"title": "Starting Early: Increasing Elementary (K-8) Student Science Achievement With Retired Scientists and Engineers", "link": "https://ieeexplore.ieee.org/document/5235090/", "abstract": "Teaching Opportunities for Partners in Science (TOPS) is an outreach program using volunteers (the ¿partners¿) for: 1) assisting teachers in grades K-8 with preparation and delivery of science and engineering (S&E) lessons in the classroom; 2) providing content knowledge to teachers when needed to teach quality science and engineering lessons; 3) motivating students with career and educational models and information; and 4) educating families through after-school family science events. The outreach program began with partners who were retired scientists and engineers. Currently, the source of volunteers includes scientists and engineers who are employed or on leave as well as retired. The program began in 1993 at the San Joaquin County Office of Education, Stockton, CA, with three Partners at three elementary schools. The program now has 33 Partners at 32 schools in a five-county region in central California. Most partners volunteer to serve a minimum of a half-day per week during the school year; however, the schedule can be flexible to accommodate differing needs of the Partners. The partners attend a TOPS Institute during the summer preceding each school year. The Institute serves as a training course for new partners. This paper covers the history of the TOPS program, the selection and training of partners, the relationship between the partners and classroom teachers, development of lessons, comments from a partner and a classroom teacher, and the results of an evaluation of the program.", "authors": [{"name": "Judith Wilson", "affiliation": "Science & Special Projects, San Joaquin County Office of Education, Stockton, CA, USA"}, {"name": "Arthur M. Krakowsky", "affiliation": "Electronics Engineering Department, Lawrence Livemore National Laboratory, Livermore, CA, USA"}, {"name": "Charles J. Herget", "affiliation": "Herget Associates, Alameda, CA, USA"}], "tags": ["teacher training", "teaching opportunities for partners in science", "partner training", "engineering education", "Education", "engineering", "K-8 outreach program", "Engineering education", "elementary science education", "teacher assistance", "content knowledge", "training", "Educational institutions", "Training", "science"]}, {"title": "A Cost-Effective Atomic Force Microscope for Undergraduate Control Laboratories", "link": "https://ieeexplore.ieee.org/document/5233773/", "abstract": "This paper presents a simple, cost-effective and robust atomic force microscope (AFM), which has been purposely designed and built for use as a teaching aid in undergraduate controls labs. The guiding design principle is to have all components be open and visible to the students, so the inner functioning of the microscope has been made clear to see. All of the parts but one are off the shelf, and assembly time is generally less than two days, which makes the microscope a robust instrument that is readily handled by the students with little chance of damage. While the scanning resolution is nowhere near that of a commercial instrument, it is more than sufficient to take interesting scans of micrometer-scale objects. A survey of students after their having used the AFM resulted in a generally good response, with 80% agreeing that they had a positive learning experience.", "authors": [{"name": "Jorge Goncalves", "affiliation": "Department of Engineering, University of Cambridge, Cambridge, UK"}, {"name": "Colin N. Jones", "affiliation": "Department of Electrical Engineering, Swiss Federal Institute of Technology of Zürich, Zurich, Switzerland"}], "tags": ["Detectors", "control", "control engineering education", "Laboratories", "cost-effective atomic force microscope", "teaching aid", "atomic force microscopy", "Force", "Measurement by laser beam", "Atomic force microscopy", "microscopy", "guiding design principle", "Atomic force microscope (AFM)", "educational aids", "scanning resolution", "system identification", "teaching laboratory", "undergraduate control laboratories"]}, {"title": "Understanding Computation of Impulse Response in Microwave Software Tools", "link": "https://ieeexplore.ieee.org/document/5291720/", "abstract": "In modern microwave engineering curricula, the introduction of the many new topics in microwave industrial development, or of software tools for design and simulation, sometimes results in students having an inadequate understanding of the fundamental theory. The terminology for and the explanation of algorithms for calculating impulse response in microwave software tools are not always beginner-oriented and might be over-sophisticated for undergraduate students. This paper presents a comprehensive analysis of the impulse response computation from the viewpoint of microwave engineering education. A new method of teaching the impulse response computation is presented. The new method should help students to gain a thorough understanding of how to compute the impulse response either in the time domain or from frequency response samples.", "authors": [{"name": "Milka M. Potrebic", "affiliation": "School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Dejan V. Tosic", "affiliation": "School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Predrag V. Pejovic", "affiliation": "School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}], "tags": ["microwave circuits", "transient response", "Discrete Fourier transforms", "educational courses", "Software tools", "impulse response computation", "Transient analysis", "Pulse measurements", "software tools", "microwave software tools", "discrete Fourier transforms", "electrical engineering education", "microwaves", "computer aided instruction", "electrical engineering computing", "Microwave circuits", "Integrated circuit modeling", "transient analysis", "impulse response", "microwave engineering curricula"]}, {"title": "Engineering the Future: Embedding Engineering Permanently Across the School–University Interface", "link": "https://ieeexplore.ieee.org/document/5238640/", "abstract": "This paper describes the design, implementation, and evaluation of an educational program. Engineering the Future (EtF) sought to promote a permanent, informed awareness within the school community of high-level engineering by embedding key aspects of engineering within the education curriculum. The Scottish education system is used for a case study in which a range of pilot high schools worked in close partnership with two university engineering departments. The study focuses on electronic/electrical engineering (EEE), a technically challenging area, which reflects many of the problems that are intrinsic to modern society. In so doing, the work also sought to support and refine the transition from the school environment to higher education engineering courses. EtF is founded on research into transformational change and describes the findings of a three-year program that sought to develop sustainable and transferable means of encouraging school students to study engineering at university. The authors describe the conditions needed to support sustainable developments. They also provide an analysis of inevitable constraints and suggest strategies to address these issues. The paper concludes that sustainable long-term promotion of engineering within schools to support the transition to university is possible if certain conditions are fulfilled. These conditions include the use of a model that facilitates partnerships among researchers, policy-makers, and practitioners in all sectors. Building such essential linkages is often challenging, but this effort is necessary if changes in engineering education are to be realized and sustained.", "authors": [{"name": "E. Louise Hayward", "affiliation": "Department of Educational Studies, University of Glasgow, Glasgow, UK"}, {"name": "Ernest Spencer", "affiliation": "Department of Educational Studies, University of Glasgow, Glasgow, UK"}, {"name": "Gordon Hayward", "affiliation": "Department of Electronic and Electrical Engineering, University of Strathclyde, Glasgow, UK"}, {"name": "Jane Magill", "affiliation": "Department of Educational Studies, University of Glasgow, Glasgow, UK"}, {"name": "George MacBride", "affiliation": "Department of Educational Studies, University of Glasgow, Glasgow, UK"}, {"name": "Ann Catrina Bryce", "affiliation": "Department of Electronic and Electrical Engineering, University of Strathclyde, Glasgow, UK"}, {"name": "Elsa Ekevall", "affiliation": "Department of Educational Studies, University of Glasgow, Glasgow, UK"}, {"name": "Brian Stimpson", "affiliation": "Department of Electronic and Electrical Engineering, University of Strathclyde, Glasgow, UK"}], "tags": ["governmental factors", "school-university interface", "high-level engineering", "learning systems", "educational courses", "Materials", "electronics engineering education", "engineering the future", "Data mining", "electrical engineering education", "Technological innovation", "Scottish education system", "educational program", "embedding engineering", "Educational institutions", "electronic engineering education", "Education", "educational institutions", "higher education engineering courses", "Communities", "management decision-making", "Physics"]}, {"title": "The Fender Stratocaster Electric Guitar: A Case Study for Both Nontransferable and Transferable Skills Learning in a Generalist Electronic Engineering Cohort", "link": "https://ieeexplore.ieee.org/document/5286255/", "abstract": "A case-study approach to teaching electronics system design that has been used since 2004 to demonstrate the importance of both nontransferable and transferable design issues to first-year undergraduate students is described. The student cohort of relevance to this work represents a diverse group comprising both students studying for a four-year engineering degree together with students studying for a variety of different degrees who take electronics design as an option in their first year. In this respect, they represent an exacting challenge for the engineering educator tasked with providing an introductory basis to both nontransferable and transferable electronic engineering design skills. Research arising out of the four years' experience of this scheme is described, which demonstrates, in particular, the suitability of the Fender Stratocaster electric guitar as a design example in both teaching and learning transferable engineering design issues. These issues include requirements capture, innovation, simplicity in design, and ensuring commercial viability.", "authors": [{"name": "Malcolm John Joyce", "affiliation": "Department of Engineering, Lancaster University, Lancaster, UK"}], "tags": ["Frequency response", "first-year undergraduate student", "engineering educator", "generalist electronic engineering cohort", "electric guitar", "first year", "Context", "Data mining", "nontransferable electronic engineering design skills", "Instruments", "transferable design issues", "Shape", "Case study", "Fender Stratocaster electric guitar", "electronic engineering education", "Education", "teaching", "Music", "electronic engineering", "four-year engineering degree", "Stratocaster", "transferable electronic engineering design skills"]}, {"title": "Engaging High School and Engineering Students: A Multifaceted Outreach Program Based on a Mechatronics Platform", "link": "https://ieeexplore.ieee.org/document/5288530/", "abstract": "If we aim to enhance the interest of students in engineering and therefore produce the best engineers, it is essential to strengthen the pipeline to high school education. This paper discusses several outreach activities undertaken by the Faculty of Engineering and Faculty of Education, University of Ottawa (UO), Ottawa, ON, Canada, to help the transition between high school and engineering education and to make students aware of the engineering profession. At the heart of these activities is mechatronics education, which demands an interdisciplinary approach, connects to fundamental math and science concepts, and promotes collaborative project-based learning (PBL). Connected to this focus, a multifaceted program of outreach activities has been initiated. The program includes creation of design-simulate-and-build projects by engineering and high school students, as well as an interactive presentation program whereby engineering students connect with high school students through the sharing of projects that they create in their engineering courses. The survey results indicate that for the high school students, these programs promote students' awareness of engineering and how the mathematics and science they take in school connects to engineering concepts. For the engineering students, they are provided with a meaningful context within which to share their projects and explain their own understanding of engineering principles.", "authors": [{"name": "Riadh W. Y. Habash", "affiliation": "School of Information Technology and Engineering, University of Ottawa, Ottawa, ONT, Canada"}, {"name": "Christine Suurtamm", "affiliation": "Faculty of Education, University of Ottawa, Ottawa, ONT, Canada"}], "tags": ["mathematics", "engineering education", "project-based learning (PBL)", "math and science", "Robots", "learning (artificial intelligence)", "Mechatronics", "outreach activities", "promotes collaborative project based learning", "multifaceted outreach program", "engineering students", "further education", "Engineering profession", "Educational institutions", "science education", "Engineering career", "high school education", "educational institutions", "Engineering students", "mechatronics"]}, {"title": "Support for Different Roles in Software Engineering Master's Thesis Projects", "link": "https://ieeexplore.ieee.org/document/5169982/", "abstract": "Like many engineering programs in Europe, the final part of most Swedish software engineering programs is a longer project in which the students write a Master's thesis. These projects are often conducted in cooperation between a university and industry, and the students often have two supervisors, one at the university and one in industry. In particular, the Bologna Process that is currently underway to align different higher educational programs in Europe discusses industrial Master's theses as a major type of thesis project. However, there is a lack of knowledge on how best to support these projects and the different stakeholders involved. This paper presents a study where students and supervisors from software engineering Master's thesis projects at three different Swedish universities are interviewed. The intention of the study is to explore what the major problems of different stakeholders are during a project and to investigate what type of support is needed. Based on the interview results, a support model is defined, which outlines the different types of support that are needed for different roles in Master's thesis projects.", "authors": [{"name": "Frank Luders", "affiliation": "Mälardalen University, Vasteras, Sweden"}, {"name": "Martin Host", "affiliation": "Department of Computer Science, Lund University, Lund, Sweden"}, {"name": "Robert Feldt", "affiliation": "Blekinge Institute of Technology, Karlskrona, Sweden"}], "tags": ["engineering education", "Communication systems", "software engineering master thesis projects", "software testing", "higher educational programs", "Swedish software engineering programs", "Planning", "project management", "Swedish universities", "further education", "software engineering", "Software", "Industries", "Software engineering", "Bologna process", "Interviews", "Companies", "educational institutions", "computer science education"]}, {"title": "Hands-On Experience in HPC With Secondary School Students", "link": "https://ieeexplore.ieee.org/document/5247019/", "abstract": "It is a global concern that the number of students in computing-related fields has been decreasing in the last few years. As a way to improve this situation, several institutions have been implementing programs to attract and keep students in science and technology majors. This work describes a high-performance computing (HPC) course intended for secondary school students, which requires only the most basic infrastructure. In this hands-on workshop, the students learn how to assemble, install, and test a cluster. In parallel, students are exposed to a complete new area of knowledge, obtaining a more accurate view of the discipline of computer science and increasing their confidence in their ability to follow computer science. This course also provides opportunities for students to meet scientists and lose any misconceptions and negative stereotypes about science in general and computer science in particular. The aim of this paper is to detail the key concepts conveyed to students, share the course organization, materials, and examples used, and describe the overall experience.", "authors": [{"name": "Pablo G. Turjanski", "affiliation": "Facultad de Ciencias Exactas y Naturales, Departamento de Computación Laboratorio de Sistemas Complejos, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Diego Fernandez Slezak", "affiliation": "Facultad de Ciencias Exactas y Naturales, Departamento de Computación Laboratorio de Sistemas Complejos, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Esteban E. Mocskos", "affiliation": "Facultad de Ciencias Exactas y Naturales, Departamento de Computación Laboratorio de Sistemas Complejos, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Damián Montaldo", "affiliation": "Facultad de Ciencias Exactas y Naturales, Departamento de Computación Laboratorio de Sistemas Complejos, Universidad de Buenos Aires, Buenos Aires, Argentina"}], "tags": ["secondary school students", "Computers", "Cluster", "hands-on workshop", "high-performance computing course", "Computer science education", "Programming", "secondary school education", "computer science education", "vocational guidance", "Educational institutions", "outreach", "high-performance computing (HPC)"]}, {"title": "Engineering Outreach: A Successful Initiative With Gifted Students in Science and Technology in Hong Kong", "link": "https://ieeexplore.ieee.org/document/5288529/", "abstract": "The primary goal of engineering outreach is to attract prospective students to engineering education and the engineering profession. Gifted students, especially those identified as possessing unusually high abilities in science and technology, are especially promising students to attract to careers in engineering. It is critical to cultivate these students' interests and develop their potential for engineering while encouraging them to pursue engineering studies beyond K-12 education. This article presents examples of the successful learning outcomes of an ongoing University-based Electronics Technology Project Study (UETPS) program, a joint endeavor between the IEEE Hong Kong Section, the Education Bureau of the Hong Kong SAR Government, and the Hong Kong Academy of Gifted Education (HKAGE). The UETPS program promotes electrical, electronic, and computer engineering education in Hong Kong and is aimed particularly at gifted students as well as their parents, teachers, and schools. Project applicants underwent formal identification procedures by the Gifted Education Section of the HKSAR Education Bureau and were identified as being gifted in the area of science and technology. Selected participants then participated in one-year research projects in electronics and computer engineering under the guidance of university professors in their respective engineering departments. This program addresses an urgent need of the engineering education sector by reaching out to highly talented K-12 students and their surrounding communities. According to the evaluation results, the UETPS program has significantly enhanced the participating students' interest in engineering as a career choice and encouraged them to pursue undergraduate studies in engineering. This article also discusses lessons learned and proposes strategies for future potential implementers.", "authors": [{"name": "Wing-Hong Lau", "affiliation": "Department of Electronic Engineering, City University of Hong Kong, Hong Kong, China"}, {"name": "David Ki-Wai Cheng", "affiliation": "Department of Industrial and Systems Engineering, Hong Kong Polytechnic University, Hong Kong, China"}, {"name": "Jasper Wong", "affiliation": "Industrial Centre, Hong Kong Polytechnic University, Hong Kong, China"}, {"name": "Anthony R. Dickinson", "affiliation": "Academic Research Laboratory, Global Choice Psychometrics, Hong Kong, People Impact International Inc."}, {"name": "Wing-Hung Ki", "affiliation": "Department of Electronic and Computer Engineering, Hong Kong University of Science and Technology, Hong Kong, China"}, {"name": "Yuen-Yan Chan", "affiliation": "Faculty of Education, University of Hong Kong, Hong Kong, China"}, {"name": "Dennis Chu", "affiliation": "Centre of Child Development, Hong Kong Baptist University, Hong Kong, China"}, {"name": "Edward W. C. Lo", "affiliation": "Department of Electrical Engineering, Hong Kong Polytechnic University, Hong Kong, China"}, {"name": "Edward Cheung", "affiliation": "Industrial Centre, Hong Kong Polytechnic University, Hong Kong, China"}, {"name": "Diane Hui", "affiliation": "Faculty of Education, University of Hong Kong, Hong Kong, China"}, {"name": "Kwai-Man Luk", "affiliation": "Department of Electronic Engineering, City University of Hong Kong, Hong Kong, China"}], "tags": ["careers", "Engineering education", "educational courses", "computer engineering education", "IEEE Hong Kong Section", "science and technology", "UETPS program", "Data mining", "outreach", "electrical engineering education", "Government", "Hong Kong SAR government", "Hong Kong Academy of Gifted Education", "gifted education", "Engineering profession", "Gifted Education", "University-based Electronics Technology Project Study program", "Educational institutions", "engineering outreach", "Training", "Education Bureau", "control engineering education", "electronic engineering education", "IEEE student activities", "educational institutions"]}, {"title": "Integrating Laboratory Activity Into a Junior High School Classroom", "link": "https://ieeexplore.ieee.org/document/5196686/", "abstract": "This paper presents a wind power system laboratory activity and an outline for evaluating student performance in this activity. The work described here was to design and implement the laboratory to assist teachers in achieving the teaching objective of this activity. The laboratory teaching activities introduce energy sources, wind energy technology, electricity storage, and wind power system testing. The wind power system testing activity includes eight topics: setting up the experimental module, operating instruments, wind velocity measurement, rotor diameter activity, wind speed activity, blade angle activity, blade number activity, and data summary. These laboratory activities were first introduced in a Taiwanese junior high school in 2007. This laboratory activity effectively introduced students to wind energy technology through activity participation. The objective of this activity is for the students to gain not only an understanding of the concept of wind power electricity generation, but a greater confidence in investigating, questioning, and experimenting with renewable energy ideas. The students are able to relate the experiments to electronic and computer engineering.", "authors": [{"name": "Wen-Jye Shyr", "affiliation": "Department of Industrial Education and Technology, National Changhua University of Education, Changhua, Taiwan"}], "tags": ["engineering education", "renewable energy", "Experimental module", "teaching objective", "wind power plants", "Wind turbines", "Electricity", "wind velocity measurement", "rotors", "energy sources", "Wind power generation", "Laboratories", "velocity measurement", "wind power system testing", "laboratory techniques", "high school classroom", "wind energy technology", "Rotors", "junior high school", "wind power system", "Education", "rotor", "electronic engineering", "educational institutions", "integrating laboratory activity", "computer engineering", "Blades", "laboratory activity", "electricity storage"]}, {"title": "Problem-Based Learning in Communication Systems: Student Perceptions and Achievement", "link": "https://ieeexplore.ieee.org/document/5353647/", "abstract": "The paper presents a curriculum design for, and subsequent evaluation of, a communications systems course using problem-based learning (PBL) as the instructional methodology. It details the rationale for implementing PBL as well as reporting intended learning outcomes and assessing the students' achievements.", "authors": [{"name": "John E. Mitchell", "affiliation": "Department of Electronic and Electrical Engineering, University College London, London, UK"}, {"name": "Jan Smith", "affiliation": "Centre of Academic Practice and Learning Enhancement (CAPLE), University of Strathclyde, Glasgow, UK"}, {"name": "Brian Canavan", "affiliation": "Robert Clark Centre of Technological Education, University of Glasgow, Glasgow, UK"}], "tags": ["student experiments", "Curriculum development", "Communication systems", "telecommunication engineering education", "problem-based learning", "education", "problem solving", "electronics engineering education", "Electrical engineering education ", "learning outcomes", "electrical engineering education", "Electronics engineering education", "student perceptions", "Educational institutions", "electronic engineering education", "Problem-solving", "curriculum design", "achievement", "Communication engineering education", "communication systems", "instructional methodology"]}, {"title": "Industry-Oriented Laboratory Development for Mixed-Signal IC Test Education", "link": "https://ieeexplore.ieee.org/document/5405080/", "abstract": "The semiconductor industry is lacking qualified integrated circuit (IC) test engineers to serve in the field of mixed-signal electronics. The absence of mixed-signal IC test education at the collegiate level is cited as one of the main sources for this problem. In response to this situation, the Department of Electrical and Computer Engineering at the Ohio State University, Columbus, has partnered with Texas Instruments to establish an IC test-engineering-oriented course. The course objectives are to familiarize students with industrial testing techniques and to help students obtain the fundamental skill sets required to be competent mixed-signal IC test engineers. A novel laboratory pedagogy is developed to achieve these objectives. The results of the classroom assignments and the feedback provided by students, faculty, and industry representatives indicate that the approach has successfully achieved these goals.", "authors": [{"name": "Mark Haffner", "affiliation": "Department of Electrical and Computer Engineering, Ohio State Uinversity, Columbus, OH, USA"}, {"name": "Mohammed Ismail", "affiliation": "Department of Electrical and Computer Engineering, Ohio State Uinversity, Columbus, OH, USA"}, {"name": "Samantha Yoder", "affiliation": "Department of Electrical and Computer Engineering, Ohio State Uinversity, Columbus, OH, USA"}, {"name": "Gursharan Reehal", "affiliation": "Department of Electrical and Computer Engineering, Ohio State Uinversity, Columbus, OH, USA"}, {"name": "Mark Scott", "affiliation": "Department of Electrical and Computer Engineering, Ohio State Uinversity, Columbus, OH, USA"}, {"name": "John Hu", "affiliation": "Department of Electrical and Computer Engineering, Ohio State Uinversity, Columbus, OH, USA"}], "tags": ["mixed analogue-digital integrated circuits", "Curriculum development", "Laboratories", "electronic engineering education", "system-on-chip", "mixed-signal IC test education", "integrated circuit testing", "integrated circuits (ICs)", "laboratory development", "Integrated circuits", "industry-oriented laboratory development", "Engineering education", "mixed-signal IC test", "test engineering", "Software", "Electronics industry", "industrial testing techniques", "Industry-oriented"]}, {"title": "Engaging Robots: Innovative Outreach for Attracting Cybernetics Students", "link": "https://ieeexplore.ieee.org/document/5233834/", "abstract": "Cybernetics is a broad subject, encompassing many aspects of electrical, electronic, and computer engineering, which suffers from a lack of understanding on the part of potential applicants and teachers when recruiting students. However, once the engineering values, fascinating science, and pathways to rewarding, diverse careers are communicated, appropriate students can be very interested in enrolling. At the University of Reading, Reading, U.K., a key route for outreach to prospective students has been achieved through the use of robots in interactive talks at schools, competitions (often funded by Public Understanding of Science projects), a collectable fortnightly magazine, exhibitions in museums, open days at the University, and appearances in the media. This paper identifies the interactive engagement, anthropomorphic acceptability, and inspirational nature of robots as being key to their successful use in outreach activities. The statistical results presented show that the continued popularity of degrees at Reading in cybernetics, electronic engineering, and robotics over the last 20 years is in part due to the outreach activities to schools and the general public.", "authors": [{"name": "Richard Mitchell", "affiliation": "Cybernetics Group School of Systems Engineering, University of Reading, Reading, UK"}, {"name": "Jim Wyatt", "affiliation": "Cybernetics Group School of Systems Engineering, University of Reading, Reading, UK"}, {"name": "Mark N. Gasson", "affiliation": "Cybernetics Group School of Systems Engineering, University of Reading, Reading, UK"}, {"name": "Kevin Warwick", "affiliation": "Cybernetics Group School of Systems Engineering, University of Reading, Reading, UK"}, {"name": "Will N. Browne", "affiliation": "Cybernetics Group School of Systems Engineering, University of Reading, Reading, UK"}], "tags": ["engineering education", "cybernetics students", "Reading University", "Androids", "Pediatrics", "education", "robot anthropomorphic acceptability", "interactive robotics", "cybernetics", "outreach", "Mobile robots", "electrical engineering", "Educational institutions", "Robot sensing systems", "mobile robots", "computer", "electronic engineering", "computer engineering", "Cybernetics", "engaging robots", "interactive engagement"]}, {"title": "Amplitude Frequency Response Measurement: A Simple Technique", "link": "https://ieeexplore.ieee.org/document/5208199/", "abstract": "A simple method is described to combine a modern function generator and a digital oscilloscope to configure a setup that can directly measure the amplitude frequency response of a system. This is achieved by synchronously triggering both instruments, with the function generator operated in the “Linear-Sweep” frequency mode, while the oscilloscope is operated in the “Envelope” acquisition mode. Under these conditions, the acquired envelopes directly correspond to the (input and output signal) spectra, whose ratio yields the amplitude frequency response. The method is easy to configure, automatic, time-efficient, and does not require any external control or interface or programming. This method is ideally suited to impart hands-on experience in sweep frequency response measurements, demonstrate resonance phenomenon in transformer windings, explain the working principle of an impedance analyzer, practically exhibit properties of network functions, and so on. The proposed method is an inexpensive alternative to existing commercial equipment meant for this job and is also an effective teaching aid. Details of its implementation, along with some practical measurements on an actual transformer, are presented.", "authors": [{"name": "L. Satish", "affiliation": "High Voltage Laboratory Department of Electrical Engineering, Indian Institute of Science, Bangalore, India"}, {"name": "Santosh C. Vora", "affiliation": "High Voltage Laboratory Department of Electrical Engineering, Indian Institute of Science, Bangalore, India"}], "tags": ["Frequency response", "function generator", "amplitude frequency response measurement", "commercial equipment", "actual transformer", "digital oscilloscope", "Transfer functions", "function generators", "envelope acquisition mode", "Frequency response amplitude and phase", "Manuals", "normal and envelope acquisition mode", "sweep frequency measurement", "Signal generators", "frequency measurement", "linear-sweep frequency mode", "Oscilloscopes", "Time frequency analysis", "instruments triggering", "digital storage oscilloscopes", "impedance analyzer", "transformer diagnostics", "transformer windings"]}, {"title": "Hands-On Summer Camp to Attract K–12 Students to Engineering Fields", "link": "https://ieeexplore.ieee.org/document/5272249/", "abstract": "This paper explains the organization and execution of a summer engineering outreach camp designed to attract and motivate high school students as well as increase their awareness of various engineering fields. The camp curriculum included hands-on, competitive design-oriented engineering projects from several disciplines: the electrical, environmental, mechanical, civil, and chemical engineering fields. The camp also provided additional information on financial aid, the academic programs in the fields of science, technology, engineering, and math (STEM) offered at Texas A&M University-Kingsville (TAMUK), as well as various career options for prospective engineers. The implementation of the camp activities and the well-designed hands-on projects not only increased the students' satisfaction, but also improved their self-confidence and their interest toward engineering disciplines. The engineering outreach camp survey results clearly indicated the success of the camp and the effectiveness of the hands-on, competitive engineering design experiences to attract students to engineering professions. Thus, it demonstrated an effective, feasible, and sustainable engineering recruitment approach.", "authors": [{"name": "Jianhong Ren", "affiliation": "Environmental Engineering Department, Texas A and M University, Kingsville, TX, USA"}, {"name": "Muhittin Yilmaz", "affiliation": "Electrical Engineering and Computer Science Department, Texas A and M University, Kingsville, TX, USA"}, {"name": "Joyce Coleman", "affiliation": "Frank H. Dotterweich College of Engineering, Texas A and M University, Kingsville, TX, USA"}, {"name": "Sheryl Custer", "affiliation": "Frank H. Dotterweich College of Engineering, Texas A and M University, Kingsville, TX, USA"}], "tags": ["sustainable engineering recruitment approach", "Computers", "engineering education", "Awards activities", "electrical engineering fields", "design-oriented engineering projects", "K-12 students", "Technical activities", "high school", "camp curriculum", "Recruitment", "environmental engineering fields", "outreach", "STEM fields", "mechanical fields", "chemical engineering fields", "Engineering", "Educational institutions", "mechanical engineering fields", "summer camp", "Texas A&M University-Kingsville", "hands-on summer camp", "civil engineering fields", "engineering fields", "Bridges", "science technology engineering and math", "hands-on"]}, {"title": "Pedagogy and Processes for a Computer Programming Outreach Workshop—The Bridge to College Model", "link": "https://ieeexplore.ieee.org/document/5232815/", "abstract": "This paper describes a model for computer programming outreach workshops aimed at second-level students (ages 15-16). Participants engage in a series of programming activities based on the Scratch visual programming language, and a very strong group-based pedagogy is followed. Participants are not required to have any prior programming experience. An empirical evaluation was undertaken to evaluate to what extent the model was successful in: (1) giving the participants a deeper understanding of what studying a computing degree and working in the computing profession entails; and (2) increasing their interest in pursuing a third-level qualification in a computer-related area.", "authors": [{"name": "Claire Conneely", "affiliation": "Suas Educational Development, Dublin, Ireland"}, {"name": "Stephen Barrett", "affiliation": "School of Computer Science and Statistics, Trinity College Dublin, Dublin, Ireland"}, {"name": "Elizabeth Oldham", "affiliation": "School of Education, Trinity College Dublin, Dublin, Ireland"}, {"name": "Brendan Tangney", "affiliation": "School of Computer Science and Statistics, Trinity College Dublin, Dublin, Ireland"}, {"name": "John Lawlor", "affiliation": "Suas Educational Development, Dublin, Ireland"}], "tags": ["Programming profession", "Computers", "workshops", "Conferences", "visual programming", "programming", "Scratch visual programming language", "computer science education", "Computational modeling", "Educational institutions", "computer programming outreach workshops", "Group work", "outreach", "pedagogy", "group-based pedagogy"]}, {"title": "Chips for Everyone: A Multifaceted Approach in Electrical Engineering Outreach", "link": "https://ieeexplore.ieee.org/document/5272438/", "abstract": "This paper reports on a multifaceted approach in electrical engineering outreach focused on the area of semiconductor technology. The activities developed can be used in combination for a very wide range of audiences in both age and stage of education, as has been demonstrated with great success. Moreover, the project has developed cross-disciplinary activities designed to engage nonscientiflc audiences and has used entirely nonscientific venues, such as art galleries. The suite of activities, given the umbrella title Chips for Everyone, includes: Chips for Everyone: drop-in activities for fairs, shows, shopping centers; Chips with Relish: interactive workshops for groups of school pupils; Chips with Flair: an arts-science collaboration in music, art, video, and engineering to present a new perspective on semiconductor technology. To achieve this diverse mix of outreach activities, the Chips for Everyone team represents a very broad spectrum of skills, its members being engineering academics, musicians, artists, education academics, public engagement specialists, and student teachers in technology. The development process is quite generic and could be applied in other science, technology, engineering, and mathematics (STEM) areas. The subject focus of the project is semiconductor technology, a technology that influences the daily lives of everyone and yet is largely invisible. The activities seek to engage, engender interest, and promote informed discussion about this technology and engineering in general. From modest beginnings as a filler during the setting up of another outreach program, Chips for Everyone has developed into a major program reaching over 25 000 young people and families in school workshops, shopping centers, and art exhibitions in Scotland and across the U.K. The development method for the activities is innovative and creative, using the complimentary skills of research academics and students in both electronic engineering and technology initial teacher education (ITE).", "authors": [{"name": "Jane Magill", "affiliation": "Robert Clark Centre of Technological Education, University of Glasgow, Glasgow, UK"}, {"name": "Scott Roy", "affiliation": "Department of Electronics and Electrical Engineering, University of Glasgow, Glasgow, UK"}], "tags": ["educational technology", "integrated circuit manufacture", "Semiconductor device modeling", "silicon chip fabrication", "Art", "Conferences", "Mobile handsets", "engineering academics", "initial teacher education", "outreach", "electrical engineering education", "semiconductor technology", "engineering", "semiconductor", "cross disciplinary activity", "integrated circuit design", "Educational institutions", "electronic engineering education", "Education", "electronic engineering", "Silicon", "educational aids", "electrical engineering outreach"]}, {"title": "Engaging Students in Applied Electromagnetics at the University of San Diego", "link": "https://ieeexplore.ieee.org/document/5272251/", "abstract": "Two possible topical approaches that have been applied to teaching an upper-division undergraduate electrical engineering applied electromagnetics course are presented. Each approach was applied to one of two offerings of the course, taught in different semesters. In either case, the course includes the study of electromagnetic theory and practical applications through laboratory experiments, design and projects. Using basic theory in time-harmonic electromagnetic fields developed early in the course, two different applications of the theory are emphasized in two alternate semesters of the course offering. The two applications that incorporated the common theoretical background of the course are: (1) applications in radio frequency engineering; and (2) radar and antenna design. An extension of the course to a topic beyond the confines of the course textbooks is included. The success of the course is further realized in two industry-sponsored capstone senior design projects.", "authors": [{"name": "Ernest M. Kim", "affiliation": "Department of Electrical Engineering, University of San Diego, San Diego, CA, USA"}, {"name": "Mikaya L. D. Lumori", "affiliation": "Department of Electrical Engineering, University of San Diego, San Diego, CA, USA"}], "tags": ["Antenna theory", "Dipole antennas", "antenna design", "radar design", "upper-division undergraduate electrical engineering", "educational courses", "radio frequency engineering", "electromagnetic fields", "time-harmonic electromagnetic fields", "electrical engineering education", "Impedance matching", "Laboratories", "Electromagnetics", "electromagnetic engineering education", "University of San Diego", "Crosstalk", "course textbooks", "laboratory experiments", "electromagnetic theory", "transmission lines", "educational institutions", "Microwave measurements", "applied electromagnetics course", "industry-sponsored capstone senior design projects", "design methodology"]}, {"title": "Evaluation of Final Examination Papers in Engineering: A Case Study Using Bloom's Taxonomy", "link": "https://ieeexplore.ieee.org/document/5196692/", "abstract": "Questions are used to obtain information, stimulate thinking, and redirect reasoning. Academics in higher education use questions on a daily basis to stimulate thinking and reasoning in students. Final examination papers are used by academics to assess the retention and application skills of students. The assumption, however, exists that questions relating to application skills at universities of technology should start to dominate the higher academic levels in education, with a subsequent drop in questions regarding retention skills. These questions may be categorized as either higher order or lower order questions. This article attempts to distinguish between these two types of questions in light of Bloom's taxonomy, with similar concepts such as deep and surface learning being examined. The literature review is applied to an electrical engineering module titled Electronics, which serves as the case study. The results of this study indicate that a high percentage of the final examination papers dealt with the objective ¿Application,¿ where students had to make use of numerous mathematical equations to solve various unknowns. The results also indicated that academics in electronics are using more lower order than higher order questions in their final examination papers. A balance is suggested between these two types of questions for various academic levels at universities of technology.", "authors": [{"name": "Arthur James Swart", "affiliation": "Department of Electronic Engineering, Vaal University of Technology, Vanderbijlpark, South Africa"}], "tags": ["higher education", "examination papers", "electrical engineering module", "lower order questions", "retention skills", "universities of technology", "Data mining", "engineering examination", "Bloom taxonomy", "electrical engineering education", "further education", "final examination papers", "Academics", "Educational institutions", "electronics", "higher order questions", "Problem-solving", "Taxonomy", "educational institutions", "Engineering students", "Bloom's taxonomy"]}, {"title": "A Novel Analog Integrated Circuit Design Course Covering Design, Layout, and Resulting Chip Measurement", "link": "https://ieeexplore.ieee.org/document/5169983/", "abstract": "This work describes a novel, first-year graduate-level analog integrated circuit (IC) design course. The course teaches students analog circuit design; an external manufacturer then produces their designs in three different silicon chips. The students, working in pairs, then test these chips to verify their success. All work is completed within one semester, and the grading cycle in the most recent offering of the course extended from September 2007 to February 2008, when there were 10 students enrolled. The manufacturer's shuttle cycle is 3.5 months. Most students in the course have only a college-level electronics background. The manufacturing process is Taiwan Semiconductor Manufacturing Company's (TSMC) 0.35 ¿m CMOS Mixed-Signal 2P4M Polycide 3.3/5 V. The three successful chips consist of a voltage controlled oscillator, a high-performance differential amplifier, and a temperature-independent voltage reference generator. Section VI describes assessment and student feedback as well as proposed course improvement.", "authors": [{"name": "Chen-Hao Wu", "affiliation": "Department of Electrical Engineering, National Chung Hsing University, Taichung, Taiwan"}, {"name": "Chang-Yu Wu", "affiliation": "Department of Electrical Engineering, National Chung Hsing University, Taichung, Taiwan"}, {"name": "Wang-Chuan Cheng", "affiliation": "Department of Electrical Engineering, National Chung Hsing University, Taichung, Taiwan"}, {"name": "Chueh-An Chan", "affiliation": "Department of Electrical Engineering, National Chung Hsing University, Taichung, Taiwan"}, {"name": "Hai-Ming Wu", "affiliation": "Department of Electrical Engineering, National Chung Hsing University, Taichung, Taiwan"}, {"name": "Wei-Liang Lin", "affiliation": "Department of Electrical Engineering, National Chung Hsing University, Taichung, Taiwan"}, {"name": "Kuan-Hsuan Ho", "affiliation": "Department of Electrical Engineering, National Chung Hsing University, Taichung, Taiwan"}], "tags": ["engineering education", "analogue integrated circuits", "temperature independent voltage reference generator", "Schedules", "measurement", "integrated circuit layout", "Analog circuits", "educational courses", "education", "differential amplifiers", "Layout", "integrated circuit testing", "voltage-controlled oscillators", "voltage controlled oscillator", "high performance differential amplifier", "chip measurement", "voltage 3.3 V", "size 0.35 mum", "Voltage measurement", "Educational institutions", "layout", "analog integrated circuits (IC)", "CMOS mixed-signal 2P4M polycide", "Semiconductor device measurement", "CMOS integrated circuits", "reference circuits", "Integrated circuits", "voltage 5 V", "graduate level analog integrated circuit design course"]}, {"title": "Establishing a K-12 Circuit Design Program", "link": "https://ieeexplore.ieee.org/document/5262963/", "abstract": "Outreach, as defined by Wikipedia, is an effort by an organization or group to connect its ideas or practices to the efforts of other organizations, groups, specific audiences, or the general public. This paper describes a computer engineering outreach project of the Department of Computer Engineering at Ege University, Izmir, Turkey, to a local elementary school. A group of 14 K-12 students was chosen by a four-stage selection method to participate in this project. This group was then taught discrete mathematics and logic design courses from the core curriculum of the Computer Engineering program. The two 11-week courses have a total of 132 contact h. The course contents are conveyed through both theoretical lessons and laboratory sessions. All of the laboratory sessions were carried out by K-12 students. Volunteer teachers from the elementary school participated in the project. The evaluations carried out during and at the end of project indicated the degree of satisfaction on the part of students and teachers. The project is still ongoing with the same methodology in its third year.", "authors": [{"name": "Mustafa M. Inceoglu", "affiliation": "Department of Computer Education and Instructional Technology, Ege University, Bornova, Izmir, Turkey"}], "tags": ["Logic design", "Internet", "Organizations", "engineering education", "Education", "discrete mathematics course", "discrete mathematics", "Circuit synthesis", "K-12 circuit design program", "logic design course", "computer science education", "outreach", "Creative thought test", "logic design", "four-stage selection method", "Interviews", "computer engineering outreach project", "Mathematics"]}, {"title": "Educational Experiences Detecting, Using, and Representing Ternary Relationships in Database Design", "link": "https://ieeexplore.ieee.org/document/5208198/", "abstract": "Conceptual models are applied as the first step in software design methodologies for collecting the semantics involved in the universe of discourse. Nevertheless, the abstraction process creates some misunderstandings for novice designers, such as difficulties in modeling some constructs and in understanding the semantics that they represent. This paper presents a thorough study of errors detected among Database Design students in Computer Science Engineering when they apply the abstraction process to generate a conceptual schema using a specific model. Specifically, the paper focuses on errors made in the design of ternary relationships. Some heuristics are proposed in order to help novice designers avoid these common errors, and an experimental study is presented to compare the number of errors made by the students before and after applying these heuristics.", "authors": [{"name": "Dolores Cuadra", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Paloma Martinez Fernandez", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Ana Iglesias Maqueda", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Elena Castro", "affiliation": "Computer Science Department, Carlos III Technical University of Madrid, Madrid, Spain"}], "tags": ["Object oriented modeling", "Analytical models", "education", "ternary relationships representation", "educational experiences detection", "Abstraction activities", "database design", "computer science engineering", "software design methodologies", "conceptual modeling", "Databases", "Unified modeling language", "computer aided instruction", "software engineering", "data models", "Computational modeling", "Redundancy", "database management systems", "computer science education"]}, {"title": "A Matlab/Simulink-Based Interactive Module for Servo Systems Learning", "link": "https://ieeexplore.ieee.org/document/5169981/", "abstract": "This paper presents an interactive module for learning both the fundamental and practical issues of servo systems. This module, developed using Simulink in conjunction with the Matlab graphical user interface (Matlab-GUI) tool, is used to supplement conventional lectures in control engineering and robotics subjects. First, the paper introduces the theoretical background of servo systems. Then, the interactive module is presented, with a description of its main features as well some hints on how to integrate Simulink models within Matlab-GUI. Some of the module's capabilities are illustrated through classroom examples. Finally, the experience of putting this into use and student assessment of the tool are also addressed.", "authors": [{"name": "Nourdine Aliane", "affiliation": "Departamento de Arquitectura de Computadores y Automática, Villaviciosa de Odón, Universidad Europea de Madrid, Madrid, Spain"}], "tags": ["interactive tools", "Couplings", "graphical user interface", "control engineering", "interactive systems", "motion control", "DC motors", "mathematics computing", "Load modeling", "Simulink", "Matlab/Simulink", "interactive module", "Matlab-GUI tool", "Control engineering", "computer aided instruction", "dc motor", "Computer languages", "servomechanisms", "student assessment", "Servomotors", "control engineering education", "servo systems learning", "robotics", "graphical user interfaces", "Trajectory", "servo systems", "control engineering computing"]}, {"title": "Effective Teaching of the Physical Design of Integrated Circuits Using Educational Tools", "link": "https://ieeexplore.ieee.org/document/5308201/", "abstract": "This paper presents the strategies used for effective teaching and skill development in integrated circuit (IC) design using project-based learning (PBL) methodologies. It presents the contexts in which these strategies are applied to IC design courses at the University of South Australia, Adelaide, Australia, and the National Institute of Applied Science (INSA), Toulouse, France. Collaborations among the faculty members of the two institutions have produced a set of learning resources and design tools to support the development of industry-relevant design skills and lifelong learning skills. At the pedagogical level, the emphasis is on the development of practical circuit design, critical thinking, and problem-solving skills rather than the mastery of complex circuit design tools. The courses enable students to learn about the most recent technological developments and their implications, using a set of user-friendly tools. The PBL methodologies, intuitive design tools, and latest technology models have consistently produced high levels of student satisfaction with the overall quality of the courses at the two institutions.", "authors": [{"name": "Sonia Ben Dhia", "affiliation": "Department of Electrical and Computer Engineering, National Institute for Applied Sciences, Toulouse, France"}, {"name": "Syed Mahfuzul Aziz", "affiliation": "School of Electrical and Information Engineering, University of South Australia, Mawson Lakes, SA, Australia"}, {"name": "Etienne Sicard", "affiliation": "Department of Electrical and Computer Engineering, National Institute for Applied Sciences, Toulouse, France"}], "tags": ["industry-relevant design skills", "PBL methodologies", "IC design courses", "Educational technology", "University of South Australia", "project-based learning (PBL)", "electronics engineering education", "Integrated circuit synthesis", "Learning systems", "integrated circuits physical design teaching", "problem solving skills", "France", "Electronics engineering education", "National Institute of Applied Science", "Adelaide", "integrated circuit design", "educational tools", "integrated circuit (IC) design", "Australia", "INSA", "electronic engineering education", "teaching", "project-based learning resources", "Toulouse", "Integrated circuit layout", "intuitive design tools"]}, {"title": "Creating an Agile ECE Learning Environment Through Engineering Clinics", "link": "https://ieeexplore.ieee.org/document/5280254/", "abstract": "To keep up with rapidly advancing technology, numerous innovations to the electrical and computer engineering (ECE) curriculum, learning methods and pedagogy have been envisioned, tested, and implemented. It is safe to say that no single approach will work for all of the diverse ECE technologies and every type of learner. However, a few key innovations appear useful in keeping undergraduate students motivated to learn, resilient to technology evolution, and oriented amid the overload of new information and ECE applications. Engineering clinics, similar to their medical clinic counterparts, provide project-based experiences within the core of an ECE education that enable transformation of the entire curriculum toward an outcomes-oriented, student-centered, total-quality environment. Clinics and project-based learning approaches build skills that give the students confidence and motivation to continuously self-learn and adapt as the technologies around them give way to new, more effective paradigms. Perhaps more importantly, engineering clinic experiences provide numerous opportunities for students to experience the holism of true engineering problem-solving approaches and the ranges of potential technology solutions. This paper reviews the clinic innovations that will enable ECE education to become more effective in the midst of the present plethora of information and technology. Assessment results are provided and are very encouraging. This paper concludes that agile learning environments, created to graduate engineers who can be rapidly productive in the professional and research worlds, are enhanced by clinic and/or project-based learning experiences in the ECE curriculum.", "authors": [{"name": "Shreekanth A. Mandayam", "affiliation": "Department of Electrical and Computer Engineering, Rowan University, Glassboro, NJ, USA"}, {"name": "Ravi P. Ramachandran", "affiliation": "Department of Electrical and Computer Engineering, Rowan University, Glassboro, NJ, USA"}, {"name": "Peter M. Jansson", "affiliation": "Department of Electrical and Computer Engineering, Rowan University, Glassboro, NJ, USA"}, {"name": "John L. Schmalzel", "affiliation": "Department of Electrical and Computer Engineering, Rowan University, Glassboro, NJ, USA"}], "tags": ["Computers", "graduate engineers", "undergraduate students", "educational courses", "ECE education", "project-based learning approaches", "problem solving", "Business", "Biometrics", "agile ECE learning environment", "Data mining", "engineering clinic", "electrical engineering education", "project-based learning", "Technological innovation", "curriculum innovation", "engineering clinics", "Educational institutions", "Assessment", "pedagogy", "project-based experiences", "electrical and computer engineering curriculum", "problem solving approach", "computer science education"]}, {"title": "Analyzing Convergence in e-Learning Resource Filtering Based on ACO Techniques: A Case Study With Telecommunication Engineering Students", "link": "https://ieeexplore.ieee.org/document/5288562/", "abstract": "The use of swarm intelligence techniques in e-learning scenarios provides a way to combine simple interactions of individual students to solve a more complex problem. After getting some data from the interactions of the first students with a central system, the use of these techniques converges to a solution that the rest of the students can successfully use. This paper uses a case study to analyze how fast swarm intelligence techniques converge when applied to solve the problem of e-learning resource filtering. Some modifications to traditional ant colony optimization (ACO) algorithms based on student filtering are also introduced in order to improve convergence.", "authors": [{"name": "Mario Munoz-Organero", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Gustavo A. Ramirez", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Carlos Delgado Kloos", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Pedro Muñoz Merino", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}], "tags": ["convergence analysis in e-learning", "student experiments", "educational technology", "higher education", "Educational technology", "Ant colony optimization", "telecommunication engineering students", "telecommunication engineering education", "learning systems", "Learning systems", "Student experiments", "further education", "Electronic learning", "resource filtering in e-learning", "e-learning resource filtering", "ant colony optimization (ACO) techniques", "optimisation", "swarm intelligence techniques", "Convergence", "ACO techniques", "ant colony optimization", "convergence"]}]