[{"title": "Learning and Understanding System Stability Using Illustrative Dynamic Texture Examples", "link": "https://ieeexplore.ieee.org/document/6517518/", "abstract": "System stability is a basic concept in courses on dynamic system analysis and control for undergraduate students with computer science backgrounds. Typically, this was taught using a simple simulation example of an inverted pendulum. Unfortunately, many difficult issues arise in the learning and understanding of the concepts of stability, instability, and marginal stability. Instead, the authors use an example from dynamic texture, a topic with which undergraduate students with computer science backgrounds are both familiar and comfortable. This example provides the opportunity for students with no access to mechanical or electronic equipment to learn system stability. In addition, the designed project also allows students to improve their knowledge in several fields, such as discrete-time dynamic system analysis, parameter identification of state-space models, and MATLAB programming. The assessment by students reveals that this project is interesting and useful for their studies.", "authors": [{"name": "Fuchun Sun", "affiliation": "Department of Computer Science and Technology, TNLIST, State Key Laboratory of Intelligent Technology and Systems TNLIST, Beijing, P.R. China"}, {"name": "Wei Xiao", "affiliation": "Department of Computer Science and Technology, TNLIST, State Key Laboratory of Intelligent Technology and Systems TNLIST, Beijing, P.R. China"}, {"name": "Huaping Liu", "affiliation": "Department of Computer Science and Technology, TNLIST, State Key Laboratory of Intelligent Technology and Systems TNLIST, Beijing, P.R. China"}, {"name": "Hongyan Zhao", "affiliation": "School of International Relations, University of International Business and Economics, Beijing, China"}], "tags": ["MATLAB programming", "system stability", "Stability criteria", "Asymptotic stability", "educational courses", "inverted pendulum", "parameter estimation", "Mathematical model", "state-space models", "discrete-time", "state-space methods", "stability", "control engineering education", "designed project", "Control systems education", "discrete time systems", "Control systems", "computer science backgrounds", "dynamic system analysis courses", "linear dynamic systems", "undergraduate students", "instability", "discrete-time dynamic system analysis", "Education", "computer science education", "system identification", "Dynamical systems", "parameter identification", "illustrative dynamic texture examples", "marginal stability", "control courses", "dynamic texture"]}, {"title": "Implantable Biomedical Microsystems: A New Graduate Course in Biomedical Circuits and Systems", "link": "https://ieeexplore.ieee.org/document/6527998/", "abstract": "After more than two decades of research on the design and development of implantable biomedical microsystems, it is time now to organize research achievements in this area in a consolidated and pedagogical form. This paper introduces a new graduate course in advanced biomedical circuits and systems. Designed for graduate students with electrical and biomedical engineering backgrounds, this course provides a general overview of the multidisciplinary field of implantable biomedical microsystems. In addition to some introductory material on physiology and biology where needed, this course comprises extensive contents and in-depth discussions on both system- and circuit-level aspects of the design of implantable microsystems. Moreover, this course also deals with issues surrounding design for implantability and testability. Wireless interfacing, signal processing, microelectrode array fabrication, and circuit design for implantable neural recording microsystems are studied extensively. Various design aspects of neural stimulation microsystems, cochlear implants, and visual prostheses are also reviewed briefly.", "authors": [{"name": "Amir M. Sodagar", "affiliation": "Electrical and Computer Engineering Department, K. N. Toosi University of Technology, Tehran, Iran"}], "tags": ["signal processing", "electrical engineering education", "multidisciplinary field", "electrical engineering backgrounds", "in-depth discussions", "visual prostheses", "Biomedical engineering", "educational courses", "Implants", "wireless interfacing", "biology", "medical signal processing", "implantable neural recording microsystems", "neural stimulation microsystems", "implantability", "circuit-level aspects", "pedagogical form", "cochlear implants", "system-level aspects", "advanced biomedical circuits and systems", "biomedical engineering backgrounds", "Micromechanical devices", "implantable biomedical microsystem development", "physiology", "Conferences", "introductory material", "implantable biomedical microsystem design", "curriculum development", "microelectrodes", "bioMEMS", "implantable microsystem design", "microelectrode array fabrication", "implantable devices", "graduate course", "biomedical electrodes", "graduate students", "Wireless communication", "consolidated form", "testability", "microfabrication", "Biomedical circuits and systems", "Circuits and systems", "neurophysiology", "surrounding design", "eye", "integrated microsystems", "extensive contents", "Telemetry", "biomedical education"]}, {"title": "The Effect of Reworking Exam Problems on Problem-Solving Performance in a Circuit Analysis Course: An Exploratory Study", "link": "https://ieeexplore.ieee.org/document/6595146/", "abstract": "In foundational knowledge engineering courses, students engage in problem solving in order to learn important course concepts. To help in this process, students receive feedback on their performance from the instructor. This paper explores an alternative to instructor-provided feedback: a semi-structured assignment in which students reworked problems they failed to solve correctly on a midterm exam for credit. The assignment required students to provide a correct solution to the problem and identify both mathematical and conceptual errors made in the initial solution. The initial results show that students who completed this assignment were able to apply course concepts in analysis and reasoning questions more accurately than students who received exam feedback from the instructor. In addition, these students showed a marked improvement in their ability to solve problems common in a Circuit Analysis course. These results show that such semi-structured assignments can replace instructor-provided feedback in large-enrollment classes and lead to improved problem solving.", "authors": [{"name": "Archie L. Holmes", "affiliation": "Charles L. Brown Department of Electrical and Computer Engineering, The University of Virginia, Charlottesville, VA, USA"}], "tags": ["semi-structured assignment", "Educational institutions", "Circuit analysis", "Fading", "educational courses", "conceptual error identification", "instructor provided feedback", "cognition", "circuit analysis course", "self-regulated learning", "Problem-solving", "mathematical error identification", "Knowledge engineering", "large enrollment class", "Cognition", "electronic engineering education", "feedback", "Materials", "foundational knowledge engineering courses", "metacognition", "problem solving performance", "problem solving", "reworking exam problem"]}, {"title": "The VLAB OER Experience: Modeling Potential-Adopter Student Acceptance", "link": "https://ieeexplore.ieee.org/document/6734731/", "abstract": "Virtual Labs (VLAB) is a multi-institutional Open Educational Resources (OER) initiative, exclusively focused on lab experiments for engineering education. This project envisages building a large OER repository, containing over 1650 virtual experiments mapped to the engineering curriculum. The introduction of VLAB is a paradigm shift in an educational system that is slow to change. Treating VLAB OER as an educational technology innovation, its adoption by potential-adopter engineering students (N=131) is modeled based on Roger's theory of perceived attributes. Regression and factor analysis were used to analyze the data. Results indicate that the attributes of Compatibility, Ease of Use, Relative Advantage, and Trialability significantly influence potential-adopter students' intention to adopt an innovation like VLAB. The study also observed that using OER (such as VLAB) on desktops and low-cost tablets had similar effects in student performance to using physical labs. This has interesting implications for education policy-makers who are looking to reduce the digital divide.", "authors": [{"name": "Prema Nedungadi", "affiliation": "Amrita University, School of Engineering, Kollam, Kerala, India"}, {"name": "Ranjan Bose", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology (IIT), New Delhi, India"}, {"name": "Krishnashree Achuthan", "affiliation": "Amrita University, School of Engineering, Kollam, Kerala, India"}, {"name": "Raghu Raman", "affiliation": "Amrita University, School of Engineering, Kollam, Kerala, India"}, {"name": "Shyam Diwakar", "affiliation": "Amrita University, School of Engineering, Kollam, Kerala, India"}], "tags": ["potential-adopter student acceptance", "tablets", "Educational institutions", "Engineering education", "Mathematical model", "regression analysis", "student experiments", "Roger theory", "engineering curriculum", "Buildings", "Conferences", "engineering education", "Virtual Labs", "Observability", "VLAB OER experience", "open educational resources", "Open Educational Resources (OER)", "simulation", "innovation", "Technological innovation", "innovation management", "factor analysis", "virtual lab", "educational technology", "Experiments"]}, {"title": "Perspective on Flipping Circuits I", "link": "https://ieeexplore.ieee.org/document/6719569/", "abstract": "A flipped-classroom approach was implemented in a Circuits I class for electrical and computer engineering majors to lower its high attrition and failure rate. Students were asked to watch online lectures and then come to class prepared to work problems in small groups of four. The attitude, retention, and performance of students in the flipped group in Spring 2013 were compared to those for the traditionally taught group in Fall 2012. The Fall 2012 lectures were recorded, so that each group saw the same lectures. Student retention and test performance was significantly higher in the flipped course. In Fall 2012, 56% of the initially enrolled students received a C or better. In Spring 2013, this improved to 83%. The first exam scores were significantly better in Spring 2013, and this helped with student success. The authors believe that it was the alignment of online lectures, face-to-face student/teacher and peer/peer interactions, combined with the active learning component of the flipped classroom that led to these improvements .", "authors": [{"name": "Ramakant Srivastava", "affiliation": "Electrical and Computer Engineering Department, University of Florida, Gainesville, FL"}, {"name": "Mark E. Law", "affiliation": "Electrical and Computer Engineering Department, University of Florida, Gainesville, FL"}, {"name": "Gloria J. Kim", "affiliation": "Electrical and Computer Engineering Department, University of Florida, Gainesville, FL"}, {"name": "Erin E. Patrick", "affiliation": "Electrical and Computer Engineering Department, University of Florida, Gainesville, FL"}], "tags": ["Springs", "small-group problem solving", "circuits", "Educational institutions", "active learning component", "Active learning", "educational courses", "Electrical engineering", "course flipping", "computer engineering", "electrical engineering", "learning outcomes", "peer-peer interaction alignment", "Awards activities", "Spring 2013", "flipping circuit I", "online lecture alignment", "face-to-face studen-teacher alignment", "flipped-classroom approach", "electronic engineering education", "flipped course", "Materials", "Physics", "teaching", "Fall 2012 lecture", "retention"]}, {"title": "Teaching RFID Information Systems Security", "link": "https://ieeexplore.ieee.org/document/6524969/", "abstract": "The future cyber security workforce needs radio frequency identification (RFID) information systems security ( INFOSEC ) and threat modeling educational materials. A complete RFID security course with new learning materials and teaching strategies is presented here. A new RFID Reference Model is used in the course to organize discussion of RFID, much as the open systems interconnection (OSI) model is used in a computer networking course. Students use a general-purpose threat modeling process named STRIDE and a risk analysis model named DREAD to determine and to mitigate security risks. Class modules on topics such as the threat modeling process and privacy can be integrated into fourth-year undergraduate or first-year graduate-level computer science and computer engineering courses such as network security, wireless security, computer networks, sensor/RFID networks, or network performance.", "authors": [{"name": "Dale R. Thompson", "affiliation": "Computer Science and Computer Engineering Department, University of Arkansas, Fayetteville, AR, USA"}, {"name": "Michael K. Daugherty", "affiliation": "Department of Curriculum and Instruction, University of Arkansas, Fayetteville, AR, USA"}, {"name": "Jia Di", "affiliation": "Computer Science and Computer Engineering Department, University of Arkansas, Fayetteville, AR, USA"}], "tags": ["Privacy", "computer network security", "security risk determination", "threat modeling", "Analytical models", "network security", "computer networking course", "computer network performance evaluation", "Radiofrequency identification", "general-purpose threat modeling process", "security risk mitigation", "first-year graduate-level computer engineering courses", "educational courses", "telecommunication security", "radiofrequency identification", "fourth-year undergraduate computer engineering courses", "further education", "teaching strategies", "threat modeling educational materials", "radio frequency identification information systems security", "RFID reference model", "wireless security", "risk analysis", "first-year graduate-level computer science courses", "RFID information systems security teaching", "fourth-year undergraduate computer science courses", "network performance", "sensor networks", "Education", "Computational modeling", "radio frequency identification (RFID)", "Information systems", "computer science education", "DREAD", "STRIDE", "open systems interconnection model", "RFID security course", "cyber security workforce", "information systems security", "teaching", "learning materials", "Security", "risk analysis model", "wireless sensor networks"]}, {"title": "OER Approach for Specific Student Groups in Hardware-Based Courses", "link": "https://ieeexplore.ieee.org/document/6839053/", "abstract": "Hardware-based courses in computer science studies require much effort from both students and teachers. The most important part of students' learning is attending in person and actively working on laboratory exercises on hardware equipment. This paper deals with a specific group of students, those who are marginalized by not being able to regularly attend lessons and perform the laboratory exercises. This group of “busy students” includes older students, and those who travel, are employed or are parents. In particular it describes how such students achieved impressive results in a hardware-based course by using Open Educational Resources (OER). These facilitated students' learning process and gave busy students the opportunity to organize their learning time so as to work on the hardware courses remotely from home when they had time and opportunity. The results of the evaluation show significant improvements, both in grade distribution and course throughput, after implementing the new Open Educational Resources approach.", "authors": [{"name": "Sasko Ristov", "affiliation": "Faculty of Computer Science and Engineering, University Ss. Cyril and Methodius, Skopje, Macedonia"}, {"name": "Nevena Ackovska", "affiliation": "Faculty of Computer Science and Engineering, University Ss. Cyril and Methodius, Skopje, Macedonia"}], "tags": ["grade distribution", "computer science studies", "hardware equipment", "educational courses", "Computer science", "microcontrollers", "student groups", "Software", "Laboratories", "student learning process", "distance learning", "computer aided instruction", "open educational resources", "Education", "hardware-based courses", "Microcontrollers", "OER approach", "computer science education", "laboratory exercises", "Materials", "teaching", "course throughput", "Hardware"]}, {"title": "Introductory Circuit Analysis Learning From Abstract and Contextualized Circuit Representations: Effects of Diagram Labels", "link": "https://ieeexplore.ieee.org/document/6637101/", "abstract": "Novice learners are typically unfamiliar with abstract engineering symbols. They are also often unaccustomed to instructional materials consisting of a combination of text, diagrams, and equations. This raises the question of whether instruction on elementary electrical circuit analysis for novice learners should employ contextualized representations of the circuits with familiar components, such as batteries, or employ abstract representations with the abstract engineering terms and symbols. A further question is if text labels in the circuit diagrams would aid these learners. This study examined these research questions with a “2 × 3” experimental design, in which the two forms of representation (abstract or contextualized) were considered under three types of diagram labeling (no labels, static labels, or interactive labels). The design was implemented in an instructional module on elementary circuit analysis for novice learners. Results indicated that abstract representations led to higher near- and far-transfer post-test scores, and that interactive (student-generated) labeling resulted in higher near-transfer scores than either the no-labels or static-labels conditions. These findings suggest that abstract representations promote the development of deep, transferrable knowledge and that generative methods of integration, such as interactive diagram labeling, can facilitate learning with multiple external representations.", "authors": [{"name": "Martin Reisslein", "affiliation": "School of Electrical, Computer, and Energy Eng., Arizona State Univ., Tempe, AZ"}, {"name": "Kirsten R. Butcher", "affiliation": "Department of Educational Psychology, University of Utah, Salt Lake City, UT"}, {"name": "Amy M. Johnson", "affiliation": "School of Electrical, Computer, and Energy Eng., Arizona State Univ., Tempe, AZ"}, {"name": "Gamze Ozogul", "affiliation": "Department of Instructional Systems Technology, Indiana University, Bloomington, IN"}], "tags": ["diagram label effect", "Batteries", "instructional materials", "Circuit analysis", "no-label conditions", "static-label conditions", "circuit diagram", "diagram label", "Labeling", "multiple external representations", "circuit analysis learning", "abstract engineering terms", "novice learner", "far-transfer post-test scores", "Resistors", "interactive diagram labeling", "circuit diagrams", "Circuit analysis instruction", "electronic engineering education", "network analysis", "abstract engineering symbols", "novice learners", "abstract circuit representations", "electrical circuit analysis", "Abstracts", "Materials", "contextualized circuit representations", "elementary electrical circuit analysis", "near-transfer post-test scores", "Resistance"]}, {"title": "Evaluation of a Didactic Method for the Active Learning of Greedy Algorithms", "link": "https://ieeexplore.ieee.org/document/6578603/", "abstract": "An evaluation of the educational effectiveness of a didactic method for the active learning of greedy algorithms is presented. The didactic method sets students structured-inquiry challenges to be addressed with a specific experimental method, supported by the interactive system GreedEx. This didactic method has been refined over several years of use. Additional elements are lecture contents and the scheduling of classes and lab sessions. Learning gain in the topic of greedy algorithms was measured in the short term for two groups of students: an experimental group taught with the new didactic method, and a control group taught with a traditional approach. The results show a significant learning gain improvement in the experimental group, while the students taught with a traditional method had little learning gain. In addition, the levels of Bloom's taxonomy at which improvements occurred were identified. In the control group, improvements were found at the knowledge level. In the experimental group, however, improvements were found at the knowledge and the comprehension levels, although not at the analysis level. These results are encouraging and indicate directions for future research, as analysis skills are important in algorithm courses.", "authors": [{"name": "J. Ángel Velázquez-Iturbide", "affiliation": "Departamento de Lenguajes y Sistemas Informáticos I, Escuela Técnica Superior de Ingeniería Informática, Universidad Rey Juan Carlos, Madrid, Móstoles, Spain"}, {"name": "Natalia Esteban-Sánchez", "affiliation": "Departamento de Lenguajes y Sistemas Informáticos I, Escuela Técnica Superior de Ingeniería Informática, Universidad Rey Juan Carlos, Madrid, Móstoles, Spain"}, {"name": "Celeste Pizarro", "affiliation": "Departamento de Lenguajes y Sistemas Informáticos I, Escuela Técnica Superior de Ingeniería Informática, Universidad Rey Juan Carlos, Madrid, Móstoles, Spain"}], "tags": ["greedy algorithms", "Optimization", "active learning", "Algorithm design and analysis", "computer science curricula", "Schedules", "educational courses", "algorithm courses", "lecture contents", "didactic method educational effectiveness", "Taxonomy", "knowledge level", "structured-inquiry challenges", "education", "Algorithms", "interactive system GreedEx", "greedy algorithm", "Education", "lab sessions", "didactic method evaluation", "computer science education", "scheduling", "Animation", "Bloom taxonomy", "control group", "class scheduling", "educational technology", "experimental group", "Greedy algorithms"]}, {"title": "How Remote Labs Impact on Course Outcomes: Various Practices Using VISIR", "link": "https://ieeexplore.ieee.org/document/6645452/", "abstract": "As technology is increasingly being seen as a facilitator to learning, open remote laboratories are increasingly available and in widespread use around the world. They provide some advantages over traditional hands-on labs or simulations. This paper presents the results of integrating the open remote laboratory VISIR into several courses, in various contexts and using various methodologies. These integrations, all related to higher education engineering, were designed by teachers with different perspectives to achieve a range of learning outcomes. The degree to which these VISIR-related outcomes were accomplished is discussed. The results reflect the levels of student engagement and learning and of teacher involvement. From the analysis, a connection between these two aspects was traced, although only related to the user profiles. VISIR is shown to be always of benefit for more motivated students, but this benefit can be maximized under particular conditions and characteristics.", "authors": [{"name": "Maria A. Marques", "affiliation": "Physics Department, School of Engineering—Polytechnic of Porto, Porto, Portugal"}, {"name": "Ingvar Gustavsson", "affiliation": "Electrical Engineering Department, Blekinge Institute of Technology, Karlskrona, Sweden"}, {"name": "Maria Clara Viegas", "affiliation": "Physics Department, School of Engineering—Polytechnic of Porto, Porto, Portugal"}, {"name": "André V. Fidalgo", "affiliation": "Electrical Engineering Department, School of Engineering—Polytechnic of Porto"}, {"name": "Gustavo R. Alves", "affiliation": "Electrical Engineering Department, School of Engineering—Polytechnic of Porto"}, {"name": "Maria Cristina Costa-Lobo", "affiliation": "Universidade Portucalense Infante D. Henrique, Porto, Portugal"}, {"name": "João S. Rocha", "affiliation": "Computer Science Department"}], "tags": ["Availability", "virtual instrument system in reality system", "educational courses", "Training", "student engagement", "further education", "higher education engineering", "virtual instrumentation", "student experiments", "open remote laboratory impact", "Context", "learning outcomes", "remote laboratories", "computer aided instruction", "Curriculum integration", "virtual reality", "Remote laboratories", "VISIR", "Market research"]}, {"title": "Comparing Online to Face-to-Face Delivery of Undergraduate Digital Circuits Content", "link": "https://ieeexplore.ieee.org/document/6582556/", "abstract": "This paper presents a comparison of online to traditional face-to-face delivery of undergraduate digital systems material. Two specific components of digital content were compared and evaluated: a sophomore logic circuits course with no laboratory, and a microprocessor laboratory component of a junior-level computer systems course. For each of these, a baseline level of student understanding was evaluated when they were being taught using traditional, face-to-face delivery. The course and lab component were then converted to being fully online, and the level of student understanding was again measured. In both cases, the same purpose-developed assessment tools were used to carry out the measurement of understanding. This paper presents the details of how the course components were converted to online delivery, including a discussion of the technology used to accomplish remote access of the electronic test equipment used in the laboratory. A comparison is then presented between the control and the experimental groups, including a statistical analysis of whether the delivery approach impacted student learning. Finally, student satisfaction is discussed, and instructor observations are given for the successful remote delivery of this type of class and laboratory.", "authors": [{"name": "Carolyn Plumb", "affiliation": "College of Engineering, Montana State University, Bozeman, MT, USA"}, {"name": "Brock J. LaMeres", "affiliation": "Electrical and Computer Engineering Department, Montana State University, Bozeman, MT, USA"}], "tags": ["e-learning", "laboratory techniques", "learning systems", "junior-level computer systems course", "educational courses", "course components", "Laboratories", "Videos", "student experiments", "Digital circuits", "student learning", "education", "digital circuits", "statistical analysis", "student understanding", "undergraduate digital circuits content", "Computers", "microprocessor laboratory component", "Microprocessors", "online delivery", "Education", "test equipment", "face-to-face delivery", "instructor observations", "electronic test equipment", "remote access", "Materials", "microprocessors", "microprocessor chips", "sophomore logic circuits course", "Hardware"]}, {"title": "Guest Editorial: Open Educational Resources in Engineering Education: Various Perspectives Opening the Education of Engineers", "link": "https://ieeexplore.ieee.org/document/6937240/", "abstract": "Open Educational Resources (OER) provide a strategic opportunity to improve the quality of education as well as facilitate policy dialog, knowledge sharing, and capacity building. One of the fundamental concepts of OER is “the ability to freely adapt and reuse existing pieces of knowledge.” Reuse of educational resources by both individuals and organizations may have significant creative and economic benefit for the educational environment. This Special Issue editorial introduces six interesting experiences, representative of the use of OER in engineering education in important areas such as the production of open content at various scales, reuse of contents, institutional open Web site initiatives, and technological applications to support the exploitation of OER, all at different degrees of maturity. Since some readers will be unfamiliar with prior work on OER, this Special Issue also outlines the hot topics in OER and the critical factors for success when joining the Open Educational Movement. Finally, the editorial provides a set of recommendations and examples offered by the Special Issue editors from their over 6 years of experience leading a research group in semantic Web technologies applied to Open Education. A key requirement, in their opinion, is to improve the metadata interoperability between various collections of open material, so as to facilitate the discoverability and subsequent combining, remixing, or adapting OER; that is, OER data should be easily accessible to any user.", "authors": [{"name": "Edmundo Tovar", "affiliation": "Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Nelson Piedra", "affiliation": "Universidad Técnica Particular de Loja, Loja, Ecuador"}], "tags": ["Knowledge engineering", "Web and internet services", "Open Educational Resources", "reusability", "open learning", "Linked data", "semantic Web", "Special issues and sections", "Open systems", "Economics", "Engineering education"]}, {"title": "UNED OER Experience: From OCW to Open UNED", "link": "https://ieeexplore.ieee.org/document/6848855/", "abstract": "Much as happened with open software, there has been a global attitude shift in the education community toward the open sharing of educational courses and resources. As the largest public distance education university in Spain, Universidad Nacional de Educación a Distancia (UNED) has had a clear commitment to open learning and content since its very beginnings. Its open courseware (OCW) portal was started in 2006 and has received several prizes for its innovative content. During this period, the OCW materials were used to supplement standard teaching in a variety of educational applications, among them induction and competence transfer courses. These initiatives have been used as a starting point for a comprehensive open educational resource (OER) policy at UNED. Efforts to foster OER initiatives are collected in the project called UNED Abierta (Open UNED). UNED currently publishes its open resources in various platforms and formats, such as iTunes U, MOOC, and OpenCourseWare. This paper presents UNED's experience in OER and describes how it is tackling the new challenges in OER creation and distribution.", "authors": [{"name": "Timothy Read", "affiliation": "Lenguajes y Sistemas Inform´ticos (LSI) Department, Spanish University for Distance Education (UNED), Madrid, Spain"}, {"name": "Roberto Hernández", "affiliation": "Control and Communication Systems Department, Spanish University for Distance Education, Madrid, Spain"}, {"name": "Miguel Rodrı´guez Artacho", "affiliation": "Lenguajes y Sistemas Inform´ticos (LSI) Department, Spanish University for Distance Education (UNED), Madrid, Spain"}, {"name": "Gabriel Dı´az Orueta", "affiliation": "Department at UNED, IEEC"}, {"name": "Rafael Pastor", "affiliation": "Control and Communication Systems Department, Spanish University for Distance Education, Madrid, Spain"}, {"name": "Salvador Ros", "affiliation": "Control and Communication Systems Department, Spanish University for Distance Education, Madrid, Spain"}], "tags": ["open UNED", "public distance education university", "Social network services", "massive online open courses", "Educational institutions", "educational courses", "educational institutions", "further education", "Software", "open content", "public domain software", "OCW", "open courseware portal", "open educational resource policy", "distance learning", "portals", "open educational resources", "educational resources", "open courseware", "Web sites", "OER", "Universidad Nacional de Educación a Distancia", "Materials", "Communities", "courseware", "Higher education"]}, {"title": "The Master's Thesis: An Opportunity for Fostering Presentation Skills", "link": "https://ieeexplore.ieee.org/document/6544309/", "abstract": "Presentation skills, such as oral expression and public speaking, have normally been relegated to the background in engineering degree programs. In recent years, however, the labor market has specifically demanded these kinds of skills in engineers. Accordingly, new engineering degrees, adapted to the goals of the Bologna Declaration or ABET criteria, consider presentation skills as being fundamental transferable skills. In practice, however, many engineering degree programs do not specifically foster these skills even though they are included in the syllabus. This paper proposes a presentation-skills training that uses the Master's thesis as an opportunity for fostering presentation-related skills. This activity has students deliver a scheduled series of rehearsals, in front of their classmates and tutors, for their officially assessed presentation of their Master's thesis work. The paper also presents a Web tool specifically designed for uploading recordings of the rehearsal presentations for feedback online as a complementary method for fostering presentation-related skills. Finally, the results of carrying out the proposed resource over a 4-year period from 2009 to 2013 are discussed; they show that students following the proposed methodology had higher than average marks, all receiving an A+, and 82% of them receiving an A+ with distinction.", "authors": [{"name": "Pablo F. Miaja", "affiliation": "Electrical Engineering, University of Oviedo, Gijon Asturias, Spain"}, {"name": "Diego G. Lamar", "affiliation": "Electrical Engineering, University of Oviedo, Gijon Asturias, Spain"}, {"name": "Pablo Pando", "affiliation": "Construction and Manufacturing Engineering Department, University of Oviedo, Gijon, Asturias, Spain"}, {"name": "Manuel Arias", "affiliation": "Electrical Engineering, University of Oviedo, Gijon Asturias, Spain"}, {"name": "Aitor Vázquez", "affiliation": "Electrical Engineering, University of Oviedo, Gijon Asturias, Spain"}, {"name": "Marcos Fernández", "affiliation": "Electrical Engineering, University of Oviedo, Gijon Asturias, Spain"}, {"name": "Alberto Rodríguez", "affiliation": "Electrical Engineering, University of Oviedo, Gijon Asturias, Spain"}], "tags": ["Bologna Declaration", "Public speaking", "presentation skills", "educational courses", "Training", "further education", "Planning", "Seminars", "Master's thesis", "presentation skills training", "Mathematics", "Organizations", "oral expression", "computer based training", "engineering degree programs", "Internet", "Master thesis", "Web tool", "public speaking", "transferable skills", "ABET criteria", "Tools"]}, {"title": "A Case Study on a Capsule Robot in the Gastrointestinal Tract to Teach Robot Programming and Navigation", "link": "https://ieeexplore.ieee.org/document/6609123/", "abstract": "Despite the increasing importance of robotics, there is a significant challenge involved in teaching this to undergraduate students in biomedical engineering (BME) and other related disciplines in which robotics techniques could be readily applied. This paper addresses this challenge through the development and pilot testing of a bio-microrobotics case study that can be integrated into curricula in BME, electrical and computer engineering (ECE), and other disciplines. This case study is based on the existing technology of wireless capsule endoscopy and centered on a “grand challenge” of building a capsule robot to navigate the human gastrointestinal tract to detect abnormality or to destroy malignant tissues. First, a conceptual design example for building such a capsule robot is presented, followed by a laboratory module that demonstrates robot navigation techniques using Webots simulation. The case study introduces robotic technologies, including robot building components, operating modes, and behavior-based programming, and students experience robot simulation in the laboratory module. The case study developed was pilot tested in three BME and ECE courses at the authors' institution. The evaluation results demonstrate the effectiveness of the case study in enhancing students' understanding of robotics, interdisciplinary skills, and critical thinking. The case study is shown to support challenge-based learning, which promotes adaptive expertise through rapid knowledge building and innovation.", "authors": [{"name": "Arthur Ritter", "affiliation": "Department of Chemistry, Chemical Biology, and Biomedical Engineering, Stevens Institute of Technology, Hoboken, NJ, USA"}, {"name": "Hong Man", "affiliation": "Department of Electrical and Computer Engineering, Stevens Institute of Technology, Hoboken, NJ, USA"}, {"name": "Yi Guo", "affiliation": "Department of Electrical and Computer Engineering, Stevens Institute of Technology, Hoboken, NJ, USA"}, {"name": "Shubo Zhang", "affiliation": "Department of Electrical and Computer Engineering, Stevens Institute of Technology, Hoboken, NJ, USA"}], "tags": ["laboratory module", "Educational robots", "biomedical engineering", "educational robots", "human gastrointestinal tract", "challenge-based learning", "abnormality detect", "robot navigation", "further education", "robot navigation technique", "endoscopes", "medical robotics", "capsule robot", "Webots simulation", "BME", "Webots", "control engineering education", "robot building components", "gastrointestinal tract", "bio-microrobotics", "wireless capsule endoscopy", "interdisciplinary skills", "Navigation", "Robot kinematics", "computer aided instruction", "microrobots", "human gastrointestinal tract navigation", "undergraduate students", "electrical and computer engineering", "path planning", "Behavior-based robot programming", "robotics", "biological tissues", "operating modes", "critical thinking", "robot simulation", "behaviour-based robot programming", "pilot testing", "Endoscopes", "robot programming", "Robot sensing systems", "teaching", "malignant tissues", "ECE", "biomedical education", "Collision avoidance"]}, {"title": "A Novel Instructional Approach to the Design of Standard Controllers: Using Inversion Formulae", "link": "https://ieeexplore.ieee.org/document/6542685/", "abstract": "This paper describes a range of design techniques for standard compensators (Lead-Lag networks and PID controllers) that have been applied to the teaching of many undergraduate control courses throughout Italy over the last twenty years, but that have received little attention elsewhere. These techniques hinge upon a set of simple formulas-herein referred to as Inversion Formulae -for the computation of the parameters of the controller as functions of the typical specifications of steady-state performance, stability margins, and crossover frequency.", "authors": [{"name": "Roberto Zanasi", "affiliation": "DII-Information Engineering Department, University of Modena and Reggio Emilia, Modena, Italy"}, {"name": "Stefania Cuoghi", "affiliation": "DII-Information Engineering Department, University of Modena and Reggio Emilia, Modena, Italy"}, {"name": "Lorenzo Ntogramatzidis", "affiliation": "Department of Mathematics and Statistics, Curtin University, Perth, WA, Australia"}], "tags": ["inversion formulae", "stability margins", "steady-state performance", "lead-lag networks", "Italy", "control system synthesis", "educational courses", "Steady-state", "PID controllers", "further education", "crossover frequency", "stability", "standard controller design", "control engineering education", "instructional approach", "Transfer functions", "Lead", "undergraduate control course teaching", "Standards", "Education", "three-term control", "lead and lag networks", "Feedback control", "Frequency control", "teaching", "Crossover frequencies", "standard compensator design techniques", "compensation"]}, {"title": "Motivation and Emotions in Competition Systems for Education: An Empirical Study", "link": "https://ieeexplore.ieee.org/document/6719576/", "abstract": "A lack of student motivation is a problem in many courses in electrical engineering. Introducing competition between students can enhance their motivation, but it can also generate negative emotions. This paper presents an empirical study of students in a telecommunications engineering degree; it measured their level of motivation, and their emotions about competition in education in general, and in particular about the Information System for Competition based on pRoblem solving in Education (ISCARE). ISCARE makes adaptive matches, pairing students who share a similar knowledge level. The study results show that students had moderate levels of motivation and experienced no negative emotions while using ISCARE. Under certain circumstances, therefore, competition in education, using technology systems that provide competition, can produce motivation without generating negative emotions. Female students and students with low ISCARE scores were less motivated and experienced more negative emotions. In addition, motivation and emotions toward ISCARE were more positive than they had been toward competition in general.", "authors": [{"name": "Carlos Delgado Kloos", "affiliation": "Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Manuel Fernández Molina", "affiliation": "Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Mario Muñoz-Organero", "affiliation": "Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Pedro J. Muñoz-Merino", "affiliation": "Universidad Carlos III de Madrid, Madrid, Spain"}], "tags": ["Electrical engineering", "Correlation", "ISCARE", "Adaptive systems", "Histograms", "human factors", "telecommunications engineering degree", "Education", "information system for competition based on problem solving in education", "Telecommunications", "motivation", "Information systems", "student motivation", "telecommunication engineering education", "competition", "electrical engineering. Education:", "intelligent tutoring systems", "Assessment", "emotions"]}, {"title": "Holistic Development of Computer Engineering Curricula Using Y-Chart Methodology", "link": "https://ieeexplore.ieee.org/document/6747383/", "abstract": "The exponential growth of advancing technologies is pushing curriculum designers in computer engineering (CpE) education to compress more and more content into the typical 4-year program, without necessarily paying much attention to the cohesiveness of those contents. The result has been highly fragmented curricula consisting of various disconnected theory courses and laboratory practicals. A holistic approach to curricula development that focuses on integrated fundamental knowledge is required to remedy this. This paper proposes a holistic approach to developing a CpE curriculum and to maintaining continuous, coherent development of that curriculum. The elements of the proposed approach are the following: formulation of objectives, identification of major curriculum areas, construction of a system model for CpE core courses by using the Y-chart methodology, description of electives, integration of laboratory practices, and assessment of the curriculum. An assessment of the curriculum is presented based on survey data and accreditation outcomes. Assessment results show that holistic understanding and integrated design experience assist students in achieving the program objectives.", "authors": [{"name": "Muhammad Rashid", "affiliation": "Department of Computer Engineering, Umm Al-Qura University, Saudi Arabia"}, {"name": "Imran A. Tasadduq", "affiliation": "Department of Computer Engineering, Umm Al-Qura University, Saudi Arabia"}], "tags": ["major curriculum areas identification", "integrated design experience", "curricula development", "curriculum assessment", "educational courses", "Guidelines", "program objectives", "forward and backward references", "ABET self-study", "student assistance", "Laboratories", "Software", "system model construction", "electives description", "CpE education", "objectives formulation", "student outcomes", "Computers", "computer engineering education", "laboratory practices integration", "Computational modeling", "system model", "holistic development", "computer science education", "computer engineering curricula", "Y-chart methodology", "lifelong learning", "Programming", "Hardware"]}, {"title": "Generating OER by Recording Lectures: A Case Study", "link": "https://ieeexplore.ieee.org/document/6860323/", "abstract": "The University of Vigo, Vigo, Spain, has the objective of making all the teaching material generated by its teachers freely available. To attain this objective, it encourages the development of Open Educational Resources, especially videos. This paper presents an experience of recording lectures and generating the corresponding videos as a step toward this objective. The core system used to record lectures is Opencast Matterhorn (free and open-source customizable software to support the management of educational audio and video content). This paper also focuses on the study and analysis of the students' experience of using recorded videos as support for their learning process. This case study was carried out in the Fall 2012 offering of the first-year Computer Architecture course in the University of Vigo's Telecommunication Technologies Engineering program. Finally, the paper addresses students' level of satisfaction with the recorded lectures and gives students' opinions on the use of these videos.", "authors": [{"name": "Fernando A. Mikic-Fonte", "affiliation": "Telematics Engineering Department, Campus Universitario, Vigo, Spain"}, {"name": "Martín Llamas-Nistal", "affiliation": "Telematics Engineering Department, Campus Universitario, Vigo, Spain"}], "tags": ["Educational resources", "teaching material", "recorded lectures", "Educational institutions", "Computer architecture", "Media", "open repositories", "educational audio content management", "Software", "video signal processing", "public domain software", "telecommunication technologies engineering program", "Spain", "lecture recording", "Videos", "Opencast Matterhorn", "computer aided instruction", "learning videos", "educational video content management", "computer architecture course", "open-source customizable software", "video recording", "University of Vigo", "computer science education", "OER", "Open Educational Resources", "free software", "content management", "learning support"]}, {"title": "Improving Aerospace Engineering Students' Achievements by an Open Aero Control Experiment Apparatus", "link": "https://ieeexplore.ieee.org/document/6824852/", "abstract": "This paper describes the development of an aero control experiment apparatus (ACEA) for use in aerospace control practical courses. The ACEA incorporates a systematic multihierarchy learning and teaching method, and was designed to improve aerospace engineering students' understanding of unmanned aerial vehicle (UAV) control systems. It offers a number of standard experimental modules at three levels: component, system, and simulation and evaluation. The software and hardware design methods used in the modules were chosen to allow students to conduct experiments in a simple, more hands-on manner. As a result, they were able to select or reconfigure their experiments and so continuously improve their skills and extend the ACEA itself. The practical curriculum modules-grouped in three skill levels of basic experiments, case study, and independent design-were applied in a 3-year M.Sc. course, UAV Control Systems. The marking criteria created to evaluate students' achievements are presented, along with some results of this evaluation.", "authors": [{"name": "Zhang WeiHua", "affiliation": "National University of Defense Technology, College of Aerospace Science and Engineering, ChangSha, HuNan, China"}, {"name": "Dong RongHua", "affiliation": "National University of Defense Technology, College of Aerospace Science and Engineering, ChangSha, HuNan, China"}, {"name": "Huang ZheZhi", "affiliation": "National University of Defense Technology, College of Aerospace Science and Engineering, ChangSha, HuNan, China"}, {"name": "Zeng QingHua", "affiliation": "National University of Defense Technology, College of Aerospace Science and Engineering, ChangSha, HuNan, China"}], "tags": ["aerospace engineering student achievement", "systematic multihierarchy learning", "aerospace computing", "experiment resources", "educational courses", "aerospace control practical course", "Software", "Laboratories", "teaching method", "control engineering education", "Control systems", "UAV control system", "Navigation", "computer aided instruction", "open aerocontrol experiment apparatus", "unmanned aerial vehicle (UAV)", "Education", "Aerospace control", "navigation and control", "aerospace control", "autonomous aerial vehicles", "unmanned aerial vehicle", "Hardware"]}, {"title": "Cloud-Based Virtual Laboratory for Network Security Education", "link": "https://ieeexplore.ieee.org/document/6632976/", "abstract": "Hands-on experiments are essential for computer network security education. Existing laboratory solutions usually require significant effort to build, configure, and maintain and often do not support reconfigurability, flexibility, and scalability. This paper presents a cloud-based virtual laboratory education platform called V-Lab that provides a contained experimental environment for hands-on experiments using virtualization technologies (such as Xen or KVM Cloud Platform) and OpenFlow switches. The system can be securely accessed through OpenVPN, and students can remotely control the virtual machines (VMs) and perform the experimental tasks. The V-Lab platform also offers an interactive Web GUI for resource management and a social site for knowledge sharing and contribution. By using a flexible and configurable design, V-Lab integrates pedagogical models into curriculum design and provides a progressive learning path with a series of experiments for network security education. Since summer 2011, V-Lab has served more than 1000 students from six courses across over 20 experiments. The evaluation demonstrates that the platform and curriculum have produced excellent results and helped students understand and build up computer security knowledge to solve real-world problems.", "authors": [{"name": "Dijiang Huang", "affiliation": "School of Computing Informatics Decision Systems Engineering, Arizona State University, Tempe, AZ"}, {"name": "Wei-Tek Tsai", "affiliation": "School of Computing Informatics Decision Systems Engineering, Arizona State University, Tempe, AZ"}, {"name": "Le Xu", "affiliation": "School of Computing Informatics Decision Systems Engineering, Arizona State University, Tempe, AZ"}], "tags": ["Modeling", "computer network security", "network security", "virtualization technologies", "Resource management", "resource management", "interactive Web GUI", "Collaborative learning", "Laboratories", "Servers", "cloud computing", "cloud-based virtual laboratory education platform", "Knowledge engineering", "computer network security education", "knowledge sharing", "computer aided instruction", "V-Lab", "virtual laboratory", "Education", "progressive learning path", "social site", "laboratories", "OpenFlow switches", "hands-on experiments", "Security"]}, {"title": "Performing Systematic Literature Reviews With Novices: An Iterative Approach", "link": "https://ieeexplore.ieee.org/document/6678789/", "abstract": "Reviewers performing systematic literature reviews require understanding of the review process and of the knowledge domain. This paper presents an iterative approach for conducting systematic literature reviews that addresses the problems faced by reviewers who are novices in one or both levels of understanding. This approach is derived from traditional systematic literature reviews and based on observations from four systematic reviews performed in an academic setting. These reviews demonstrated the importance of defining iterations for the eight tasks of the review process. The iterative approach enables experiential learning from the two levels of understanding: the process level and the domain level.", "authors": [{"name": "Mathieu Lavallée", "affiliation": "Polytechnique Montreal, Génie informatique et génie logiciel, Montreal, Quebec, Canada"}, {"name": "Reza Mirsalari", "affiliation": "Polytechnique Montreal, Génie informatique et génie logiciel, Montreal, Quebec, Canada"}, {"name": "Pierre-N. Robillard", "affiliation": "Polytechnique Montreal, Génie informatique et génie logiciel, Montreal, Quebec, Canada"}], "tags": ["computer science education", "academic setting", "Tutorials", "engineering education", "reviews", "iterative methods", "Iterative methods", "experiential learning", "Software", "Search problems", "iterative approach", "engineering students", "Systematics", "Training", "Computer science education", "systematic literature review process", "Planning"]}, {"title": "An Assessment of Remote Laboratory Experiments in Radio Communication", "link": "https://ieeexplore.ieee.org/document/6518150/", "abstract": "Today's electrical and computer engineering graduates need marketable skills to work with electronic devices. Hands-on experiments prepare students to deal with real-world problems and help them to comprehend theoretical concepts and relate these to practical tasks. However, shortage of equipment, high costs, and a lack of human resources for laboratory maintenance and assistance decrease the implementation capacity of hands-on training laboratories. At the same time, the Internet has become a common networking medium and is increasingly used to enhance education. In addition, at many sites, existing experimental systems are typically underutilized. These cost and efficient exploitation constraints can be resolved by the use of remote laboratories accessible through the Internet that can be shared and used at flexible times and from various locations. This paper is a description of a systematic assessment effort of the efficiency of remote laboratories in radio communication. The labs are offered to graduate and undergraduate students, and hands-on and remote experiences are compared. A dedicated remote experimentation system, eComLab, was developed to support the effort.", "authors": [{"name": "Andreas Gampe", "affiliation": "Department of Computer Science, University of Texas, San Antonio, Texas, USA"}, {"name": "Arsen Melkonyan", "affiliation": "Electrical and Computer Engineering, University of Texas, San Antonio, Texas, United States"}, {"name": "Murillo Pontual", "affiliation": "Oracle, Redwood, CA, USA"}, {"name": "David Akopian", "affiliation": "Electrical and Computer Engineering, University of Texas, San Antonio, Texas, United States"}], "tags": ["laboratory techniques", "remote education", "hands-on training laboratories", "electrical engineering graduates", "Software", "Servers", "laboratory assistance", "eComLab", "Demodulation", "computer engineering graduates", "remote laboratory experiments", "electronic devices", "Internet", "remote trainer", "undergraduate students", "laboratory maintenance", "education enhancement", "graduate students", "Radio communication", "Remote laboratories", "telecommunication engineering education", "remote desktop architecture", "radiocommunication", "remote laboratory", "Hardware"]}, {"title": "A Semantically Enriched Context-Aware OER Recommendation Strategy and Its Application to a Computer Science OER Repository", "link": "https://ieeexplore.ieee.org/document/6774489/", "abstract": "This paper describes a knowledge-based strategy for recommending educational resources-worked problems, exercises, quiz questions, and lecture notes-to learners in the first two courses in the introductory sequence of a computer science major (CS1 and CS2). The goal of the recommendation strategy is to provide support for personalized access to the resources that exist in open educational repositories. The strategy uses: 1) a description of the resources based on metadata standards enriched by ontology-based semantic indexing, and 2) contextual information about the user (her knowledge of that particular field of learning). The results of an experimental analysis of the strategy's performance are presented. These demonstrate that the proposed strategy offers a high level of personalization and can be adapted to the user. An application of the strategy to a repository of computer science open educational resources was well received by both educators and students and had promising effects on the student performance and dropout rates.", "authors": [{"name": "Guillermo Jiménez-Díaz", "affiliation": "Department of Software Engineering and Artificial Intelligence, Complutense University of Madrid, Madrid, Spain"}, {"name": "Mercedes Gómez-Albarrán", "affiliation": "Department of Software Engineering and Artificial Intelligence, Complutense University of Madrid, Madrid, Spain"}, {"name": "Almudena Ruiz-Iniesta", "affiliation": "Department of Software Engineering and Artificial Intelligence, Complutense University of Madrid, Madrid, Spain"}], "tags": ["Knowledge based systems", "meta data", "ontologies (artificial intelligence)", "ubiquitous computing", "Computer science repositories", "introductory sequence", "student performance", "student dropout rates", "Educational institutions", "educational courses", "user knowledge", "Computer science", "Measurement", "knowledge-based strategy", "strategy performance", "metadata standards", "indexing", "Context", "quiz questions", "personalization level", "computer aided instruction", "users' experience", "Standards", "open education", "knowledge-based recommender systems", "courses", "lecture notes", "computer science major", "personalized access", "computer science education", "computer science open educational resources", "contextual information", "ontology-based semantic indexing", "worked problems", "open educational repositories", "Ontologies", "exercises", "semantically enriched context-aware OER recommendation strategy", "information retrieval", "computer science OER repository", "recommender systems"]}, {"title": "Implementation of a Project-Based Telecommunications Engineering Design Course", "link": "https://ieeexplore.ieee.org/document/6521393/", "abstract": "This paper describes and discusses the implementation of a project-based graduate design course in telecommunications engineering. This course, which requires a combination of technical and soft skills for its completion, enables guided independent learning (GIL) and application of technical knowledge acquired from classroom learning. Its main implementation challenge is the need for instructors to define graduate-level GIL activities that are unique for the project objectives and scope. This process is required at both the system and subsystem levels. These activities must also satisfy the program learning outcomes and course outcomes (PLOs and COs). The course initiation, implementation, and management are first described from the instructor's perspective. Technical specifications and outcomes from a recently implemented project titled “A Human-Inspired Telecommunication System” is taken as a case study. Besides explaining the methodology used to evaluate both the course and the students, an empirical assessment of PLOs and COs against the associated educational activities is also presented. Results of a student exit survey, in which each instrument was mapped to specific COs, indicated that the intended course objectives had been accomplished and that there was a good level of student satisfaction.", "authors": [{"name": "Saeed Farsi", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}, {"name": "Hadi Aliakbarian", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}, {"name": "Emmanuel H. E. M. J. C. Van Lil", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}, {"name": "Dominique M. M.-P. Schreurs", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}, {"name": "Ping Jack Soh", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}, {"name": "Guy A. E. Vandenbosch", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}, {"name": "Bart K. J. C. Nauwelaers", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}, {"name": "Hantao Xu", "affiliation": "ESAT-TELEMIC, Katholieke Universiteit Leuven, Leuven, Vlaams-Brabant, Belgium"}], "tags": ["Ear", "program learning outcomes", "soft skills", "Direction-of-arrival estimation", "technical skills", "educational courses", "direction-of-arrival (DoA) estimation", "project based graduate design course", "guided independent learning", "GIL", "Electrical engineering", "course outcomes", "human-inspired telecommunication system", "student experiments", "course initiation", "associated educational activities", "communication engineering education", "Biomimetics", "Education", "PLO", "Telecommunications", "student satisfaction", "classroom learning", "telecommunication engineering education", "CO", "technical knowledge", "Antennas", "project based telecommunications engineering design course"]}, {"title": "Dissemination of the Phasor Method in Electrical Engineering in China", "link": "https://ieeexplore.ieee.org/document/6520899/", "abstract": "Synchrophasors, widely used in the monitoring and analysis of power systems, evolved from the phasor method presented by Charles Proteus Steinmetz in 1893. The phasor method is a mathematical method for solving linear sinusoidal steady-state circuits and time-varying electromagnetic fields. This paper traces the history and diffusion of the phasor method in the discipline of electrical engineering in China. In 1914, Sidney Roby Sheldon, an American teacher at the Government Institute of Technology of the Communications Ministry, Shanghai, China, introduced the phasor method to his students in his Alternating Currents course. The textbook used was Elements of Electrical Engineering (Volume II) by William Suddards Franklin and William Esty. In 1920, The Electrical Magazine published a paper “Complex number and its application” by Sijiu Shi (editor of the electrical engineering section of this periodical). This is the earliest example found of Chinese literature introducing the phasor method. In the 1930s, Principles of Alternating Currents, an American electrical engineering textbook that includes the phasor method, was translated by Chinese scholars; this Chinese version promoted the use of the phasor method in China's electrical engineering field. Alternating Current Circuits, authored by the Chinese university professor Pen Tung Sah and published in 1948, may be the earliest example of the phasor method being included in a Chinese electrical engineering textbook; it played an important role in popularizing the phasor method in China.", "authors": [{"name": "Yinzhao Lei", "affiliation": "Department of Electrical Engineering, Beihang University, Beijing, China"}, {"name": "Liangliang Zhang", "affiliation": "Department of Electrical Engineering, Beihang University, Beijing, China"}], "tags": ["American electrical engineering textbook", "electrical engineering education", "phasor method", "Shanghai", "educational courses", "complex numbers", "linear sinusoidal steady-state circuits", "Electrical engineering", "China", "Synchronization", "communications ministry", "electrical engineering", "Government", "power system analysis", "phasor measurement", "History", "Alternating current (ac) circuit", "mathematical method", "Education", "diffusion", "Machinery", "time-varying electromagnetic fields", "power system monitoring", "alternating currents course", "electrical engineering field", "synchrophasors", "history of electrical engineering", "alternating current circuits", "Government Institute of Technology", "Monitoring"]}, {"title": "Effects of the Meetings-Flow Approach on Quality Teamwork in the Training of Software Capstone Projects", "link": "https://ieeexplore.ieee.org/document/6762899/", "abstract": "Software development relies heavily on teamwork; determining how to streamline this collaborative development is an essential training subject in computer and software engineering education. A team process known as the meetings-flow (MF) approach has recently been introduced in software capstone projects in engineering programs at various institutions. In undergraduate science, technology, engineering, and mathematics (STEM) curricula that emphasize team- and project-based learning, the MF approach serves as a macro-level instructional tool to guide students in holistically designing and directing collaborative project development. Previous studies on MF have shown the technical benefits of monitoring student work and product quality. This study investigated the approach further, from the perspective of team management. The effects of MF were examined through an experiment with team-related hypotheses. The results revealed that MF significantly enhances a team's communication and coordination and balances members' contributions by giving mutual support and effort. It has relatively less influence, however, on student team cohesion.", "authors": [{"name": "Pei-Chi Chen", "affiliation": "Department of Information Management, National Taiwan University, Tapei, Taiwan"}, {"name": "Chung-Yang Chen", "affiliation": "Dept. of Information Management, National Central University, Jhong-Li City, Tao-Yuan, Taiwan"}, {"name": "Ya-Chun Hong", "affiliation": "Dept. of Information Management, National Central University, Jhong-Li City, Tao-Yuan, Taiwan"}], "tags": ["team communication enhancement", "Analysis of variance", "teamwork quality", "educational courses", "Training", "experiment", "software development management", "Software", "team process", "meetings-flow approach", "Context", "Collaborative work", "engineering programs", "computer engineering education", "Capstone projects", "team coordination enhancement", "meetings-flow (MF)", "training", "computer science education", "team management", "software capstone project course", "team-based software development", "undergraduate science, technology, engineering, and mathematics (STEM) program", "team working", "Teamwork", "software capstone project training", "student team cohesion"]}, {"title": "Project Circuits in a Basic Electric Circuits Course", "link": "https://ieeexplore.ieee.org/document/6571270/", "abstract": "The use of project circuits (a photoplethysmograph circuit and a simple audio amplifier), introduced in a sophomore-level electric circuits course utilizing active learning and inquiry-based methods, is described. The development of the project circuits was initiated to promote enhanced engagement and deeper understanding of course content among students. The new activities were assessed by student surveys, student scores on essay exams probing deeper learning, and classroom observations by an assessment specialist. The results are compared to similar assessments made before the introduction of the project circuits and are related to other applications of active learning approaches in the teaching of electric circuits.", "authors": [{"name": "James P. Becker", "affiliation": "Department of Electrical and Computer Engineering, Montana State University, Bozeman, MT, USA"}, {"name": "Richard A. Revia", "affiliation": "Department of Electrical and Computer Engineering, Montana State University, Bozeman, MT, USA"}, {"name": "Carolyn Plumb", "affiliation": "Montana State University, College of Engineering, Bozeman, MT, USA"}], "tags": ["active learning", "circuit analysis", "electrical engineering education", "circuits", "Circuit analysis", "photoplethysmograph circuit", "Laboratories", "basic electric circuits course", "Integrated circuit modeling", "education", "sophomore level electric circuits", "Standards", "Education", "biomedical electronics", "audio amplifier", "project circuits", "Materials", "Operational amplifiers", "networks (circuits)", "teaching", "Assessment", "inquiry based methods"]}, {"title": "Erratum to “2013 IEEE Educational Activities Board Awards” [May 14 129-137]", "link": "https://ieeexplore.ieee.org/document/6869091/", "abstract": "In the above paper (ibid., vol. 57, no. 2, pp. 129-137, May 2014), the name of 2004 IEEE EAB Pre-University Educator Award recipient Mark D. Conner was misspelled. IEEE regrets the error.", "authors": [{"name": "S.K. Ramesh", "affiliation": "Laboratoire d'électronique industrielle, STI-LEI-EPFL, Lausanne, Switzerland"}], "tags": ["Awards", "Educational Activities Board"]}, {"title": "Implementation and Assessment of a Virtual Laboratory of Parallel Robots Developed for Engineering Students", "link": "https://ieeexplore.ieee.org/document/6584025/", "abstract": "This paper presents a tool, LABEL, oriented to the teaching of parallel robotics. The application, organized as a set of tools developed using Easy Java Simulations, enables the study of the kinematics of parallel robotics. A set of classical parallel structures was implemented such that LABEL can solve the inverse and direct kinematic problem of 5R, 3RRR, and Delta robots. An intuitive graphical user interface lets the student change the joint coordinates or Cartesian coordinates of the end effector while observing a graphical representation of the robot. In addition, a set of five practical sessions based upon this tool was developed. During the practical sessions, the student analyzes the inverse kinematics of parallel structures and the direct kinematic problem. Moreover, LABEL makes it easy to analyze the singularities that appear in the solution of the inverse and direct kinematic problem. These singularities are analyzed through the use of a path planning application, which allows the user to plan a trajectory in the robot's workspace. This helps the student to analyze the position and velocity of the end effector while observing the joint trajectories and speeds of the actuators. LABEL was implemented during the academic year 2011-2012 and has been well accepted. Finally, an assessment of LABEL is presented.", "authors": [{"name": "José María Marín", "affiliation": "System Engineering Department, Universidad Miguel Hernández de Elche, Elche (Alicante), SPAIN"}, {"name": "Adrián Peidró", "affiliation": "System Engineering Department, Universidad Miguel Hernández de Elche, Elche (Alicante), SPAIN"}, {"name": "Arturo Gil", "affiliation": "System Engineering Department, Universidad Miguel Hernández de Elche, Elche (Alicante), SPAIN"}, {"name": "Óscar Reinoso", "affiliation": "System Engineering Department, Universidad Miguel Hernández de Elche, Elche (Alicante), SPAIN"}], "tags": ["intuitive graphical user interface", "software tools", "Service robots", "Laboratories", "inverse kinematic problem", "robot kinematics", "Kinematics", "parallel robotics", "control engineering education", "Cartesian coordinates", "direct kinematic problem", "trajectory control", "Robot kinematics", "Joints", "computer aided instruction", "path planning", "Delta robots", "virtual laboratory", "simulation", "Education", "parallel robots", "virtual laboratories", "easy Java simulations", "LABEL", "Parallel robots", "trajectory planning", "Java", "graphical user interfaces", "teaching", "engineering students"]}, {"title": "On the Domain-Specificity of Mindsets: The Relationship Between Aptitude Beliefs and Programming Practice", "link": "https://ieeexplore.ieee.org/document/6662493/", "abstract": "Deliberate practice is important in many areas of learning, including that of learning to program computers. However, beliefs about the nature of personal traits, known as mindsets, can have a profound impact on such practice. Previous research has shown that those with a fixed mindset believe their traits cannot change; they tend to reduce their level of practice when they encounter difficulty. In contrast, those with the growth mindset believe their traits are flexible; they tend to maintain regular practice despite the level of difficulty. However, focusing on mindset as a single construct focused on intelligence may not be appropriate in the field of computer programming. Exploring this notion, a self-belief survey was distributed to undergraduate software engineering students. It revealed that beliefs about intelligence and programming aptitude formed two distinct constructs. Furthermore, the mindset for programming aptitude had greater utility in predicting software development practice, and a follow-up survey showed that it became more fixed throughout instruction. Thus, educators should consider the role of programming-specific beliefs in the design and evaluation of introductory courses in software engineering. In particular, they need to situate and contextualize the growth messages that motivate students who experience early setbacks.", "authors": [{"name": "Michael J. Scott", "affiliation": "School of Information Systems, Computing & Mathematics, Brunel University, Uxbridge, Middlesex, United Kingdom"}, {"name": "Gheorghita Ghinea", "affiliation": "School of Information Systems, Computing & Mathematics, Brunel University, Uxbridge, Middlesex, United Kingdom"}], "tags": ["introductory courses", "implicit beliefs", "Programming profession", "Educational institutions", "Data models", "educational courses", "computer programming", "further education", "software engineering", "psychology", "self-theories", "mindsets", "Software engineering", "Dweck", "programming practice", "programming aptitude beliefs", "Domain-specific", "Computers", "software development practice", "intelligence", "undergraduate software engineering students", "computer science education", "mindset domain-specificity", "practice", "programming-specific beliefs", "programming"]}, {"title": "Experiential Learning of Digital Communication Using LabVIEW", "link": "https://ieeexplore.ieee.org/document/6521383/", "abstract": "This paper discusses the design and implementation of laboratories and course projects using LabVIEW in an instrumentation course. The pedagogical challenge is to enhance students' learning of digital communication using LabVIEW. LabVIEW was extensively used in the laboratory sessions, which better prepared students for the course projects. Two course projects were designed to familiarize the students with virtual instrumentation, data acquisition, Modbus communication, and simple closed-loop control. One project involved the instrumentation and control of a brushed dc permanent magnet motor; the other involved the instrumentation and control of a small-scale temperature chamber. Students used one computer, functioning as a Modbus slave, to measure the motor speed or temperature inside the chamber and to turn the motor or lightbulbs on and off. Another computer, functioning as a Modbus master, reads the measurements using Modbus communication protocol via RS-485 wires, compared the measurements to the set points, made control decisions, and sent the commands to the Modbus slave for actuation. The effectiveness of student learning is analyzed using student survey data.", "authors": [{"name": "Jay R. Porter", "affiliation": "Department of Engineering Technology & Industrial Distribution, Texas A&M University, College Station, TX, USA"}, {"name": "Wei Zhan", "affiliation": "Department of Engineering Technology & Industrial Distribution, Texas A&M University, College Station, TX, USA"}, {"name": "Joseph A. Morgan", "affiliation": "Department of Engineering Technology & Industrial Distribution, Texas A&M University, College Station, TX, USA"}], "tags": ["Digital communication", "Instruments", "educational courses", "DC motors", "virtual instrumentation", "Laboratories", "Temperature control", "Temperature measurement", "closed loop systems", "control engineering education", "RS-485 wires", "instrumentation", "LabVIEW", "engineering education", "Temperature sensors", "computer aided instruction", "permanent magnet motors", "small-scale temperature chamber control", "lightbulb", "Data acquisition", "data acquisition", "electronic engineering education", "digital communication", "closed-loop control", "experiential learning", "Permanent magnet motors", "brushed dc permanent magnet motor control", "protocols", "motor speed measurement", "Modbus communication protocol"]}]