[{"title": "Mechatronic Aeropendulum: Demonstration of Linear and Nonlinear Feedback Control Principles With MATLAB/Simulink Real-Time Windows Target", "link": "https://ieeexplore.ieee.org/document/6193186/", "abstract": "This paper presents a low-cost hands-on experiment for a classical undergraduate controls course for non-electrical engineering majors. The setup consists of a small dc electrical motor attached to one of the ends of a light rod. The motor drives a 2-in propeller and allows the rod to swing. Angular position is measured by a potentiometer attached to the pivot point. A custom-designed circuit board produces the controlled voltage input to the motor. The target board is powered and communicates with the PC through its USB port using a virtual RS-232 port. A simple MATLAB/Simulink module has been created to read the pendulum angle and send a command signal to the motor. The module is based on Real-time Windows Target software, which allows a sampling rate of up to 200 Hz. Students are able to design and test classical PID and phase lead-lag controllers, as well as modern controllers, including state-space controller design combined with feedback linearization. A semester-long series of assignments is described that can be carried out without the need for a specialized laboratory or teaching assistants. The project was tested in a classical control systems design class of senior-level mechanical engineering students. Student feedback and survey data on the effectiveness of the modules are also presented.", "authors": [{"name": "Giampiero Campa", "affiliation": "Mathworks Inc., El Segundo, CA, USA"}, {"name": "Eniko T. Enikov", "affiliation": "Department of Aerospace and Mechanical Engineering, University of Arizona, Tucson, AZ, USA"}], "tags": ["Feedback linearization", "mechatronics", "real-time systems", "feedback", "three-term control", "virtual RS-232 port", "small dc electrical motor", "Mathematical model", "undergraduate controls course", "motor drives", "specialized laboratory", "senior-level mechanical engineering students", "survey data", "state-space controller design", "teaching assistants", "Propellers", "educational courses", "state-space methods", "phase lead-lag controllers", "control engineering computing", "non-electrical engineering majors", "USB port", "Steady-state", "angular position", "real-time windows target", "pendulum angle", "linear feedback control principles", "custom-designed circuit board", "Application software", "control system synthesis", "nonlinear feedback control principles", "light rod", "pendulums", "mechatronic aeropendulum", "feedback linearization", "PID controllers", "MATLAB-Simulink real-time windows target", "Laboratories", "command signal", "linear feedback control", "linear systems", "pivot point", "Force", "nonlinear control systems", "real-time control", "student feedback", "mathematics computing", "potentiometer", "Simulink", "Real time systems", "peripheral interfaces"]}, {"title": "Efficient Ways to Learn Weather Radar Polarimetry", "link": "https://ieeexplore.ieee.org/document/5738361/", "abstract": "The U.S. weather radar network is currently being upgraded with dual-polarization capability. Weather radar polarimetry is an interdisciplinary area of engineering and meteorology. This paper presents efficient ways to learn weather radar polarimetry through several basic and practical topics. These topics include: 1) hydrometeor scattering model and calculation of radar variables; 2) characteristics of polarimetric radar measurements and radar echo classification; and 3) rain microphysics retrieval. The supporting files, data, codes, and results are provided on the Web site http://arrc.ou.edu/~guzhang/Polarimetry/main.html. The study modules provide hands-on experience in the area of weather radar polarimetry and related fields.", "authors": [{"name": "Guifu Zhang", "affiliation": "School of Meteorology, University of Oklahama, Norman, OK, USA"}, {"name": "Qing Cao", "affiliation": "Atmospheric Radar Research Center, Norman, OK, USA"}, {"name": "Mark B. Yeary", "affiliation": "School of Electrical and Computer Engineering, University of Oklahama, Norman, OK, USA"}], "tags": ["Meteorological radar", "weather radar polarimetry", "Radar measurements", "Electromagnetic scattering", "radar echo classification", "Scattering", "meteorological radar", "radar polarimetry", "rain microphysics retrieval", "polarimetric radar measurements", "Radar polarimetry", "precipitation", "Meteorology", "electromagnetic wave polarisation", "US weather radar network", "hydrometeor scattering model", "Shape", "retrieval", "weather radar"]}, {"title": "A Laboratory Project on the Theory, Fabrication, and Characterization of a Silicon-On-Insulator Micro-Comb Drive Actuator With Fixed-Fixed Beams", "link": "https://ieeexplore.ieee.org/document/5716699/", "abstract": "A laboratory course on the theory, fabrication, and characterization of microelectromechanical systems (MEMS) devices for a multidisciplinary audience of graduate students at the University of New Mexico, Albuquerque, has been developed. Hands-on experience in the cleanroom has attracted graduate students from across the university's engineering and science campuses, including students from the Nano-Science and Micro Systems program, itself an interdisciplinary program. This course has been offered yearly for the last four years (since 2007) at the University of New Mexico. In one project from the class, a MEMS actuator is fabricated. This paper details the theory, fabrication steps, and characterization of a silicon-on-insulator (SOI) comb drive actuator that relies on fixed-fixed beams for its restoring force. Discussions include force generation by comb drives and a linear and nonlinear description of the restoring force applied by the fixed-fixed beams. Course assessment data is given from 79 students from three semesters, based on which the effectiveness of the laboratory project is evaluated.", "authors": [{"name": "Zayd C. Leseman", "affiliation": "Mechanical Engineering Department, University of New Mexico, Albuquerque, NM, USA"}, {"name": "Khawar Abbas", "affiliation": "Mechanical Engineering Department, University of New Mexico, Albuquerque, NM, USA"}], "tags": ["nonlinear restoring force description", "electrostatic actuators", "multidisciplinary course", "Fabrication", "electronic engineering education", "educational courses", "fixed-fixed beams", "silicon-on-insulator microcomb drive actuator fabrication", "microelectromechanical systems (MEMS)", "Curriculum development", "Springs", "microelectromechanical system", "MEMS actuator", "SOI comb drive actuator", "linear restoring force description", "microactuators", "laboratory project", "Micromechanical devices", "engineering education", "Laboratories", "graduate students", "interdisciplinary program", "Actuators", "further education", "Force", "silicon-on-insulator", "microfabrication", "force generation", "course assessment data"]}, {"title": "Improving the Teaching of Discrete-Event Control Systems Using a LEGO Manufacturing Prototype", "link": "https://ieeexplore.ieee.org/document/6072289/", "abstract": "This paper discusses the usefulness of employing LEGO as a teaching-learning aid in a post-graduate-level first course on the control of discrete-event systems (DESs). The final assignment of the course is presented, which asks students to design and implement a modular hierarchical discrete-event supervisor for the coordination layer of a complete automated manufacturing system (AMS) built using LEGO blocks. A design approach frequently used in manufacturing is introduced to unify design criteria and nomenclature. Software tools are provided for all calculation and translation tasks required for the implementation of the supervisor architecture in a programmable logic controller (PLC). The assignment reinforces all the basic concepts of supervisory control theory taught during the course. It provides hands-on experience of the advantages and disadvantages and of the important theoretical and practical issues related to the use of DES controllers in an engineering application.", "authors": [{"name": "Arturo Sanchez", "affiliation": "Unidad de Ingenieria Avanzada, Centro de Investigación y de Estudios Avanzados, Zapopan, Mexico"}, {"name": "Jorge Bucio", "affiliation": "Unidad de Ingenieria Avanzada, Centro de Investigación y de Estudios Avanzados, Zapopan, Mexico"}], "tags": ["discrete-event control systems teaching", "Computer architecture", "DES controllers", "complete automated manufacturing system", "Automated manufacturing systems (AMSs)", "discrete event systems", "Manufacturing systems", "educational courses", "control engineering computing", "control engineering education", "supervisory control theory", "AMS", "computer aided instruction", "software tools", "teaching", "modular hierarchical discrete-event supervisor", "LEGO blocks", "Raw materials", "programmable controllers", "PLC", "programmable logic controller", "coordination control", "teaching-learning aid", "Control systems", "post-graduate-level fírst course", "further education", "supervisory control theory (SCT)", "factory automation", "discrete-event systems (DESs)", "LEGO manufacturing prototype", "Workstations"]}, {"title": "Supporting Undergraduate Computer Architecture Students Using a Visual MIPS64 CPU Simulator", "link": "https://ieeexplore.ieee.org/document/6122467/", "abstract": "The topics of computer architecture are always taught using an Assembly dialect as an example. The most commonly used textbooks in this field use the MIPS64 Instruction Set Architecture (ISA) to help students in learning the fundamentals of computer architecture because of its orthogonality and its suitability for real-world applications. This paper shows how to use the EduMIPS64 visual CPU Simulator as a supporting tool for teaching the standard topics covered by an undergraduate course in computer architecture. The proposed approach is first compared to other similar works in the field, then after a short description of the simulator, the paper focuses on how it can be used for teaching specific topics in an undergraduate computer architecture course. This discussion is then followed by a quantitative assessment of the suitability of the simulator by means of a survey compiled by students themselves; the results show that EduMIPS64 is suitable for the purpose for which it was built-that is, supporting the learning process of computer architecture topics.", "authors": [{"name": "Davide Patti", "affiliation": "Dipartimento di Ingegneria Elettrica, Elettronica ed Informatica, University of Catania, Catania, Italy"}, {"name": "Fabrizio Fazzino", "affiliation": "NVIDIA, Inc., Bristol, UK"}, {"name": "Andrea Spadaccini", "affiliation": "Dipartimento di Ingegneria Elettrica, Elettronica ed Informatica, University of Catania, Catania, Italy"}, {"name": "Maurizio Palesi", "affiliation": "Kore University, Enna, Italy"}, {"name": "Vincenzo Catania", "affiliation": "Dipartimento di Ingegneria Elettrica, Elettronica ed Informatica, University of Catania, Catania, Italy"}], "tags": ["Assembly programming", "Computer architecture", "ISA", "Pipeline processing", "visual simulation", "instruction sets", "undergraduate computer architecture course", "distance learning", "Assembly", "educational courses", "text analysis", "Visualization", "instruction set architecture", "quantitative assessment", "textbook", "learning", "computer aided instruction", "teaching", "Computers", "User interfaces", "teaching methodology", "real-world application", "EduMIPS64", "Education", "further education", "visual MIPS64 CPU simulator", "microprocessor chips", "reduced instruction set computing", "computer science education", "instruction-set simulator"]}, {"title": "Lessons Learned in the Use of WIRIS Quizzes to Upgrade Moodle to Solve Electrical Circuits", "link": "https://ieeexplore.ieee.org/document/6132438/", "abstract": "WIRIS quizzes are an online mathematics tool for educational purposes that upgrade Moodle quizzes and allow the development of personalized quizzes using random data and conditional instructions. WIRIS quizzes can be used in any mathematics or science degree; their complex operators allow it to be used to solve electrical circuits. This tool promotes autonomous student learning and enables teachers to monitor that learning and make adjustments if necessary. Therefore, this tool improves teaching quality. It can also be used as an assessment tool by both the teacher and the student. This paper shows how WIRIS quizzes have been integrated into the virtual campus of the Polytechnic University of Catalonia (UPC), Spain, to teach electrical circuits. Lessons learned in performing and using WIRIS quizzes with second-year students at the UPC are shown.", "authors": [{"name": "Francisco J. Arcega Solsona", "affiliation": "R&D&I EduQTech group, University of Zaragoza, Zaragoza, Spain"}, {"name": "Antoni Font Piera", "affiliation": "Electrical Engineering Department, Polytechnic University of Catalonia (UPC), Terrassa, Spain"}, {"name": "Montserrat Corbalan Fuertes", "affiliation": "R&D&I EduQTech group, Polytechnic University of Catalonia (UPC), Terrassa, Spain"}, {"name": "Inmaculada Plaza Garcia", "affiliation": "R&D&I EduQTech group, University of Zaragoza, Teruel, Spain"}, {"name": "Santiago Bogarra Rodriguez", "affiliation": "Electrical Engineering Department, Polytechnic University of Catalonia (UPC), Terrassa, Spain"}], "tags": ["e-learning", "Educational institutions", "WIRIS quizzes Moodle", "mathematics", "Polytechnic University of Catalonia", "Mathematical model", "Spain", "WIRIS quizzes", "Distance learning", "electrical circuits", "random data", "Moodle quizzes", "virtual campus", "Electrical engineering", "online mathematics tool", "training", "computer aided instruction", "UPC", "electrical engineering education", "Calculators", "Training", "Syntactics", "conditional instructions"]}, {"title": "Student Evaluation of Teaching Effectiveness of a Nationwide Innovative Education Program on Image Display Technology", "link": "https://ieeexplore.ieee.org/document/6105601/", "abstract": "The study presented here explored a student evaluation of the teaching effectiveness of a nationwide innovative education program on image display technology in Taiwan. Using survey data collected through an online questionnaire system, covering 165 classes across 30 colleges and universities in Taiwan, the study aimed to understand the teaching effectiveness of this particular educational program based on learners' viewpoints. Each item included in the student evaluation comprised four subscales: student knowledge and skill, satisfaction with the curriculum and teaching, professional learning, and general learning of the course. Moreover, the influences of student characteristics and type of school on the outcome of such an evaluation were considered. T-test and one-way ANOVA results confirm the effects of these influences. The implications for effective use of student evaluation of teaching in enhancing university-level teaching and learning of image display technology are discussed.", "authors": [{"name": "Li-An Chiu", "affiliation": "Department of Bio-Industry Communication and Development, National Taiwan University, Taipei, Taiwan"}, {"name": "An-Bang Wang", "affiliation": "Graduate Institute of Applied Mechanics, National Taiwan University, Taipei, Taiwan"}, {"name": "Hsiu-Ping Yueh", "affiliation": "Department of Bio-Industry Communication and Development, National Taiwan University, Taipei, Taiwan"}, {"name": "San-Liang Lee", "affiliation": "Department of Electronic Engineering and the Graduate Institute of Electro-Optical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan"}, {"name": "Tzy-Ling Chen", "affiliation": "Graduate Institute of Bio-Industry Management, National Chung Hsing University, Taichung, Taiwan"}], "tags": ["System-on-a-chip", "student skill", "Educational institutions", "student knowledge", "survey data", "display instrumentation", "educational institutions", "image display technology", "Educational programs", "student evaluation of teaching (SET)", "educational courses", "Reliability", "T-test", "colleges", "engineering students", "general learning", "teaching", "online questionnaire system", "engineering education", "nationwide innovative education program", "Psychology", "Training", "Taiwan", "image display technology (IDT)", "university teaching", "universities", "professional learning", "teaching effectiveness", "Analysis of variance", "one-way ANOVA", "student evaluation"]}, {"title": "The Use of Enhanced Guided Notes in an Electric Circuit Class: An Exploratory Study", "link": "https://ieeexplore.ieee.org/document/5716700/", "abstract": "This study was conducted to evaluate students' (\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">n</i>\n=70) learning performance after their participation in lectures using enhanced guided notes (EGN) in an electric circuits course for non-electrical engineering students. Unlike traditional guided notes, EGN include questions that prompt students to evaluate their metacognitive knowledge. The results of the study demonstrate a significant increase in student learning performance with the application of EGN, as measured by an AC/DC Circuit Concept Inventory. Students reacted positively to the use of the EGN in a survey given to assess their learning experience.", "authors": [{"name": "Oenardi Lawanto", "affiliation": "Engineering and Technology Education, Utah State University, Logan, UT, USA"}], "tags": ["electric circuit class", "electric circuit course", "Problem-solving", "Mathematical model", "learning performance", "cognition", "electronic engineering education", "metacognitive knowledge", "Frequency measurement", "student learning performance", "problem solving", "Electrical engineering", "enhanced guided note", "enhanced guided notes (EGN)", "electric circuit", "AC-DC circuit concept", "nonelectrical engineering student", "Engineering students", "Materials", "Conceptual information"]}, {"title": "The 18 mm$^{2}$  Laboratory: Teaching MEMS Development With the SUMMiT Foundry Process", "link": "https://ieeexplore.ieee.org/document/6189763/", "abstract": "This paper describes the goals, pedagogical system, and educational outcomes of a three-semester curriculum in microelectromechanical systems (MEMS). The sequence takes engineering students with no formal MEMS training and gives them the skills to participate in cutting-edge MEMS research and development. The evolution of the curriculum from in-house fabrication facilities to an industry-standard foundry process affords an opportunity to examine the pedagogical benefits of the latter approach. Outcomes that are assessed include the number of students taking the classes, the quality of work produced by students, and the research that has emanated from class projects. Three key elements of the curriculum are identified: 1) extensive use of virtual design and process simulation software tools; 2) fabrication of student-designed devices for physical characterization and testing; and 3) integration of a student design competition. This work strongly leveraged the university outreach activities of Sandia National Laboratories (SNL) and the SNL SUMMiT MEMS design and fabrication system. SNL provides state-of-the-art design tools and device fabrication and hosts a yearly nationwide student design competition. Student MEMS designs developed using computer-aided design (CAD) and finite element analysis (FEA) software are fabricated at SNL and returned on 18-mm die modules for characterization and testing. One such module may contain a dozen innovative student projects. Important outcomes include an increase in enrollment in the introductory MEMS class, external research funding and archival journal publications arising from student designs, and consistently high finishes in the SNL competition. Since the SNL offerings are available to any US college or university, this curriculum is transportable in its current form.", "authors": [{"name": "Richard O. Gale", "affiliation": "Department of Electrical and Computer Engineering, Texas Tech University, Lubbock, Texas, United States"}, {"name": "Jordan M. Berg", "affiliation": "Department of Mechanical Engineering, Texas Tech University, Lubbock, Texas, United States"}, {"name": "Tim Dallas", "affiliation": "Department of Electrical Engineering, Texas Tech University, Lubbock, Texas, United States"}], "tags": ["FEA software", "Educational institutions", "micromechanical devices", "CAD", "Solid modeling", "journal publication", "technology CAD (electronics)", "educational institutions", "Fabrication", "electronic engineering education", "computer-aided fabrication design", "pedagogical system", "finite element analysis", "process simulation software", "Software", "computer aided instruction", "laboratories", "virtual design", "teaching", "student-designed device", "microelectromechanical system", "in-house fabrication facility", "three-semester curriculum", "SUMMiT Foundry Process", "Micromechanical devices", "Laboratories", "SNL", "industry-standard foundry process", "module", "finite element methods", "Foundries", "Sandia National Laboratories", "US college", "Educational technologies", "MEMS", "cutting-edge MEMS research and development", "microfabrication", "teaching MEMS development", "microelectromechanical systems", "finite element analysis software", "university outreach activity"]}, {"title": "An Educational Laboratory for Digital Control and Rapid Prototyping of Power Electronic Circuits", "link": "https://ieeexplore.ieee.org/document/6036198/", "abstract": "This paper describes a new educational power electronics laboratory that was developed primarily to reinforce experimentally the fundamental concepts presented in a power electronics course. The developed laboratory combines theoretical design, simulation studies, digital control, fabrication, and verification of power-electronic circuits based on a set of hardware and software tools. The salient feature of the laboratory is that it takes the students through a step-by-step design, implementation, and digital control procedure for a set of power electronic circuits. A detailed description of the tools along with their use in the developed laboratory is presented.", "authors": [{"name": "Maryam Saeedifard", "affiliation": "School of Electrical and Computer Engineering, Purdue University, West Lafayette, IN, USA"}, {"name": "Sanghun Choi", "affiliation": "School of Electrical and Computer Engineering, Purdue University, West Lafayette, IN, USA"}], "tags": ["micro-controller", "laboratory techniques", "hardware-software codesign", "electronic engineering education", "Power electronics", "Software tools", "MATLAB/Simulink environment", "MATLAB", "power electronics", "power electronic circuits", "rapid prototyping (industrial)", "digital control", "Laboratories", "hardware software tools", "Graphical user interfaces", "Libraries", "rapid prototyping", "Digital control", "educational laboratory"]}, {"title": "Supervised Coursework as a Way of Improving Motivation in the Learning of Digital Electronics", "link": "https://ieeexplore.ieee.org/document/6189764/", "abstract": "This paper presents a series of activities and educational strategies related to the teaching of digital electronics in computer engineering. The main objective of these methodologies was to develop a final tutored coursework to be carried out by the students in small teams. This coursework was conceived as consisting of advanced problems or small projects that should serve as a compendium of the knowledge acquired during the course, with competition between the groups and students' assuming a professional role being key incentive factors. The result was that students had a high degree of motivation and engagement in the activity, as well as improved knowledge because of the self-learning required in carrying out the coursework.", "authors": [{"name": "Raúl Rengel", "affiliation": "Department of Applied Physics, University of Salamanca, Salamanca, Spain"}, {"name": "Beatriz G. Vasallo", "affiliation": "Department of Applied Physics, University of Salamanca, Salamanca, Spain"}, {"name": "María J. Martin", "affiliation": "Department of Applied Physics, University of Salamanca, Salamanca, Spain"}], "tags": ["Educational institutions", "knowledge improvement", "incentive factors", "student engagement", "supervised tutored coursework", "problem-based learning (PBL)", "electronic engineering education", "digital electronics teaching", "Digital circuits", "motivation degree improvement", "educational strategies", "self-learning", "digital electronics learning", "computer aided instruction", "tutored coursework", "teaching", "Computers", "Laboratories", "Logic gates", "computer engineering", "Digital electronics education", "motivation techniques", "professional role", "computer science education", "Physics"]}, {"title": "Learning Intelligent Genetic Algorithms Using Japanese Nonograms", "link": "https://ieeexplore.ieee.org/document/5875911/", "abstract": "An intelligent genetic algorithm (IGA) is proposed to solve Japanese nonograms and is used as a method in a university course to learn evolutionary algorithms. The IGA combines the global exploration capabilities of a canonical genetic algorithm (CGA) with effective condensed encoding, improved fitness function, and modified crossover and mutation. In this paper, the condensed encoding ensures that the chromosome is a feasible solution in all rows for Japanese nonograms. In the reconstruction process of a Japanese nonogram, the numbers in the left column are used as encoding conditions, and the numbers in the top row with the improved fitness function are employed to evaluate the reconstruction result. From the computational experiments, the proposed IGA approach is applied to solve Japanese nonograms effectively, with better results than using a CGA. The students of the Department of Computer Science, National Pingtung University of Education, Taiwan, have gained practical experience of applying evolutionary algorithms to solve Japanese nonograms using both the proposed IGA and a CGA. The students learn that the IGA can find the right solution of the puzzle effectively, but the CGA cannot.", "authors": [{"name": "Jinn-Tsong Tsai", "affiliation": "Department of Computer Science, National Ping Tung University of Education, Ping Tung, Taiwan"}, {"name": "Ping-Yi Chou", "affiliation": "Department of Computer Science, National Ping Tung University of Education, Ping Tung, Taiwan"}, {"name": "Jia-Cen Fang", "affiliation": "Department of Computer Science, National Ping Tung University of Education, Ping Tung, Taiwan"}], "tags": ["pedagogical issues", "Encoding", "genetic algorithms (GAs)", "condensed encoding", "Genetic algorithms", "evolutionary computation", "canonical genetic algorithm", "computer aided instruction", "Japanese nonograms", "Optimization", "evolutionary algorithms", "CGA", "genetic algorithms", "learning intelligent genetic algorithms", "improved fitness function", "Education", "Evolutionary computation", "IGA", "Computer science", "Condensed encoding", "Biological cells", "teaching sequence"]}, {"title": "Technological Literacy Learning With Cumulative and Stepwise Integration of Equations Into Electrical Circuit Diagrams", "link": "https://ieeexplore.ieee.org/document/6172537/", "abstract": "Technological literacy education involves the teaching of basic engineering principles and problem solving, including elementary electrical circuit analysis, to non-engineering students. Learning materials on circuit analysis typically rely on equations and schematic diagrams, which are often unfamiliar to non-engineering students. The goal of this experimental study was to investigate the effects of the integration of equations into circuit diagrams on the learning of non-engineering undergraduate students. This experimental study compared three integration designs. In the cumulative integrated design, as each practice problem solution progressed, the equations were cumulatively integrated into the circuit diagram. In the stepwise integrated design, only those equations relevant to the present step of the problem were integrated into the circuit diagram; previously displayed equations were moved to an adjacent frame and recorded there. The nonintegrated design recorded all equations in the adjacent frame throughout each of the problems. Student learning was measured with a problem-solving near-transfer and far-transfer post-test. Students rated the helpfulness of the diagrams and difficulty of the instructional program. Results indicated that participants in the cumulative integrated condition scored significantly higher on the near-transfer post-test and marginally significantly higher on the far-transfer post-test compared to the stepwise and nonintegrated conditions. Findings indicate that circuit analysis instruction for non-engineering students should integrate equations into circuit diagrams in a cumulative fashion so as to avoid the split-attention effect for both the previously displayed equations as well as the equations for the present problem step.", "authors": [{"name": "Roxana Moreno", "affiliation": "Educational Psychology Program, University of New Mexico, Albuquerque, NM, USA"}, {"name": "Gamze Ozogul", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Amy M. Johnson", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Martin Reisslein", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}], "tags": ["Problem-solving", "Mathematical model", "Resistance", "circuit analysis instruction", "Reliability", "spatial contiguity", "Diagram-equation integration", "elementary electrical circuit analysis", "Circuit analysis", "electrical circuit analysis", "teaching", "Equations", "nonengineering undergraduate student", "technological literacy learning", "technological literacy education", "cumulative integration", "circuit diagrams", "further education", "network analysis", "Materials", "electrical circuit diagram"]}, {"title": "Sending Learning Pills to Mobile Devices in Class to Enhance Student Performance and Motivation in Network Services Configuration Courses", "link": "https://ieeexplore.ieee.org/document/5741748/", "abstract": "Teaching electrical and computer software engineers how to configure network services normally requires the detailed presentation of many configuration commands and their numerous parameters. Students tend to find it difficult to maintain acceptable levels of motivation. In many cases, this results in their not attending classes and not dedicating enough time to acquire the required competencies. This paper describes a successful experiment that was able to improve student class attendance, performance, and motivational patterns by using mobile devices in class to provide students with contextualized learning pills. A learning pill is a simple exercise that summarizes some of the key concepts explained in class and promotes reflection and self-study. Each student attending a particular lecture or laboratory session automatically receives a learning pill on his or her mobile phone just after the related concept has been presented. This paper details the scenario used in the experiment and analyzes the performance and motivational patterns of 170 students at the Higher Polytechnic School, Carlos III University of Madrid, Leganes, Spain.", "authors": [{"name": "Pedro J. Munoz-Merino", "affiliation": "Carlos III of Madrid University, Leganes, Spain"}, {"name": "Carlos Delgado Kloos", "affiliation": "Carlos III Technical University of Madrid, Leganes, Spain, Carlos III of Madrid University, Leganes, Spain"}, {"name": "Mario Munoz-Organero", "affiliation": "Carlos III Technical University of Madrid, Leganes, Spain, Carlos III of Madrid University, Leganes, Spain"}], "tags": ["motivational patterns", "configuration commands", "student class attendance", "student performance", "network services configuration courses", "Educational technology", "contextualized learning pills", "Higher Polytechnic School", "Electronic learning", "higher education", "mobile phone", "computer aided instruction", "electrical engineering education", "Performance evaluation", "mobile devices", "Telematics", "mobile handsets", "student experiments", "pattern recognition", "educational aids", "learning systems", "computer software engineers", "Conferences", "further education", "prediction methods", "Mobile communication", "electrical engineers", "Mobile handsets"]}, {"title": "FPGA-Based Laboratory Assignments for NoC-Based Manycore Systems", "link": "https://ieeexplore.ieee.org/document/5951809/", "abstract": "Manycore systems have emerged as being one of the dominant architectural trends in next-generation computer systems. These highly parallel systems are expected to be interconnected via packet-based networks-on-chip (NoC). The complexity of such systems poses novel and exciting challenges in academia, as teaching their design requires the students to understand a large number of NoC-based design-space parameters. Moreover, the industry has only recently attempted to design large-scale NoC-based manycore prototypes; the use of NoCs, therefore, has not yet reached a mature stage. Consequently, academia still lacks standardized tools and methodologies to teach NoC-based manycore systems, which, in turn, demand a solid educational background in a wide variety of areas, thus raising several teaching challenges. This paper presents an FPGA-based teaching framework composed of a sequence of laboratory assignments. The framework provides instructors with a practical teaching approach and helps them teach students how to emulate NoC-based manycore systems and how to evaluate and explore their design parameters. The proposed framework can be integrated into existing senior undergraduate courses or can be taught as an independent course. The course has been taught three times at the University of Cyprus, and initial course evaluation results, instructor observations, and suggested grading policies are also provided.", "authors": [{"name": "Theocharis Theocharides", "affiliation": "Department of Electrical and Computer Engineering, University of Cyprus, Nicosia, Cyprus"}, {"name": "Maria K. Michael", "affiliation": "Department of Electrical and Computer Engineering, University of Cyprus, Nicosia, Cyprus"}, {"name": "Christos Ttofis", "affiliation": "Department of Electrical and Computer Engineering, University of Cyprus, Nicosia, Cyprus"}], "tags": ["System-on-a-chip", "manycore systems", "Computer architecture", "educational background", "next-generation computer systems", "multiprocessing systems", "Routing", "field programmable gate arrays", "FPGA", "next generation networks", "laboratory assignments", "Switches", "networks-on-chip (NoC)", "design-space parameters", "Debugging", "Laboratories", "network-on-chip", "embedded systems design", "field programmable gate arrays (FPGAs)", "Nickel", "NoC-based manycore systems", "packet-based networks-on-chip"]}, {"title": "Redesigning the Assessment of an Entrepreneurship Course in an Information Technology Degree Program: Embedding Assessment for Learning Practices", "link": "https://ieeexplore.ieee.org/document/6204207/", "abstract": "Entrepreneurship is a novel course in the curriculum for students in the Information Technology (IT) degree program at La Trobe University, Bundoora, Australia. In comparison to other IT-related courses, the Entrepreneurship course seeks to develop business management knowledge and skills; its learning design is thus different to that of other courses in the IT program. The concept of constructive alignment for curriculum renewal suggests that there are several components of good course design. In this paper, we use the principles of constructive alignment to analyze and redesign several components of the Entrepreneurship course. The focus is on reviewing and aligning the assessment tasks to ensure an effective evaluation and the achievement of student learning outcomes. Since assessment drives student learning, we describe the innovative assessment tasks that were implemented to enhance student learning, provide the rationale for the design of these tasks as supported by the current literature, and reflect on possible future improvements. The course redesign process and the constructive alignment and innovative assessment can be applied to other courses in the field, and more broadly to curriculum, teaching, and learning in higher education.", "authors": [{"name": "Judith Lyons", "affiliation": "Department of Computer Science and Engineering, La Trobe University, Bundoora, Victoria, Australia"}, {"name": "Eric Pardede", "affiliation": "Department of Computer Science and Engineering, La Trobe University, Bundoora, Victoria, Australia"}], "tags": ["constructive alignment", "Educational institutions", "IT degree program", "information technology (IT)", "educational institutions", "curriculum", "information technology", "educational courses", "entrepreneurship", "entrepreneurship course", "course redesign process", "innovative assessment", "commerce", "information technology degree program", "Assessment", "Bundoora", "learning", "business management knowledge", "higher education", "business management skills", "management education", "teaching", "Information technology", "learning practices", "La Trobe University", "student learning outcomes", "IT-related courses", "Innovation management", "Conferences", "further education", "computer science education", "course design", "Australia"]}, {"title": "A Capstone Course on Agile Software Development Using Scrum", "link": "https://ieeexplore.ieee.org/document/5765710/", "abstract": "In this paper, an undergraduate capstone course in software engineering is described that not only exposes students to agile software development, but also makes it possible to observe the behavior of developers using Scrum for the first time. The course requires students to work as Scrum Teams, responsible for the implementation of a set of user stories defined by a project domain expert playing the role of the Product Owner. During the course, data on project management activities are collected in order to analyze the amount of work completed, compliance with the release and iteration plans, productivity, ability in effort estimation, and the like. The paper discusses the achievement of teaching goals and provides empirical evaluation of students' progress in estimation and planning skills. A summary of lessons learned and recommendations is given, reflecting the issues to be considered when teaching courses in agile software development. Surveys of students have shown that they were overwhelmingly positive about the course, indicating that the course fully met or even exceeded their expectations.", "authors": [{"name": "Viljan Mahnic", "affiliation": "Faculty of Computer and Information Science, University of Ljubljana, Ljubljana, Slovenia"}], "tags": ["software engineering education", "Educational institutions", "Scrum", "Software engineering", "Estimation", "teaching goal", "Programming", "Agile software development", "educational courses", "planning skill", "agile software development", "effort estimation", "software prototyping", "Software", "undergraduate capstone course", "project management activities", "teaching", "project domain expert", "iteration plan", "Scrum team", "project management", "software engineering", "empirical evaluation", "capstone course", "productivity", "product owner", "Planning", "computer science education"]}, {"title": "Combining Self-Explaining With Computer Architecture Diagrams to Enhance the Learning of Assembly Language Programming", "link": "https://ieeexplore.ieee.org/document/6194980/", "abstract": "This paper investigates the impact of combining self explaining (SE) with computer architecture diagrams to help novice students learn assembly language programming. Pre- and post-test scores for the experimental and control groups were compared and subjected to covariance (ANCOVA) statistical analysis. Results indicate that the SE-plus-diagram approach had a significant effect on student achievement and improved novice students' learning experience by increasing their interest and participation in the course and helping them to develop assembly programming skills.", "authors": [{"name": "Yen-Chu Hung", "affiliation": "Department of Computer Science and Information Engineering, National Chiayi University, Chiayi City, Taiwan"}], "tags": ["Assembly language programming", "Computer architecture", "Problem-solving", "diagrams method", "post-test scores", "assembly language programming learning", "Assembly", "educational courses", "covariance statistical analysis", "programming", "self-explaining", "ANCOVA", "assembly language", "SE-plus-diagram approach", "computer architecture diagrams", "computer aided instruction", "pretest score", "assembly programming skills", "covariance analysis", "Microprocessors", "novice student learning experience", "self-explaining (SE)", "computer architecture", "Programming profession", "computer science education", "Materials"]}, {"title": "Student Usage Patterns and Perceptions for Differentiated Lab Exercises in an Undergraduate Programming Course", "link": "https://ieeexplore.ieee.org/document/5993470/", "abstract": "Differentiated instruction in the form of tiered take-home lab exercises was implemented for students of an undergraduate-level programming course. This paper attempts to uncover the perceptions and usage patterns of students toward these new lab exercises using a comprehensive survey. Findings reveal that these tiered exercises are generally very well received and preferred over their traditional “one size fits all” counterparts. Although the study does not show that tiered exercises have improved proficiency or scores, it does seem to indicate higher student engagement and motivation levels. Based on the survey results, a list of recommendations is put forth for the structure and format of tiered exercises that can be applied to future offerings of this programming course as well as to other similar courses.", "authors": [{"name": "Heng Ngee Mok", "affiliation": "School of Information Systems, Singapore Management University, Singapore"}], "tags": ["differentiated instruction (DI)", "Educational institutions", "student perception", "tiered take-home lab exercise", "educational activities", "student engagement", "Information systems", "educational courses", "programming", "differentiated learning", "Correlation", "Software", "undergraduate level programming course", "higher education", "psychology", "student motivation level", "software engineering", "tiered exercise structure", "differentiated instruction", "differentiated lab exercises", "tiered exercise format", "further education", "student usage pattern", "Computer science education", "Programming profession", "student engagement and satisfaction", "computer science education", "teaching/learning strategies"]}, {"title": "Methodology of Change Assimilation in Technology Education—A Case Study", "link": "https://ieeexplore.ieee.org/document/5937029/", "abstract": "This paper describes a four-year program to advance electrical and electronics studies and their implementation in eight northern Israeli high schools. The program was begun with four schools participating, increasing to eight schools toward the end. This paper presents the teaching and learning processes of teachers and students during the program. Within the program's framework, learning materials and teaching guides were written, teachers were given in-school training and guidance, and meetings were held with teachers and headmasters so as to promote and track performance in the field. At the end of the program, more than 200 12th-grade students from eight high schools successfully passed their matriculation exam on large-scale projects. About 150 of these students had studied electronics, and the other 50 studied electricity. Prior to this program, only about 40 final projects in these fields had been undertaken in the State of Israel. Today, 10 years after the program, some 2000 final projects are submitted each year to matriculation exams.", "authors": [{"name": "Yaron Doppelt", "affiliation": "Department of Mechanical Engineering, Ministry of Education, Atzmon-Misgav, Israel"}, {"name": "Nissim Sabag", "affiliation": "Department of Electrical and Electronics Engineering, ORT Braude College of Engineering, Karmiel, Israel"}], "tags": ["Educational institutions", "12th-grade students", "learning materials", "educational institutions", "technology education", "teaching process", "electronic engineering education", "Interviews", "design-based learning", "Change assimilation", "large-scale projects", "teaching guides", "project-based learning (PBL)", "training", "learning process", "in-school guidance", "Electricity", "Lead", "teaching", "change assimilation", "electrical studies", "Israeli high schools", "matriculation exam", "in-school training", "electronics studies", "Training", "teacher training", "intervention program", "Materials"]}, {"title": "Localization of Mobile Robots Using an Extended Kalman Filter in a LEGO NXT", "link": "https://ieeexplore.ieee.org/document/5782966/", "abstract": "The inspiration for this paper comes from a successful experiment conducted with students in the “Mobile Robots” course in the fifth year of the integrated Master's program in the Department of Electrical and Computer Engineering, Faculty of Engineering, University of Porto (FEUP), Porto, Portugal. One of the topics in this Mobile Robots course is “ Localization of Mobile Robots using the Extended Kalman Filter in a LEGO NXT,” which gives the students the opportunity to study the concepts of localization. This experiment comes within the framework of teaching localization concepts in mobile robotics and focuses primarily on explaining the Kalman filter concept. It involves a specific tool developed by the authors and based on LEGO NXT technology. The work presented here could be a helpful guide for teaching concepts related to localization in mobile robotics to ensure adequate understanding of the concept and of the use of the extended Kalman filter (EKF). The LegoFeup robot described here was built using a LEGO Mindstorms NXT and tested both in simulation and in real scenarios. Based on the results obtained, the authors concluded that the developed tool is effective in motivating students. The implementation of the tool, the structure of the Mobile Robots course, and the criteria for student assessment are described in this paper.", "authors": [{"name": "Aníbal Matos", "affiliation": "Department of Electrical and Computer Engineering Faculty of Engineering, University of Porta, Porto, Portugal"}, {"name": "António Paulo Moreira", "affiliation": "Department of Electrical and Computer Engineering Faculty of Engineering, University of Porta, Porto, Portugal"}, {"name": "Miguel Pinto", "affiliation": "Department of Electrical and Computer Engineering Faculty of Engineering, University of Porta, Porto, Portugal"}], "tags": ["robot sensing systems", "LEGO Mindstorms NXT", "educational courses", "LegoFeup robot", "Robots", "teaching localization", "Robot sensing systems", "Educational robots", "Mobile robots", "EKF", "Probabilistic logic", "Education", "robot kinematics", "extended kalman filter", "state estimation", "Kalman filters", "LEGO NXT", "mobile robots", "robot programming"]}, {"title": "Experiences in the Application of Project-Based Learning in a Switching-Mode Power Supplies Course", "link": "https://ieeexplore.ieee.org/document/5727925/", "abstract": "This paper presents the introduction of problem-based learning (PBL) in a power electronics course at the University of Oviedo, Gijón, Spain, by means of two practical projects: the design and construction of a switching-mode power supply (SMPS) prototype and the static study of a dc-dc converter topology. The goal of this innovation was for students to apply in practice the knowledge they had acquired in theory classes. PBL is known to be a motivating, problem-centered teaching method that brings the real professional world closer to the student. The instructors thus considered PBL to be the most suitable methodology to obtain the desired results. The underlying methodology, task planning, and assessment of these projects will be presented. Furthermore, the influence of the introduction of PBL in practical sessions versus the traditional teaching method will be discussed. Finally, the instructors' reflections and conclusions regarding the application of PBL in this course from 2007-2009 will be presented.", "authors": [{"name": "Miguel Rodriguez", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}, {"name": "Pablo F. Miaja", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}, {"name": "Marta M. Hernando", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}, {"name": "Manuel Arias", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}, {"name": "Diego G. Lamar", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}, {"name": "Aitor Vazquez", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}, {"name": "Alberto Rodriguez", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}, {"name": "Javier Sebastian", "affiliation": "Power Supply System Group, Departamento de Ingeniería Eléctrica, Electrónica, de Computadores y Sistemas, University of Oviedo, Gijon, Spain"}], "tags": ["Prototypes", "Switched-mode power supply", "innovation", "power electronics course", "Power electronics", "innovation management", "project-based learning (PBL)", "power electronics", "Switches", "problem-centered teaching method", "teaching", "practical sessions", "switching-mode power supply (SMPS)", "Topology", "Education", "switching-mode power supplies course", "SMPS", "switched mode power supplies", "significant knowledge", "Converters", "project-based learning"]}, {"title": "Fair and Square Computation of Inverse  $ {\\cal Z}$-Transforms of Rational Functions", "link": "https://ieeexplore.ieee.org/document/6047582/", "abstract": "All methods presented in textbooks for computing inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transforms of rational functions have some limitation: 1) the direct division method does not, in general, provide enough information to derive an analytical expression for the time-domain sequence \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">x</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">k</i>\n) whose \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transform is \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">X</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">z</i>\n) ; 2) computation using the inversion integral method becomes labored when \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">X</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">z</i>\n)\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">zk</i>\n-1 has poles at the origin of the complex plane; 3) the partial-fraction expansion method, in spite of being acknowledged as the simplest and easiest one to compute the inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transform and being widely used in textbooks, lacks a standard procedure like its inverse Laplace transform counterpart. This paper addresses all the difficulties of the existing methods for computing inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n -transforms of rational functions, presents an easy and straightforward way to overcome the limitation of the inversion integral method when \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">X</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">z</i>\n)\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">zk</i>\n-1 has poles at the origin, and derives five expressions for the pairs of time-domain sequences and corresponding \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transforms that are actually needed in the computation of inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n -transform using partial-fraction expansion.", "authors": [{"name": "Marcos Vicente Moreira", "affiliation": "COPPE-Programa de Engenharia Elétrica, Electrical Engineering, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brazil"}, {"name": "João Carlos Basilio", "affiliation": "COPPE-Programa de Engenharia Elétrica, Electrical Engineering, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brazil"}], "tags": ["partial-fraction expansion method", "inversion integral method", "inverse Laplace transform", "time-domain sequences", "Poles and zeros", "inverse transforms", "Time domain analysis", "Laplace equations", "inverse $ {\\cal Z}$-transformation", "inverse Z-transforms", "Convergence", "Polynomials", "Z transforms", "discrete-time signals", "teaching methodology", "Control education", "discrete-time systems", "Education", "rational functions"]}, {"title": "Introducing Programmable Logic to Undergraduate Engineering Students in a Digital Electronics Course", "link": "https://ieeexplore.ieee.org/document/6044735/", "abstract": "Due to significant technological advances and industry requirements, many universities have introduced programmable logic and hardware description languages into undergraduate engineering curricula. This has led to a number of logistical and didactical challenges, in particular for computer science students. In this paper, the integration of some programmable logic concepts into an introductory digital electronics course is presented. The proposed optional lab develops a printed circuit board that implements a programmable logic block. Another contribution is the collaborative problem-solving methodology used to achieve this goal. Surveys completed by the students, and their final grades, show that the lab has improved the quality of their education and has contributed to a successful integration of programmable logic concepts in an introductory digital electronics course. Because of its demands on students' time and effort, the lab favors the most motivated students. This suggests future research on a proposal for a lab that would be feasible within the time constraints for even the least motivated students.", "authors": [{"name": "Elías Todorovich", "affiliation": "Instituto de Investigación en Tecnología Informática Avanzada (INTIA), Universidad Nacional del Centro de la Provincia de Buenos Aires, Tandil, Argentina"}, {"name": "Martín Vazquez", "affiliation": "Instituto de Investigación en Tecnología Informática Avanzada (INTIA), Universidad Nacional del Centro de la Provincia de Buenos Aires, Tandil, Argentina"}, {"name": "José A. Marone", "affiliation": "Instituto de Investigación en Tecnología Informática Avanzada (INTIA), Universidad Nacional del Centro de la Provincia de Buenos Aires, Tandil, Argentina, Consejo Nacional de Investigaciones Científicas y Técnicas, Caba, Argentina"}], "tags": ["Educational institutions", "Computer architecture", "educational institutions", "collaborative problem solving", "electronic engineering education", "hardware description languages", "programmable logic", "educational courses", "printed circuit board", "Field programmable gate arrays", "Routing", "problem solving", "printed circuits", "programmable logic devices", "undergraduate engineering curricula", "Active teaching", "digital electronics", "engineering education", "Laboratories", "programmable logic block", "Multiplexing", "collaborative problem-solving methodology", "digital electronics course", "undergraduate engineering students", "computer science students"]}, {"title": "Application of Project-Based Learning (PBL) to the Teaching of Electrical Power Systems Engineering", "link": "https://ieeexplore.ieee.org/document/6179321/", "abstract": "Project-based learning (PBL), a learning environment in which projects drive learning, has been successfully used in various courses in the educational programs of different disciplines. However, concerns have been raised as to the breadth of the content covered and, in particular, whether PBL can be applied to specialized subjects without compromising the coverage of the required technical content. This paper discusses the advantages and drawbacks of using the PBL methodology in teaching specialized subjects in electrical power engineering, based on the authors' reflections and student feedback. The design and delivery of a PBL-based course in power system modeling and analysis is used as an example. It is asserted that proper usage of PBL makes it possible to deliver both technical content and generic professional skills in a specialized course.", "authors": [{"name": "Mohammad Reza Hesamzadeh", "affiliation": "Department of Power Systems, Royal Institute of Technology (KTH), Stockholm, Sweden"}, {"name": "Nasser Hosseinzadeh", "affiliation": "Department of Electrical Engineering, Swinburne University of Technology, Hawthorn, Vic., Australia"}], "tags": ["specialized course", "generic professional skills", "Portfolios", "Power systems", "PBL", "PBL-based course", "power engineering education", "teaching", "PBL methodology", "engineering education", "Curriculum design", "professional aspects", "Laboratories", "educational programs", "portfolio assessment", "electrical power systems engineering", "technical", "Education", "power system modeling and analysis", "Power engineering", "Power system modeling", "learning environment", "power system analysis", "electrical engineering", "project-based learning", "Australia"]}, {"title": "Problem-Based Learning in Wind Energy Using Virtual and Real Setups", "link": "https://ieeexplore.ieee.org/document/5770190/", "abstract": "The use of wind energy is now an established fact, and many educational institutions are introducing this topic into their engineering studies. Problem-based learning (PBL), as a student-centered instructional approach, has contributed to important developments in engineering education over the last few years. This paper presents the experience of a problem-based learning approach within the context of teaching wind energy conversion systems for electricity generation at an Electrical and Electronic Master's degree level. Students were given the problem of finding the response of a wind turbine to a grid fault. Groups of three students worked on a cooperative learning project for 15 weeks, with the instructor providing resource assistance and information at all stages of the work. Two tools were designed to help the students: a virtual wind turbine simulator and a real wind turbine setup. Both experimental tools are described, and the results obtained by the students are discussed. The results show that the students valued both tools and were able to address problems at a high cognitive level.", "authors": [{"name": "Jaime Alonso-Martinez", "affiliation": "Department of Electrical Engineering, Universidad Carlos III de Madrid, Leganes, Madrid, Spain"}, {"name": "David Santos-Martin", "affiliation": "Department of Electrical Engineering, Universidad Carlos III de Madrid, Leganes, Madrid, Spain"}, {"name": "Santiago Arnaltes", "affiliation": "Department of Electrical Engineering, Universidad Carlos III de Madrid, Leganes, Madrid, Spain"}, {"name": "Joaquin Eloy-Garcia Carrasco", "affiliation": "Department of Electrical Engineering, Universidad Carlos III de Madrid, Leganes, Madrid, Spain"}], "tags": ["resource assistance", "wind energy conversion systems", "electricity generation", "cooperative learning project", "Generators", "Blades", "problem-based learning (PBL)", "laboratory setup", "simulator", "Wind energy", "wind turbines", "grid fault", "wind power", "power engineering education", "Electrical and Electronic Master degree level", "computer aided instruction", "virtual wind turbine simulator", "teaching", "Grid fault", "wind turbine", "problem-based learning", "engineering education", "Laboratories", "power engineering computing", "real wind turbine setup", "Torque", "virtual setups", "real setups", "engineering studies", "Wind turbines", "Voltage fluctuations", "student-centered instructional approach"]}, {"title": "Factors That Influence Dissemination in Engineering Education", "link": "https://ieeexplore.ieee.org/document/6122466/", "abstract": "Although the need for new educational materials and methods in engineering education is increasing, the process of disseminating (making target groups become aware of, accept, and use) these innovations remains a challenge. A literature review shows that few studies have thoroughly investigated this area. The purpose of this article is to identify factors that may affect the adoption and use of educational innovations used in engineering education and to offer advice to educators on how they may better disseminate their materials. This study uses extant theories related to diffusion and acceptance of innovation as the basis for identifying factors that may impact the dissemination of educational innovations. These factors are tested via a Delphi study employing 21 subject-matter experts and content analysis of 410 research abstracts. The results suggest nine factors that are most important for facilitating acceptance and use of educational engineering innovations. In particular, new materials should be designed such that they demonstrate an obvious relative advantage over existing materials, are compatible with and adaptable to existing pedagogy, lack complexity, and are generally easy to use. Management support and availability of resources are found to be important environmental conditions that facilitate acceptance; logistical issues and cultural differences are the chief impediments.", "authors": [{"name": "Chetan S. Sankar", "affiliation": "Auburn University, Auburn, AL, USA"}, {"name": "Yun Wu", "affiliation": "Auburn University, Auburn, AL, USA"}, {"name": "Benjamin T. Hazen", "affiliation": "Auburn University, Auburn, AL, USA"}], "tags": ["Educational institutions", "educational innovations", "Delphi", "Encoding", "innovation", "research abstracts", "content analysis", "dissemination", "Technological innovation", "power engineering education", "educational materials", "Content analysis", "engineering education", "Delphi study", "diffusion", "Engineering education", "technology acceptance", "Abstracts", "Materials"]}, {"title": "“Design for All in the Context of the Information Society”: Integration of a Specialist Course in a Generalist M.Sc. Program in Electrical and Electronics Engineering", "link": "https://ieeexplore.ieee.org/document/5762576/", "abstract": "This paper describes an educational research experience that took place in the Electrical & Electronics Engineering Master's program offered at the Escuela Universitaria de Ingeniería Técnica de Telecomunicación, Universidad Politécnica de Madrid, Madrid, Spain. The focus is to provide details of the motivation behind and the design and subsequent evaluation of a course adapted to the European Higher Education Area titled “ Design for All in the Context of the Information Society.” This course may be useful for other engineering educators who design Master's programs and perform research on education in electrical and electronics engineering. The course contents are structured along four axes: disabilities, technical aids, accessibility, and recommendations of the standardization bodies. The results of four years of experience are presented. The course is evaluated according to accepted criteria, highlighting the course scope, pedagogic decisions, and relevance. Based on the analysis of program outcomes, some recommendations are made for undergraduate and postgraduate engineering education programs focusing on disability and technology .", "authors": [{"name": "Nicolás Saenz-Lechon", "affiliation": "Departamento Ingeniería de Circuitos y Sistemas (ICS), Escuela Universitaria de Ingeniería Técnica (EUIT) de Telecomunicación, Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Víctor Osma-Ruiz", "affiliation": "Departamento Ingeniería de Circuitos y Sistemas (ICS), Escuela Universitaria de Ingeniería Técnica (EUIT) de Telecomunicación, Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Juan I. Godino-Llorente", "affiliation": "Departamento Ingeniería de Circuitos y Sistemas (ICS), Escuela Universitaria de Ingeniería Técnica (EUIT) de Telecomunicación, Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Juan Carlos Gonzalez de Sande", "affiliation": "Departamento Ingeniería de Circuitos y Sistemas (ICS), Escuela Universitaria de Ingeniería Técnica (EUIT) de Telecomunicación, Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Rubén Fraile", "affiliation": "Departamento Ingeniería de Circuitos y Sistemas (ICS), Escuela Universitaria de Ingeniería Técnica (EUIT) de Telecomunicación, Universidad Politécnica de Madrid, Madrid, Spain"}], "tags": ["electrical and electronics engineering", "European Higher Education Area (EHEA)", "Usability", "Least squares approximation", "Seminars", "European higher education area", "electronic engineering education", "educational courses", "generalist M.Sc. program", "digital divide", "specialist course", "undergraduate engineering education programs", "pedagogic decisions", "Master's course", "technical aids", "Senior citizens", "the disable and technology", "Europe", "Education", "postgraduate engineering education programs", "Design for all", "further education", "Universidad Politecnica de Madrid", "Materials", "educational research experience", "Design for all in the context of the information society"]}, {"title": "Performance Analysis of Saturated Induction Motors by Virtual Tests", "link": "https://ieeexplore.ieee.org/document/6119242/", "abstract": "Many undergraduate-level electrical machines textbooks give detailed treatments of the performance of induction motors. Students can deepen this understanding of motor performance by performing the appropriate practical work in laboratories or in simulation using proper software packages. This paper considers various common and less-common tests for induction motors performance analysis, and their simulations using MATLAB/Simulink. These tests are the no-load test, the locked-rotor test, and the load test, as well as two new tests introduced to determine breakdown and starting torques. A saturable model allows magnetic saturation effects to be simulated, which helps students to recognize the importance of saturation impact upon induction motor performance.", "authors": [{"name": "Mohsen Rezaei", "affiliation": "Department of Electrical Engineering, University of Zanjan, Zanjan, Iran"}, {"name": "Mansour Ojaghi", "affiliation": "Department of Electrical Engineering, University of Zanjan, Zanjan, Iran"}, {"name": "Majid Kazemi", "affiliation": "Department of Electrical Engineering, University of Zanjan, Zanjan, Iran"}, {"name": "Jawad Faiz", "affiliation": "School of Electrical and Computer Engineering, University of Tehran, Tehran, Iran"}], "tags": ["Stators", "laboratory techniques", "Saturation magnetization", "machine testing", "MATLAB/Simulink", "induction motors", "saturated induction motors", "performance study", "locked rotor test", "Rotors", "computer aided instruction", "saturation effect", "software laboratory", "virtual tests", "engineering education", "Load modeling", "power engineering computing", "induction motors performance analysis", "Education", "Torque", "Integrated circuit modeling", "Induction motors", "no-load test"]}, {"title": "Improving Students With Rubric-Based Self-Assessment and Oral Feedback", "link": "https://ieeexplore.ieee.org/document/6069828/", "abstract": "Rubrics and oral feedback are approaches to help students improve performance and meet learning outcomes. However, their effect on the actual improvement achieved is inconclusive. This paper evaluates the effect of rubrics and oral feedback on student learning outcomes. An experiment was conducted in a software engineering course on requirements engineering, using the two approaches in course assignments. Both approaches led to statistically significant improvements, though no material improvement (i.e., a change by more than one grade) was achieved. The rubrics led to a significant decrease in the number of complaints and questions regarding grades.", "authors": [{"name": "Michael Unterkalmsteiner", "affiliation": "Blekinge Institute of Technology, Karlskrona, Sweden"}, {"name": "Kai Petersen", "affiliation": "Blekinge Institute of Technology, Karlskrona, Sweden"}, {"name": "Sebastian Barney", "affiliation": "Blekinge Institute of Technology, Karlskrona, Sweden, University of New South Wales, Sydney, NSW, Australia"}, {"name": "Mahvish Khurum", "affiliation": "Blekinge Institute of Technology, Karlskrona, Sweden"}, {"name": "Ronald Jabangwe", "affiliation": "Blekinge Institute of Technology, Karlskrona, Sweden"}], "tags": ["Educational institutions", "rubric-based evaluation", "Taxonomy", "Software engineering", "educational courses", "user interfaces", "Reliability", "requirements engineering", "Context", "oral feedback", "student performance improvement", "human computer interaction", "computer aided instruction", "rubric-based self-assessment", "student learning outcomes", "course assignments", "software engineering", "Learning outcomes", "perception gap", "formal verification", "Computer science", "computer science education", "Materials", "software engineering course"]}, {"title": "Determinants of Differential Item Functioning in an Elementary Mathematics Test With Accommodations", "link": "https://ieeexplore.ieee.org/document/6054037/", "abstract": "Those items or test characteristics that are likely to result in differential item functioning (DIF) across accommodated test forms in statewide tests have received little attention. An examination of elementary-level student performance across accommodated test forms in a large-scale mathematics assessment revealed DIF variations by grades, accommodation conditions, graphic inclusion, and item types (i.e., constructed response versus multiple choice). In general, items with a lower grade, graphic, constructed-response format appear to benefit accommodated examinees for a statewide mathematics test.", "authors": [{"name": "Soo Eun Chae", "affiliation": "Department of Human Development and Quantitative Methodology, University of Maryland, College Park, MD, USA"}, {"name": "Doyoung Kim", "affiliation": "American Institutes for Research, Washington DC, DC, USA"}, {"name": "Jae-Ho Han", "affiliation": "Department of Brain and Cognitive Engineering, Korea University, Seoul, South Korea"}], "tags": ["graphic inclusion", "Educational institutions", "mathematics", "statewide mathematics test", "elementary-level student performance", "mathematics assessment", "differential item functioning", "Testing", "Synthetic aperture sonar", "education", "elementary mathematics test", "constructed response format", "DIF variation", "Magnetohydrodynamics", "psychology", "Mathematics", "Graphics", "engineering education", "measurement equivalence", "differential item functioning (DIF)", "large-scale mathematics assessment", "item types", "Accommodation"]}, {"title": "The Company Approach to Software Engineering Project Courses", "link": "https://ieeexplore.ieee.org/document/6166912/", "abstract": "Teaching larger software engineering project courses at the end of a computing curriculum is a way for students to learn some aspects of real-world jobs in industry. Such courses, often referred to as capstone courses, are effective for learning how to apply the skills they have acquired in, for example, design, test, and configuration management. However, these courses are typically performed in small teams, giving only a limited realistic perspective of problems faced when working in real companies. This paper describes an alternative approach to classic capstone projects, with the aim of being more realistic from an organizational, process, and communication perspective. This methodology, called the company approach, is described by intended learning outcomes, teaching/learning activities, and assessment tasks. The approach is implemented and evaluated in a larger Master's student course.", "authors": [{"name": "David Broman", "affiliation": "Department of Computer and Information Science, Linköping University, Campus Valla, Linköping, Sweden"}, {"name": "Kristian Sandahl", "affiliation": "Department of Computer and Information Science, Linköping University, Campus Valla, Linköping, Sweden"}, {"name": "Mohamed Abu Baker", "affiliation": "Department of Computer and Information Science, Linköping University, Campus Valla, Linköping, Sweden"}], "tags": ["organisational aspects", "constructive alignment", "company approach", "capstone projects", "Software engineering", "teaching activity", "Industries", "assessment tasks", "educational courses", "Capstone projects", "organizational perspective", "team working", "teaching", "communication perspective", "project management", "software engineering", "software engineering project course teaching", "learning activity", "Education", "learning outcomes", "software engineering (SE)", "further education", "Companies", "Computer science", "Planning", "computing curriculum", "process perspective", "computer science education"]}, {"title": "Everyday Electrical Engineering: A One-Week Summer Academy Course for High School Students", "link": "https://ieeexplore.ieee.org/document/6177698/", "abstract": "A summer academy is held for grade 9-12 high school students at the University of Toronto, Toronto, ON, Canada, every year. The academy, dubbed the Da Vinci Engineering Enrichment Program (DEEP), is a diverse program that aims to attract domestic and international high school students to engineering and sciences (and possibly recruit them). DEEP also provides them with the opportunity to experience the university setting. This paper discusses the organization of DEEP and presents the details of a DEEP course developed to introduce students to electrical engineering. This course is designed for junior (grades 9 and 10) students and includes lectures, hands-on activities (both in a team and individually), and a field trip. The survey results, collected as both formative and summative feedback, indicate the success of the course. This paper also provides recommendations for future offerings of the course.", "authors": [{"name": "Ali Mehrizi-Sani", "affiliation": "School of Electrical Engineering and Computer Science, Washington State University, Pullman, WA, USA"}], "tags": ["Educational institutions", "DEEP", "Adders", "Canada", "high school education", "field trip", "educational courses", "summer academy", "Electrical engineering education", "Electrical engineering", "Proposals", "power engineering", "electrical engineering education", "Electricity", "problem-based learning", "University of Toronto", "Training", "international high school students", "lectures", "outreach", "Da Vinci Engineering Enrichment Program", "one-week summer academy course", "electrical engineering", "hands-on activities"]}, {"title": "A Low-Cost Hands-On Laboratory to Introduce Lithography Concepts", "link": "https://ieeexplore.ieee.org/document/6184351/", "abstract": "A lithography lab course has been developed that is applicable to students from the middle-school level up to college students. It can also be inserted into electronics technology or similar courses in two- and four-year colleges, or used to demonstrate applications of polymers in chemistry classes. Some of these techniques would enable research projects that involve photolithography for those who lack access to a research lab. The major contribution of this course is the innovative methodology, which allows students to have a hands-on experience of lithography without using expensive equipment typically found only in a clean room. Optical lithography, microcontact printing, and embossing can be performed using basic equipment. The appendix of this paper provides a comprehensive list of this equipment. The photolithography results are comparable to those obtained with standard research tools.", "authors": [{"name": "Stephen A. Campbell", "affiliation": "Department of Electrical and Computer Engineering, University of Minnesota, Minneapolis, MN, USA"}, {"name": "Maryam Jalali", "affiliation": "Department of Electrical and Computer Engineering, University of Minnesota, Minneapolis, MN, USA"}, {"name": "James J. Marti", "affiliation": "Nanofabrication Center, University of Minnesota, Minneapolis, MN, USA"}, {"name": "Frances Lawrenz", "affiliation": "Department of Educational Psychology, University of Minnesota, Minneapolis, MN, USA"}, {"name": "Allison L. Kirchhoff", "affiliation": "Department of Educational Psychology, University of Minnesota, Minneapolis, MN, USA"}], "tags": ["Plastics", "educational institutions", "electronics technology", "Resists", "electronic engineering education", "educational courses", "lithography", "polymer", "microelectromechanical systems (MEMS)", "Copper", "laboratories", "four-year college student", "two-year college student", "Lithography", "embossing", "microimprint", "chemistry class", "middle-school", "soft lithography", "Education", "polymers", "optical lithography", "Aluminum", "photolithography", "photolithography lab course concept", "microfabrication", "low-cost hands-on laboratory", "microcontact printing", "Embossing", "Hot embossing"]}, {"title": "Low-Cost Undergraduate Control Systems Experiments Using Microcontroller-Based Control of a DC Motor", "link": "https://ieeexplore.ieee.org/document/6182726/", "abstract": "This paper presents low-cost experiments for a control systems laboratory module that is worth one and a third credits. The experiments are organized around the microcontroller-based control of a permanent magnet dc motor. The experimental setups were built in-house. Except for the operating system, the software used is primarily freeware or free for academic use. The objective of this module is that students-fresh from a first course in control systems theory, which introduces them to proportional-integral-derivative control and to design using Bode plots and root locus-learn how a simple modern control system is built. Student feedback and a 90-min end-of-semester practical exam show that, although the students find the experiments challenging, this module helps meet this objective. After having taken the first course and this laboratory module, the students feel that they can build control systems in addition to discussing them theoretically. This module is easy to set up and administer using the supporting material provided by the authors.", "authors": [{"name": "Manavaalan Gunasekaran", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology Kanpur, Kanpur, India"}, {"name": "Ramprasad Potluri", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology Kanpur, Kanpur, India"}], "tags": ["control systems laboratory module", "DC motors", "Motor drives", "three-term control", "modern control system", "end-of-semester practical exam", "permanent magnet motors", "educational courses", "low-cost laboratory", "bode plots", "Software", "power engineering education", "first course", "disturbance observer", "microcontroller-based control", "proportional-integral-derivative control", "control systems theory", "engineering education", "permanent magnet dc motor", "DC motor control", "Laboratories", "Microcontrollers", "Manuals", "time 90 min", "microcontrollers", "machine control", "embedded control system", "freeware", "low-cost undergraduate control systems", "student feedback", "dc motor"]}, {"title": "Implementation of a Multidisciplinary Professional Skills Course at an Electrical Engineering School", "link": "https://ieeexplore.ieee.org/document/6078443/", "abstract": "This paper describes a case study of an innovative approach to teaching at an engineering school. The postgraduate course Project Work and Communication in Research and Development (R&D) was developed at the Faculty of Electrical Engineering of the University of Ljubljana, Ljubljana, Slovenia. The main aim of the course was to make the entry of young engineering graduates into the business environment as easy as possible. Currently, engineers are facing more and more interdisciplinarity and project work in their daily assignments. The course was designed to remedy any deficiencies in the multidisciplinary professional skills and knowledge of the graduate-level students, and it covered the topics of innovation management, communication in R&D, project management, and problem solving in teams. An end-of-course survey showed positive feedback from participating students. The empirical data (enrollment ratio of students, session attendance ratio, and average student grade) proves that the course met its goal of honing the professional skills of postgraduate engineering students.", "authors": [{"name": "Borut Likar", "affiliation": "Faculty of Management, University of Primorska, Koper, Slovenia"}, {"name": "Tomaz Kern", "affiliation": "Faculty of Organization Sciences, University of Maribor, Kranj, Slovenia"}, {"name": "Franc Gider", "affiliation": "Slovenian Technology Agency, Ljubljana, Slovenia"}, {"name": "Damijan Miklavcic", "affiliation": "Faculty of Electrical Engineering, University of Ljubljana, Ljubljana, Slovenia"}], "tags": ["electrical engineering school", "Educational institutions", "University of Ljubljana", "Slovenia", "educational institutions", "engineering graduates", "research and development", "Faculty of Electrical Engineering", "Communication", "continuing education", "average student grade", "education", "problem solving", "innovation management", "Organizations", "multidisciplinary professional skills course", "business environment", "end-of-course survey", "Technological innovation", "electrical engineering education", "teaching", "postgraduate engineering students", "project management", "enrollment ratio", "Teamwork", "postgraduate course", "research and development (R&D)", "session attendance ratio", "Project management", "graduate-level students"]}, {"title": "A Training Tool and Methodology to Allow Concurrent Multidisciplinary Experimental Projects in Engineering Education", "link": "https://ieeexplore.ieee.org/document/6101570/", "abstract": "This paper describes a novel Electrical Machine and Power Electronic Training Tool (EM&PE\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">TT</sub>\n), a methodology for using it, and associated experimental educational activities. The training tool is implemented by recreating a whole power electronics system, divided into modular blocks. This process is similar to that applied when analyzing a piece of industrial equipment by the functions of its various parts. The EM&PE\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">TT</sub>\n is divided into five areas: the power block, the electronic switch command, instrumentation, the control system, and the application environment. The training tool lets a user analyze each functional block and the relationships between functional blocks; it can be used either in local or remote mode, thus ensuring optimal effectiveness of the proposed learning methodology. The students can redesign the hardware and software blocks before reassembling them; this allows various different experimental projects to be run concurrently in the same training tool. The results presented here show that EM&PE\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">TT</sub>\n improves engineering students' technical skills and their motivation in experimental work.", "authors": [{"name": "F. Javier Maseda", "affiliation": "Automatic Control and Systems Engineering Department, University of the Basque Country, Bilbao, Spain"}, {"name": "Itziar Martija", "affiliation": "Mechanical Engineering Department, University of the Basque Country, Bilbao, Spain"}, {"name": "Irene Martija", "affiliation": "Automatic Control and Systems Engineering Department, University of the Basque Country, Bilbao, Spain"}], "tags": ["control system", "Computer architecture", "concurrent multidisciplinary experimental projects", "electrical machine and power electronic training tool", "instrumentation", "Power electronics", "power electronics", "Software", "training", "Computer applications", "power engineering education", "computer aided instruction", "Hardware", "electronics engineering education", "electronic switch command", "application environment", "engineering education", "Laboratories", "control systems", "Training", "hardware and software blocks", "learning systems", "power block", "Instruments"]}, {"title": "Enhancing Project-Based Learning in Software Engineering Lab Teaching Through an E-Portfolio Approach", "link": "https://ieeexplore.ieee.org/document/6182725/", "abstract": "Project-based learning is one of the main successful student-centered pedagogies broadly used in computing science courses. However, this approach can be insufficient when dealing with practical subjects that implicitly require many deliverables and a great deal of feedback and organizational resources. In this paper, a worked e-portfolio is presented as an approach to improve the teaching/learning and evaluation processes in project-based learning environments needing considerable resources. To validate this approach, a practical project-based software engineering course supported by a Moodle-based e-portfolio was designed and taught. The results obtained corroborated the effectiveness of the e-portfolio in practical software engineering teaching; this approach can be extended to similar subjects in other studies and/or curricula.", "authors": [{"name": "José A. Macias", "affiliation": "Escuela Politécnica Superior, Universidad Autónoma de Madrid, Madrid, Spain"}], "tags": ["software engineering education", "organisational aspects", "Moodle-based e-portfolio", "learning improvement", "feedback", "courseware", "Software engineering", "teaching improvement", "laboratory education", "Monitoring", "Reliability", "Portfolios", "Software", "organizational resources", "project-based learning environments", "teaching", "Electronic portfolio", "project-based software engineering course", "software engineering", "software engineering lab teaching", "Education", "teaching strategies", "computer science courses", "project-based learning", "student-centered pedagogies", "computer science education", "Materials"]}, {"title": "Facilitating Constructive Alignment in Power Systems Engineering Education Using Free and Open-Source Software", "link": "https://ieeexplore.ieee.org/document/6059459/", "abstract": "This paper describes how the use of free and open-source software (FOSS) can facilitate the application of constructive alignment theory in power systems engineering education by enabling the deep learning approach in power system analysis courses. With this aim, this paper describes the authors' approach in using the Power System Analysis Toolbox (PSAT) for undergraduate and graduate education. Interviews with former students reveal the positive impact that the use of FOSS in general, and PSAT in particular, had on their learning and how it has influenced their professional life.", "authors": [{"name": "Federico Milano", "affiliation": "Department of Electrical Engineering, University of Castilla-La Mancha, Ciudad Real, Spain"}, {"name": "Luigi Vanfretti", "affiliation": "Electric Power Systems Division, School of Electrical Engineering, KTH Royal Institute of Technology, Stockholm, Sweden"}], "tags": ["functioning knowledge", "deep learning approach", "free and open-source software", "MATLAB", "Open source software", "Power systems", "Constructive alignment", "learning activities", "power engineering education", "Computer languages", "computer aided instruction", "power systems engineering education", "power system analysis toolbox", "Software architecture", "Education", "free and open-source software (FOSS)", "constructive alignment theory", "power system analysis computing", "power system analysis"]}, {"title": "A Middleware Platform for Providing Mobile and Embedded Computing Instruction to Software Engineering Students", "link": "https://ieeexplore.ieee.org/document/6140611/", "abstract": "As embedded software systems have grown in number, complexity, and importance in the modern world, a corresponding need to teach computer science students how to effectively engineer such systems has arisen. Embedded software systems, such as those that control cell phones, aircraft, and medical equipment, are subject to requirements and constraints that are significantly different from those encountered in the standard desktop computing environment. For example, embedded systems must frequently address challenges that arise from severe resource restrictions (e.g., low memory and network bandwidth), heterogeneous hardware platforms, and safety-critical operations. Software architecture has been shown to be an effective means for coping with such issues, yet traditional courses on embedded software development rarely focus on software architectural abstractions. Instead, they have concentrated on lower-level issues such as programming languages and hardware interfaces. Since 2005 at the University of Southern California, Los Angeles, a unique course has been developed that affords students the opportunity to gain experience and insights on developing software architectures for embedded systems. At the heart of the course is a middleware platform, Prism-MW, that helps students use software architectural principles to construct embedded systems and understand the important challenges of the embedded systems domain. This paper describes this course through the explanation and evaluation of four years of class projects, weaving together the course, the middleware platform, and the relationship of each to three key pedagogical goals that drove the formulation of the course curriculum.", "authors": [{"name": "Chris A. Mattmann", "affiliation": "Computer Science Department, University of Southern California, Los Angeles, California, United States, Instrument and Science Data Systems Section, NASA Jet Propulsion Laboratory, Pasadena, California, United States"}, {"name": "Somo Banerjee", "affiliation": "Software Engineering, CarsDirect.com, El Segundo, California, USA"}, {"name": "Nenad Medvidovic", "affiliation": "Computer Science Department, University of Southern California, Los Angeles, California, USA"}, {"name": "Sam Malek", "affiliation": "Department of Computer Science, George Mason University, Fairfax, Virginia"}, {"name": "George Edwards", "affiliation": "CEO, Blue Cell Software, Los Angeles, California, USA"}], "tags": ["embedded computing instruction", "Prism-MW", "hardware interfaces", "educational institutions", "software architecture", "mobile computing education", "software architectural abstractions", "Glide", "educational courses", "safety-critical operations", "course curriculum formulation", "University of Southern California", "resource restrictions", "heterogeneous hardware platforms", "embedded systems", "mobile computing instruction", "mobile computing", "computer aided instruction", "middleware platform", "teaching", "Middleware", "software engineering", "Los Angeles", "desktop computing environment", "Education", "safety-critical software", "Embedded systems", "embedded software development", "Mobile communication", "computer science student teaching", "software engineering students", "middleware", "computer science education", "embedded software systems", "programming languages"]}, {"title": "Correction to “Introducing Programmable Logic to Undergraduate Engineering Students in a Digital Electronics Course” [May 12 255-262]", "link": "https://ieeexplore.ieee.org/document/6193263/", "abstract": "In the above titled paper (ibid, vol. 55, no. 2, pp. 255-262, May 2012), originally an Early Access article on IEEE Xplore and now included in this current issue, reference [18] is missing; it is cited as [2] in this correction. In Section II of the original paper, reference [18] should be cited in the following sentence of the fourth paragraph: \" In [18], a lab-at-home approach is proposed at the Universidad de la Republica in Montevideo, Montevideo, Uruguay.\"", "authors": [{"name": "Martín Vazquez", "affiliation": "Instituto de Investigación en Tecnología Informática Avanzada (INTIA), Universidad Nacional del Centro de la Provincia de Buenos Aires (UNCPBA), Tandil, Argentina"}, {"name": "Elías Todorovich", "affiliation": "Instituto de Investigación en Tecnología Informática Avanzada (INTIA), Universidad Nacional del Centro de la Provincia de Buenos Aires (UNCPBA), Tandil, Argentina"}, {"name": "José A. Marone", "affiliation": "CONICET (Consejo Nacional de Investigaciones Científicas y Técnicas), Caba, Argentina"}], "tags": ["Digital circuits", "Programmable logic devices", "Engineering education"]}, {"title": "The Issue of (Software) Plagiarism: A Student View", "link": "https://ieeexplore.ieee.org/document/5720272/", "abstract": "The issue of plagiarism is discussed in the context of university education in disciplines related to computing. The focus is therefore mainly on software plagiarism. First, however, a case is made for the claim that the most important reason that plagiarism cannot be tolerated lies in the essence of the concept of a university as it is rooted in the Western cultural tradition. The main contribution of this paper is in providing firsthand insight into students' views on some of the delicate questions related to student plagiarism. However, this paper presents views from both sides of the question, including the views of staff members. This paper is quite unique in that it is coauthored by students who provide independent comments and recommendations.", "authors": [{"name": "Bianka Kovacova", "affiliation": "T-Mobile Slovakia, Zilina, Slovakia"}, {"name": "Daniela Chuda", "affiliation": "Faculty of Informatics and Information Technologies, Slovak University of Technology, Bratislava, Slovakia"}, {"name": "Pavol Navrat", "affiliation": "Faculty of Informatics and Information Technologies, Slovak University of Technology, Bratislava, Slovakia"}, {"name": "Pavel Humay", "affiliation": "Avitech, Bratislava, Slovakia"}], "tags": ["Informatics", "educational institutions", "university education", "student plagiarism", "Plagiarism", "text analysis", "programming", "Software", "Western cultural tradition", "plagiarism", "software", "software plagiarism issue", "Computers", "staff members", "Education", "further education", "Computer science education", "Computer science", "computer science education", "Materials"]}, {"title": "Motor-Reducer Sizing Through a MATLAB-Based Graphical Technique", "link": "https://ieeexplore.ieee.org/document/6200392/", "abstract": "The design of the drive system for an automatic machine and its correct sizing is a very important competence for an electrical or mechatronic engineer. This requires knowledge that crosses the fields of electrical engineering, electronics and mechanics, as well as the skill to choose commercial components based upon their technical documentation. A good way to help students to achieve these competencies is to set them a project-oriented task, consisting of a real case study they have to solve. The aim is to give to students enrolled in the courses Functional Mechanical Design and Dynamics of Machines at the Polytechnic of Milan, Milan, Italy, the opportunity to put their knowledge and skills into practice on a real industrial case regarding the design of an automatic machine, with particular attention being paid to the problem of the analysis and synthesis of the drive system.", "authors": [{"name": "Simone Cinquemani", "affiliation": "Department of Mechanical Engineering, Politecnico di Milano, Milano, Italy"}, {"name": "Hermes Giberti", "affiliation": "Department of Mechanical Engineering, Politecnico di Milano, Milano, Italy"}], "tags": ["Acceleration", "mechanical engineering", "Polytechnic of Milan", "mechatronic engineer", "functional mechanical design", "motor drives", "drive system design", "educational courses", "MATLAB", "Electronic cams", "MATLAB-based graphical technique", "Application software", "motor sizing", "Computer languages", "computer aided instruction", "electrical engineering education", "Gears", "Catalogs", "servo-system", "electrical engineer", "automatic machine", "project-oriented task", "Brushless motors", "electrical engineering computing", "Torque", "mechanical engineering computing", "motor-reducer sizing", "Italy", "mathematics computing", "machine dynamics"]}, {"title": "Automatic Error Analysis Using Intervals", "link": "https://ieeexplore.ieee.org/document/5711698/", "abstract": "A technique for automatic error analysis using interval mathematics is introduced. A comparison to standard error propagation methods shows that in cases involving complicated formulas, the interval approach gives comparable error estimates with much less effort. Several examples are considered, and numerical errors are computed using the INTLAB extension to MATLAB. Two laboratory experiments are examined, and measured data are used to explore the applicability of interval analysis under typical experimental conditions. Because of the simplicity of using interval analysis, and because of its easy implementation in MATLAB, error analysis may be introduced in the earliest electrical engineering lab classes. This provides students with a crucial skill that will be valuable throughout their engineering studies.", "authors": [{"name": "Edward J. Rothwell", "affiliation": "Department of Electrical and Computer Engineering, Michigan State University, East Lansing, MI, USA"}, {"name": "Michael J. Cloud", "affiliation": "Department of Electrical and Computer Engineering, Lawrence Technological University, Southfield, MI, USA"}], "tags": ["interval analysis", "electrical engineering lab class", "Capacitance", "Capacitors", "impedance measurement", "automatic error analysis", "measurement errors", "standard error propagation method", "Dielectric measurements", "error analysis", "numerical error", "MATLAB", "laboratories", "interval mathematics", "Measurement uncertainty", "student experiments", "error estimation", "Laboratories", "dielectric measurement", "Uncertainty", "Error analysis", "electrical engineering", "INTLAB extension"]}, {"title": "Building Young Engineers: TASEM for Third Graders in Woodcreek Magnet Elementary School", "link": "https://ieeexplore.ieee.org/document/5741749/", "abstract": "Following the success of summer-camp-based programs, a new program has been developed for in-school sessions focused around LEGO robotics to foster interest in STEM topics at a young age. The program has been implemented in a very diverse school, and preliminary results on the efficacy of the program are presented.", "authors": [{"name": "Dean M. Aslam", "affiliation": "Department of Electrical Engineering, Michigan State University, East Lansing, MI, USA"}, {"name": "Michael W. Varney", "affiliation": "Department of Electrical Engineering, Michigan State University, East Lansing, MI, USA"}, {"name": "Abed Janoudi", "affiliation": "Department of Electrical Engineering, Michigan State University, East Lansing, MI, USA"}, {"name": "Diane Graham", "affiliation": "Lansing School District, Woodcreek Elementary Magnet School, Lansing, MI, USA"}], "tags": ["TASEM program", "Educational institutions", "Gears", "robots", "Presses", "science, technology, engineering, and math (STEM)", "control engineering education", "summer-camp-based programs", "STEM topics", "educational institutions", "outreach", "LEGO robotics", "Woodcreek magnet elementary school", "Elementary education", "Educational robots", "Programming"]}, {"title": "Flip-Flops in Students' Conceptions of State", "link": "https://ieeexplore.ieee.org/document/5754625/", "abstract": "The authors conducted a qualitative interview-based study to reveal students' misconceptions about state in sequential circuits. This paper documents 16 misconceptions of state, how students' conceptions of state shift and change, and students' methodological weaknesses. These misconceptions can be used to inform and direct instruction. This study revealed a need for the development and adoption of standard terminology and a need to focus digital logic instruction upon a central concept of information encoding. In addition, these misconceptions will serve as the basis for the creation of standard assessments called concept inventories. A concept inventory will provide rigorous and quantitative metrics to assess the effectiveness of new teaching methods.", "authors": [{"name": "Geoffrey L. Herman", "affiliation": "Department of Electrical and Computer Engineering and Coordinated Science Laboratory, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}, {"name": "Craig Zilles", "affiliation": "Department of Computer Science, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}, {"name": "Michael C. Loui", "affiliation": "Department of Electrical and Computer Engineering and Coordinated Science Laboratory, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}], "tags": ["Combinational circuits", "Flip-flops", "qualitative interview", "electronic engineering education", "Interviews", "students methodological weaknesses", "students conceptions of state", "Context", "Sequential circuits", "standard terminology", "information encoding", "concept inventories", "state machines", "logic circuits", "Springs", "teaching", "encoding", "flip-flops", "standard assessments", "Education", "sequential circuits", "Computer science", "digital logic instruction", "teaching methods", "computer science education"]}, {"title": "An Open-Access Educational Tool for Teaching Motion Dynamics in Multi-Axis Servomotor Control", "link": "https://ieeexplore.ieee.org/document/5961660/", "abstract": "Servomotors are widely used in computerized numerically controlled (CNC) machines, hence motion control is a major topic covered in undergraduate/graduate engineering courses. Despite the fact that several syllabi include the motion dynamics topic in their courses, there are neither suitable tools available for designing and simulating multi-axis motion control nor an efficient link between theory and practice. This paper proposes an educational, open-source tool for teaching motion dynamics in multi-axis servomotor control. The tool allows students to generate multi-axis motion and export these movements for their application to a CNC machine. A simulation module is embedded for evaluating the controller performance. The proposed educational tool allows the use of the inductive pedagogic method to support student learning. Eleven lab practicals are described to show how the proposed tool can be utilized for the systematic teaching of motion dynamics.", "authors": [{"name": "Rene de Jesus Romero-Troncoso", "affiliation": "Autonomous University of Querétaro, Mexico"}, {"name": "Roque Alfredo Osornio-Rios", "affiliation": "HSPdigital CA-Mecatronica, Faculty of Engineering, Autonomous University of Queretaro, Mexico, Mexico"}, {"name": "Jose de Jesus Rangel-Magdaleno", "affiliation": "Autonomous University of Querétaro, Mexico"}, {"name": "Jesus Rooney Rivera-Guillen", "affiliation": "HSPdigital CA-Mecatronica, Faculty of Engineering, Autonomous University of Queretaro, Mexico, Mexico"}, {"name": "Ramon Gerardo Guevara-Gonzalez", "affiliation": "Autonomous University of Querétaro, Faculty of Engineering, Mexico, Mexico"}], "tags": ["Acceleration", "servomotors", "Computer numerical control", "inductive pedagogic method", "graduate engineering courses", "educational courses", "public domain software", "computerized numerically controlled machine", "control engineering education", "spline functions", "motion dynamics", "simulation module", "open access educational tool", "controller performance evaluation", "Splines (mathematics)", "open source tool", "computer aided instruction", "teaching", "motion control", "engineering education", "multiaxis servomotor control", "Servomotors", "numerical control", "Education", "computerised numerical control", "undergraduate engineering courses", "further education", "Dynamics", "Torque", "CNC machines", "student learning"]}, {"title": "An Ultra Low Cost Wireless Communications Laboratory for Education and Research", "link": "https://ieeexplore.ieee.org/document/5937028/", "abstract": "This paper presents an ultra-low-cost wireless communications laboratory that is based on a commercial off-the-shelf field programmable gate array (FPGA) development board that is both inexpensive and available worldwide. The total cost of the laboratory is under USD $200, but it includes complete transmission, channel emulation, reception (coherent and noncoherent), and probing capabilities. Over 15 different modulation types are currently supported. The laboratory, aimed primarily to serve as a teaching aid for a professor teaching senior undergraduate courses and projects, allows students to have visual real-time demonstrations in wireless communications systems. The laboratory is also powerful enough to allow experienced researchers to carry out wireless communications research projects. In this context, the laboratory is particularly useful for universities in developing countries, where budgets are extremely limited. Numerical and written survey results are presented that were collected from two classes of students taught by the author in a university in Colombia, South America, and which show the effectiveness of the laboratory in teaching wireless communications.", "authors": [{"name": "Yair Linn", "affiliation": "PMC-Sierra, Burnaby, Canada"}], "tags": ["Wireless communication", "receivers", "laboratory", "telecommunication engineering education", "hardware", "digital communications", "wireless communication research project", "radiocommunication", "educational courses", "wireless communications", "QAM", "Field programmable gate arrays", "education", "field programmable gate arrays", "Phase shift keying", "phase shift keying (PSK)", "phase locked loop (PLL)", "AGC", "field programmable gate array (FPGA)", "undergraduate course", "FPGA development board", "commercial off-the-shelf field programmable gate array development board", "channel emulation", "ultra low cost wireless communication laboratory", "Laboratories", "Education", "BPSK", "QPSK", "modulation", "transmitters", "Receivers", "Oscilloscopes", "demodulation", "wireless communication system"]}, {"title": "The 18 mm$^{2}$ Laboratory: Teaching MEMS Development With the SUMMiT Foundry Process", "link": "https://ieeexplore.ieee.org/document/6189763/", "abstract": "This paper describes the goals, pedagogical system, and educational outcomes of a three-semester curriculum in microelectromechanical systems (MEMS). The sequence takes engineering students with no formal MEMS training and gives them the skills to participate in cutting-edge MEMS research and development. The evolution of the curriculum from in-house fabrication facilities to an industry-standard foundry process affords an opportunity to examine the pedagogical benefits of the latter approach. Outcomes that are assessed include the number of students taking the classes, the quality of work produced by students, and the research that has emanated from class projects. Three key elements of the curriculum are identified: 1) extensive use of virtual design and process simulation software tools; 2) fabrication of student-designed devices for physical characterization and testing; and 3) integration of a student design competition. This work strongly leveraged the university outreach activities of Sandia National Laboratories (SNL) and the SNL SUMMiT MEMS design and fabrication system. SNL provides state-of-the-art design tools and device fabrication and hosts a yearly nationwide student design competition. Student MEMS designs developed using computer-aided design (CAD) and finite element analysis (FEA) software are fabricated at SNL and returned on 18-mm die modules for characterization and testing. One such module may contain a dozen innovative student projects. Important outcomes include an increase in enrollment in the introductory MEMS class, external research funding and archival journal publications arising from student designs, and consistently high finishes in the SNL competition. Since the SNL offerings are available to any US college or university, this curriculum is transportable in its current form.", "authors": [{"name": "Richard O. Gale", "affiliation": "Department of Electrical and Computer Engineering, Texas Tech University, Lubbock, Texas, United States"}, {"name": "Jordan M. Berg", "affiliation": "Department of Mechanical Engineering, Texas Tech University, Lubbock, Texas, United States"}, {"name": "Tim Dallas", "affiliation": "Department of Electrical Engineering, Texas Tech University, Lubbock, Texas, United States"}], "tags": ["FEA software", "Educational institutions", "micromechanical devices", "CAD", "Solid modeling", "journal publication", "technology CAD (electronics)", "educational institutions", "Fabrication", "electronic engineering education", "computer-aided fabrication design", "pedagogical system", "finite element analysis", "process simulation software", "Software", "computer aided instruction", "laboratories", "virtual design", "teaching", "student-designed device", "microelectromechanical system", "in-house fabrication facility", "three-semester curriculum", "SUMMiT Foundry Process", "Micromechanical devices", "Laboratories", "SNL", "industry-standard foundry process", "module", "finite element methods", "Foundries", "Sandia National Laboratories", "US college", "Educational technologies", "MEMS", "cutting-edge MEMS research and development", "microfabrication", "teaching MEMS development", "microelectromechanical systems", "finite element analysis software", "university outreach activity"]}, {"title": "Using Virtualization and Automatic Evaluation: Adapting Network Services Management Courses to the EHEA", "link": "https://ieeexplore.ieee.org/document/5944997/", "abstract": "This paper outlines the adaptation of a course on the management of network services in operating systems, called NetServicesOS, to the context of the new European Higher Education Area (EHEA). NetServicesOS is a mandatory course in one of the official graduate programs in the Faculty of Computer Science at the Universidad Nacional de Educación a Distancia (UNED), Madrid, Spain, the Spanish University for Distance Education. Since UNED is a distance university, this course is taught entirely online. The adaptation process includes the implementation of continuous assessment, a key feature in EHEA's methodology. This learning-teaching methodology is driven by a set of student activities that implement the continuous assessment. For this, a virtual machine-based framework was defined, and an automatic evaluation system implemented. The evaluation system can handle the large student numbers characteristic of distance learning. If the set of proposed activities had to be performed in person on site, significant resources would have been necessary since many computer laboratories would have been required to accommodate all the students. Furthermore, the proposed framework ensures that students can perform the practical work simply and flexibly, without the need for large computing platforms.", "authors": [{"name": "Antonio Robles-Gomez", "affiliation": "Control and Communication Systems Department, University for Distance Education, Madrid, Spain"}, {"name": "Salvador Ros", "affiliation": "Control and Communication Systems Department, University for Distance Education, Madrid, Spain"}, {"name": "Agustín C. Caminero", "affiliation": "Control and Communication Systems Department, University for Distance Education, Madrid, Spain"}, {"name": "Rafael Pastor", "affiliation": "Control and Communication Systems Department, University for Distance Education, Madrid, Spain"}, {"name": "Roberto Hernandez", "affiliation": "Control and Communication Systems Department, University for Distance Education, Madrid, Spain"}], "tags": ["automatic evaluation system", "network services management course", "European Higher Education Area (EHEA)", "learning-teaching methodology", "NetServicesOS", "Universidad Nacional de Educación a Distancia", "Operating systems", "European Higher Education Area", "information technology", "Engines", "Linux", "distance learning", "educational courses", "continuing education", "UNED", "Spanish University for Distance Education", "virtualisation", "online course", "Electronic learning", "Faculty of Computer Science", "Servers", "computer aided instruction", "teaching", "continuous assessment", "operating systems (computers)", "virtualization", "Automatic learning systems", "computer laboratory", "Europe", "operating system", "mandatory course", "distance education", "virtual machines", "virtual learning environments (VLEs)", "educational administrative data processing", "further education", "virtual machine-based framework", "graduate program", "EHEA", "student activity", "computer science education"]}, {"title": "Differential Amplifier With Current-Mirror Load: Influence of Current Gain, Early Voltage, and Supply Voltage on the DC Output Voltage", "link": "https://ieeexplore.ieee.org/document/6003805/", "abstract": "A differential amplifier composed of an emitter-coupled pair is useful as an example in lecture presentations and laboratory experiments in electronic circuit analysis courses. However, in an active circuit with zero input load \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">id</sub>\n, both laboratory measurements and PSPICE and LTspice simulation results for the output voltage \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">o</sub>\n are considerably lower than one base emitter unit \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BE(on)</sub>\n below the supply voltage \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">CC</sub>\n, as predicted by a textbook derivation. Modification of the derivation to include the p-n-p transistor base currents and the current gain β\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">P</sub>\n and the supply voltage and specifications for the four transistors provide equations that predict results for \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">o</sub>\n that are consistent with laboratory experience and computer simulations. The output voltage is in excess of three \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BE(on)</sub>\n units below \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">CC</sub>\n when β\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">P</sub>\n is 50. At larger values for β\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">P</sub>\n , \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">o</sub>\n is increased by a factor proportional to 1/β\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">P</sub>\n, reaching one \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">BE(on)</sub>\n unit below \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">CC</sub>\n as β\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">P</sub>\n approaches infinity. Larger values for \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">CC</sub>\n cause an additional modest difference between \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">CC</sub>\n and \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">o</sub>\n at low values for β\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">P</sub>\n. The derived equations and LTspice values are used to develop an empirical equation that predicts output voltages for the given Early voltages. The technique is adaptable to student data evaluation assignments. The computer simulations also showed that increased supply voltage results in increased gain for a given input value for \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">id</sub>\n, while larger values for β\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">P</sub>\n result in a modest increase in gain at all values of \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">CC</sub>\n.", "authors": [{"name": "George F. Paulik", "affiliation": "IBM, Rochester, MN, USA"}, {"name": "Raymond P. Mayer", "affiliation": "Science and Mathematics Department, West Shore Community College, Scottville, MI, USA"}], "tags": ["emitter-coupled pair", "Mathematical model", "electronic engineering education", "Transistors", "LTspice", "output voltage", "differential amplifiers", "PSPICE", "Voltage measurement", "differential amplifier", "DC output voltage", "active circuit", "p-n-p transistor base current", "Gain", "Equations", "SPICE", "Laboratories", "current gain", "Amplifier", "current-mirror load", "gain", "emitter-coupled differential amplifier", "transistors", "supply voltage", "base currents"]}, {"title": "An Undergraduate Survey Course on Asynchronous Sequential Logic, Ladder Logic, and Fuzzy Logic", "link": "https://ieeexplore.ieee.org/document/6164285/", "abstract": "For a basic foundation in computer engineering, universities traditionally teach synchronous sequential circuit design, using discrete gates or field programmable gate arrays, and a microcomputers course that includes basic I/O processing. These courses, though critical, expose students to only a small subset of tools. At co-op schools like Kettering University, Flint, MI, students could strongly benefit from a more diverse set of topics and tool experience in their curriculum. This paper presents an undergraduate course that includes introductions to sequential circuit design using asynchronous logic, ladder logic and its general implementation on programmable logic controllers, and fuzzy logic targeted at both PC and embedded processor applications. The paper discusses the structure of the course, the objectives and material, the laboratory platforms, and the evaluations of the first course offerings that show the course's success.", "authors": [{"name": "David L. Foster", "affiliation": "Department of Electrical and Computer Engineering, Kettering University, Flint, MI, USA"}], "tags": ["Hazards", "Educational institutions", "ladder logic", "fuzzy logic", "sequential circuit design", "Fuzzy logic", "undergraduate survey course", "Asynchronous logic", "Programming", "educational courses", "Microcomputers", "electrical engineering education", "asynchronous sequential logic", "asynchronous circuits", "programmable logic controllers", "digital circuits", "programmable controllers", "Laboratories", "Logic gates", "embedded processor applications", "computer engineering", "further education", "sequential circuits", "computer science education"]}, {"title": "A Project-Based Learning Approach to Programmable Logic Design and Computer Architecture", "link": "https://ieeexplore.ieee.org/document/6117096/", "abstract": "This paper describes a course in programmable logic design and computer architecture as it is taught at the University of Newcastle, Australia. The course is designed around a major design project and has two supplemental assessment tasks that are also described. The context of the Computer Engineering degree program within which the course is taught is presented, and some student outcomes are discussed.", "authors": [{"name": "Christopher M. Kellett", "affiliation": "School of Electrical Engineering and Computer Science, University of Newcastle, Callaghan, NSW, Australia"}], "tags": ["Educational institutions", "Computer architecture", "logic design", "design project", "computer engineering degree program", "microprocessor design", "electronic engineering education", "supplemental assessment tasks", "Logic design", "Programming", "educational courses", "field programmable gate arrays", "Hardware design languages", "FPGA", "University of Newcastle", "educational course", "computer aided instruction", "Computers", "Laboratories", "programmable logic design", "computer architecture", "field programmable gate arrays (FPGAs)", "computer science education", "project-based learning", "Australia"]}, {"title": "Unique Power Electronics and Drives Experimental Bench (PEDEB) to Facilitate Learning and Research", "link": "https://ieeexplore.ieee.org/document/6213161/", "abstract": "Experimentation is important for learning and research in the field of power electronics and drives. However, a great deal of equipment is required to study the various topologies, controllers, and functionalities. Thus, the cost of establishing good laboratories and research centers is high. To address this problem, the authors have developed a “Power Electronics and Drives Experimental Bench” (PEDEB), whose details are given in this paper. This unique kit includes reconfigurable hardware modules, which can be interconnected to achieve more than 14 different circuit topologies. Moreover, the software (controller) is accessible to users, thereby facilitating quick verification and testing of new ideas. A 2-kVA prototype of the PEDEB was developed and tested for various possible modes of operation. The kit is being used for a first-semester post-graduate laboratory course on “Power Electronics and Drives.” This paper includes observations and learning from experiments on dc-dc buck converter, an induction motor drive, and a grid feeding inverter conducted using the PEDEB.", "authors": [{"name": "Sandeep Anand", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology Bombay, Mumbai, India"}, {"name": "B. G. Fernandes", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology Bombay, Mumbai, India"}, {"name": "Rajesh Singh Farswan", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology Bombay, Mumbai, India"}], "tags": ["DC-DC power convertors", "Voltage control", "power conversion", "electric drives", "Do-it-yourself", "induction motor drives", "unique power electronics and drives experimental bench", "circuit topology", "Insulated gate bipolar transistors", "reconfigurable", "grid feeding inverter", "first-semester post-graduate laboratory", "power electronics", "dc-dc buck converter", "power engineering education", "induction motor drive", "teaching", "invertors", "power grids", "Laboratories", "Topology", "Inverters", "laboratory course", "PEDEB", "Inductors"]}, {"title": "Experiences of a Multidisciplinary Course on Geo-Signal Processing From a DSP Perspective Offered in Electrical Engineering at King Fahd University of Petroleum and Minerals", "link": "https://ieeexplore.ieee.org/document/6117097/", "abstract": "The purpose of this paper is to share the experience gained in, and the efforts made toward, introducing and implementing a new course in the challenging and important area of geophysical signal processing at the Electrical Engineering (EE) Department, King Fahd University of Petroleum and Minerals (KFUPM), Dhahran, Saudi Arabia. The new course, titled “Geo-Signal Processing,” was offered both at the graduate level and as a special topics course to undergraduates. The course was developed in collaboration with the Earth Sciences Department at KFUPM. This paper contributes new information because it stresses the multidisciplinary aspects of digital signal processing (DSP) technologies when applied to estimating the Earth's layered structure on the basis of seismic data. Unlike many Earth sciences seismic data processing courses, this Geo-Signal Processing course also emphasizes that the perspective taken by those working in DSP is different from that taken by geophysicists. The course presents DSP with particular emphasis on seismic data signals and the artifacts accompanying them while covering the principles and algorithms needed for processing seismic signals in both deterministic and statistical fashion. Topics include, but are not limited to, basic seismic theory, acquisition of seismic data, analysis of seismic signals and noise, deterministic filtering of seismic data, and statistical processing of seismic data.", "authors": [{"name": "Wail A. Mousa", "affiliation": "Department of Electrical Engineering, King Fahd University of Petroleum and Minerals, Dhahran, Saudi Arabia"}], "tags": ["geo-signal processing", "graduate level course", "Applications of digital signal processing", "KFUPM", "seismic data acquisition", "statistical processing", "Dhahran", "Petroleum", "multidisciplinary course", "Noise", "Digital signal processing", "deterministic signal processing", "Petroleum industry", "data acquisition", "physics education", "Saudi Arabia", "King Fahd University of Petroleum and Minerals", "undergraduate course", "Data processing", "statistical analysis", "electrical engineering education", "Earth sciences seismic data processing courses", "seismic signal analysis", "Earth", "digital signal processing", "geophysical signal processing", "Earth Sciences Department", "DSP perspective", "seismic data processing", "geo-signals", "basic seismic theory", "deterministic filtering", "statistical signal processing", "seismology", "electrical engineering", "Materials"]}, {"title": "Educational Software for Interference and Optical Diffraction Analysis in Fresnel and Fraunhofer Regions Based on MATLAB GUIs and the FDTD Method", "link": "https://ieeexplore.ieee.org/document/5773462/", "abstract": "Interference and diffraction of light are elementary topics in optics. The aim of the work presented here is to develop an accurate and cheap optical-system simulation software that provides a virtual laboratory for studying the effects of propagation in both time and space for the near- and far-field regions. In laboratory sessions, this software can let optical engineering undergraduates simulate many optical systems based on thin slits. The numerical method used is the finite-difference time-domain (FDTD) method that has been successfully applied in many engineering fields. Using this numerical method, the irradiance distribution can be successfully evaluated in different planes far from the simulation grid without degrading performance. In addition, an easy-to-use MATLAB GUI handles all the parameters of the FDTD simulation and computes theoretical values of irradiance for both the Fresnel and Fraunhofer regions. Therefore, by using this software, the student is able to analyze the behavior of the Fresnel and Fraunhofer expressions as a function of the distance. This distance is defined as the space between the slits plane and the plane that contains the virtual screen on which the irradiance pattern is represented.", "authors": [{"name": "Sergio Bleda", "affiliation": "Universitat d'Alacant, Alacant, Comunitat Valenciana, ES"}, {"name": "Cristian Neipp", "affiliation": "Universitat d'Alacant, Alacant, Comunitat Valenciana, ES"}, {"name": "Augusto Belendez", "affiliation": "Universitat d'Alacant, Alacant, Comunitat Valenciana, ES"}, {"name": "Elena Fernandez", "affiliation": "Universitat d'Alacant, Alacant, Comunitat Valenciana, ES"}, {"name": "Manuel Perez-Molina", "affiliation": "University Institute of Physics to Sciences and Technologies, University of Alicante, Alicante, Spain"}, {"name": "Jorge Frances", "affiliation": "Department of Physics, Systems Engineering and Signal Theory, University of Alicante, Alicante, Spain"}], "tags": ["Approximation methods", "Fraunhofer region", "physics computing", "optical system simulation software", "virtual screen", "education", "physics education", "finite difference time-domain analysis", "Optical diffraction", "optics", "Software", "graphical user interfaces", "Finite difference methods", "computer aided instruction", "far field region", "light diffraction", "light interference", "irradiance distribution", "Fresnel region", "educational software", "finite difference time domain method", "finite-difference method", "virtual laboratory", "near field region", "light propagation effects", "FDTD method", "light propagation", "Diffraction", "MATLAB GUI", "mathematics computing", "Apertures"]}, {"title": "Experimental Economics for Teaching the Functioning of Electricity Markets", "link": "https://ieeexplore.ieee.org/document/6172536/", "abstract": "In the field of electricity markets, the development of training tools for engineers has been extremely useful. A novel experimental economics approach based on a computational Web platform of an electricity market is proposed here for the practical teaching of electrical engineering students. The approach is designed to diminish the gap that exists between theory and practice in this field, through a methodological strategy for teaching/ learning called “simulation.” In the proposed simulation exercise, groups of students operate as market agents and have the freedom to create their own strategies. Additionally, a theoretical model and a specific simulation tool are used for the evaluation of the proposed strategies. The test system is based on the market structure of the Chilean wholesale electricity market and was tested on student groups at two universities. Based on the students' performance, the strategic behavior of agents and their impact on market price evolution are described and analyzed. Student assessment supports the conclusion that the proposed experimental economics framework offers a useful mechanism in student practical work for understanding and explaining the observed phenomena.", "authors": [{"name": "Jessica Y. Guevara-Cedeño", "affiliation": "Department of Electrical Engineering, Technological University of Panama, Panama City, Panama"}, {"name": "Rosa Uribe", "affiliation": "Center of Energy, University of Chile (CMM, ISCI, DIE), Santiago, Chile"}, {"name": "Rodrigo Palma-Behnke", "affiliation": "Center of Energy, University of Chile (CMM, ISCI, DIE), Santiago, Chile"}], "tags": ["computational Web platform", "Internet", "Educational institutions", "electricity markets", "Chilean wholesale electricity market", "experimental economics", "experimental economics approach", "Economics", "pricing", "power markets", "training", "power engineering education", "power system simulation", "computer aided instruction", "teaching", "electrical engineering student", "practical teaching", "student assessment", "training tool", "Load modeling", "Training", "Games", "university", "Education", "market behavior", "market price evolution", "simulation tool", "simulation exercise", "power system economics", "Electricity supply industry"]}, {"title": "A Control Systems Concept Inventory Test Design and Assessment", "link": "https://ieeexplore.ieee.org/document/5953536/", "abstract": "Any meaningful initiative to improve the teaching and learning in introductory control systems courses needs a clear test of student conceptual understanding to determine the effectiveness of proposed methods and activities. The authors propose a control systems concept inventory. Development of the inventory was collaborative and iterative. The diagnostic test was administered to students before (pre) and after (post) student learning activities. Test responses were analyzed to provide instructors with feedback on their teaching. Using classical test theory and item response theory, aggregated results were analyzed to assess internal consistency and measurement error, respectively. Students demonstrated an improvement from pre- to post-test scores, showing gains of 23%-34% in understanding of new concepts learned. The internal consistency of the test has ranged from 0.61 to 0.68. It can be shown that the precision of the test is highest in the score range of 33%-66%, which is where most post-test scores occurred.", "authors": [{"name": "Jan Paul Huissoon", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Waterloo, Waterloo, ONT, Canada"}, {"name": "Gordon D. Stubley", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Waterloo, Waterloo, ONT, Canada"}, {"name": "Steven L. Waslander", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Waterloo, Waterloo, ONT, Canada"}, {"name": "Kaan Erkorkmaz", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Waterloo, Waterloo, ONT, Canada"}, {"name": "William S. Owen", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Waterloo, Waterloo, ONT, Canada"}, {"name": "Soo Jeon", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Waterloo, Waterloo, ONT, Canada"}, {"name": "Michele Bristow", "affiliation": "Department of Systems Design Engineering, University of Waterloo, Waterloo, ONT, Canada"}], "tags": ["classical test theory", "student learning activities", "Aerospace electronics", "control systems concept inventory assessment", "Time factors", "educational courses", "measurement error", "control engineering computing", "diagnostic test", "control engineering education", "Assessment", "control systems concept inventory test design", "Joining processes", "introductory control systems courses", "Gain measurement", "Item Response Theory (IRT)", "teaching", "control systems courses", "student conceptual understanding", "item response theory", "Mechatronics", "control systems", "concept inventory", "Education", "Control systems", "educational administrative data processing", "instructor teaching feedback", "internal consistency", "psychometric testing"]}, {"title": "Learning Switching Control: A Tank Level-Control Exercise", "link": "https://ieeexplore.ieee.org/document/5967920/", "abstract": "A key topic in multicontroller strategies is the mechanism for switching between controllers, depending on the current operating point. The objective of the switching mechanism is to keep the control action coherent. To help students understand the switching strategy involved in multicontroller schema and the relationship between the system dynamics and the switching structure, this paper proposes a student practical where basic linear control knowledge and a simple switching strategy are applied to an educational nonlinear control problem, that of controlling the level in a tank. Evaluation provided by the students is also included.", "authors": [{"name": "Manuel Berenguel", "affiliation": "Departamento de Lenguajes y Computación, University of Almería, Almeria, Spain"}, {"name": "José Domingo Alvarez", "affiliation": "Departamento de Lenguajes y Computación, University of Almería, Almeria, Spain"}, {"name": "Manuel Pasamontes", "affiliation": "Departamento de Lenguajes y Computación, University of Almería, Almeria, Spain"}, {"name": "José Luis Guzman", "affiliation": "Departamento de Lenguajes y Computación, University of Almería, Almeria, Spain"}], "tags": ["tank level-control exercise", "Mathematical model", "system dynamics", "Control engineering education", "basic linear control knowledge", "control engineering education", "tanks (containers)", "switching structure", "PID control", "Nonlinear dynamical systems", "Feedforward neural networks", "Switches", "educational nonlinear control problem", "level control", "Computational modeling", "time-varying systems", "switching control learning", "nonlinear control systems", "switching systems", "multicontroller strategy", "nonlinear systems"]}, {"title": "An Innovative Method of Teaching Electronic System Design With PSoC", "link": "https://ieeexplore.ieee.org/document/6129522/", "abstract": "Programmable system-on-chip (PSoC), which provides a microprocessor and programmable analog and digital peripheral functions in a single chip, is very convenient for mixed-signal electronic system design. This paper presents the experience of teaching contemporary mixed-signal electronic system design with PSoC in the Department of Automation, Tsinghua University, Beijing, China. An innovative teaching method was adopted, which involved designing a flexible experimental board, designing four experiments of different levels and with different teaching objectives, writing a textbook, and instructing students in out-of-class activities. This paper describes these in detail, as well as the courses in which the method was used, with their course objectives and contents. Finally, the course evaluation results and the design prizes for innovation won by students and teaching awards won by teachers are given, which confirm that this innovative teaching method is effective.", "authors": [{"name": "Chengying Hua", "affiliation": "Department of Automation, Tsinghua University, Beijing, China"}, {"name": "Zhaohui Ye", "affiliation": "Department of Automation, Tsinghua University, Beijing, China"}], "tags": ["System-on-a-chip", "Educational institutions", "Temperature measurement", "Computer architecture", "microprocessor", "electronic engineering education", "PSoC", "educational courses", "System analysis and design", "mixed analogue-digital integrated circuits", "programmable analog and digital peripheral functions", "teaching", "teaching method", "innovative teaching method", "programmable system-on-chip", "mixed-signal electronic system design", "system design", "Courses", "Light emitting diodes", "course projects", "system-on-chip", "programmable system-on-chip (PSoC)"]}, {"title": "Pipelined CPU Design With FPGA in Teaching Computer Architecture", "link": "https://ieeexplore.ieee.org/document/6093707/", "abstract": "This paper presents a pipelined CPU design project with a field programmable gate array (FPGA) system in a computer architecture course. The class project is a five-stage pipelined 32-bit MIPS design with experiments on the Altera DE2 board. For proper scheduling, milestones were set every one or two weeks to help students complete the project on time. The goal of the project is to educate students effectively via hands-on learning, rather than having them achieve a complete and flawless CPU design. This study reveals that 21 MIPS instructions are enough to achieve the purpose. With the addition in 2010 of the properly enforced scheduling and the FPGA system, many more students successfully completed the class project than was the case in 2009. A student survey and the independent samples t-test reveal the effectiveness of the methodology with the FPGA system. This work differs from previous work in that the devised project requires the implementation of a real CPU instead of utilizing simulators or just experimenting with ready-made complete CPU models.", "authors": [{"name": "Seung Eun Lee", "affiliation": "Department of Electronic and Information Engineering, Seoul National University of Science and Technology, Seoul, South Korea"}, {"name": "Taeweon Suh", "affiliation": "Department of Computer Science Education, Korea University, Seoul, South Korea"}, {"name": "Jong Hyuk Lee", "affiliation": "Creative Informatics and Computing Institute, Korea University, Seoul, South Korea"}, {"name": "Heon Chang Yu", "affiliation": "Department of Computer Science Education, Korea University, Seoul, South Korea"}], "tags": ["Altera DE2 board", "pipelined CPU design", "Computer architecture", "Pipeline processing", "class project", "hands-on learning", "teaching computer architecture", "problem-based learning (PBL)", "multiprocessing systems", "Field programmable gate arrays", "education", "field programmable gate arrays", "sampling methods", "Software", "ready-made complete CPU models", "pipeline", "field programmable gate array (FPGA)", "five-stage pipelined MIPS design", "Hardware", "students education", "field programmable gate array system", "fĺawless CPU design", "project management", "pipeline processing", "Education", "incremental learning", "Computational modeling", "FPGA system", "computer architecture", "learning (artificial intelligence)", "computer architecture course", "independent t-test samples", "processor scheduling", "computer science education"]}, {"title": "Improving a Computer Networks Course Using the Partov Simulation Engine", "link": "https://ieeexplore.ieee.org/document/6144730/", "abstract": "Computer networks courses are hard to teach as there are many details in the protocols and techniques involved that are difficult to grasp. Employing programming assignments as part of the course helps students to obtain a better understanding and gain further insight into the theoretical lectures. In this paper, the Partov simulation engine and experience using this engine in a computer networks course are discussed. Since 2009, various programming assignments based on the Partov system have been set to help students in their learning process. Student feedback has been very good; this has been quantified in two surveys in which a majority of students expressed their satisfaction with this approach.", "authors": [{"name": "Mehdi Kharrazi", "affiliation": "Department of Computer Engineering, Sharif University of Technology, Tehran, Iran"}, {"name": "Behnam Momeni", "affiliation": "Department of Computer Engineering, Sharif University of Technology, Tehran, Iran"}], "tags": ["programming assignments", "Computer networks", "Wireless communication", "computer networks course", "IP networks", "Partov simulation engine", "educational courses", "teaching tools", "Partov", "computer networks", "learning process", "Servers", "computer aided instruction", "Network topology", "Protocols", "protocols", "digital simulation", "Topology", "theoretical lectures", "Computational modeling", "network simulator", "student feedback", "computer science education"]}, {"title": "Electromagnetic Levitation of a Disc", "link": "https://ieeexplore.ieee.org/document/6032050/", "abstract": "This paper presents a teaching experiment that explores the levitation of a disc of ferromagnetic material in the presence of the magnetic field produced by a single electromagnet. In comparison to the classical experiment of the levitation of a sphere, the main advantage of the proposed laboratory bench is that the uniform magnetic field distribution in the air gap allows analytical calculations to be performed. This paper illustrates the important connection between theory, mathematical modeling, design, simulation, and experimental verification and emphasizes the educational opportunities that this experiment brings to subjects such as control, magnetic circuits, power electronics, and electromechanical energy conversion. The proposal can be seen as an introduction to the main issues of mechatronics and is being used as example to raise the interest of undergraduate electrical engineering students.", "authors": [{"name": "F. Neves", "affiliation": "Department of Control and Automation Engineering, Federal University of Rio de Janeiro, Rio de Janeiro, Brazil"}, {"name": "Rubens de Andrade Jr", "affiliation": "Department of Electrical Engineering, Federal University of Rio de Janeiro, Rio de Janeiro, Brazil"}, {"name": "Richard M. Stephan", "affiliation": "Department of Electrical Engineering, Federal University of Rio de Janeiro, Rio de Janeiro, Brazil"}, {"name": "Rodrigo Valle", "affiliation": "ELETROBRAS, Rio de Janeiro, Brazil"}], "tags": ["mechatronics", "ferromagnetic material", "Magnetic circuits", "Resonant frequency", "magnetic circuits", "air gap", "Levitation", "Electromagnetic forces", "power electronics", "undergraduate electrical engineering students", "magnetic field distribution", "electrical engineering education", "magnetic disc storage", "magnetic levitation", "stability", "mathematical modeling", "student experiments", "ferromagnetic materials", "electromagnets", "Electromagnets", "single electromagnet", "Control systems", "feedback control", "electromagnetic levitation", "electromechanical energy conversion", "disc", "teaching experiment"]}, {"title": "Generalized Simulation Model for a Switched-Mode Power Supply Design Course Using MATLAB/SIMULINK", "link": "https://ieeexplore.ieee.org/document/5722054/", "abstract": "Switched-mode power supplies (SMPS) are becoming an essential part of many electronic systems as the industry drives toward miniaturization and energy efficiency. However, practical SMPS design courses are seldom offered. In this paper, a generalized MATLAB/SIMULINK modeling technique is first presented. A proposed practical SMPS design course at Lunghua University, Taiwan, which incorporates this technique, is then described. In order to validate the correctness of the proposed modeling technique, four prototype SMPS are provided in this paper. These prototype circuits also serve as the laboratory section of the proposed course. The main objective of the course is to teach final-year undergraduate students and first-year Master's students how to design an SMPS in real life. The positive response from students indicates that the proposed technique is useful for SMPS design courses.", "authors": [{"name": "Yi-Hua Liu", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan"}, {"name": "Wei-Hsin Liao", "affiliation": "Department of Electrical Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan"}, {"name": "Shun-Chung Wang", "affiliation": "Department of Electrical Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}], "tags": ["ac–dc power conversion", "pulse-width modulated power converters", "Voltage control", "energy conservation", "Mathematical model", "Switched-mode power supply", "prototype circuits", "dc–dc power conversion", "educational courses", "power electronics", "generalized simulation model", "power engineering education", "Switches", "computer aided instruction", "switched mode power supply design course", "energy efficiency", "SMPS design course", "power engineering computing", "generalized MATLAB/SIMULINK modeling technique", "switched-mode power supplies (SMPS)", "further education", "switched mode power supplies", "Integrated circuit modeling", "Lunghua University", "Pulse width modulation", "undergraduate students", "Converters"]}, {"title": "Design of Optical Systems With Extended Depth of Field: An Educational Approach to Wavefront Coding Techniques", "link": "https://ieeexplore.ieee.org/document/6036004/", "abstract": "A practical activity designed to introduce wavefront coding techniques as a method to extend the depth of field in optical systems is presented. The activity is suitable for advanced undergraduate students since it combines different topics in optical engineering such as optical system design, aberration theory, Fourier optics, and digital image processing. This paper provides the theoretical background and technical information for performing the experiment. The proposed activity requires students able to develop a wide range of skills since they are expected to deal with optical components, including spatial light modulators, and develop scripts to perform some calculations.", "authors": [{"name": "Artur Carnicer", "affiliation": "Applied Physics and Optics Department, Universitat de Barcelona, Barcelona, Spain"}, {"name": "Salvador Bosch", "affiliation": "Applied Physics and Optics Department, Universitat de Barcelona, Barcelona, Spain"}, {"name": "Carme Ferran", "affiliation": "Applied Physics and Optics Department, Universitat de Barcelona, Barcelona, Spain"}], "tags": ["optical system design", "extended depth of field", "aberrations", "Integrated optics", "optical engineering", "optical elements", "optical transfer function", "Optical design", "Optical diffraction", "optical imaging", "spatial light modulator", "optical component", "Physical optics", "Optical polarization", "engineering education", "Fourier optics", "aberration theory", "spatial light modulators", "educational approach", "Fourier transform optics", "Education", "Lenses", "digital image processing", "wavefront coding technique", "Optical imaging", "image processing", "optical images"]}, {"title": "Educational Tool for Optimal Controller Tuning Using Evolutionary Strategies", "link": "https://ieeexplore.ieee.org/document/5733380/", "abstract": "In this paper, an optimal tuning tool is presented for control structures based on multivariable proportional-integral-derivative (PID) control, using genetic algorithms as an alternative to traditional optimization algorithms. From an educational point of view, this tool provides students with the necessary means to consolidate their knowledge on these control structures, which are of particular relevance in control engineering. The graphical user interface designed for the tool allows for the following: the selection of the control structure, the desired decoupling, the type of PID, the analysis of the interaction effects through relative gain array (RGA), the planning of several optimal tuning processes, the comparison of different designs (through graphics or the numeric results obtained), and the management of data files saved during the planned optimal tunings process. The developed tool was made available to students for them to solve a practical problem and, subsequently, the impact of its use was evaluated.", "authors": [{"name": "Fernando Morilla", "affiliation": "Departamento de Informática y Automática, Universidad Nacional de Educación a Distancia, Madrid, Spain"}, {"name": "Francisco Vazquez", "affiliation": "Departamento de Informática y Análisis Numérico, Universidad de Córdoba, Cordoba, Spain"}, {"name": "Daniel Carmona Morales", "affiliation": "Departamento de Informática y Análisis Numérico, Universidad de Córdoba, Cordoba, Spain"}, {"name": "Jorge E. Jimenez-Hornero", "affiliation": "Departamento de Informática y Análisis Numérico, Universidad de Córdoba, Cordoba, Spain"}], "tags": ["graphical user interface design", "three-term control", "multivariable control systems", "optimal control", "genetic algorithms (GAs)", "educational tool", "data file management", "control engineering education", "file organisation", "genetic algorithm", "graphical user interfaces", "MIMO", "optimal controller tuning tool", "Distributed control", "computer aided instruction", "multivariable control", "Optimization", "optimal tuning", "control engineering", "Process control", "genetic algorithms", "Educational tool", "multivariable proportional-integral-derivative control", "proportional-integral-derivative (PID)", "control structure", "Centralized control", "relative gain array", "planned optimal tuning process", "evolutionary strategy", "optimization algorithm", "Tuning"]}, {"title": "An Online, Interactive Renewable Energy Laboratory", "link": "https://ieeexplore.ieee.org/document/6202387/", "abstract": "An undergraduate introductory science, technology, engineering, and math (STEM) class can be a jarring disappointment to new students expecting to work with cutting-edge, realworld technology. Their cell phones are often more technically advanced and real-world than the tools used in a class lab. Not surprisingly, many complain that the STEM labs are dull and antiquated. To address these issues, the authors have created an online lab where students can interact via the Internet with tracking solar panels and solar power measurement tools at the University of California, Santa Cruz (UCSC) and the National Aeronautics and Space Administration (NASA) Renewable Energy (RE) Lab in Mountain View, CA. The authors evaluate the impact of using real-life, real-time, real-world solar data on student learning. In identical pre- and post-lab quizzes taken before and after students performed the lab, two thirds of errors made on the pre-quiz were corrected on the post-quiz.", "authors": [{"name": "Daniel A. O'Leary", "affiliation": "Electrical Engineering Department, University of California, Santa Cruz, CA, USA"}, {"name": "Joel Kubby", "affiliation": "Electrical Engineering Department, University of California, Santa Cruz, CA, USA"}, {"name": "Julie Shattuck", "affiliation": "Shattuck Applied Research & Evaluation, Santa Cruz, CA, USA"}], "tags": ["National Aeronautics and Space Administration", "undergraduate introductory science technology engineering and math", "Photovoltaic cells", "Internet", "cell phone", "online lab", "online learning", "solar cells", "Mountain View", "Power measurement", "interactive renewable energy laboratory", "Sun", "power", "virtual instrumentation", "power measurement", "University of California Santa Cruz", "solar panel tracking", "solar", "Renewable energy resources", "CA", "power engineering education", "Photonics", "computer aided instruction", "Tracking", "Electricity", "renewable energy", "solar data", "solar power measurement tool", "Laboratories", "UCSC", "STEM lab", "NASA", "further education", "STEM class"]}, {"title": "Reversing the Trend of Engineering Enrollment Declines With Innovative Outreach, Recruiting, and Retention Programs", "link": "https://ieeexplore.ieee.org/document/5872032/", "abstract": "This paper discusses an all-encompassing approach to increase the number of students in engineering through innovative outreach, recruiting, and retention programs. Prior to adopting these programs, the School of Electrical and Computer Engineering (ECE) at the University of Oklahoma (OU), Norman, experienced a reduction in engineering enrollment similar to the trend that has occurred across the U.S. over the last few years. As a result, the school investigated the key factors that influence selection of engineering as a career path and initiated a corrective program to reverse this trend. The program involves focusing on the present through retention, on the immediate future through recruiting, and on the distant future through outreach. The focus of all of these programs is to mobilize the OU-ECE faculty and student body to present advanced engineering technologies, innovative demonstrations, and hands-on activities at a level that the individual student can understand and appreciate. Student surveys and interviews are used to assess the program qualitatively, and OU-ECE enrollment numbers are used as a quantitative assessment.", "authors": [{"name": "Mark B. Yeary", "affiliation": "Department of Electrical and Computer Engineering, University of Oklahama, Norman, OK, USA"}, {"name": "Chad E. Davis", "affiliation": "Department of Electrical and Computer Engineering, University of Oklahama, Norman, OK, USA"}, {"name": "James J. Sluss", "affiliation": "Department of Electrical and Computer Engineering, University of Oklahama, Norman, OK, USA"}], "tags": ["recruitment", "Educational institutions", "School of Electrical and Computer Engineering", "OU-ECE faculty", "enrollment", "Engineering profession", "Electrical and computer engineering (ECE)", "U.S", "recruiting", "innovation management", "Electrical engineering", "Robots", "Organizations", "engineering students", "innovative outreach programs", "recruiting programs", "electrical engineering education", "engineering enrollment", "Computer bugs", "outreach", "retention", "retention programs", "University of Oklahoma", "computer science education", "engineering"]}, {"title": "Hands-On Learning Modules for Interdisciplinary Environments: An Example With a Focus on Weather Radar Applications", "link": "https://ieeexplore.ieee.org/document/6003804/", "abstract": "Learning modules provide an effective means of encouraging cognition and active learning. This paper discusses several such modules that have been developed within a course on weather radar applications intended for students from Electrical Engineering and Meteorology. The modules were designed both to promote interdisciplinary exchange between the students and to guide them from a theoretical to an applied understanding of weather radar and the interactions of radio waves with geophysical media. The learning modules introduce students to various means of acquiring weather radar data from real-time and archival sources and ways in which to query and visualize them. They are also tasked with analyzing data from several actual and significant meteorological events and asked to assess the strengths and limitations of current methods of retrieving rainfall rates. Data sources include both weather radars and complementary surface-based instrumentation. The modules may be used in a variety of locations and by a diversity of students. Although developed for weather radar applications, the concepts discussed are applicable to other interdisciplinary classroom environments.", "authors": [{"name": "Mark B. Yeary", "affiliation": "School of Electrical and Computer Engineering and the Atmospheric Radar Research Center, University of Oklahama, Norman, OK, USA"}, {"name": "Phillip B. Chilson", "affiliation": "School of Meteorology and the Atmospheric Radar Research Center, University of Oklahama, Norman, OK, USA"}], "tags": ["scattering parameters", "Meteorological radar", "rainfall rate", "cognition", "radiowaves", "weather radar data", "educational courses", "radio wave", "interdisciplinary exchange", "education", "Scattering", "meteorological radar", "active learning", "electrical engineering education", "interdisciplinary classroom environment", "electromagnetics", "geophysical media", "rain", "Meteorology", "meteorology", "Doppler radar", "weather radar application", "hands-on learning module", "Radar cross section", "interdisciplinary environment", "course", "electrical engineering", "surface-based instrumentation"]}, {"title": "An Ill-Structured PBL-Based Microprocessor Course Without Formal Laboratory", "link": "https://ieeexplore.ieee.org/document/5783318/", "abstract": "This paper introduces a problem-based learning (PBL) microprocessor application course designed according to the following strategies: 1) hands-on training without having a formal laboratory, and 2) intense student-centered cooperative learning through an ill-structured problem. PBL was adopted as the core educational technique of the course to accomplish student learning outcomes such as fundamental knowledge acquisition and applications, practical design experiences, problem-solving skills, higher-order thinking, teamwork and communication skills, and lifelong self-directed learning capability. In the designed course, students were required to build their own hardware system on a breadboard and learn how to program, download, and execute from a student mentor's demonstration. Students were also asked to choose a design topic for their team project with minimum guidelines and were encouraged to learn whatever was necessary to accomplish the project autonomously. The course has been offered for two years and has obtained overwhelming positive feedback from students.", "authors": [{"name": "Jungkuk Kim", "affiliation": "Electronic Engineering Department, Myongji University, Yongin si, South Korea"}], "tags": ["microprocessor", "microprocessor application course", "hardware system", "problem-based learning (PBL)", "electronic engineering education", "Industries", "educational courses", "Ill-structured PBL based microprocessor course", "computer aided instruction", "Hardware", "Embedded system", "Laboratories", "Microcontrollers", "formal laboratory", "Training", "core educational technique", "Embedded systems", "microprocessor chips", "microcontroller", "knowledge acquisition", "problem based learning"]}, {"title": "Fair and Square Computation of Inverse $ {\\cal Z}$-Transforms of Rational Functions", "link": "https://ieeexplore.ieee.org/document/6047582/", "abstract": "All methods presented in textbooks for computing inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transforms of rational functions have some limitation: 1) the direct division method does not, in general, provide enough information to derive an analytical expression for the time-domain sequence \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">x</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">k</i>\n) whose \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transform is \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">X</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">z</i>\n) ; 2) computation using the inversion integral method becomes labored when \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">X</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">z</i>\n)\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">zk</i>\n-1 has poles at the origin of the complex plane; 3) the partial-fraction expansion method, in spite of being acknowledged as the simplest and easiest one to compute the inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transform and being widely used in textbooks, lacks a standard procedure like its inverse Laplace transform counterpart. This paper addresses all the difficulties of the existing methods for computing inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n -transforms of rational functions, presents an easy and straightforward way to overcome the limitation of the inversion integral method when \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">X</i>\n(\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">z</i>\n)\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">zk</i>\n-1 has poles at the origin, and derives five expressions for the pairs of time-domain sequences and corresponding \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n-transforms that are actually needed in the computation of inverse \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">Z</i>\n -transform using partial-fraction expansion.", "authors": [{"name": "Marcos Vicente Moreira", "affiliation": "COPPE-Programa de Engenharia Elétrica, Electrical Engineering, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brazil"}, {"name": "João Carlos Basilio", "affiliation": "COPPE-Programa de Engenharia Elétrica, Electrical Engineering, Universidade Federal do Rio de Janeiro, Rio de Janeiro, Brazil"}], "tags": ["partial-fraction expansion method", "inversion integral method", "inverse Laplace transform", "time-domain sequences", "Poles and zeros", "inverse transforms", "Time domain analysis", "Laplace equations", "inverse $ {\\cal Z}$-transformation", "inverse Z-transforms", "Convergence", "Polynomials", "Z transforms", "discrete-time signals", "teaching methodology", "Control education", "discrete-time systems", "Education", "rational functions"]}, {"title": "An Investigation Into the Understanding and Skills of First-Year Electrical Engineering Students", "link": "https://ieeexplore.ieee.org/document/5722055/", "abstract": "In response to demands from industry and the profession for more graduates, first-year engineering numbers have grown considerably over the last decade, matched by an increasing diversity of academic backgrounds. In order to support first-year students effectively, and ensure the courses they take remain appropriately pitched, the academic preparedness of these students must be determined. Since 2007, the lecturers in the compulsory first-year Electrical and Digital Systems course at the University of Auckland (UoA), Auckland, New Zealand, have administered a short diagnostic test to determine the level of conceptual understanding of electricity and electromagnetics possessed by the incoming students. This paper presents and discusses student understanding of dc circuit theory as revealed by the diagnostic test and subsequent investigations. The evidence is indicative of both flawed conceptual models and context-triggered misapplication of fundamental rules. Parallels are drawn with the results of research conducted elsewhere, indicating the misconceptions are robust and pervasive, crossing institutional and national boundaries. Not only are concepts such as current and voltage poorly understood, but even more basic concepts such as series and parallel connections are confusing for a significant number of students. Understanding the incorrect models that underlie these basic misconceptions is the first step to correcting them. Only then can students proceed to the more advanced concepts that engineering graduates are required to master.", "authors": [{"name": "Elizabeth Godfrey", "affiliation": "Department of Engineering, Sydney University of Technology, Sydney, NSW, Australia"}, {"name": "Chris R. Smaill", "affiliation": "Department of Electrical and Computer Engineering, University of Auckland, Auckland, New Zealand"}, {"name": "Gerard B. Rowe", "affiliation": "Department of Electrical and Computer Engineering, University of Auckland, Auckland, New Zealand"}, {"name": "Rod O. Paton", "affiliation": "Department of Physics, Westlake Boys High School, Westlake, New Zealand"}], "tags": ["Conceptual misunderstandings", "Educational institutions", "engineering graduate", "Resistance", "diagnostic testing", "electric circuits", "Circuit theory", "Cognition", "educational courses", "diagnostic test", "first-year electrical system course", "first year electrical engineering student", "parallel connection", "electrical engineering education", "Mathematics", "DC circuit theory", "freshmen engineering courses", "context-triggered misapplication", "Integrated circuit modeling", "academic course", "Physics", "digital system course"]}, {"title": "Algorithmic Bricks: A Tangible Robot Programming Tool for Elementary School Students", "link": "https://ieeexplore.ieee.org/document/6172535/", "abstract": "Tangible programming tools enable children to easily learn the programming process, previously considered to be difficult for them. While various tangible programming tools have been developed, there is still a lack of available tools to help students experience the general programming process. This study therefore developed a tool called Algorithmic Bricks (A-Bricks), to improve the programming language experience by considering and utilizing characteristics of procedural language. Specifically, elements such as sequence, repetition, condition, function, and parameter were used to develop A-Bricks. In addition, this study observed the benefits of A-Bricks and confirmed its potential as a tangible educational programming tool by comparing and analyzing elementary school students using A-Bricks to control groups using Scratch.", "authors": [{"name": "Han-Sung Kim", "affiliation": "Department of Computer Science Education, Korea University, Seoul, Korea"}, {"name": "Won-Gyu Lee", "affiliation": "Department of Computer Science Education, Korea University, Seoul, Korea"}, {"name": "Dai-Young Kwon", "affiliation": "Creative Information & Computing Institute, Korea University, Seoul, Korea"}, {"name": "Jae-Kwoun Shim", "affiliation": "Department of Computer Science Education, Korea University, Seoul, Korea"}], "tags": ["Algorithmic Bricks", "Usability", "procedural language", "programming languages", "elementary school students", "repetition", "A-Bricks", "tangible robot programming tool", "Robots", "condition", "Joining processes", "computer aided instruction", "parameter", "User interfaces", "Debugging", "tangible user interface", "Scratch", "programming language", "procedural programming", "sequence", "educational robot", "function", "Computer science education", "Programming profession", "computer science education", "robot programming"]}, {"title": "MATLAB-Based Program for Teaching Autocorrelation Function and Noise Concepts", "link": "https://ieeexplore.ieee.org/document/6094173/", "abstract": "An attractive MATLAB-based tool for teaching the basics of autocorrelation function and noise concepts is presented in this paper. This tool enhances traditional in-classroom lecturing. The demonstrations of the tool described here highlight the description of the autocorrelation function (ACF) in a general case for wide-sense stationary (WSS) processes, and for several important special processes including Gaussian white noise (GWN), non-Gaussian white noise, and Gaussian non-white noise. The demonstrations were designed for and introduced in the graduate-level course “Introduction to Communications,” but would also be appropriate at the undergraduate level in various courses on signals or communications, or in a basic course on probability and random variables. The course description and program evaluations are also included.", "authors": [{"name": "Gordana Jovanovic Dolecek", "affiliation": "National Institute INAOE, Puebla, Mexico"}], "tags": ["graduate level course", "non-Gaussian white noise", "Gaussian noise", "White noise", "MATLAB based program", "MATLAB based tool", "Estimation", "Gaussian white noise", "noise concepts", "educational courses", "ACF", "classroom lecturing", "WSS", "GWN", "Correlation", "Probability density function", "computer aided instruction", "power spectral density (PSD)", "Gaussian band-limited noise", "Random variables", "course description", "introduction to communications", "Autocorrelation function (ACF)", "Education", "program evaluations", "wide sense stationary", "Gaussian white noise (GWN)", "mathematics computing", "teaching autocorrelation function"]}, {"title": "Using Student Conferences to Increase Participation in the Classroom: A Case Study", "link": "https://ieeexplore.ieee.org/document/6161618/", "abstract": "This paper describes the use of a student conference as a novel experience aimed at motivating students enrolled in various computer architecture courses, such as Microprocessor Systems. The goal was to increase student engagement, to decrease failure rates, and to introduce students to the world of research. This multidisciplinary experience enabled students from several universities and cities to participate in a scientific conference while addressing novel research topics. This experience, and the understanding thus gained of the assorted roles of participants in a scientific conference—authors, reviewers, and local, steering, and scientific committees—served to increase the engagement and collaboration of both students and instructors and helped to decrease the dropout rate.", "authors": [{"name": "J. J. Merelo", "affiliation": "School of Computer and Telecommunications Engineering, University of Granada, Granada, Spain"}, {"name": "F. Fernández de Vega", "affiliation": "Mérida University Center, University of Extremadura, Granada, Spain"}, {"name": "M. G. Arenas", "affiliation": "School of Computer and Telecommunications Engineering, University of Granada, Granada, Spain"}, {"name": "P. A. Castillo", "affiliation": "School of Computer and Telecommunications Engineering, University of Granada, Granada, Spain"}], "tags": ["Telecommunications", "interuniversity conference", "Educational institutions", "Engineering education", "Computer architecture", "Organizations", "student conference", "student engagement", "Computer science", "innovation", "Organizing", "Conferences"]}, {"title": "Using Video Tutorials as a Carrot-and-Stick Approach to Learning", "link": "https://ieeexplore.ieee.org/document/6161619/", "abstract": "Traditional teaching styles practiced at universities do not generally suit all students' learning styles. For a variety of reasons, students do not always engage in learning in the courses in which they are enrolled. New methods to create and deliver educational material are available, but these do not always improve learning outcomes. Acknowledging these truths and developing and delivering educational material that provides diverse ways for students to learn is a constant challenge. This study examines the use of video tutorials within a university environment in an attempt to provide a teaching model that is valuable to all students, and in particular to those students who are not engaging in learning. The results of a three-year study have demonstrated that the use of well-designed, assessment-focused, and readily available video tutorials have the potential to improve student satisfaction and grades by enabling and encouraging students to learn how they want, when they want, and at a pace that suits their needs.", "authors": [{"name": "Robert Mathie Barry", "affiliation": "School of Information Technology, Deakin University, Geelong, Victoria, Australia"}, {"name": "Jason Wells", "affiliation": "School of Information Technology, Deakin University, Waurn Ponds, Victoria, Australia"}, {"name": "Aaron Spence", "affiliation": "School of Information Technology, Deakin University, Geelong, Victoria, Australia"}], "tags": ["educational material creation", "Educational institutions", "educational institutions", "Tutorials", "carrot-and-stick learning approach", "teaching model", "university environment", "education", "programming", "student satisfaction", "video tutorials", "learning", "Curriculum development", "computer aided instruction", "teaching", "Computers", "teaching styles", "student learning styles", "educational material delivery", "learning outcomes", "videos", "Programming profession", "tutorials", "Materials"]}]