[{"title": "Source Code Plagiarism—A Student Perspective", "link": "https://ieeexplore.ieee.org/document/5451097/", "abstract": "This paper considers the problem of source code plagiarism by students within the computing disciplines and reports the results of a survey of students in Computing departments in 18 institutions in the U.K. This survey was designed to investigate how well students understand the concept of source code plagiarism and to discover what, if any, specific aspects might cause particular confusion. An analysis of the results was carried out to assess understanding by topic and to discover whether various demographic factors may have an influence on that understanding. Within the survey sample, it appeared that the demographic factors tested did not generally affect students' understanding of source code plagiarism. However, analysis of the data for specific topics revealed that there are several areas of activity where the boundary between acceptable and unacceptable behavior is not clearly understood. These findings have implications for plagiarism education programs.", "authors": [{"name": "Jane Sinclair", "affiliation": "Computer Science Department, University of Warwick, Coventry, UK"}, {"name": "Georgina Cosma", "affiliation": "P.A. College, Larnaca, Cyprus"}, {"name": "Mike Joy", "affiliation": "Computer Science Department, University of Warwick, Coventry, UK"}, {"name": "Jane Yin-Kim Yau", "affiliation": "Computer Science Department, University of Warwick, Coventry, UK"}], "tags": ["Computing disciplines", "Education", "university education", "U.K. institution", "plagiarism", "student survey", "Computer languages", "Plagiarism", "source code plagiarism", "university student", "Programming profession", "Materials", "demography", "Books", "source code", "demographic factor", "educational institutions", "data analysis", "source coding", "computer science education", "education program"]}, {"title": "Exploring Three-Phase Systems and Synchronous Motors: A Low-Voltage and Low-Cost Experiment at the Sophomore Level", "link": "https://ieeexplore.ieee.org/document/5438833/", "abstract": "In order to meet changing curricular and societal needs, a three-phase system and synchronous motor laboratory experience for sophomore-level students in a wide variety of engineering majors was designed, implemented, and assessed. The experiment is unusual in its early placement in the curriculum, and in that it focuses primarily on basic understanding of balanced three-phase systems and synchronous motor operating principles. While a low-voltage three-phase system and subfractional-horsepower electric motors were used, experimental results proved to be reliable, accurate, and repeatable. Changes in student knowledge and confidence in the application of that knowledge was assessed and shown to have increased significantly in each case.", "authors": [{"name": "Ernest M. Kim", "affiliation": "Department of Engineering, University of San Diego, San Diego, CA, USA"}, {"name": "Thomas F. Schubert", "affiliation": "Department of Engineering, University of San Diego, San Diego, CA, USA"}, {"name": "Frank G. Jacobitz", "affiliation": "Department of Engineering, University of San Diego, San Diego, CA, USA"}], "tags": ["sophomore-level students", "Assessment", "Synchronization", "three-phase", "low-voltage experiment", "synchronous motors", "Synchronous motors", "synchronous motor operating principles", "power systems", "subfractional-horsepower electric motors", "Voltage measurement", "Radiation detectors", "low-cost experiment", "balanced three-phase systems", "DC motors", "Power measurement", "electric motors", "power engineering education", "engineering majors", "laboratory", "Laboratories", "low-voltage three-phase system"]}, {"title": "The Design of NetSecLab: A Small Competition-Based Network Security Lab", "link": "https://ieeexplore.ieee.org/document/5454381/", "abstract": "This paper describes a competition-style of exercise to teach system and network security and to reinforce themes taught in class. The exercise, called NetSecLab, is conducted on a closed network with student-formed teams, each with their own Linux system to defend and from which to launch attacks. Students are expected to learn how to: 1) install the specified Linux distribution; 2) set up the required services; 3) find ways to harden the box; 4) explore attack methods; and 5) compete. The informal write-up at the end of the lab focuses on their research into defense and attack methods, which contributes to their grade, while their competition score is dependent on their abilities to attack during the competition. Surveys were performed to evaluate the efficacy of the exercise in teaching system security.", "authors": [{"name": "Kevin D. Fairbanks", "affiliation": "Communications Systems Center, School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "Arif Selcuk Uluagac", "affiliation": "Communications Systems Center, School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "John A. Copeland", "affiliation": "Communications Systems Center, School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "Christopher P. Lee", "affiliation": "Communications Systems Center, School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["Security", "Education", "computer aided instruction", "IP networks", "network security education", "Linux", "Computers", "computer network security", "student-formed teams", "teaching system security", "Generators", "network security", "closed network", "Linux distribution system", "network security lab", "teach system", "Materials", "NetSecLab", "small competition-based network security lab"]}, {"title": "Emulation-Based Virtual Laboratories: A Low-Cost Alternative to Physical Experiments in Control Engineering Education", "link": "https://ieeexplore.ieee.org/document/5431072/", "abstract": "This paper argues the case for emulation-based virtual laboratories in control engineering education. It demonstrates that such emulation experiments can give students an industrially relevant educational experience at relatively low cost. The paper also describes a particular emulation-based system that has been developed with the aim of giving students an introduction to real-world control engineering design.", "authors": [{"name": "Adrian M. Medioli", "affiliation": "School of Electrical Engineering and Computer Science, University of Newcastle, Callaghan, NSW, Australia"}, {"name": "Willy Sher", "affiliation": "School of Electrical Engineering and Computer Science, University of Newcastle, Callaghan, NSW, Australia"}, {"name": "Ljubo B. Vlacic", "affiliation": "School of Engineering, Griffith University, Nathan, QLD, Australia"}, {"name": "James S. Welsh", "affiliation": "School of Architecture and Built Environment, University of Newcastle, Callaghan, NSW, Australia"}, {"name": "Graham C. Goodwin", "affiliation": "School of Electrical Engineering and Computer Science, University of Newcastle, Callaghan, NSW, Australia"}], "tags": ["Education", "virtual instrumentation", "real world control engineering design", "engineering education", "Composite teaching techniques", "control engineering education", "teaching resources", "emulation experiment", "emulation based virtual laboratory", "low-cost laboratories", "virtual laboratories", "Mathematical model", "Emulation", "Actuators", "User interfaces", "Laboratories", "physical experiment", "teaching", "emulation-based laboratories"]}, {"title": "Validation of Symbolic Expressions in Circuit Analysis E-Learning", "link": "https://ieeexplore.ieee.org/document/5639063/", "abstract": "Symbolic circuit analysis is a cornerstone of electrical engineering education. Solving a suitable set of selected problems is essential to developing professional skills in the field. A new method is presented for automatic validation of circuit equations representing a student's intermediate steps in the solving process. Providing this immediate feedback may strongly enhance the training effects. The new method was embedded in a Web-based e-learning system and has proved to be useful in circuit analysis training, both at an introductory level and for more advanced problems in analog electronics.", "authors": [{"name": "Maarten De Bock", "affiliation": "Department of Electronics and Information Systems (ELIS), Engineering Faculty, University of Ghent, Ghent, Belgium"}, {"name": "Benoit Catteau", "affiliation": "Department of Electronics and Information Systems (ELIS), Engineering Faculty, University of Ghent, Ghent, Belgium"}, {"name": "Pieter Rombouts", "affiliation": "Department of Electronics and Information Systems (ELIS), Engineering Faculty, University of Ghent, Ghent, Belgium"}, {"name": "Ludo Weyten", "affiliation": "Department of Electronics and Information Systems (ELIS), Engineering Faculty, University of Ghent, Ghent, Belgium"}], "tags": ["computer aided instruction", "Web-based e-learning system", "Electronic learning", "analog electronics", "network theory", "Equations", "e-learning", "Educational institutions", "electrical engineering computing", "electrical engineering education", "analogue circuits", "Analog circuits", "Circuit analysis", "circuit analysis training", "Mathematical model", "symbolic circuit analysis", "circuit analysis", "circuit analysis e-learning", "symbolic expression validation", "Operational amplifiers", "distance learning", "network analysis", "training"]}, {"title": "The Key Factors of an Active Learning Method in a Microprocessors Course", "link": "https://ieeexplore.ieee.org/document/5463048/", "abstract": "The creation of the European Higher Education Area (EHEA) is promoting a change toward a new model of education focused on the student. It is impelling methodological innovation processes in many European universities, leading more teachers to apply methods based on active and cooperative learning in their classrooms. However, the successful implementation of these methodologies involves changes to a significant portion of the teaching process, from instructional design and organization to development of learning materials, and even teacher activity inside the classroom. Three years' experience of introducing active learning techniques in microprocessors courses have made the authors well-acquainted with these challenges. This research analyzes the importance of different factors in achieving greater student engagement and satisfaction with the learning process.", "authors": [{"name": "Javier Corredor", "affiliation": "Sistemas Electronicos y de Control, Universidad Politecnica de Madrid, Madrid, Spain"}, {"name": "Antonio Carpeño", "affiliation": "Sistemas Electronicos y de Control, Universidad Politecnica de Madrid, Madrid, Spain"}, {"name": "Javier Hernández", "affiliation": "Sistemas Electronicos y de Control, Universidad Politecnica de Madrid, Madrid, Spain"}, {"name": "Jesús Arriaga", "affiliation": "Sistemas Electronicos y de Control, Universidad Politecnica de Madrid, Madrid, Spain"}], "tags": ["Education", "Microprocessors", "Reliability", "microprocessors course", "regression analysis", "cooperative learning", "Learning systems", "teaching", "Europe", "electronic engineering education", "Materials", "student engagement and satisfaction", "active learning method", "Technological innovation", "computer electronics", "microprocessor chips", "Active and cooperative learning", "European Higher Education Area (EHEA)", "teacher activity"]}, {"title": "T&D-Bench—Innovative Combined Support for Education and Research in Computer Architecture and Embedded Systems", "link": "https://ieeexplore.ieee.org/document/5711701/", "abstract": "Teaching and Design Workbench (T&D-Bench) is a framework aimed at education and research in the areas of computer architecture and embedded systems. It includes a set of features not found in other educational environments. This set of features is the result of an original combination of design requirements for T&D-Bench: that the framework should provide modeling capabilities similar to that of Architecture Description Languages (popular in embedded systems design), and that it should have the simulation capabilities found only in educational simulators. This paper highlights the main features and the latest achievements of the framework and of its didactic and research simulators. The results of a new didactic strategy, supported by the simulators, are presented and discussed. The design of a new architectural feature for embedded processors, using a research simulator, is introduced, and it is shown how to employ such a research work as an educational module to teach the complexities involved in embedded systems design.", "authors": [{"name": "Flávio Rech Wagner", "affiliation": "Instituto de Informática, Universidade Federal do Rio Grande do Sul, Porto Alegre, Brazil"}, {"name": "Sandro Neves Soares", "affiliation": "Centro de Ciências Exatas, da Natureza e de Tecnologia, Universidade de Caxias do Sul, Bento Goncalves, Brazil"}], "tags": ["computer aided instruction", "Computer architecture", "Program processors", "Organizations", "architecture description language", "education", "Load modeling", "computer architecture", "simulation", "T&D-Bench", "Graphical user interfaces", "embedded system", "Solid modeling", "computer-aided instruction", "Teaching and Design Workbench", "Computational modeling", "embedded systems", "computer science education", "design methodology"]}, {"title": "A Laboratory-Based Course in Display Technology", "link": "https://ieeexplore.ieee.org/document/5512573/", "abstract": "A laboratory-based class in flat-panel display technology is presented. The course introduces fundamental concepts of display systems and reinforces these concepts through the fabrication of three display devices-an inorganic electroluminescent seven-segment display, a dot-matrix organic light-emitting diode (OLED) display, and a dot-matrix liquid crystal display (LCD). Instead of fabricating a device over multiple laboratory sessions, students fabricate a functional device in a single session. This approach to teaching fabrication provides students immediate results, can accommodate students with disparate backgrounds, and can be easily adapted and expanded. This paper discusses the laboratory design, its impact on student experiences, and possible improvements and extensions.", "authors": [{"name": "Ioannis Kymissis", "affiliation": "Columbia Laboratory of Unconventional Electronics, Department of Electrical Engineering, Columbia University, New York, NY, USA"}, {"name": "John Sarik", "affiliation": "Columbia Laboratory of Unconventional Electronics, Department of Electrical Engineering, Columbia University, New York, NY, USA"}, {"name": "Akintunde Ibitayo Akinwande", "affiliation": "MIT Laboratory of Organic Optics and Electronics, Massachusetts Institute of Technology, Cambridge, MA, USA"}], "tags": ["display instrumentation", "flat panel display technology", "Substrates", "flat panel displays", "inorganic electroluminescent seven segment display", "Displays", "LCD display", "light-emitting diode (LED) displays", "electrical engineering education", "fabrication", "Liquid crystal displays", "Organic light emitting diodes", "electroluminescent devices", "educational courses", "liquid crystal displays (LCDs)", "liquid crystal displays", "laboratory techniques", "OLED display", "laboratory based course", "dot matrix liquid crystal display", "organic light emitting diodes", "dot matrix organic light emitting diode", "Laboratories", "Drives", "Fabrication"]}, {"title": "Description and Assessment of Activities Oriented to Enhance a First Course on Power Electronics", "link": "https://ieeexplore.ieee.org/document/5638614/", "abstract": "The ongoing search for excellence in education requires the review and renewal of teaching strategies, concentrating efforts on courses that are not attractive to students or are considered to be unsuccessful. This paper is focused on an undergraduate power electronics course in which students had poor academic results in the past. The actions taken to improve the situation over the last several academic years are described, and an exhaustive analysis is presented of the results achieved, based on student statistics and surveys. The teaching experience is presented so as to offer some useful tips for educators wanting to improve courses of similar characteristics in a cost-effective and efficient way.", "authors": [{"name": "Antonio Lazaro", "affiliation": "Departmento deTecnología Electrónica, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Pablo Zumel", "affiliation": "Departmento deTecnología Electrónica, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Marina Sanz", "affiliation": "Departmento deTecnología Electrónica, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Andrés Barrado", "affiliation": "Departmento deTecnología Electrónica, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Cristina Fernandez", "affiliation": "Departmento deTecnología Electrónica, Universidad Carlos III de Madrid, Madrid, Spain"}], "tags": ["simulation", "Education", "teaching", "laboratory", "teaching strategy", "Engineering education", "electronic engineering education", "power electronics", "Power systems", "undergraduate power electronics course", "Laboratories", "teaching material", "Electrical engineering", "educational courses", "Power electronics", "Materials", "exhaustive analysis", "Integrated circuit modeling"]}, {"title": "Wireless Sensor Networks—A Hands-On Modular Experiments Platform for Enhanced Pedagogical Learning", "link": "https://ieeexplore.ieee.org/document/5411936/", "abstract": "This paper presents the use of wireless sensor net works (WSNs) in educational research as a platform for enhanced pedagogical learning. The aim here with the use of a WSN plat form was to go beyond the implementation stage to the real-life ap plication stage, i.e., linking the implementation to real-life applications, where abstract theory and algorithmic implementations become natural tools for the execution of application itself. Abstract theoretical concepts are illustrated through hands-on modular experiments in a host of diverse electrical and computer engineering courses. The WSN consists of Mica2 motes with on-board sensors, wireless communication antennas, and processors that are programmed using NesC. Three sets of experiments feeding into different courses [on topics such as wireless embedded networks, detection and estimation theory, stochastic processes, probability theory, statistical pattern recognition, and digital signal processing (DSP)] and illustrating different theoretical concepts are presented in detail. These experiments can be used as demos in those courses and/or can be incorporated as hands-on laboratory projects to go hand in hand with the course in which they are introduced. Also presented is the assessment of the experiments as pedagogical tools, made by means of well-designed evaluation questionnaires given to the students. Both the sensor network platform and the novel experiments built on this platform are found to be pedagogically successful tools for learning about and teaching the theoretical concepts introduced in those courses. The assessment survey shows that students who had very little knowledge on average before the demonstrations/experiments gained extensive knowledge and interest in the subject matter after going through them.", "authors": [{"name": "Fredricka K. Reisman", "affiliation": "School of Education and Goodwin College of Professional Studies, Drexel University, Philadelphia, PA, USA"}, {"name": "Ezgi Taslidere", "affiliation": "Department of Electrical and Computer Engineering, Drexel University, Philadelphia, PA, USA"}, {"name": "Fernand S. Cohen", "affiliation": "Department of Electrical and Computer Engineering, Drexel University, Philadelphia, PA, USA"}], "tags": ["computer aided instruction", "hands-on modular experiment", "receiver operating characteristics (ROC) curve", "Digital signal processing", "Object detection", "MICA2 motes", "hands-on laboratory project", "electrical engineering course", "wireless sensor networks", "educational research", "target detection", "computer engineering course", "enhanced pedagogical learning", "electrical engineering education", "antennas", "educational courses", "Wireless sensor networks", "wireless sensor networks (WSNs)", "NesC", "WSN", "Histograms", "Light emitting diodes", "motion tracking", "Light sources", "Programming", "hands-on experiments", "wireless communication antenna", "Decision making", "computer science education", "on-board sensor"]}, {"title": "How to Teach Residue Number System to Computer Scientists and Engineers", "link": "https://ieeexplore.ieee.org/document/5457965/", "abstract": "The residue number system (RNS) has been an important research field in computer arithmetic for many decades, mainly because of its carry-free nature, which can provide high-performance computing architectures with superior delay specifications. Recently, research on RNS has found new directions that have resulted in the introduction of efficient algorithms and hardware implementations for RNS with much better performance than previous ones. Furthermore, the applicability of RNS in many computer and digital signal processing (DSP) applications has simultaneously greatly increased. Hence, the need is evident for the development of a new and well-organized RNS teaching method with emphasis on recent achievements. In this paper, a step-by-step teaching process for RNS that describes RNS design in separate parts is presented. Each part is investigated in detail, taking into account the recent research performed on RNS. The compatibility of the proposed method with the new RNS research trends makes this method suitable for researchers as well as students.", "authors": [{"name": "Amir Sabbagh Molahosseini", "affiliation": "Microelectronic Laboratory, Shahid Beheshti University, Tehran, Iran"}, {"name": "Keivan Navi", "affiliation": "Faculty of Electrical and Computer Engineering, Shahid Beheshti University, Tehran, Iran"}, {"name": "Mohammad Esmaeildoust", "affiliation": "Faculty of Electrical and Computer Engineering, Shahid Beheshti University, Tehran, Iran"}], "tags": ["reverse converter", "Converters", "Dynamic range", "Hardware", "Cathode ray tubes", "Algorithm design and analysis", "computer arithmetic", "residue number systems", "high performance computing architecture", "further education", "moduli sets", "computer engineer", "Mathematical model", "forward converter", "RNS teaching", "Forward converter", "residue number system (RNS)", "computer scientist", "Adders", "moduli set", "residue number system", "teaching", "computer science education", "residue arithmetic"]}, {"title": "A Web-Based Learning System for Software Test Professionals", "link": "https://ieeexplore.ieee.org/document/5487435/", "abstract": "Fierce competition, globalization, and technology innovation have forced software companies to search for new ways to improve competitive advantage. Web-based learning is increasingly being used by software companies as an emergent approach for enhancing the skills of knowledge workers. However, the current practice of Web-based learning is perceived as being less goal-effective due to a lack of alignment of learning with work performance. To solve this problem, a performance-oriented approach is presented in this study. Using this approach, a Web-based learning system has been developed for software testing professionals. An empirical study was conducted by inviting employees working in the software testing sector to use and evaluate the system. The results showed the effectiveness of the proposed approach.", "authors": [{"name": "Haiyang Jia", "affiliation": "Jilin University, Changchun, China"}, {"name": "Weijia Ran", "affiliation": "University of Hong Kong, Hong Kong, China"}, {"name": "Vijayan Sugumaran", "affiliation": "Oakland University, Rochester, MI, USA"}, {"name": "Jian Liao", "affiliation": "Southwest University, Chongqing, China"}, {"name": "Minhong Wang", "affiliation": "University of Hong Kong, Hong Kong, China"}], "tags": ["learning systems", "software testing sector", "performance-oriented approach", "competitive advantage", "software testing professionals", "Ontologies", "Training", "knowledge workers", "software companies", "learning system", "Learning systems", "Web-based learning system", "technology innovation", "globalization", "Software testing", "personnel", "DP industry", "Companies", "program testing", "employees", "Software", "software testing", "Education technology", "computer science education", "computer based training", "training", "Context"]}, {"title": "Teaching Agile Software Development: A Case Study", "link": "https://ieeexplore.ieee.org/document/5487434/", "abstract": "This paper describes the authors' experience of teaching agile software development to students of computer science, software engineering, and other related disciplines, and comments on the implications of this and the lessons learned. It is based on the authors' eight years of experience in teaching agile software methodologies to various groups of students at different universities, in different cultural settings, and in a number of courses and seminars. It specifically discusses three different courses on agile software development, given in different teaching settings and at different levels, and briefly surveys variations to these courses given elsewhere. Based on the experience acquired, analyses and evaluations conducted, and current pedagogical trends at relevant university departments, the authors provide recommendations on how to overcome potential problems in teaching agile software development and make their adoption more effective.", "authors": [{"name": "Vladan Devedžić", "affiliation": "FON-School of Business Administration, University of Belgrade, Belgrade, Serbia"}, {"name": "Sas˘a R. Milenkovic", "affiliation": "School of Business Administration, University of Belgrade, Belgrade, Serbia, FKN-Faculty of Computer Sciences, Megatrend University, Belgrade, Serbia"}], "tags": ["cultural setting", "Software", "Industries", "software prototyping", "Variable speed drives", "Scrum", "Educational institutions", "Programming", "computer science", "pedagogical trend", "Agile software development (ASD)", "agile software development teaching", "software engineering", "Extreme Programming (XP)", "teaching", "computer science education", "educational courses", "Testing"]}, {"title": "A Spiral Step-by-Step Educational Method for Cultivating Competent Embedded System Engineers to Meet Industry Demands", "link": "https://ieeexplore.ieee.org/document/5535217/", "abstract": "Embedded system technologies are undergoing dramatic change. Competent embedded system engineers are becoming a scarce resource in the industry. Given this, universities should revise their specialist education to meet industry demands. In this paper, a spirally tight-coupled step-by-step educational method, based on an analysis of industry requirements, is proposed. The learning process consists of multiple learning circles piled up in a spiral. Each learning circle consists of three steps: lecture, demo, and hands-on practice, which are tight-coupled to enable students to readily revisit essential knowledge. The circle currently being studied is directly based on the previous circle, so as to maintain a smooth learning curve. Since students can quickly see the result of their work, their motivation to learn remains high. Since a learning circle takes only a short period to complete, the core knowledge and skills can be repeated in different forms across the three types of educational step so that students can master them. The students' achievement and performance using the proposed method show that it can enable them to master the requisite knowledge and effectively transform this into skills.", "authors": [{"name": "Zixue Cheng", "affiliation": "School of Computer Science and Engineering, University of Aizu, Aizu-Wakamatsu, Japan"}, {"name": "Lei Jing", "affiliation": "School of Computer Science and Engineering, University of Aizu, Aizu-Wakamatsu, Japan"}, {"name": "Yinghui Zhou", "affiliation": "School of Electrical Engineering, Yanshan University슠, Qinhuangdao, China"}, {"name": "Junbo Wang", "affiliation": "Graduate School of Computer Science and Engineering, University of Aizu, Aizu-Wakamatsu, Japan"}], "tags": ["smooth learning curve", "engineering education", "Embedded systems", "multiple learning circle", "project-based learning (PBL)", "Embedded system", "industry requirement", "Training", "Educational institutions", "competent embedded system engineer", "Educational activities", "spirally tight coupled step-by-step educational method", "Spirals", "scarce resource", "step-by-step learning", "Industries", "competent embedded system cultivation", "industry demand", "educational institutions", "university–industry cooperative education", "embedded systems", "learning process"]}, {"title": "Enhancement of Student Learning Through the Use of a Hinting Computer e-Learning System and Comparison With Human Teachers", "link": "https://ieeexplore.ieee.org/document/5439694/", "abstract": "This paper reports the results of an experiment in a Computer Architecture Laboratory course classroom session, in which students were divided into two groups for interaction both with a hinting e-learning system and with human teachers generating hints. The results show that there were high learning gains for both groups, demonstrating the effectiveness of the human teachers as well as of the computer-based hinting e-learning system even without the use of adaptive and personalization capabilities. In addition, in the worst case, the difference in favor of human teachers (with a low student-to-teacher ratio of 13.5 students per teacher) would not be significant with respect to the e-learning system, so the computer-based system can replace teachers without a significant loss of effectiveness.", "authors": [{"name": "Carlos Delgado Kloos", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Mario Munoz-Organero", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}, {"name": "Pedro J. Munoz-Merino", "affiliation": "Carlos III Technical University of Madrid, Madrid, Spain"}], "tags": ["computer aided instruction", "Physics", "Electronic learning", "Computer architecture", "Assessment", "Computers", "computer-based hinting e-learning system", "e-learning", "Probability", "Internet", "Humans", "human teachers", "educational courses", "computers", "Adaptive systems", "computer architecture laboratory course classroom session", "evaluation", "hints", "computer science education"]}, {"title": "The Impact of Providing Unlimited Access to Programmable Boards in Digital Design Education", "link": "https://ieeexplore.ieee.org/document/5361402/", "abstract": "This paper presents the benefits and costs of providing students with unlimited access to programmable boards in digital design education, allowing hands-on experiences outside traditional laboratory settings. Studies were conducted at three universities in two different countries-Rose Hulman Institute of Technology, Terre Haute, IN; Washington State University, Pullman; and Technical University of Cluj-Napoca, Romania-to measure the effect on student learning and student performance of students having their own programmable hardware systems and unrestricted access to the most commonly used design tools. The results of the studies, supported by assessment data from various sources, suggest that the overall learning process is improved, and students gain a better knowledge of modern technologies and design methods if they are given full time access to programmable logic boards.", "authors": [{"name": "Clint Cole", "affiliation": "Electrical and Computer Engineering Department, Washington State University, Pullman, WA, USA"}, {"name": "Shannon Sexton", "affiliation": "Office of Institutional Research, Planning, and Assessment, Rose Hulman Institute of Technology, Terre Haute, IN, USA"}, {"name": "Joe Harris", "affiliation": "Digilent, Inc., Pullman, WA, USA"}, {"name": "Mircea Alexandru Dabacan", "affiliation": "Electronics Department, Technical University of Cluj Napoca, Cluj-Napoca, Romania"}, {"name": "Mihaela Elena Radu", "affiliation": "Electrical and Computer Engineering Department, Rose Hulman Institute of Technology, Terre Haute, IN, USA"}], "tags": ["laboratories", "Technical University of Cluj-Napoca", "hands-on experience", "Hardware", "Design automation", "Educational institutions", "student learning", "Washington State University", "digital design education", "electronic engineering education", "programmable logic boards", "laboratory techniques", "programmable boards", "Assessment data", "unlimited access", "Iron", "Field programmable gate arrays", "programmable logic devices", "Rose Hulman Institute of Technology", "Laboratories", "programmable hardware systems", "lab objectives", "hands-on experiences", "design tools"]}, {"title": "Use of a New Moodle Module for Improving the Teaching of a Basic Course on Computer Architecture", "link": "https://ieeexplore.ieee.org/document/5463047/", "abstract": "This paper describes how a new Moodle module, called CTPracticals, is applied to the teaching of the practical content of a basic computer organization course. In the core of the module, an automatic verification engine enables it to process the VHDL designs automatically as they are submitted. Moreover, a straightforward modification of this engine would make it possible to extend its application to other programming languages. The module provides students with real-time knowledge of the state of their work by their accessing the result of the automatic assessment or feedback messages. Teachers have a constant global view of the status of their class and have available multiple options such as sending feedback messages to students, obtaining statistics, launching additional verifications in batch, and so on. Likewise, the module substantially improves some organizational aspects, and its design may help teachers to encourage teamwork. Its use partially frees teachers from certain routine work, saving time that can be devoted to teaching objectives and tutoring activities.", "authors": [{"name": "Francisco Corbera", "affiliation": "Department of Computer Architecture, University of Màlaga, Malaga, Spain"}, {"name": "Eladio D. Gutierrez", "affiliation": "Department of Computer Architecture, University of Màlaga, Malaga, Spain"}, {"name": "María A. Trenas", "affiliation": "Department of Computer Architecture, University of Màlaga, Malaga, Spain"}, {"name": "Sergio Romero", "affiliation": "Department of Computer Architecture, University of Màlaga, Malaga, Spain"}, {"name": "Julián Ramos", "affiliation": "Department of Computer Architecture, University of Màlaga, Malaga, Spain"}], "tags": ["computer aided instruction", "Education", "basic computer organization course", "Computer architecture", "team working", "Automatic assessment", "electronic engineering computing", "Computers", "VHDL simulation", "CTPracticals", "Integrated circuit modeling", "feedback message", "logic design", "Engines", "automatic assessment", "tutoring activity", "programming language", "computer architecture", "educational courses", "electronic engineering education", "Moodle", "Moodle module", "teamwork", "learning management systems", "automatic verification engine", "real-time knowledge", "Solid modeling", "hardware description languages", "VHDL design", "Computational modeling", "teaching"]}, {"title": "Teaching Behavioral Modeling and Simulation Techniques for Power Electronics Courses", "link": "https://ieeexplore.ieee.org/document/5598547/", "abstract": "This paper suggests a pedagogical approach to teaching the subject of behavioral modeling of switch-mode power electronics systems through simulation by general-purpose electronic circuit simulators. The methodology is oriented toward electrical engineering (EE) students at the undergraduate level, enrolled in courses such as “Power Electronics,” “Industrial Electronics,” or the like. The proposed approach is demonstrated by simulation example of a realistic active power factor corrector (APFC) system. The paper discusses the derivation of PSPICE/ORCAD-compatible behavioral models, their software implementation, and fast time domain, frequency domain, and stability analysis simulation techniques suitable for virtual study of complex nonlinear feedback systems. Some “tricks of the trade” are also suggested. The paper can be helpful to instructors of a “Virtual Power Electronics Laboratory” course wanting to conduct a software experiment on a PFC system.", "authors": [{"name": "Alexander Abramovitz", "affiliation": "Electrical and Electronics Engineering, Sami Shamoon College of Engineering, Beersheba, Israel"}], "tags": ["computer aided instruction", "Analytical models", "APFC system", "active power factor corrector system", "electrical engineering student", "EE student", "time domain simulation technique", "stability analysis simulation technique", "power electronics course", "Integrated circuit modeling", "power factor correction", "Feedback", "software experiment", "complex nonlinear feedback system", "power factor", "feedback circuits", "teaching behavioral simulation technique", "SPICE", "switch-mode power electronics system", "Load modeling", "educational courses", "general-purpose electronic circuit simulator", "frequency domain simulation technique", "simulation", "teaching behavioral modeling technique", "electronic engineering education", "Mathematical model", "switch-mode power conversion", "virtual power electronics laboratory", "power electronics", "industrial electronics", "PSPICE-ORCAD-compatible behavioral model", "teaching", "Power electronics", "Voltage control"]}, {"title": "A Web Service and Interface for Remote Electronic Device Characterization", "link": "https://ieeexplore.ieee.org/document/5710034/", "abstract": "A lightweight Web Service and a Web site interface have been developed, which enable remote measurements of electronic devices as a “virtual laboratory” for undergraduate engineering classes. Using standard browsers without additional plugins (such as Internet Explorer, Firefox, or even Safari on an iPhone), remote users can control a Keithley source-measurement unit and monitor results in real time from anywhere on the Internet. As an in-class example, students in a solid-state electronics course used the Web site interface to make real-time transistor measurements. Recommendations are made on how to best integrate the interface into electronics classes based on the student assignment responses. The present interface is flexible and could be expanded to many other devices and instruments. The source code has been openly posted online.", "authors": [{"name": "Sumit Dutta", "affiliation": "Micro and Nanotechnology Lab, Department of Electrical and Computer Engineering, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}, {"name": "Shreya Prakash", "affiliation": "Micro and Nanotechnology Lab, Department of Electrical and Computer Engineering, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}, {"name": "Eric Pop", "affiliation": "Micro and Nanotechnology Lab, Department of Electrical and Computer Engineering, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}, {"name": "David Estrada", "affiliation": "Micro and Nanotechnology Lab, Department of Electrical and Computer Engineering, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}], "tags": ["computer aided instruction", "Real time systems", "virtual instrumentation", "virtual laboratory", "engineering education", "electronic engineering computing", "Web sites", "Servers", "telecontrol", "Web service", "undergraduate engineering class", "Internet", "solid-state electronics course", "standard browser", "student assignment response", "Keithley source-measurement unit", "remote measurement", "MOSFETs", "remote electronic device characterization", "educational courses", "Educational technology", "electronic engineering education", "control engineering computing", "Browsers", "Web site interface", "online services", "metal-oxide-semiconductor field-effect transistors (MOSFETs)", "Instruments", "Web services"]}, {"title": "A Multiple-Sessions Interactive Computer-Based Learning Tool for Ability Cultivation in Circuit Simulation", "link": "https://ieeexplore.ieee.org/document/5422840/", "abstract": "An interactive computer-based learning tool with multiple sessions is proposed in this paper, which teaches students to think and helps them recognize the merits and limitations of simulation tools so as to improve their practical abilities in electrical circuit simulation based on the case of a power converter with progressive problems. The common problem of fast simulation and differential equation solver convergence are discussed in detail for the simulation of nonlinear power electronic circuits. Another special ratio for ripple restriction is proposed, taking practical work into consideration. Some design and simulation tradeoffs for corresponding problems are also presented. Such a learning tool can improve students' programming skills and inspire their interest in practical work as well. The practical tests-carried out at the Aichi Institute of Technology, Toyota, Japan, and Southeast University, Nanjing, China- validate the effectiveness of the learning tool.", "authors": [{"name": "Norman C. F. Tse", "affiliation": "Division of Building Science and Technology, City University of Hong Kong, Hong Kong, China"}, {"name": "Katsuhiro Ichiyanagi", "affiliation": "Aichi Institute of Technology, Toyota, Japan"}, {"name": "Qingshan Xu", "affiliation": "Electrical Engineering School, South-East University, Nanjing, China"}, {"name": "Loi Lei Lai", "affiliation": "Energy Systems Group, City University of London, London, UK"}], "tags": ["computer aided instruction", "Education", "nonlinear power electronic circuit", "Capacitors", "interactive systems", "ability cultivation", "circuit simulation", "Integrated circuit modeling", "power convertors", "China", "electrical engineering education", "power converter", "Load modeling", "Mathematical model", "Japan", "differential equations", "simulation tool", "Inductors", "multiple sessions interactive computer-based learning tool", "Toyota", "Nanjing", "Aichi institute", "power electronics", "ripple restriction", "southeast university", "electrical circuit simulation", "Computational modeling", "Converters", "differential equation"]}, {"title": "A Simulation-Based LED Design Project in Photonics Instruction Based on Industry–University Collaboration", "link": "https://ieeexplore.ieee.org/document/5680622/", "abstract": "In response to the growing industrial demand for light-emitting diode (LED) design professionals, based on industry-university collaboration in Taiwan, this paper develops a novel instructional approach: a simulation-based learning course with peer assessment to develop students' professional skills in LED design as required by industry as well as to enhance cognition and metacognition in students in higher education. The simulation-based learning course enables students to understand the influences on LED performance of the variation of different parameters and to seek the best design through comparing the effectiveness of different combinations of parameters. The evaluation results of pre- and post-test knowledge maps and a photonics scoreboard indicate that this project-based instruction may help students understand the operating principles of LEDs and enhance their skill in LED design. The Constructivist Project-based Learning Environment Survey is adopted to demonstrate that the proposed project-based learning environment is beneficial in cultivating student inquiry learning, reflective thinking, teamwork, and skills in creative problem solving.", "authors": [{"name": "Mei-Ling Chen", "affiliation": "Department of Physics and Institute of Photonics, National Changhua University of Education, Changhua, Taiwan"}, {"name": "Yen-Kuang Kuo", "affiliation": "National Chiao Tung University, Taiwan"}, {"name": "Shu-Hsuan Chang", "affiliation": "Department of Physics of Education, National Changhua University슠of Education, Changhua, Taiwan"}, {"name": "Yung-Chi Shen", "affiliation": "National Chiao Tung University, Taiwan"}], "tags": ["computer aided instruction", "Education", "simulation based learning", "Physics", "light emitting diode", "electronic engineering computing", "Photonics", "Teamwork", "project-based learning (PBL)", "peer assessment (PA)", "Light-emitting diode (LED)", "industry-university collaboration", "electronic engineering education", "constructivist project based learning environment survey", "photonics instruction", "Software", "Light emitting diodes", "light emitting diodes", "simulation-based learning (SBL)", "Computational modeling", "LED design project"]}, {"title": "Collaborative Learning Using Wiki Web Sites for Computer Science Undergraduate Education: A Case Study", "link": "https://ieeexplore.ieee.org/document/5454284/", "abstract": "This paper proposes a collaborative approach to enhancing the student learning experience based on Web 2.0 principles. Specifically, wiki Web sites are used by students for collaboration and for publication of course assignments, which are then shared with the class. Web 2.0 principles include: the Web as platform, harnessing collective intelligence, data are the next Intel Inside, and rich user experiences. Based on a case study in a junior-level undergraduate class, this paper studies a set of six factors with comprehensive grading and evaluation criteria that are critical to make this approach successful. The six factors are knowledge base, motivation, research, social aspects, presentation, and feedback and support. The data collected show that most of the students who participated feel that this approach is exciting and rewarding, and that even some undergraduate students are able to produce original and innovative concepts. The data also show other interesting phenomena with respect to motivation, undergraduate research, and social aspects. Finally, the paper proposes a methodology of conducting a wiki project in a university class using a cyclic constant improvement process.", "authors": [{"name": "Wei-Tek Tsai", "affiliation": "Computer Science Department, Tsinghua University, Beijing, China, School of Computing, Informatics, and Decision Systems Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Wu Li", "affiliation": "Department of Computer Science and Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Jay Elston", "affiliation": "School of Computing, Informatics and Decision Systems Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Yinong Chen", "affiliation": "School of Computing, Informatics and Decision Systems Engineering, Arizona State University, Tempe, AZ, USA"}], "tags": ["Education", "Web 2.0 principle", "junior level undergraduate class", "distance learning", "Web sites", "comprehensive grading", "courseware", "Internet", "collective intelligence", "social aspect", "knowledge base", "Intel", "wiki", "further education", "Wiki Web site", "innovative concept", "educational courses", "Collaboration", "social networking", "computer science undergraduate education", "Blogs", "collaborative learning", "Collaborative learning", "groupware", "Materials", "cyclic constant improvement process", "Software", "Web 2.0", "course assignment", "Computer science", "computer science education"]}, {"title": "Teaching Embedded System Concepts for Technological Literacy", "link": "https://ieeexplore.ieee.org/document/5699380/", "abstract": "A basic understanding of technology is recognized as important knowledge even for students not connected with engineering and computer science. This paper shows that embedded system concepts can be taught in a technological literacy course. An embedded system teaching block that has been used in an electronics module for non-engineers is presented. It comprises 1 h of lecturing and 3 h of hands-on lab work. Feedback and evaluation show that students are able to gain a basic understanding of the topic even in such a limited time.", "authors": [{"name": "Marco Winzker", "affiliation": "Bonn-Rhine-Sieg University of Applied Sciences, Sankt Augustin, Germany"}, {"name": "Andrea Schwandt", "affiliation": "Bonn-Rhine-Sieg University of Applied Sciences, Sankt Augustin, Germany"}], "tags": ["Education", "engineering education", "Embedded systems", "Computers", "electronics module", "technological literacy", "embedded system concepts", "technological literacy course", "Automotive electronics", "non-engineering students", "educational courses", "feedback", "embedded system teaching block", "hands-on lab work", "computer science", "nonengineers", "engineering for non-engineers", "Programming profession", "Microcontrollers", "Educational methods", "engineering", "lifelong learning", "embedded systems", "teaching", "computer science education"]}, {"title": "A Switching-Mode Power Supply Design Tool to Improve Learning in a Power Electronics Course", "link": "https://ieeexplore.ieee.org/document/5447794/", "abstract": "The static design of ac/dc and dc/dc switching-mode power supplies (SMPS) relies on a simple but repetitive process. Although specific spreadsheets, available in various computer-aided design (CAD) programs, are widely used, they are difficult to use in educational applications. In this paper, a graphic tool programmed in MATLAB is presented, which allows students to apply and to reflect upon the knowledge acquired in theoretical classes. This tool has been successfully employed in the course “Sistemas Electrónicos de Alimentación” in the Telecommunications Engineering degree as part of a project in new education methods (University of Oviedo project PB-08-019). During practical sessions, the students used the tool to design a SMPS, achieving better learning results than was the case without the tool. In addition, the tool was successfully used to improve the students' theoretical knowledge of the subject.", "authors": [{"name": "Diego G. Lamar", "affiliation": "Power Supply Systems Group, Department of Electrical and Electronic Engineering, University of Oviedo, Gijon, Spain"}, {"name": "Alberto Rodriguez", "affiliation": "Power Supply Systems Group, Department of Electrical and Electronic Engineering, University of Oviedo, Gijon, Spain"}, {"name": "Miguel Rodriguez", "affiliation": "Power Supply Systems Group, Department of Electrical and Electronic Engineering, University of Oviedo, Gijon, Spain"}, {"name": "Manuel Arias Pérez de Azpeitia", "affiliation": "Power Supply Systems Group, Department of Electrical and Electronic Engineering, University of Oviedo, Gijon, Spain"}, {"name": "Marta M. Hernando", "affiliation": "Power Supply Systems Group, Department of Electrical and Electronic Engineering, University of Oviedo, Gijon, Spain"}, {"name": "Pablo F. Miaja", "affiliation": "Power Supply Systems Group, Department of Electrical and Electronic Engineering, University of Oviedo, Gijon, Spain"}], "tags": ["Switched-mode power supply", "computer aided instruction", "switching mode power supply", "graphic tool programm", "SMPS", "project-based learning", "power electronics course", "education", "Semiconductor diodes", "computer-aided design", "Computer-aided engineering", "educational courses", "switching power supplies teaching", "Inductors", "Materials", "knowledge acquisition", "power engineering education", "learning", "Magnetic cores", "educational technology", "Converters", "switched mode power supplies"]}, {"title": "Guest Editorial: Cross-Fertilization of Engineering Education Research and Development", "link": "https://ieeexplore.ieee.org/document/6062573/", "abstract": null, "authors": [{"name": "Phillip C. Wankat", "affiliation": "School of Chemical Engineering, Purdue University, West Lafayette, IN, USA"}], "tags": ["Technological innovation", "Research and development", "Engineering education"]}, {"title": "Effects of Response-Driven Feedback in Computer Science Learning", "link": "https://ieeexplore.ieee.org/document/5620936/", "abstract": "This paper presents the results of a project on generating diagnostic feedback for guided learning in a first-year course on programming and a Master's course on software quality. An online multiple-choice questions (MCQs) system is integrated with neural network-based data analysis. Findings about how students use the system suggest that the feedback is effective in addressing the level of knowledge of the individual and guiding him/her toward a greater understanding of particular concepts. In contrast, there is no evidence that learning required in programming problems, where students develop higher-level thinking according to Bloom's taxonomy, was exercised by using MCQs.", "authors": [{"name": "Chrisina Jayne", "affiliation": "Faculty of Computing, London Metropolitan University, London, UK"}, {"name": "José Luis Fernandez Fernandez Aleman", "affiliation": "Department of Informatics and Systems, Facultad de Informática, University of Murcia, Murcia, Spain"}, {"name": "Dominic Palmer-Brown", "affiliation": "Faculty of Computing, London Metropolitan University, London, UK"}], "tags": ["computer aided instruction", "Electronic learning", "programming course", "e-learning", "online multiple choice questions system", "Active learning", "Training", "neural network", "software quality", "feedback", "Software quality", "computer science learning", "diagnostic feedback", "Bloom taxonomy", "guided learning", "higher education", "Artificial neural networks", "Programming", "software quality masters course", "response driven feedback", "computer science education", "Neurons"]}, {"title": "Control Systems Lab Using a LEGO Mindstorms NXT Motor System", "link": "https://ieeexplore.ieee.org/document/5585842/", "abstract": "This paper introduces a low-cost LEGO Mindstorms NXT motor system for teaching classical and modern control theories in standard third-year undergraduate courses. The LEGO motor system can be used in conjunction with MATLAB, Simulink, and several necessary toolboxes to demonstrate: 1) a modeling technique; 2) proportional-integral-differential (PID) control; and 3) state feedback control and estimator design. This paper describes the use of these demonstrations during three lab sessions and illustrates their usefulness for helping students to understand the modeling and control systems theories.", "authors": [{"name": "Yoonsoo Kim", "affiliation": "Department of Mechanical and Mechatronics Engineering, University of Stellenbosch, Matieland, South Africa"}], "tags": ["Real time systems", "state feedback", "modeling technique", "undergraduate courses", "motor control", "control systems lab", "control engineering education", "educational courses", "control system synthesis", "Sensors", "estimator design", "MATLAB", "three-term control", "LEGO Mindstorms NXT", "Mathematical model", "modeling", "DC motors", "control theories", "Control systems", "toolboxes", "Control engineering education", "state feedback control", "LEGO Mindstorms NXT motor system", "proportional-integral-differential control"]}, {"title": "A Mixed Learning Approach in Mechatronics Education", "link": "https://ieeexplore.ieee.org/document/5508395/", "abstract": "This study aims to investigate the effect of a Web-based mixed learning approach model on mechatronics education. The model combines different perception methods such as reading, listening, and speaking and practice methods developed in accordance with the vocational background of students enrolled in the course Electromechanical Systems in mechatronics education. For this purpose, the effectiveness of the model recommended for mechatronics education was investigated on a working group consisting of 32 sophomore students in the 2008-2009 Spring semester in the Mechatronics Department of the Faculty of Technical Education, Marmara University, Istanbul, Turkey. The 12-week-long Electromechanical Systems course is given each semester and covers the topics of mechatronics, electric principles, electrostatics, magnetism and principles, control components, control and power circuits, industrial electronics, and direct and alternating current motors. The text, pictures, and images for the Web-supported education materials used in the study were developed using Adobe Presenter and Adobe Captivate software. In addition, Adobe Flash was used to provide the interactivity between the students and the training content, and 3dsMax software was used for 3-D simulations. Finally, Adobe Connect Professional software was used as a learning management system. During this process, expert opinion in the field of educational sciences, instructional technologies, and electromechanical systems was consulted. The efficiency of the model recommended for mechatronics education was evaluated by using data collection forms and the results of interviews with the students.", "authors": [{"name": "Özgür Yilmaz", "affiliation": "Department of Mechatronics Education, Marmara University, Istanbul, Turkey"}, {"name": "Koray Tunçalp", "affiliation": "Department of Mechatronics Education, Marmara University, Istanbul, Turkey"}], "tags": ["computer aided instruction", "mechatronics", "Adobe Connect Professional software", "alternating current motors", "Adobe Presenter software", "Electromechanical systems", "Web-based mixed learning approach", "vocational background", "Training", "3dsMax software", "Adobe Flash", "mechatronics education", "Adobe Captivate software", "AC motors", "Mechatronics", "direct current motors", "Marmara University", "Web-based mixed education", "electronic engineering education", "training content", "electromechanical systems", "DC motors", "Learning", "3D simulations", "learning management system", "Software", "Industries", "Laboratories"]}, {"title": "Ten Years of Cybertech: The Educational Benefits of Bullfighting Robotics", "link": "https://ieeexplore.ieee.org/document/5658177/", "abstract": "After 10 years of organizing the Cybertech robotics competition, this paper presents this unique and innovative educational experience of teaching engineering at Universidad Politécnica de Madrid (UPM), Spain. Cybertech is not only a well-known robotic contest in Spain due to the Robotaurus bullfighting, but is also a whole academic activity spanning theory, laboratory practical lessons, seminars, tutoring, and a spectacular contest in which robots, developed by the students, compete. It is an open activity, for all students and grades, requiring knowledge of various subjects such as mechanics, microcontrollers, control, and electronics. The experience acquired has shown how this novel educational approach can boost the motivation of students, who in a real applied project effectively learn not only the particular subject matter, but also skills in teamwork, oral presentations, budget management, and so on. This is considered the flagship of innovation in education at UPM. This paper describes the evolution of Cybertech over the past 10 years, summarizes the educational experience, and provides some statistics and results as well as a perspective for future editions of the competition.", "authors": [{"name": "Diego Rodriguez-Losada", "affiliation": "Automática e Informática Industrial (ELAI), Escuela Universitaria de Ingeniería Téchnica Industrial (EUITI), Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Miguel Hernando", "affiliation": "Automática e Informática Industrial (ELAI), Escuela Universitaria de Ingeniería Téchnica Industrial (EUITI), Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Ramón Galan", "affiliation": "División de Ingeniería de Sistemas y Automática (DISAM), Escuela Técnica Superior de Ingenieros Industriales (ETSII), Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Iñaki Navarro", "affiliation": "División de Ingeniería de Sistemas y Automática (DISAM), Escuela Técnica Superior de Ingenieros Industriales (ETSII), Universidad Politécnica de Madrid, Madrid, Spain"}], "tags": ["Robot sensing systems", "Education", "robotaurus bullfighting", "student motivation", "tutoring", "budget management", "team working", "control engineering education", "spectacular contest", "robotics contest", "oral presentations", "laboratory practical lessons", "robotics workshop", "academic activity spanning theory", "Mobile communication", "Conferences", "educational courses", "innovation", "interdisciplinary curricula", "bullfighting robotics", "Europe", "Universidad Politécnica de Madrid", "innovation management", "cybertech robotics competition", "seminars", "educational benefits", "educational approach", "teamwork", "innovative educational experience", "UPM", "robotic contest", "engineering teaching", "teaching", "robots"]}, {"title": "Mechatronics Learning Studio: From “Play and Learn” to Industry-Inspired Green Energy Applications", "link": "https://ieeexplore.ieee.org/document/5720526/", "abstract": "This paper describes the evolution of the teaching of electrical engineering to mechanical engineering students based on motivation and a pedagogical strategy incorporating interdisciplinary mechatronics projects in a learning studio environment. Implementation of student projects within the curriculum has been demonstrated to be highly motivational and educational and has even evolved from “play and learn” into industry-inspired green energy applications as a platform for multiple student competitions. Several examples of successful student projects are discussed. These modules can be used as motivation instruments to gradually enhance the interest of current and future engineering students in mechatronics. In this paper, a summary of student feedback is provided, and benefits, challenges, and lessons learned from this initiative are discussed.", "authors": [{"name": "Christine Suurtamm", "affiliation": "Faculty of Education, University of Ottawa, Ottawa, ONT, Canada"}, {"name": "Riadh W. Y. Habash", "affiliation": "School of Information Technology and Engineering, University of Ottawa, Ottawa, ONT, Canada"}, {"name": "Dan Necsulescu", "affiliation": "Department of Mechanical Engineering, University of Ottawa, Ottawa, ONT, Canada"}], "tags": ["mechatronics", "learning studio environment", "mechatronics learning studio", "play and learn", "Cranes", "project-based learning (PBL)", "pedagogical strategy", "student competitions", "Educational institutions", "electrical engineering teaching", "electrical engineering education", "studios", "interdisciplinary mechatronics projects", "educational courses", "student projects", "mechanical engineering", "Mechatronics", "Robots", "motivation", "industry-inspired green energy", "Industry participation", "Industries", "curriculum", "mechanical engineering students", "Laboratories", "multiple student competitions"]}, {"title": "An Undergraduate Nanotechnology Engineering Laboratory Course on Atomic Force Microscopy", "link": "https://ieeexplore.ieee.org/document/5560696/", "abstract": "The University of Waterloo, Waterloo, ON, Canada, is home to North America's first undergraduate program in nanotechnology. As part of the Nanotechnology Engineering degree program, a scanning probe microscopy (SPM)-based laboratory has been developed for students in their fourth year. The one-term laboratory course “Nanoprobing and Lithography” is accompanied by a preceding one-term lecture course, “Nanoprobing and Lithography.” The lecture course lays the theoretical foundation for the concepts covered in the laboratory course. The students work in groups of two and obtain hands-on experience in biweekly 3-h laboratory sessions. The labs use a dedicated undergraduate SPM teaching facility consisting of five atomic force microscope stations. The laboratory course covers all common standard modes of operation, as well as force spectroscopy, electrostatic force microscopy, magnetic force microscopy, and scanning probe lithography by electrochemical oxidation and scratching/ploughing of resist. In light of the breadth of the nanotechnology engineering educational program in terms of synthesis and characterization of nanomaterials, the authors designed a dedicated SPM lab with a capacity of up to 130 students per term.", "authors": [{"name": "Daniel Russo", "affiliation": "University of Waterloo, Waterloo, ONT, Canada"}, {"name": "Thorsten Hesjedal", "affiliation": "Department of Electrical and Computer Engineering, University of Waterloo, Waterloo, ONT, Canada"}, {"name": "Randal D. Fagan", "affiliation": "University of Waterloo, Waterloo, ONT, Canada"}], "tags": ["nanoprobing", "SPM education", "Nanotechnology", "University of Waterloo", "engineering education", "Atomic force microscopy (AFM)", "electrochemical analysis", "nanolithography", "magnetic force microscopy", "nanotechnology", "oxidation", "laboratory course", "further education", "Probes", "resists", "educational courses", "undergraduate SPM teaching facility", "SPM lab", "Microscopy", "electrochemical oxidation", "scanning probe microscopy based laboratory", "undergraduate nanotechnology engineering laboratory course", "Software", "nanotechnology education", "3-h laboratory session", "Laboratories", "atomic force microscopy", "Force", "scanning probe lithography", "scanning probe microscopy (SPM)"]}, {"title": "Complex Problem Exercises in Developing Engineering Students' Conceptual and Procedural Knowledge of Electromagnetics", "link": "https://ieeexplore.ieee.org/document/5430961/", "abstract": "Complex multistep problem exercises are one way to enhance engineering students' learning of electromagnetics (EM). This study investigates whether exposure to complex problem exercises during an introductory EM course improves students' conceptual and procedural knowledge. The performance in complex problem exercises is compared to prior success in pre-engineering mathematics and physics courses and with success in the final exam. Students' conceptual knowledge is evaluated with the Conceptual Survey of Electricity and Magnetism (CSEM). The data (\n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">N</i>\n = 133) are collected from an undergraduate static field theory course at Helsinki University of Technology, Espoo, Finland. The data are analyzed using correlation and linear regression. The study shows that the complex problem exercises do not improve conceptual understanding of EM. However, complex problem exercises significantly enhance the students' procedural knowledge. In addition, students found problem exercises useful and relevant for their learning.", "authors": [{"name": "Ari Sihvola", "affiliation": "Department of Radio Science and Engineering, Aalto University School of Science and Technology, Aalto, AALTO, Finland"}, {"name": "Henrik Kettunen", "affiliation": "Department of Radio Science and Engineering, Aalto University School of Science and Technology, Aalto, AALTO, Finland"}, {"name": "Johanna Leppävirta", "affiliation": "Department of Radio Science and Engineering, Aalto University School of Science and Technology, AALTO, Finland"}], "tags": ["computer aided instruction", "complex multistep problem", "Electromagnetics", "engineering education", "Mathematics", "engineering students learning", "electromagnetics", "electromagnetics (EM)", "Educational institutions", "regression analysis", "electrical engineering education", "educational courses", "undergraduate static field theory", "problem solving", "Complex multistep problems", "electromagnetism", "conceptual knowledge", "Engineering students", "procedural knowledge", "Problem-solving", "Electricity", "linear regression"]}, {"title": "Corrections to “An Approach to Average Modeling and Simulation of Switch-Mode Systems” [Aug 11 509-517]", "link": "https://ieeexplore.ieee.org/document/5970287/", "abstract": "Presents some corrections to the above titled paper (ibid., vol. 54, no. 3, pp. 509-517, Aug. 2011).", "authors": [{"name": "Alexander Abramovitz", "affiliation": "Sami Shamoon College of Engineering-Electrical and Electronics Engineering, Beer-Sheva, Israel"}], "tags": ["Simulation", "Design automation", "Equivalent circuits", "Integrated circuit modeling", "Pulse width modulation converters"]}, {"title": "Guest Editorial Microelectronic Systems Education", "link": "https://ieeexplore.ieee.org/document/5762421/", "abstract": "The seven papers in this special issue were originally presented at the IEEE Microelectronics Systems Education (MSE) Conference, which is held in the US on odd years.", "authors": [{"name": "Tina A. Hudson", "affiliation": "Department of Electrical and Computer Engineering, Rose-Hulman Institute of Technology, Terre Haute, IN, USA"}], "tags": ["Integrated circuit technology", "System-on-a-chip", "Embedded systems", "Micromechanical devices", "Meetings", "Special issues and sections", "Microelectronics"]}, {"title": "Adjustable Speed Drive Project for Teaching a Servo Systems Course Laboratory", "link": "https://ieeexplore.ieee.org/document/5710015/", "abstract": "This paper describes an adjustable speed drive for a three-phase motor, which has been implemented as a design for a servo system laboratory course in an engineering curriculum. The platform is controlled and analyzed in a LabVIEW environment and run on a PC. Theory is introduced in order to show the sensorless algorithms. These are computed by means of speed feedback from speed and flux estimators, which provide tracking of these variables in spite of the presence of an uncertain load torque and changes in the time constant. The novel electronic architecture permits students to use low-cost hardware. The project was divided into several subsystems in order to give students the opportunity to construct a tuning procedure for torque and speed control loops.", "authors": [{"name": "Juvenal Rodriguez-Resendiz", "affiliation": "Engineering Department, Universidad Autónoma de Querétaro, Queretaro, Mexico"}, {"name": "Gilberto Herrera-Ruiz", "affiliation": "School of Engineering, Universidad Autónoma de Querétaro, Queretaro, Mexico"}, {"name": "Edgar Alejandro Rivas-Araiza", "affiliation": "School of Engineering, Universidad Autónoma de Querétaro, Queretaro, Mexico"}], "tags": ["flux estimator", "Digital signal processing", "Variable speed drives", "engineering education", "torque control", "three-phase motor", "servomechanisms", "speed estimators", "LabVIEW", "flux estimators", "velocity control", "Voltage measurement", "electronic architecture", "Computer application in education", "adjustable speed drive project", "induction motors", "Mathematical model", "vector control", "Servomotors", "motor drives", "software laboratory", "speed control", "Laboratories", "servo systems course laboratory", "engineering curriculum", "Rotors"]}, {"title": "Trajectories of Electrical Engineering and Computer Engineering Students by Race and Gender", "link": "https://ieeexplore.ieee.org/document/5685600/", "abstract": "Electrical engineering (EE) is one of the largest engineering disciplines. Computer engineering (CpE) has a similar curriculum, but different demographics and student outcomes. Using a dataset from universities in the U.S. that includes over 70 000 students who majored in engineering, this paper describes the out comes for students matriculating in and migrating into EE and CpE so as to inform the decision making of faculty, department heads, and deans. Although men consistently outnumber women in EE and CpE, the rates of matriculation and six-year graduation vary by race and gender. EE is the most popular choice for Asian and Black students (males and females) at matriculation, but while Asians graduate at high rates, Blacks (particularly males) are not retained. Retention is higher in EE than in CpE despite the similarity of the curricula. Graduation rates are lower than expected for women of all races in CpE and for Hispanic women in EE. By the third semester, some students of all races and genders have left their matriculation major, but others have migrated in from other majors, compensating for some of this loss. CpE students are more likely than EE students to switch to another major. Trajectories of EE and CpE students are racialized and distinct. CpE loses more students and attracts fewer students than EE. These findings il lustrate the importance of disaggregating by engineering major as well as race and gender to improve recruitment and retention overall.", "authors": [{"name": "Susan M. Lord", "affiliation": "University of San Diego, San Diego, CA, USA"}, {"name": "Matthew W. Ohland", "affiliation": "Purdue University, West Lafayette, IN, USA"}, {"name": "Richard A. Layton", "affiliation": "Rose Hulman Institute of Technology, Terre Haute, IN, USA"}], "tags": ["retention", "Asian students", "Computers", "Electrical engineering", "race", "gender", "Educational institutions", "student demographics", "electrical engineering education", "computer engineering students", "U.S. universities", "Black students", "Switches", "gender issues", "Hispanic women", "Engineering students", "Trajectory", "women students", "demography", "decision making", "matriculation rates", "Computer engineering education", "computer science education", "electrical engineering students"]}, {"title": "Augmented Reality for the Improvement of Remote Laboratories: An Augmented Remote Laboratory", "link": "https://ieeexplore.ieee.org/document/5607327/", "abstract": "Augmented reality (AR) provides huge opportunities for online teaching in science and engineering, as these disciplines place emphasis on practical training and unsuited to completely nonclassroom training. This paper proposes a new concept in virtual and remote laboratories: the augmented remote laboratory (ARL). ARL is being tested in the first and second years of the new degrees in industrial engineering and computer engineering, respectively, at the School of Engineering, University of Huelva, Huelva, Spain. By means of augmented reality techniques, ARL allows the student to experience sensations and explore learning experiences that, in some cases, may exceed those offered by traditional laboratory classes. The effectiveness of this methodology for remote laboratory work is evaluated by comparing it to practical sessions in the laboratory at the university itself with the same group of students. Students completed a questionnaire after having experienced both types of practicals, and the results show that the use of ARL improves student outcomes. As discussed in the paper, the potential of AR to configure different experiments from the same physical configuration is virtually limitless.", "authors": [{"name": "Jose Manuel Andujar", "affiliation": "Department of Electronic Engineering, Computer and Control Engineering, Escuela Politecnica Superior, University of Huelva, Huelva, Spain"}, {"name": "Andrés Mejias", "affiliation": "Department of Electronic Engineering, Computer and Control Engineering, Escuela Politecnica Superior, University of Huelva, Huelva, Spain"}, {"name": "Marco Antonio Marquez", "affiliation": "Department of Electronics, Pedro Gómez Institute, Huelva, Spain"}], "tags": ["Education", "laboratories", "Augmented reality (AR)", "engineering education", "augmented remote laboratories (ARLs)", "science", "online teaching", "Cameras", "Augmented reality", "remote laboratories", "virtual laboratories", "Remote laboratories", "computer engineering", "augmented remote laboratory", "science and engineering education", "Materials", "industrial engineering", "Control systems", "augmented reality", "distance learning"]}, {"title": "Evaluating Usability in a Distance Digital Systems Laboratory Class", "link": "https://ieeexplore.ieee.org/document/5535218/", "abstract": "This paper presents the usability evaluation of a digital systems laboratory class offered to distance-learning students. It details the way in which students can participate remotely in such a laboratory, the methodology employed in the usability assessment of the laboratory infrastructure (hardware and software), and also outlines the main findings and lessons learned. It has been shown that the setting up of such a laboratory requires careful design, pilot runs, and formal evaluation prior to scaling up for a large number of students in order to both foresee usability flaws in the infrastructure and ensure educational quality.", "authors": [{"name": "Athanassios N. Skodras", "affiliation": "School of Sciences and Technology, Hellenic Open University, Patra, Greece"}, {"name": "Nektarios Kostaras", "affiliation": "School of Sciences and Technology, Hellenic Open University, Patra, Greece"}, {"name": "Michalis Xenos", "affiliation": "School of Sciences and Technology, Hellenic Open University, Patra, Greece"}], "tags": ["computer aided instruction", "quality assessment", "laboratory infrastructure", "distance digital system laboratory class", "usability evaluation methods", "Cameras", "distance learning student", "usability evaluation", "Usability", "Remote laboratories", "laboratory techniques", "Distance laboratory", "quality assessment laboratory", "Quality assessment", "usability assessment", "Digital systems", "educational technology", "distance learning", "educational quality"]}, {"title": "Use of E-Learning Functionalities and Standards: The Spanish Case", "link": "https://ieeexplore.ieee.org/document/5639062/", "abstract": "This paper shows the results of a survey performed in Spain on the different functionalities of e-learning platforms. This survey was filled in by a group of teachers, experts in engineering education from across Spain, within the scope of the Spanish Chapter of the IEEE Education Society. This paper presents their opinions on several aspects of e-learning functionalities, such as knowledge levels, levels of use, and usefulness, as well as describing the most commonly used platforms. One of the objectives of this work is to create a debate in the international community about the use of e-learning platforms and their main functionalities, the most frequently used standards, the implications for and the levels of support by institutions in their use of e-learning platforms, and in general, their advantages and disadvantages.", "authors": [{"name": "Manuel Caeiro-Rodriguez", "affiliation": "Telematics Department, University of Vigo, Vigo, Spain"}, {"name": "Manuel Castro", "affiliation": "Electrical and Computer Engineering Department, UNED University, Madrid, Spain"}, {"name": "Martín Llamas-Nistal", "affiliation": "Telematics Department, University of Vigo, Vigo, Spain"}], "tags": ["Digital audio broadcasting", "computer aided instruction", "Spain", "Engineering education", "Training", "IEEE Education Society", "Electronic learning", "Electronic mail", "engineering education", "e-learning platforms", "standards", "digital repositories", "Standards", "E-learning functionalities", "e-learning functionalities", "IEEE standards"]}, {"title": "ADVICE—Educational System for Teaching Database Courses", "link": "https://ieeexplore.ieee.org/document/5551261/", "abstract": "This paper presents a Web-based educational system, ADVICE, that helps students to bridge the gap between database management system (DBMS) theory and practice. The usage of ADVICE is presented through a set of laboratory exercises developed to teach students conceptual and logical modeling, SQL, formal query languages, and normalization. While working on the exercises, students use the system to access real databases, and the system provides them with feedback about their solutions. From the perspective of an instructor, the system allows easy exercise management and continual progress monitoring. The paper also describes a practical experience with the use of ADVICE on a database course over a three-year period.", "authors": [{"name": "Vladimir Blagojevic", "affiliation": "School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Miroslav Bojovic", "affiliation": "School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Miloš Cvetanovic", "affiliation": "School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Zaharije Radivojevic", "affiliation": "School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}], "tags": ["computer aided instruction", "Education", "conceptual model", "database management system", "SQL", "database systems", "Internet", "Computer science education", "Automated Database Verification with Interactive Counter Example System", "data models", "ADVICE", "DBMS theory", "Algebra", "Web-based educational system", "educational courses", "Calculus", "Database languages", "Visualization", "normalization", "database management systems", "database course", "Databases", "formal query language", "educational technology", "Laboratories", "teaching", "computer science education", "continual progress monitoring", "exercise management", "database languages", "logical model"]}, {"title": "Seven Principles of Instructional Content Design for a Remote Laboratory: A Case Study on ERRL", "link": "https://ieeexplore.ieee.org/document/5535216/", "abstract": "This paper discusses the results of a study of the requirements for developing a remote radio frequency (RF) laboratory for electrical engineering students. It investigates students' preferred usage of the technical content of a state-of-the-art RF laboratory. The results of this study are compared to previous findings, which dealt with other user groups (technicians in technical colleges and engineers in the RF domain). Based on the results of these analyses, seven essential principles for designing and developing such a laboratory were identified. As a case study, these principles were then implemented into a remote laboratory system. In this paper, the implementation examples are also provided and discussed. The primary aim of this study is to guide remote laboratory platform developers toward the most effective instructional design. This study also determined, from the remote laboratory system case study, what the requirements are of such a laboratory from the students' perspective.", "authors": [{"name": "Marian Alexandru", "affiliation": "Transilvania University of Brasov, Brasov, Romania"}, {"name": "Ali Kara", "affiliation": "Department of Electrical Engineering, Atilim University, Ankara, Turkey"}, {"name": "Elif Aydin", "affiliation": "Department of Electrical Engineering, Atilim University, Ankara, Turkey"}, {"name": "Nergiz Ercil Cagiltay", "affiliation": "Departments of Computer Engineering and Software Engineering, Atilim University, Ankara, Turkey"}, {"name": "Cansu Cigdem Aydin", "affiliation": "Department of Computer Engineering, Atilim University, Ankara, Turkey"}], "tags": ["Education", "Computer mediated communication", "Animation", "distance education", "telelearning", "electrical engineering student", "Keyword search", "Remote laboratories", "Radio frequency", "electrical engineering education", "lifelong learning", "Adult learning", "instructional content design", "European remote radio frequency laboratory", "improving classroom teaching"]}, {"title": "Using LEGO NXT Mobile Robots With LabVIEW for Undergraduate Courses on Mechatronics", "link": "https://ieeexplore.ieee.org/document/5430870/", "abstract": "The paper proposes lab work and student competitions based on the LEGO NXT Mindstorms kits and standard LabVIEW. The goal of this combination is to stimulate design and experimentation with real hardware and representative software in courses where mobile robotics is adopted as a motivating platform to introduce mechatronics competencies. Basic LabVIEW examples are proposed for three case-study laboratory practices. These are implemented with the NXT Toolkit and the NXT Direct Command programming libraries for standalone and remote execution, respectively. The application of this instructional material has been tested in two different experiences with senior undergraduate engineering students. A description of the courses as well as an assessment of student results are also included.", "authors": [{"name": "Jesús M. Gomez-de-Gabriel", "affiliation": "Dpto. Ingeniería de Sistemas y Automática, Universidad de Málaga, Málaga, Spain"}, {"name": "Jesús Fernandez-Lozano", "affiliation": "Dpto. Ingeniería de Sistemas y Automática, Universidad de Málaga, Málaga, Spain"}, {"name": "Anthony Mandow", "affiliation": "Dpto. Ingeniería de Sistemas y Automática, Universidad de Málaga, Málaga, Spain"}, {"name": "Alfonso J. García-Cerezo", "affiliation": "Dpto. Ingeniería de Sistemas y Automática, Universidad de Málaga, Málaga, Spain"}], "tags": ["Robot sensing systems", "Education", "virtual instrumentation", "mechatronics", "undergraduate courses", "Mobile robots", "remote execution", "project-based learning", "mobile robots", "NXT direct command programming libraries", "LabVIEW", "software libraries", "LEGO NXT mobile robots", "educational courses", "Mechatronics", "Engineering education", "LEGO Mindstorms NXT", "Lab VIEW", "Educational robots", "LEGO NXT mindstorms kits", "robot programming"]}, {"title": "Students' Involvement in Continuous Assessment Methodologies: A Case Study for a Distributed Information Systems Course", "link": "https://ieeexplore.ieee.org/document/5590268/", "abstract": "The creation of the new European Higher Education Area (EHEA), with the corresponding changes in the structure and content of university degrees, offers a great opportunity to review learning methodologies. This paper investigates the effect on students of moving from a traditional learning process, based on lectures and laboratory work, to an approach closer to continuous evaluation. To this end, various types of weekly assessments were included in a Distributed Information Systems course; these assessments and the teacher's feedback were both intended to increase students' participation in the learning process. Data for seven academic years have been compiled, representing a total of more than 750 students. Analysis of the results established that most students preferred to participate in the course following the new methodology. Although both the pass rate and the final students' grades improved, the percentage of students dropping out of the course increased slightly. The impact of carrying out the proposed assessments was the same, regardless of gender and whether the student had taken this course before. In addition, compulsory attendance at office hours did not impact the degree of student participation in the new methodology. Finally, it was found that the greater (more continuous) effort demanded by the new methodology had an effect on the teacher's evaluation, whose scores were slightly lower with the new methodology, even though the students' performed better.", "authors": [{"name": "Maria-Dolores Cano", "affiliation": "Department of Information and Communication Technologies, Technical University Cartagena, Cartagena, Spain"}], "tags": ["Education", "Assessment", "Synchronization", "university degree", "European Higher Education Area", "continuous assessment methodology", "continuous evaluation", "further education", "distributed information systems course", "educational courses", "Europe", "telecommunication engineering education", "distributed information systems", "Distributed information systems", "Analysis of variance", "telecommunications engineering degree", "Laboratories", "European Higher Education Area (EHEA)", "computer science education", "Telematics", "information systems"]}, {"title": "Enhancing Learning in Introductory Computer Science Courses Through SCALE: An Empirical Study", "link": "https://ieeexplore.ieee.org/document/5411930/", "abstract": "The work presented in this paper aims to support and promote the learning process in introductory computer science courses through the Web-based, adaptive, activity-oriented learning environment known as Supporting Collaboration and Adaptation in a Learning Environment (SCALE). The environment engages students actively in the learning process and supports them with multiple informative and tutoring feedback components. The exploitation of appropriately developed educational material, which was provided through SCALE, showed that SCALE can be a valuable tool for supporting the learning process in introductory computer science courses.", "authors": [{"name": "Evaggelia Gouli", "affiliation": "Department of Informatics and Telecommunications, National and Kapodistrian University of Athens, Athens, Greece"}, {"name": "Maria Boubouka", "affiliation": "Department of Informatics and Telecommunications, National and Kapodistrian University of Athens, Athens, Greece"}, {"name": "Ilias Verginis", "affiliation": "Department of Informatics and Telecommunications, National and Kapodistrian University of Athens, Athens, Greece"}, {"name": "Agoritsa Gogoulou", "affiliation": "Department of Informatics and Telecommunications, National and Kapodistrian University of Athens, Athens, Greece"}, {"name": "Maria Grigoriadou", "affiliation": "Department of Informatics and Telecommunications, National and Kapodistrian University of Athens, Athens, Greece"}], "tags": ["supporting collaboration", "Education", "activity oriented learning", "Web-based learning environment", "Adaptation", "Web based learning", "educational material", "courseware", "Internet", "informative feedback components", "educational courses", "multiple informative feedback", "Informatics", "SCALE", "tutoring feedback", "groupware", "Materials", "Telecommunications", "introductory computer science courses", "learning environment", "tutoring feedback components", "Laboratories", "learning activities", "Computer science", "computer science education", "adaptive learning", "Context"]}, {"title": "Step-By-Step Design of an FPGA-Based Digital Compensator for DC/DC Converters Oriented to an Introductory Course", "link": "https://ieeexplore.ieee.org/document/5688206/", "abstract": "In this paper, a short introductory course to introduce field-programmable gate array (FPGA)-based digital control of dc/dc switching power converters is presented. Digital control based on specific hardware has been at the leading edge of low-medium power dc/dc switching converters in recent years. Besides industry's interest in this topic, from the educational point of view, digital control is a multidisciplinary subject that is very attractive to include in various programs of study. The course presented here covers the calculation and implementation procedure for a linear compensator based on an FPGA for a dc/dc converter. The approach taken is structured in a step-by-step design flow combining theoretical justifications, use of CAD tools, and lab experience. The course can be adapted to students' various backgrounds and time schedules.", "authors": [{"name": "Andrés Barrado", "affiliation": "Department of Electronic Technology, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Pablo Zumel", "affiliation": "Department of Electronic Technology, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Marina Sanz", "affiliation": "Department of Electronic Technology, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Antonio Lazaro", "affiliation": "Department of Electronic Technology, Universidad Carlos III de Madrid, Madrid, Spain"}, {"name": "Cristina Fernandez", "affiliation": "Department of Electronic Technology, Universidad Carlos III de Madrid, Madrid, Spain"}], "tags": ["Transfer functions", "DC-DC power convertors", "introductory course", "field-programmable gate array (FPGA)", "Digital control", "educational", "Hardware", "dc/dc switching power converters", "FPGA-based digital compensator", "step-by-step design flow", "DC-DC power converters", "Difference equations", "digital control", "Field programmable gate arrays", "field programmable gate arrays", "power electronics", "switching convertors", "linear compensator", "field-programmable gate array"]}, {"title": "Teaching Discrete and Programmable Logic Design Techniques Using a Single Laboratory Board", "link": "https://ieeexplore.ieee.org/document/5699964/", "abstract": "Programmable logic devices (PLDs) are used at many universities in introductory digital logic laboratories, where kits containing a single high-capacity PLD replace “standard” sets containing breadboards, wires, and small- or medium-scale integration (SSI/MSI) chips. From the pedagogical point of view, two problems arise in these laboratories. First, students have some difficulties in understanding the link between discrete and programmable design techniques. Second, using only a single PLD, students are not automatically forced to learn modular design skills, which is one of the required learning outcomes in electrical engineering (EE) curricula. To overcome these problems, an innovative laboratory is proposed in this paper. Each training board contains four complex PLDs (CPLDs) and peripherals. In the initial sessions, students implement designs in which CPLDs are programmed as standard SSI/MSI chips and interconnected to construct the target circuit. Then, an active learning technique is used: Students form groups of any size and can set themselves more complex problems and choose their design approach. The proposed laboratory was set up at the Technical University of Lodz, Lodz, Poland, and the first classes were given in the 2008-2009 academic year. The instructors' insights and design reports and feedback from students were gathered and analyzed. The results showed the effectiveness of the novel approach. Students were deeply involved in solving self-imposed problems. They learned “engineering imagination,” modular design, and teamwork skills. Some groups went far beyond the requirements set by the instructor. However, an additional conclusion is that the “standard” approach should not be completely eliminated.", "authors": [{"name": "Piotr Debiec", "affiliation": "Institute of Electronics, Technical University of Lodz, Lodz, Poland"}, {"name": "Marcin Byczuk", "affiliation": "Institute of Electronics, Technical University of Lodz, Lodz, Poland"}], "tags": ["laboratories", "EE curricula", "innovative laboratory", "teaching discrete", "Hardware", "programmable logic design techniques", "electrical engineering curricula", "Sockets", "logic design", "single high-capacity PLD", "programmable logic devices (PLDs)", "Educational institutions", "standard SSI-MSI chips", "electrical engineering education", "modular design skills", "breadboards", "Educational technology", "single laboratory board", "electronics engineering education", "Software", "Hardware design languages", "programmable logic devices", "Laboratories", "target circuit", "teaching"]}, {"title": "Multicore Education Through Simulation", "link": "https://ieeexplore.ieee.org/document/5685601/", "abstract": "A project-oriented course for advanced undergraduate and graduate students is described for simulating multiple processor cores. Simics, a free simulator for academia, was utilized to enable students to explore computer architecture, operating systems, and hardware/software cosimulation. Motivation for including this course in the curriculum is provided along with a detailed syllabus and an assessment demonstrating its successful impact on the students.", "authors": [{"name": "Ozcan Ozturk", "affiliation": "Computer Engineering Department, Bilkent University, Ankara, Turkey"}], "tags": ["hardware-software codesign", "Education", "Architecture", "multiple processor core", "chip", "Simics", "engineering education", "Computers", "multicore education", "Hardware", "Multicore processing", "experiential learning", "Operating systems", "hardware-software cosimulation", "operating systems", "computer architecture", "simulation", "operating systems (computers)", "multicore", "microprocessor chips", "project oriented course"]}, {"title": "Experiment-Based Teaching in Advanced Control Engineering", "link": "https://ieeexplore.ieee.org/document/5535219/", "abstract": "This paper discusses an experiment-based approach to teaching an advanced control engineering syllabus involving controlled plant analysis and modeling, control structures and algorithms, real-time laboratory experiments, and their assessment. These experiments are structured around the representative case of the longitudinal slip control of an antilock braking system (ABS). The basic and advanced control strategies that are experimentally studied include the proportional-integral (PI) control, gain scheduling, iterative feedback tuning (IFT) and fuzzy control. The final grades obtained by representative groups of students demonstrate the efficiency of a described hands-on laboratory experimental study of a complex antilock braking system as encountered in practice, which allowed students to gain a better understanding of the theoretical aspects learned during the lectures.", "authors": [{"name": "Emil M. Petriu", "affiliation": "School of Information Technology and Engineering (SITE), University of Ottawa, Ottawa, ONT, Canada"}, {"name": "Radu-Emil Precup", "affiliation": "Depart of Automation and Applied Informatics (DAAI), Polytechnic University of Timisoara, Timisoara, Romania"}, {"name": "Stefan Preitl", "affiliation": "Depart of Automation and Applied Informatics (DAAI), Polytechnic University of Timisoara, Timisoara, Romania"}, {"name": "József K. Tar", "affiliation": "Institute of Intelligent Engineering Systems, John von Neumann Faculty of Informatics, Óbuda University, Budapest, Hungary"}, {"name": "Mircea-Bogdan Radac", "affiliation": "Depart of Automation and Applied Informatics (DAAI), Polytechnic University of Timisoara, Timisoara, Romania"}, {"name": "Claudia-Adina Dragos", "affiliation": "Depart of Automation and Applied Informatics (DAAI), Polytechnic University of Timisoara, Timisoara, Romania"}], "tags": ["mathematical modeling", "Education", "proportional-integral control", "PI control", "Equations", "Advanced control engineering (ACE)", "antilock braking system (ABS)", "control engineering education", "braking", "real-time laboratory experiments", "student experiments", "gain scheduling", "longitudinal slip control", "iterative methods", "Friction", "controlled plant modeling", "experiment-based teaching", "controlled plant analysis", "educational courses", "feedback", "iterative feedback tuning", "fuzzy control", "advanced control engineering syllabus", "hands-on laboratory experiments", "Mathematical model", "Wheels", "Actuators", "Laboratories", "control structures", "complex antilock braking system"]}, {"title": "Design of a Competitive and Collaborative Learning Strategy in a Communication Networks Course", "link": "https://ieeexplore.ieee.org/document/5535220/", "abstract": "In this paper, an educational methodology based on collaborative and competitive learning is proposed. The suggested approach has been successfully applied to an undergraduate communication networks course, which is part of the core curriculum of the three-year degree in telecommunications engineering at the University of Valladolid in Spain. This methodology is supported by two tools: the Moodle wiki for the collaborative part and a competitive learning tool called QUESTOURnament, which has been created by the authors to encourage the development of students' inquiry, documentation, and critical analysis skills while raising the level of involvement and communication between students and teachers. This paper describes how the collaborative and competitive approaches were combined and how the activities were ordered in phases. This educational proposal has been validated with academic outcomes and students' feedback.", "authors": [{"name": "Juan P. de Castro", "affiliation": "School of Telecommunications Engineering, University of Valladolid, Valladolid, Spain"}, {"name": "María Jesús Verdú", "affiliation": "School of Telecommunications Engineering, University of Valladolid, Valladolid, Spain"}, {"name": "Luisa M. Regueras", "affiliation": "School of Telecommunications Engineering, University of Valladolid, Valladolid, Spain"}, {"name": "Elena Verdú", "affiliation": "School of Telecommunications Engineering, University of Valladolid, Valladolid, Spain"}], "tags": ["computer aided instruction", "Education", "Games", "undergraduate communication networks course", "Communication networks", "Teamwork", "telecommunications engineering", "Moodle wiki", "University of Valladolid", "teaching/learning strategies", "educational courses", "telecommunication engineering education", "collaborative learning", "critical analysis skills", "improving classroom teaching", "higher education", "Laboratories", "competitive learning", "QUESTOURnament", "Collaborative work", "Cooperative/collaborative learning"]}, {"title": "Transforming PC Power Supplies Into Smart Car Battery Conditioners", "link": "https://ieeexplore.ieee.org/document/5535215/", "abstract": "This paper describes a laboratory project consisting of a PC power supply modification into an intelligent car-battery conditioner with both wireless and wired networking capabilities. Adding a microcontroller to an average PC power supply transforms it into a flexible, intelligent device that can be configured and that is suitable to keep car batteries always ready to use. Using a high-performance microcontroller provides the product with wireless communication capabilities so it becomes a new network device that can be accessed through the Internet. This project allows students to improve their knowledge in several fields: power electronics, battery charging and conditioning, advanced microcontrollers, embedded Linux, and wireless communications.", "authors": [{"name": "José Manuel Rodriguez-Ascariz", "affiliation": "Electronics Department, University of Alcalá, Madrid, Spain"}, {"name": "Luciano Boquete-Vazquez", "affiliation": "Electronics Department, University of Alcalá, Madrid, Spain"}], "tags": ["automobiles", "Pulse width modulation", "Linux", "embedded Linux", "smart charger", "intelligent device", "smart car battery conditioner", "Internet", "wireless communication", "education", "laboratory project", "Switches", "network device", "battery conditioner", "Wireless communication", "microcontrollers", "power supplies to apparatus", "Advanced microcontrollers", "Batteries", "wireless networking capability", "battery charging", "Microcontrollers", "high performance microcontroller", "radiocommunication", "intelligent car battery conditioner", "power electronics", "advanced microcontroller", "PC power supply transform", "Power supplies", "PC power supply modification", "secondary cells"]}, {"title": "Marrying Content and Process in Computer Science Education", "link": "https://ieeexplore.ieee.org/document/5549962/", "abstract": "Constructivist approaches to computer science education emphasize that as well as knowledge, thinking skills and processes are involved in active knowledge construction. K-12 computer science curricula must not be based on fashions and trends, but on contents and processes that are observable in various domains of computer science, that can be taught at every intellectual level, that will stay relevant in the longer term, and that are related to everyday language and/or thinking. Only recently, two empirically determined lists, one of central content concepts (algorithm, computer, data, system, etc.) and another of central process concepts (problem solving and problem posing, analyzing, classifying, generalizing, etc.), have become available for computer science education. This paper tackles the problem of finding content and process concepts to be taught in combination. Computer science experts are surveyed in order to identify combinations of content and process concepts-so-called blocks-that are relevant to computer science education. By using cluster analyses, 15 central blocks for teaching computer science in schools are determined. The results of this study may serve as a reference system for the systematic design of instruction in K-12 computer science education.", "authors": [{"name": "Dieter Klaudt", "affiliation": "Institute of Mathematics and Computer Science, University of Education, Ludwigsburg, Germany"}, {"name": "Christian Spannagel", "affiliation": "Institute of Computer Science, University of Education, Heidelberg, Germany"}, {"name": "Andreas Zendler", "affiliation": "Institute of Mathematics and Computer Science, University of Education, Ludwigsburg, Germany"}], "tags": ["cluster analyses", "Software", "Central content concepts", "active knowledge construction", "central process concepts", "pattern clustering", "thinking skills", "Classification algorithms", "Computer science education", "Problem-solving", "Computers", "curriculum planning", "Computer science", "computer science education", "process as content", "K-12 computer science curricula", "educational courses"]}, {"title": "A Cochlear Implant Signal Processing Lab: Exploration of a Problem-Based Learning Exercise", "link": "https://ieeexplore.ieee.org/document/5704224/", "abstract": "This paper presents an introductory signal processing laboratory and examines this laboratory exercise in the context of problem-based learning (PBL). Centered in a real-world application, a cochlear implant, the exercise challenged students to demonstrate a working software-based signal processor. Partnering in groups of two or three, second-year electrical and computer engineering and biomedical engineering students used MATLAB graphical user interface programs, complemented with their own original MATLAB code, to design filters suitable for achieving a filter bank decomposition of an audio signal. Rather than using the envelope-detected output for direct electrical stimulation of auditory nerve fibers as in an implant, the students reconstructed the signal by modulating sinusoids to yield an acoustic simulation. To appreciate the impact of filter order on sound intelligibility, students were asked to reconstruct signals using 4-16 filter channels for both speech and music and to examine the results critically. The lab served as a substrate upon which to solidify fundamental signal processing concepts such as the distinction between time and frequency domains, constructing and interpreting spectrograms, sampling, spectral decomposition, filtering, and reconstruction. In the spirit of PBL, the students examined engineering tradeoffs and discussed implementations when they were asked to consider realizing a significantly higher channel count (128-channel) device. To determine how the laboratory exercise impacted student learning and comprehension, as well as the level of student engagement achieved with this compelling application, an anonymous online survey was administered at the end of the course. The survey outcomes, as well as the components of the lab, are discussed in the context of PBL pedagogy.", "authors": [{"name": "Pamela T. Bhatti", "affiliation": "School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "James H. McClellan", "affiliation": "School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["acoustic simulation", "spectral decomposition", "Matlab graphical user interface programs", "channel bank filters", "biomedical engineering students", "filter bank decomposition", "Auditory system", "audio signal processing", "Cochlear implants", "time-frequency domains", "MATLAB", "Signal processing", "cochlear implant signal processing lab", "signal processing", "computer engineering student", "filter-bank design", "Graphical user interfaces", "Speech", "graphical user interfaces", "problem-based learning (PBL)", "electrical engineering", "Laboratories", "direct electrical stimulation", "PBL pedagogy", "mathematics computing", "auditory nerve fibers", "problem-based learning exercise"]}, {"title": "Teaching Multimedia Data Protection Through an International Online Competition", "link": "https://ieeexplore.ieee.org/document/5546922/", "abstract": "Low-cost personal computers, wireless access technologies, the Internet, and computer-equipped classrooms allow the design of novel and complementary methodologies for teaching digital information security in electrical engineering curricula. The challenges of the current digital information era require experts who are effectively able to counteract piracy, forgery, copyright infringement, and so on. Digital watermarking is one possible technique for fighting piracy, which consists of the insertion of invisible but robust information to protect the data. In this paper, a new teaching approach, designed for testing student skills and progressing in multimedia data protection, is presented. This consists of a distributed security game where students compete by first using the developed watermarking techniques and then attacking each other's methods, thus verifying their robustness. Groups of students from different universities and countries play against each other, trying to compromise other teams' hiding systems while protecting their own data from attacks. The proposed methodology can be considered as an appealing approach for stimulating learning, cooperation, and team competition. The effectiveness of the teaching method is verified by a student survey and their academic results.", "authors": [{"name": "Federica Battisti", "affiliation": "Dipartimenti di Elettronica Applicata, Università degli Studi Roma TRE, Rome, Italy"}, {"name": "Alessandro Neri", "affiliation": "Dipartimenti di Elettronica Applicata, Università degli Studi Roma TRE, Rome, Italy"}, {"name": "Marco Carli", "affiliation": "Dipartimenti di Elettronica Applicata, Università degli Studi Roma TRE, Rome, Italy"}, {"name": "Giulia Boato", "affiliation": "Information Engineering and Computer Science Department, University of Trento, Trento, Italy"}], "tags": ["computer aided instruction", "Games", "engineering education", "Multimedia communication", "data hiding", "Internet", "electrical engineering curricula", "watermarking", "Competitive learning", "Training", "Robustness", "Educational institutions", "international online competition", "digital watermarking", "electrical engineering education", "multimedia computing", "digital information security", "computer utilization", "multimedia data protection", "teaching", "Watermarking"]}, {"title": "A Modular Approach for Teaching Partial Discharge Phenomenon Through Experiment", "link": "https://ieeexplore.ieee.org/document/5551260/", "abstract": "Partial discharge (PD) monitoring is an effective predictive maintenance tool for electrical power equipment. As a result, an understanding of the theory related to PD and the associated measurement techniques is now necessary knowledge for power engineers in their professional life. This paper presents a modular course on PD phenomenon in which the design experiences are distributed across different modules so that ABET criteria are met to a great extent. The teaching methodology involves delivering theoretical lectures on concepts related to PD and its measurements, along with laboratory experiments, assignments, open presentation, and so on. The evaluation methodology comprises examinations, both oral and written reports, and an assessment of the effectiveness of teamwork and of the course itself by means of student feedback. Analysis of student feedback showed that the students liked the course and felt it would be helpful for their professional advancement.", "authors": [{"name": "Debangshu Dey", "affiliation": "Department of Electrical Engineering, Jadavpur University, Kolkata, India"}, {"name": "Biswendu Chatterjee", "affiliation": "Department of Electrical Engineering, Jadavpur University, Kolkata, India"}, {"name": "Sivaji Chakravorti", "affiliation": "Department of Electrical Engineering, Jadavpur University, Kolkata, India"}], "tags": ["computer aided instruction", "Education", "partial discharge phenomenon teaching", "student experiments", "education", "Noise", "PD measurement technique", "ABET criteria", "educational courses", "modular approach", "electrical power equipment", "partial discharge", "partial discharge measurement", "laboratory experiments", "predictive maintenance tool", "teaching methodology", "partial discharge monitoring", "electrical maintenance", "Discharges", "power engineering education", "student feedback", "Resistors", "Partial discharges", "Laboratories", "Detectors"]}, {"title": "Using Tablet PCs and Interactive Software in IC Design Courses to Improve Learning", "link": "https://ieeexplore.ieee.org/document/5710016/", "abstract": "This paper describes an initial study of using tablet PCs and interactive course software in integrated circuit (IC) design courses. A rapidly growing community is demonstrating how this technology can improve learning and retention of material by facilitating interaction between faculty and students via cognitive exercises during lectures. While numerous examples of using this technology exist, there is not much literature regarding its application to electrical engineering and IC design in particular. This paper presents examples from three different IC design courses to describe the types of cognitive activities that can be facilitated with this technology. While these examples are specific to IC design, the basic techniques are valid for any application. This study does show some initial success, which, it is hoped, will spark interest at other universities and lead to a better examination of its effectiveness through larger sample sizes.", "authors": [{"name": "Mario Simoni", "affiliation": "Department of Electrical and Computer Engineering, Rose Hulman Institute of Technology, Terre Haute, IN, USA"}], "tags": ["computer aided instruction", "Integrated circuits", "Tablet computers", "interactive systems", "education", "integrated circuit (IC) design", "Active learning", "tablet PC", "DyKnow", "electronic engineering education", "Terminology", "integrated circuit design courses", "integrated circuit design", "interactive course software", "Materials", "laptop computers", "Software", "cognitive exercises", "educational technology", "Adders", "Delay"]}, {"title": "Project-Based Learning and Rubrics in the Teaching of Power Supplies and Photovoltaic Electricity", "link": "https://ieeexplore.ieee.org/document/5438911/", "abstract": "Project-based learning (PBL) and cooperative learning are, in various aspects, very superior education methodologies compared to other traditional ones. They are highly appropriate methodologies for elective courses, as they exert a strong attraction on the students, quite apart from their educational advantages. This paper describes how PBL and cooperative learning have been used to teach the topics of power supplies and photovoltaic electricity within two elective undergraduate courses. A project is carried out for each of the two topics. Moodle is used as the e-learning platform to provide the course materials and the wiki resource and to allow the submission of assignments. The simulation is done by means of Simulink. Work has been done to develop skills for project planning, group management of the work, technical document writing and presentations in public. The methodology has been seen to be successful, as all the students who have followed it over the last few years have passed the courses in which it was included, Design of Industrial Applications and Industrial Electronics. Examples of the rubrics for assessing the projects and examples of the projects themselves are also included.", "authors": [{"name": "Luis Carlos Herrero", "affiliation": "Department of Electronics, Escuela de Ingenierias Industriales, University of Valladolid, Valladolid, Spain"}, {"name": "Santiago de Pablo", "affiliation": "Department of Electronics, Escuela de Ingenierias Industriales, University of Valladolid, Valladolid, Spain"}, {"name": "Fernando Martinez", "affiliation": "Department of Electronics, Escuela de Ingenierias Industriales, University of Valladolid, Valladolid, Spain"}], "tags": ["computer aided instruction", "Education", "undergraduate courses", "Converters", "wiki resource", "project-based learning", "photovoltaic electricity", "project-based learning (PBL)", "rubrics", "Simulink", "power supply teaching", "power supplies", "industrial application", "group management", "cooperative learning", "Cooperative learning", "project planning", "educational courses", "e-learning platform", "PBL", "Moodle", "course material", "Photovoltaic systems", "technical document writing", "power supplies to apparatus", "Materials", "power engineering education", "Power supplies", "industrial electronics", "Electricity", "teaching"]}, {"title": "RHE: A JVM Courseware", "link": "https://ieeexplore.ieee.org/document/5454292/", "abstract": "Java Virtual Machine (JVM) education has become essential in training embedded software engineers as well as virtual machine researchers and practitioners. However, due to the lack of suitable instructional tools, it is difficult for students to obtain any kind of hands-on experience and to attain any deep understanding of JVM design. To address this issue, the authors designed the RHE, or Reduced Harmony for Education, a lightweight instructional JVM. The RHE is extremely simple and yet contains all essential modules of a JVM. Furthermore, it comes with several test programs designed to familiarize users with the modules of JVM. In the past few years, the authors have successfully used the RHE to train new engineers on the JVM technology. The training experience shows that with the RHE, it takes less than 40 h for engineers with little or no prior knowledge of JVM design to become familiar with the essential JVM components.", "authors": [{"name": "Jean-Luc Gaudiot", "affiliation": "Department of Electrical Engineering and Computer Science, University of California, Irvine, CA, USA"}, {"name": "Chengrui Deng", "affiliation": "Intel China Research Center Limited, Beijing, China"}, {"name": "Shaoshan Liu", "affiliation": "Department of Electrical Engineering and Computer Science, University of California, Irvine, CA, USA"}, {"name": "Xiao-Feng Li", "affiliation": "Intel China Research Center Limited, Beijing, China"}, {"name": "Jie Tang", "affiliation": "CSE, Beijing Institute of Technology, Beijing, China"}], "tags": ["embedded software engineers", "Java Virtual Machine (JVM)", "reduced harmony", "courseware", "Engines", "Training", "virtual machines", "execution manager", "threading support", "lightweight instructional JVM", "Class loader", "memory management", "Memory management", "RHE", "Virtual machining", "embedded systems", "Java", "computer science education", "computer based training", "JVM courseware", "Java virtual machine"]}, {"title": "Teaching OOP With Financial Literacy", "link": "https://ieeexplore.ieee.org/document/5492289/", "abstract": "Students lose interest in learning programming when the materials are not related to their lives. A challenge facing most students is that they lack the financial literacy necessary to manage their debts. An approach is developed to integrate financial literacy into an object-oriented programming (OOP) course. The approach is effective in motivating students and improving the learning outcomes.", "authors": [{"name": "Hongwei Zhu", "affiliation": "Old Dominion University, Norfolk, VA, USA"}], "tags": ["Calculators", "Springs", "debts management", "student motivation", "Educational institutions", "Financial literacy", "object-oriented programming (OOP)", "Loans and mortgages", "object-oriented programming course", "learning effectiveness", "Programming profession", "motivation", "object-oriented programming", "financial literacy", "financial management", "computer science education", "object-oriented programming teaching", "educational courses"]}, {"title": "Blended Learning of Programming in the Internet Age", "link": "https://ieeexplore.ieee.org/document/5471072/", "abstract": "This paper presents an advanced variant of learning programming by the use of the Internet and multimedia. It describes the development of a blended learning environment, which, in addition to classroom (face-to-face) lessons, introduces lessons delivered over the Internet: the use of multimedia teaching material with completely dynamic interactive simulations; the use of applications for regular checking and self-checking of the acquisition of knowledge; and applications for regular communication on the teaching material between students and lecturers. This blended learning environment has been developed with the purpose of upgrading the basic programming courses (Programming Fundamentals 1 and Programming Fundamentals 2) at the Advanced School of Electrical and Computer Engineering (VISER) in Belgrade, Serbia. The paper contains a brief description of the goals set, their development and implementation (structure design, the development of teaching materials, scenario implementation, and evaluation), and the results of the implementation and evaluation of these courses.", "authors": [{"name": "S. Djenic", "affiliation": "Advanced School of Electrical and Computer Engineering, Belgrade, Serbia"}, {"name": "J. Mitic", "affiliation": "Advanced School of Electrical and Computer Engineering, Belgrade, Serbia"}, {"name": "R. Krneta", "affiliation": "Technical Faculty Cacak, University of Kragujevac, Serbia"}], "tags": ["computer aided instruction", "basic programming courses", "programming", "Multimedia communication", "interactive systems", "Internet", "multimedia teaching material", "Educational institutions", "electrical engineering education", "dynamic interactive simulation", "programming courses", "online multimedia textbooks", "Programming Fundamentals 1", "educational courses", "multimedia systems", "interactive simulations", "Programming profession", "Programming Fundamentals 2", "Materials", "Internet lessons", "Blended learning", "distance learning", "computer science education", "blended learning environment"]}, {"title": "An Analog Computer for Electronic Engineering Education", "link": "https://ieeexplore.ieee.org/document/5638617/", "abstract": "This paper describes a compact analog computer and proposes its use in electronic engineering teaching laboratories to develop student understanding of applications in analog electronics, electronic components, engineering mathematics, control engineering, safe laboratory and workshop practices, circuit construction, testing, and maintenance. The device develops student understanding through experiential learning, where theory is applied and process is observed. The device can be built by or issued to first-year students and used in a variety of units throughout an Electronic Engineering degree course. A number of applications are described that can be given as student laboratories and projects.", "authors": [{"name": "Herbert H. C. Iu", "affiliation": "School of Electrical Electronic and Computer Engineering, University of Western Australia, Crawley, WA, Australia"}, {"name": "Andrew L. Fitch", "affiliation": "School of Electrical Electronic and Computer Engineering, University of Western Australia, Crawley, WA, Australia"}, {"name": "Dylan D. C. Lu", "affiliation": "School of Electrical and Information Engineering, University of Sydney, Sydney, NSW, Australia"}], "tags": ["maintenance", "Analog computers", "analog electronics", "electronic components", "Equations", "safe laboratory", "experiential learning", "control engineering", "Analog computing", "circuits", "teaching laboratories", "engineering mathematics", "simulation", "testing", "workshop practices", "electronic engineering education", "Mathematical model", "analog computer", "Software", "Computational modeling", "Laboratories", "circuit construction", "deep learning", "teaching"]}, {"title": "Implementing Motivational Features in Reactive Blended Learning: Application to an Introductory Control Engineering Course", "link": "https://ieeexplore.ieee.org/document/5685599/", "abstract": "This paper presents a significant advance in a reactive blended learning methodology applied to an introductory control engineering course. This proposal was based on the inclusion of a reactive element (a fuzzy-logic-based controller) designed to regulate the workload for each student according to his/her activity and performance. The contribution of this proposal stands on the inclusion of elements related to motivational factors in the students. Student motivation has been widely identified as a key factor for the academic success of every teaching-learning activity.", "authors": [{"name": "Evelio J. Gonzalez", "affiliation": "Departamento de Ingeniería de Sistemas y Automática y ATC, Universidad de La Laguna, La Laguna, Spain"}, {"name": "Juan Albino Mendez", "affiliation": "Departamento de Ingeniería de Sistemas y Automática y ATC, Universidad de La Laguna, La Laguna, Spain"}], "tags": ["Education", "fuzzy-logic-based controller", "student motivation", "distance education", "teaching-learning activity", "introductory control engineering course", "Proposals", "control engineering education", "human factors", "Fuzzy logic", "teaching/learning strategies", "reactive blended learning methodology", "simulations", "Psychology", "educational courses", "Control engineering", "fuzzy control", "classroom teaching", "telelearning", "motivational features", "Fuzzy sets", "Applications in subject areas", "motivational factors", "Pragmatics", "reactive element", "distance learning"]}, {"title": "Remote Multivariable Control Design Using a Competition Game", "link": "https://ieeexplore.ieee.org/document/5451095/", "abstract": "In this paper, some approaches to teaching multi variable control design are discussed, with special attention being devoted to a step-by-step transition to e-learning. The approach put into practice and presented here is developed through design projects, from which one is chosen as a competition game and is realized using the E-CHO system, Matlab, and a laboratory pilot plant. All the preparations for the game can be completed using a remote virtual and actual laboratory device, while the final competition evaluation takes place in the laboratory in order to preserve personal contacts between the students and the staff. The methods described, comprising all the important e-education elements, were found to stimulate the students' interest and speed up the learning process, and are directly extendable to different forms of courses suitable for new forms of study and education promotion, including lifelong education.", "authors": [{"name": "Vito Logar", "affiliation": "Faculty of Electrical Engineering—Department of Automatics, Ljubljana, Slovenia"}, {"name": "Rihard Karba", "affiliation": "Faculty of Electrical Engineering—Department of Automatics, Ljubljana, Slovenia"}, {"name": "Maja Atanasijević-Kunc", "affiliation": "Faculty of Electrical Engineering—Department of Automatics, Ljubljana, Slovenia"}, {"name": "Marko Papič", "affiliation": "Faculty of Electrical Engineering—Department of Automatics, Ljubljana, Slovenia"}, {"name": "Andrej Kos", "affiliation": "Faculty of Electrical Engineering—Department of Automatics, Ljubljana, Slovenia"}], "tags": ["computer aided instruction", "Education", "virtual instrumentation", "Games", "e-education elements", "terms-competition game", "virtual laboratory", "Electronic learning", "telecontrol", "e-learning", "control engineering education", "remote laboratory", "multiple-input–multiple-output (MIMO) systems", "personal contacts", "Matlab", "step-by-step transition", "control system synthesis", "competition game", "computer games", "MIMO", "Mathematical model", "control engineering computing", "multivariable control systems", "Control design", "E-CHO system", "Laboratories", "laboratory pilot plant", "teaching", "remote multivariable control design"]}, {"title": "An Approach to Average Modeling and Simulation of Switch-Mode Systems", "link": "https://ieeexplore.ieee.org/document/5766064/", "abstract": "This paper suggests a pedagogical approach to teaching the subject of average modeling of PWM switch-mode power electronics systems through simulation by general-purpose electronic circuit simulators. The paper discusses the derivation of PSPICE/ORCAD-compatible average models of the switch-mode power stages, their software implementation, and fast time-domain, frequency-domain, and stability analysis simulation techniques suitable for virtual study of complex switch-mode feedback systems. The proposed approach is demonstrated by a simulation example. The methodology is oriented toward Electrical Engineering students at the undergraduate level, enrolled in courses such as “Power Electronics,” “Industrial Electronics,” or the like. The paper can be helpful to instructors of a “Virtual Power Electronics Laboratory” course wanting to conduct a software experiment on dynamics of switch-mode power converter systems. Engineers and scientists approaching the task of simulation of switch-mode systems can also find the suggested technique useful.", "authors": [{"name": "Alexander Abramovitz", "affiliation": "Department of Electrical and Computer Engineering, University of California, Irvine, Irvine, CA, USA, Electrical and Electronics Engineering, Sami Shamoon College of Engineering, Beersheba, Israel"}], "tags": ["computer aided instruction", "Pulse width modulation", "electronic engineering computing", "PWM switch mode power electronics", "Integrated circuit modeling", "Feedback", "circuit CAD", "Power electronics", "power factor", "feedback circuits", "SPICE", "pedagogical approach", "simulation", "Switches", "electronic engineering education", "switch-mode power conversion", "Inductors", "PWM power convertors", "switch mode systems", "electronic circuit simulators", "circuit feedback", "switch-mode power converter systems", "Computational modeling", "PSPICE/ORCAD", "virtual power electronics laboratory course", "teaching", "switched mode power supplies"]}, {"title": "Game-Themed Programming Assignment Modules: A Pathway for Gradual Integration of Gaming Context Into Existing Introductory Programming Courses", "link": "https://ieeexplore.ieee.org/document/5559399/", "abstract": "Despite the proven success of using computer video games as a context for teaching introductory programming (CS1/2) courses, barriers including the lack of adoptable materials, required background expertise (in graphics/games), and institutional acceptance still prevent interested faculty members from experimenting with this approach. Game-themed programming assignment (GTA) modules are designed specifically for these faculty members. The GTA modules are independent, and each is a self-contained game-like programming assignment that challenges students on concepts pertaining to a specific curriculum topic area. A faculty member can selectively pick and choose a subset of GTA modules to experiment with and gradually adopt the materials in his or her own classes. Each GTA module also includes a step-by-step tutorial guide that supports and encourages interested faculty to develop their own expertise and game-themed materials. This paper begins with a survey of previous results. Based on this survey, the paper summarizes the important considerations when designing materials for selective adoption. The paper then describes the design, implementation, and assessment of the GTA modules. The results from ongoing GTA workshops for CS1/2 faculty members and from a yearlong project in adopting the GTA modules in classes are then presented. In this case, the collected results verified that introductory programming concepts can be examined, practiced, and learned by means of GTA modules when neither the faculty nor the students involved have backgrounds in graphics or games. More importantly, these results demonstrated that it is straightforward to blend the GTA modules into existing classes with minimum alterations. In these ways, the GTA modules are excellent catalysts enabling faculty to begin exploring and developing their own expertise and materials to teach with games.", "authors": [{"name": "John Nordlinger", "affiliation": "Microsoft External Research, Redmond, WA, USA"}, {"name": "David S. Goldstein", "affiliation": "Teaching and Learning Center, University of Washington, Bothell, Bothell, WA, USA"}, {"name": "Robin Lynn Angotti", "affiliation": "Department of Education, University of Washington, Bothell, Bothell, WA, USA"}, {"name": "Michael W. Panitz", "affiliation": "Cascadia Community College, Bothell, WA, USA"}, {"name": "Kelvin Sung", "affiliation": "Department of Computing and Software Systems, University of Washington, Bothell, Bothell, WA, USA"}, {"name": "Cinnamon Hillyard", "affiliation": "Department of Interdisciplinary Arts and Sciences, University of Washington, Bothell, Bothell, WA, USA"}], "tags": ["computer aided instruction", "Education", "assessment", "Games", "programming", "CS1/2 faculty members", "assignments", "Computers", "Adaptation", "CS1/2", "computer video games", "gaming context", "educational courses", "computer games", "Graphics", "introductory programming courses", "Programming profession", "Materials", "games", "game themed programming assignment modules", "computer science education"]}, {"title": "How Blended Learning Reduces Underachievement in Higher Education: An Experience in Teaching Computer Sciences", "link": "https://ieeexplore.ieee.org/document/5607328/", "abstract": "This paper presents a blended learning approach and a study evaluating instruction in a software engineering-related course unit as part of an undergraduate engineering degree program in computing. In the past, the course unit had a lecture-based format. In view of student underachievement and the high course unit dropout rate, a distance-learning system was deployed, where students were allowed to choose between a distance-learning approach driven by a moderate constructivist instructional model or a blended-learning approach. The results of this experience are presented, with the aim of showing the effectiveness of the teaching/learning system deployed compared to the lecture-based system previously in place. The grades earned by students under the new system, following the distance-learning and blended-learning courses, are compared statistically to the grades attained in earlier years in the traditional face-to-face classroom (lecture-based) learning.", "authors": [{"name": "Daniel Manrique", "affiliation": "Departamento de Inteligencia Artificial, Facultad de Informática, Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Loïc Martinez", "affiliation": "Departmento de Lenguajes Sistemas Informáticos e Ingeniería del Software, Facultad de Informática, Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "Fernando Alonso", "affiliation": "Departmento de Lenguajes Sistemas Informáticos e Ingeniería del Software, Facultad de Informática, Universidad Politécnica de Madrid, Madrid, Spain"}, {"name": "José M. Vines", "affiliation": "Aulatika S.L., Madrid, Spain"}], "tags": ["student underachievement", "Electronic learning", "moderate constructivism", "distance-learning approach", "teaching system", "higher education underachievement", "e-learning", "Computer aided instruction", "lecture-based format", "software engineering-related course unit", "educational courses", "course unit dropout rate", "lecture-based learning", "Object oriented modeling", "face-to-face classroom learning", "software engineering", "blended-learning approach", "instruction evaluation", "distance-learning system", "Roads", "lecture-based system", "Analysis of variance", "blended learning", "Blended learning", "educational technology", "Computational modeling", "distance learning", "teaching", "computer science education", "undergraduate engineering degree program", "moderate constructivist instructional model", "computer sciences"]}, {"title": "Improvements to an Electrical Engineering Skill Audit Exam to Improve Student Mastery of Core EE Concepts", "link": "https://ieeexplore.ieee.org/document/5430960/", "abstract": "The San José State University Electrical Engineering (EE) Department implemented a skill audit exam for graduating seniors in 1999 with the purpose of assessing the teaching and the students' mastery of core concepts in EE. However, consistent low scores for the first years in which the test was administered suggested that students had little incentive in reviewing for passing the test. To promote the concept that there is a set of basic skills every graduating senior should master, improvements were implemented that included creating an online exam used for review and requiring students to earn a 70% or higher score on an in-class exam that is a requirement for graduation. After the improvements were made, all students demonstrated at least 70% mastery of the core EE concepts as measured by the improved in-class skill audit exam. The details of these improvements are presented. Anonymous survey results of graduating seniors indicate that students feel that preparing for the skill audit exam was a good use of their time and that the exam should be made more rigorous for future students.", "authors": [{"name": "David W. Parent", "affiliation": "Electrical Engineering Department, San José State University, San Jose, CA, USA"}], "tags": ["Transmission line measurements", "Resistance", "computer aided instruction", "Springs", "student mastery", "online exam", "Book reviews", "learning management system", "Educational institutions", "San Jose State University", "ABET", "exit exam", "capstone engineering experience", "electrical engineering education", "in-class exam", "Electrical engineering", "teaching", "electrical engineering skill audit exam"]}, {"title": "A Course in Simulation and Demonstration of Humanoid Robot Motion", "link": "https://ieeexplore.ieee.org/document/5483077/", "abstract": "An introductory course for humanoid robot motion realization for undergraduate and graduate students is presented in this study. The basic operations of AX-12 motors and the mechanics combination of a 16 degrees-of-freedom (DOF) humanoid robot are presented first. The main concepts of multilink systems, zero moment point (ZMP), and feedback control are then introduced such that the students can understand the relationship between the ZMP position and the stability of the robot. Finally, the students can simulate the desired motion trajectory and realize the motion practically on the real humanoid robot. Taking this course, the students can not only learn robotic theories and control techniques for humanoid robot motion, but can also enhance their experience in hands-on experiments in executing the motion of a humanoid robot. The proposed educational strategy will enable students to progress easily to more advanced work on robot design and control in their future study or careers.", "authors": [{"name": "Hsin-Yu Liu", "affiliation": "Department of Electrical Engineering, National Central University, Jhong Li, Taiwan"}, {"name": "Rong-Jyue Wang", "affiliation": "Department of Electrical Engineering, National Formosa University, Huwei, Taiwan"}, {"name": "Wen-June Wang", "affiliation": "Department of Electrical Engineering, National Central University, Jhong Li, Taiwan"}], "tags": ["motion control", "DOF humanoid robot", "Computers", "introductory course", "control techniques", "AX-12 motors", "mobile robots", "robotic theory", "control engineering education", "robot control", "Stability analysis", "undergraduate students", "multilink systems", "motion trajectory", "humanoid robot motion realization", "feedback control", "multilink system", "Humanoid robots", "educational courses", "feedback", "humanoid robots", "Educational strategy", "Joints", "educational strategy", "mechanics combination", "degrees-of-freedom humanoid robot", "Educational robots", "zero moment point", "Trajectory", "ZMP position", "zero moment point (ZMP)", "robot design", "humanoid robot stability", "stability", "hands-on experiments", "position control"]}, {"title": "A Laboratory Testbed for Embedded Fuzzy Control", "link": "https://ieeexplore.ieee.org/document/5406013/", "abstract": "This paper presents a novel scheme called “Laboratory Testbed for Embedded Fuzzy Control of a Real Time Nonlinear System.” The idea is based upon the fact that project-based learning motivates students to learn actively and to use their engineering skills acquired in their previous years of study. It also fosters initiative and focuses students' attention on authentic real-world problems. At the same time, it enhances their learning. Students gain hands-on experience and improve their skills in product development, self-directed learning, teamwork, and project management. There has been a tremendous rise in the popularity of intelligent control techniques like fuzzy logic for use in industrial control applications in recent times. These techniques, which were primarily conceived for nonlinear control applications, are best implemented using embedded controllers, which can use their capabilities to the maximum. While courses in electrical and computer engineering cover several areas like digital and analog integrated circuits, microprocessors and control Systems, and process control, few of these integrate all these areas with focus on the application of intelligent techniques in real-time systems. Also, there is a growing need in industry for engineers who can perform software design and system integration for various applications in embedded control. This paper aims at developing such a practical task as one of the major projects in the eighth semester of the program offered by the Instrumentation and Control Engineering (ICE) Department of Netaji Subhas Institute of Technology (NSIT), Delhi University, India, to design a real-time embedded controller implementing an intelligent control technique, fuzzy logic, for control applications. These applications might, for example, be level control, flow control, or pressure control. The paper discusses an example of a real-time pressure control system for which a microcontroller-based fuzzy proportional-integral-derivative (PID) controller has been simulated and implemented with satisfactory results.", "authors": [{"name": "Parampreet Singh Bhasin", "affiliation": "School of Electrical Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}, {"name": "Vidya Sukumar", "affiliation": "Humanities Department, Netaji Subhas Institute of Technology, New Delhi, India"}, {"name": "Duru Arun Kumar", "affiliation": "ST-Ericsson, Connectivity and Broadcast Business Unit, Greater Noida, India"}, {"name": "Smriti Srivastava", "affiliation": "Instrumentation and Control Engineering Department, Netaji Subhas Institute of Technology, New Delhi, India"}], "tags": ["real-time systems", "Real time systems", "Process control", "fuzzy logic", "engineering education", "project based learning", "nonlinear control systems", "laboratory testbed", "proportional-integral-derivative control", "real-time system", "Fuzzy control", "Intelligent control", "Fuzzy logic", "Instrumentation and Control Engineering", "real-time pressure control system", "project agement", "educational courses", "fuzzy control", "three-term control", "system integration", "intelligent control", "embedded control", "Mathematical model", "microcontrollers", "computer engineering", "software design", "teamwork", "Control systems", "intelligent control technique", "electrical engineering", "embedded systems", "self-directed learning", "product development", "nonlinear control system", "pressure control"]}, {"title": "Learning Embedded Software Design in an Open 3A Multiuser Laboratory", "link": "https://ieeexplore.ieee.org/document/5499444/", "abstract": "The need for professional programmers in embedded applications has become critical for industry growth. This need has increased the popularity of embedded software design courses, which are resource-intensive and space-limited in traditional real lab-based instruction. To overcome geographic and time barriers in enhancing practical skills that students require for embedded software design, this paper presents a remote multiuser platform designed to allow students to experiment with embedded systems “anytime” and “anywhere” through the “always open” lab (3A). The open 3A Multiuser Lab (3AML) integrates open source and network address translation (NAT) service techniques to offer a low-cost and efficient experimental environment for students. The current study achieves the educational goals of training students to apply and integrate embedded software programming by combining teaching methodology and the proposed open 3AML aids. In addition to describing the various experimental stations of the open platform and the students' project achievements, this work also discusses the campus-wide teaching assessment results and the satisfaction survey of the learning platform with students.", "authors": [{"name": "Lain-Jinn Hwang", "affiliation": "Department of Computer Science and Information Engineering, Tamkang University, Tamsui, Taiwan"}, {"name": "Chien-Chou Shih", "affiliation": "Department of Information and Communication, Tamkang University, Tamsui, Taiwan"}], "tags": ["programming", "Embedded software programming", "network address translation (NAT)", "Servers", "open source", "NAT service", "courseware", "Embedded system", "student experiments", "always open lab", "Educational institutions", "open 3AML aids", "software programming", "real lab-based instruction", "professional programmer", "network address translation", "educational courses", "remote multiuser platform", "open 3A multiuser laboratory", "Programming profession", "software engineering", "embedded software design course", "teaching methodology", "embedded system", "campus-wide teaching assessment", "embedded application", "embedded systems", "learning platform", "computer science education"]}, {"title": "EduCloud: PaaS versus IaaS Cloud Usage for an Advanced Computer Science Course", "link": "https://ieeexplore.ieee.org/document/5686886/", "abstract": "The cloud has become a widely used term in academia and the industry. Education has not remained unaware of this trend, and several educational solutions based on cloud technologies are already in place, especially for software as a service cloud. However, an evaluation of the educational potential of infrastructure and platform clouds has not been explored yet. An evaluation of which type of cloud would be the most beneficial for students to learn, depending on the technical knowledge required for its usage, is missing. Here, the first systematic evaluation of different types of cloud technologies in an advanced course on network overlays with 84 students and four professors is presented. This evaluation tries to answer the question whether cloud technologies (and which specific type of cloud) can be useful in educational scenarios for computer science students by focusing students in the actual tasks at hand. This study demonstrates that platform clouds are valued by both students and professors to achieve the course objectives and that clouds offer a significant improvement over the previous situation in labs where much effort was devoted to setting up the software necessary for course activities. These results most strongly apply to courses in which students interact with resources that are non-self-contained (e.g., network nodes, databases, mechanical equipment, or the cloud itself), but could also apply to other science disciplines that involve programming or performing virtual experiments.", "authors": [{"name": "Luis M. Vaquero", "affiliation": "Universidad Rey Juan Carlos de Madrid, Mostoles, Spain, Hewlett Packard Laboratories, Bristol, UK"}], "tags": ["computer aided instruction", "Education", "computer science education", "cloud computing", "virtual experiments", "course", "PaaS cloud usage", "Hardware", "Algorithm design and analysis", "technical knowledge", "education", "educational courses", "network overlays", "Software", "advanced computer science course", "Programming", "Peer to peer computing", "cloud technologies", "evaluation", "IaaS cloud usage", "Cloud"]}, {"title": "Computer-Aided Teaching Using MATLAB/Simulink for Enhancing an IM Course With Laboratory Tests", "link": "https://ieeexplore.ieee.org/document/5610743/", "abstract": "This paper describes an automatic procedure using MATLAB software to plot the circle diagram for two induction motors (IMs), with wound and squirrel-cage rotors, from no-load and blocked-rotor tests. The advantage of this approach is that it avoids the need for a direct load test in predetermining the IM characteristics under reduced power. Additionally, to verify the validity of the equivalent circuit parameters deduced from experimental tests, these characteristics are used to simulate virtual machines implemented under Simulink/PSB models. Furthermore, a virtual load test is performed to validate the proposed model. Finally, the results are given of an assessment that reflects the positive impact the proposed methods have had on students' learning experience in electrical machinery courses in the Electrotechnics Department, Engineer Sciences Faculty, University Mentouri of Constantine (ED-ESF-UMC), Algeria.", "authors": [{"name": "Tahar Birem", "affiliation": "Laboratory Electrotechnics of Constantine, Engineer Sciences Faculty, University of Mentouri Constantine, Constantine, Algeria"}, {"name": "Hamza Amiar", "affiliation": "Laboratory Electrotechnics of Constantine, Engineer Sciences Faculty, University of Mentouri Constantine, Constantine, Algeria"}, {"name": "Hind Djeghloud", "affiliation": "Laboratory Electrotechnics of Constantine, Engineer Sciences Faculty, University of Mentouri Constantine, Constantine, Algeria"}, {"name": "Amar Bentounsi", "affiliation": "Laboratory Electrotechnics of Constantine, Engineer Sciences Faculty, University of Mentouri Constantine, Constantine, Algeria"}, {"name": "Hocine Benalla", "affiliation": "Laboratory Electrotechnics of Constantine, Engineer Sciences Faculty, University of Mentouri Constantine, Constantine, Algeria"}], "tags": ["computer aided instruction", "Stator windings", "Characteristics", "electrical machinery courses", "circle diagram", "engineer sciences faculty", "experimental tests", "squirrel cage motors", "Stator cores", "student experiments", "Inductance", "virtual machines", "Simulink", "load (electric)", "induction motor", "wound rotors", "MATLAB/Simulink", "computer-aided teaching", "University Mentouri of Constantine", "IM Course", "educational courses", "MATLAB", "no-load tests", "induction motors", "virtual load test", "blocked-rotor tests", "Equivalent circuits", "power engineering education", "Algeria", "laboratory tests", "squirrel-cage rotors", "electrotechnics department", "Rotors", "virtual tests"]}, {"title": "Evaluation of the Effectiveness of a Web-Based Learning Design for Adult Computer Science Courses", "link": "https://ieeexplore.ieee.org/document/5545452/", "abstract": "This paper reports on work undertaken within a pilot study concerned with the design, development, and evaluation of online computer science training courses. Drawing on recent developments in e-learning technology, these courses were structured around the principles of a learner-oriented approach for use with adult learners. The paper describes a methodological framework for the evaluation of three main educational issues involved in the learning process of Web-based computer science training courses, and analyzes the results of this study with the aim of providing an improved learning design, and environment, for these courses. The findings highlight a number of potential barriers to learning and indicate the failed indicators that need to be improved in order to enhance effective performance. The authors give their views both on ways to improve the proposed learning environment and on the need for an optimal balance between asynchronous and synchronous activities, enhanced collaboration, and interactions among adult learners and e-tutors.", "authors": [{"name": "Thanasis Daradoumis", "affiliation": "Computer Science Department, Open University of Catalonia, Barcelona, Spain, Department of Cultural Informatics, University of Aegean, Mytilini, Greece"}, {"name": "Spyros Papadakis", "affiliation": "School of Science and Technology, Hellenic Open University, Patras, Greece"}, {"name": "Christos Simos", "affiliation": "Technological Educational Institute of Lamia, Lamia, Greece"}, {"name": "Konstantinos Antonis", "affiliation": "Technological Educational Institute of Lamia, Lamia, Greece"}], "tags": ["computer aided instruction", "Electronic learning", "Least squares approximation", "continuing professional development", "adult computer science courses", "Internet", "Training", "learning design", "Adult education", "Collaboration", "enhanced collaboration", "e-tutors", "online computer science training courses", "Materials", "evaluation", "lifelong learning", "Computer science", "computer science education", "Web based learning design"]}, {"title": "Vertical Integration of System-on-Chip Concepts in the Digital Design Curriculum", "link": "https://ieeexplore.ieee.org/document/5477209/", "abstract": "The rapid evolution of System-on-Chip (SoC) challenges academic curricula to keep pace with multidisciplinary/interdisciplinary system thinking. This paper presents a curricular prototype that cuts across artificial course boundaries and provides a meaningful exploration of diverse facets of SoC design. Specifically, experimental contents of a digital flow SoC product design-a simplified Transmission Control Protocol (TCP)/Internet Protocol (IP) stack-are systematically developed and implemented in the series of courses that comprise the Digital Design track of the Rowan Electrical and Computer Engineering (ECE) curriculum. The System-on-Chip project and its progressively more complex laboratory modules are described and discussed. Its implementation in the existing ECE curriculum is also presented along with the assessment results.", "authors": [{"name": "Linda M. Head", "affiliation": "Department of Electrical and Computer Engineering, Rowan University, Glassboro, NJ, USA"}, {"name": "Lawrence M. Chatman", "affiliation": "Department of Engineering Science and Technology, Camden County College, Cherry Hill, NJ, USA"}, {"name": "Ravi P. Ramachandran", "affiliation": "Department of Electrical and Computer Engineering, Rowan University, Glassboro, NJ, USA"}, {"name": "Ying Tang", "affiliation": "Department of Electrical and Computer Engineering, Rowan University, Glassboro, NJ, USA"}], "tags": ["Education", "digital flow system-on-chip product design", "Computer architecture", "interdisciplinary system thinking", "Hardware", "Digital circuits", "multidisciplinary system thinking", "Rowan electrical engineering curriculum", "Internet", "academic curricula", "education", "Internet protocol stack", "system-on-chip", "electrical engineering education", "System-on-Chip (SoC)", "educational courses", "artificial course", "System-on-a-chip", "digital design track", "digital design curriculum", "microcontrollers", "integrated circuit design", "Software", "Hardware design languages", "Protocols", "Rowan computer engineering curriculum", "vertical integration", "computer science education", "transport protocols", "transmission control protocol"]}, {"title": "Automated Assessment in a Programming Tools Course", "link": "https://ieeexplore.ieee.org/document/5675756/", "abstract": "Automated assessment systems can be useful for both students and instructors. Ranking and immediate feedback can have a strongly positive effect on student learning. This paper presents an experience using automatic assessment in a programming tools course. The proposal aims at extending the traditional use of an online judging system with a series of assignments related to programming tools. Some empirical results on how students use an automated assessment system in a CS2 course are presented. Research suggested that automated assessment systems promoted the students' interest and produced statistically significant differences in the scores between experimental and control groups.", "authors": [{"name": "José Luis Fernandez Aleman", "affiliation": "Department of Informatics and Systems, Facultad de Informática, University of Murcia, Murcia, Spain"}], "tags": ["Runtime", "automated assessment systems", "Electronic learning", "online judging system", "Web tool", "e-learning", "courseware", "Testing", "Active learning", "student learning", "feedback", "software tools", "ranking", "Programming profession", "Debugging", "Software", "immediate feedback", "programming tools", "programming tools course", "competitive learning", "computer science education"]}, {"title": "Students' Misconceptions About Medium-Scale Integrated Circuits", "link": "https://ieeexplore.ieee.org/document/5699379/", "abstract": "To improve instruction in computer engineering and computer science, instructors must better understand how their students learn. Unfortunately, little is known about how students learn the fundamental concepts in computing. To investigate student conceptions and misconceptions about digital logic concepts, the authors conducted a qualitative interview-based study. In the interviews, students verbalized their thinking while they solved digital logic problems. The interviews were analyzed to identify students' misconceptions. This paper presents five classes of students' misconceptions and methodological weaknesses concerning medium-scale integrated (MSI) circuits. These misconceptions were used to create a multiple-choice conceptual assessment, called a concept inventory, that is being used to test for the prevalence of the misconceptions discovered through the interviews. Although the misconceptions documented in the paper are primarily intended for the construction of the concept inventory, they can also point to potential ways to improve instruction.", "authors": [{"name": "Craig Zilles", "affiliation": "Department of Computer Science, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}, {"name": "Geoffrey L. Herman", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}, {"name": "Michael C. Loui", "affiliation": "Department of Electrical and Computer Engineering, University of Illinois, Urbana-Champaign, Urbana, IL, USA"}], "tags": ["Education", "Interviews", "integrated circuit", "integrated circuits", "Decoding", "logic circuits", "instruction", "Multiplexing", "Wires", "electrical engineering education", "Random access memory", "combinational circuits", "Read only memory", "Boolean algebra", "computer science", "qualitative interview based study", "students", "computer engineering", "medium scale integrated circuits", "concept inventory", "computer science education"]}, {"title": "Rapid Prototyping Platform for Robotics Applications", "link": "https://ieeexplore.ieee.org/document/5464382/", "abstract": "For the past several years, a team in the Department of Electrical Engineering (EE), National Chung Cheng University, Taiwan, has been establishing a pedagogical approach to embody embedded systems in the context of robotics. To alleviate the burden on students in the robotics curriculum in their junior and senior years, a training platform on embedded systems with co-design in hardware and software has been developed and fabricated as a supplement for these students. This general-purpose platform has several advantages over commercial training kits for embedded systems. For instance, the programming layer has been brought onto an open-source platform ported by Linux and μC/OS-II such that it is mostly hardware-independent. Meanwhile, in addition to linking to fundamental library functions provided for robotics, users can program the codes not only in C language, but also through visual programming by means of a graphic interface developed along with the platform, allowing users to concentrate on higher-level robot function design. In other words, the platform facilitates rapid prototyping in robotics design. Meanwhile, a tailored laboratory manual associated with the platform has been designed and used in classes. Based on assessments and evaluation on the students who have completed this course, the curricular training is satisfactory and largely meets the requirements established at the design stage.", "authors": [{"name": "Kao-Shing Hwang", "affiliation": "Department of Electrical Engineering, National Chung Cheng University, Chiayi, Taiwan"}, {"name": "Kim-Joan Chen", "affiliation": "Department of Electrical Engineering, National Chung Cheng University, Chiayi, Taiwan"}, {"name": "Gaung-Ting Shing", "affiliation": "Department of Electrical Engineering, National Chung Cheng University, Chiayi, Taiwan"}, {"name": "Wen-Hsu Hsiao", "affiliation": "Department of Electrical Engineering, National Chung Cheng University, Chiayi, Taiwan"}], "tags": ["hardware-software codesign", "Real time systems", "rapid prototyping platform", "Linux", "microprocessor", "Microprocessors", "Hardware", "control engineering education", "software libraries", "Embedded system", "education", "Curriculum", "training platform", "robotics curriculum", "robotics education", "open-source platform", "pedagogical approach", "public domain software", "robot function design", "software prototyping", "Robots", "Programming profession", "control engineering computing", "graphic interface", "μC/OS-II", "programming layer", "graphical user interfaces", "C language", "visual programming", "embedded system", "fundamental library function", "embedded systems", "robot programming", "training"]}, {"title": "Microcircuit Modeling and Simulation Beyond Ohm’s Law", "link": "https://ieeexplore.ieee.org/document/5418860/", "abstract": "Circuit theory textbooks rely heavily on the applicability of Ohm's law, which collapses as electronic components reach micro- and nanoscale dimensions. Circuit analysis is examined in the regime where the applied voltage \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n is greater than the critical voltage \n<i xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">V</i>\n<sub xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">c</sub>\n, which triggers the nonlinear behavior. The critical voltage is infinity in the Ohmic regime, but is as low as a fraction of a volt when linear current-voltage characteristics become sublinear and the resistance surges due to current saturation effects. For two resistors of the same Ohmic values but of differing lengths, the shorter resistor is more susceptible to this effect. In addition, the power consumed in this regime is a linear function of voltage as compared to quadratic behavior in the Ohmic regime. Several possible applications are suggested.", "authors": [{"name": "Tanuj Saxena", "affiliation": "Department of Engineering Physics, Indian Institute of Technology, Mumbai, India"}, {"name": "Desmond Chang Yih Chek", "affiliation": "Faculty of Electrical Engineering, Universiti Teknologi Malaysia, Skudai, Malaysia"}, {"name": "Michael Loong Peng Tan", "affiliation": "Electrical Engineering Division, Engineering Department, University of Cambridge, Cambridge, UK, Faculty of Electrical Engineering, Universiti Teknologi Malaysia, Skudai, Malaysia"}, {"name": "Vijay K. Arora", "affiliation": "Faculty of Electrical Engineering, Universiti Teknologi Malaysia, Skudai, Malaysia, Division of Engineering and Physics, Wilkes University, Wilkes Barre, PA, USA"}], "tags": ["resistor", "integrated circuit modelling", "power consumption", "circuit theory", "circuit simulation", "Integrated circuit modeling", "MOSFET", "Resistance", "electronic component", "microcircuit modeling", "very large scale integration", "current-voltage characteristic", "low-power electronics", "SPICE", "Circuit analysis", "nonlinear I–V", "simulation", "micro/nano channels", "microcircuit simulation", "Ohm's law", "Mathematical model", "circuit analysis", "Materials", "Charge carrier processes", "resistors", "current saturation effect", "Resistors", "resistance surge", "trigger"]}, {"title": "Integrating Embedded Computing Systems Into High School and Early Undergraduate Education", "link": "https://ieeexplore.ieee.org/document/5593191/", "abstract": "Early exposure to embedded computing systems is crucial for students to be prepared for the embedded computing demands of today's world. However, exposure to systems knowledge often comes too late in the curriculum to stimulate students' interests and to provide a meaningful difference in how they direct their choice of electives for future education and careers. This paper describes an experience with integrating embedded computing systems education into high school and early undergraduate curricula to give students that needed early exposure. It provides assessment data that illustrates the success and limitations of the efforts described as well as the lessons they hold for a reform of the undergraduate curriculum and its impact on high school education.", "authors": [{"name": "Bridget Benson", "affiliation": "Department of Computer Science and Engineering, University of California, San Diego, CA, USA, Center of Coastal Environmental Sensing Networks, University of Massachusetts, Boston, MA, USA"}, {"name": "Arash Arfaee", "affiliation": "Department of Computer Science and Engineering, University of California, San Diego, CA, USA"}, {"name": "Ryan Kastner", "affiliation": "Department of Computer Science and Engineering, University of California, San Diego, CA, USA"}, {"name": "Rajesh K. Gupta", "affiliation": "Department of Computer Science and Engineering, University of California, San Diego, CA, USA"}, {"name": "Choon Kim", "affiliation": "Department of Computer Science and Engineering, University of California, San Diego, CA, USA"}], "tags": ["Early undergraduate curricula", "Computers", "future education", "Embedded system", "Educational institutions", "early undergraduate education", "further education", "education assessment", "system knowledge", "Programming profession", "undergraduate curriculum", "assessment data", "embedded computing system education", "embedded systems education", "career", "high school curricula", "hands-on learning", "embedded systems", "educational administrative data processing", "computer science education", "high school education"]}, {"title": "Understanding Optical Trapping Phenomena: A Simulation for Undergraduates", "link": "https://ieeexplore.ieee.org/document/5451098/", "abstract": "Optical trapping is an attractive and multidisciplinary topic that has become the center of attention to a large number of researchers. Moreover, it is a suitable subject for advanced students that requires a knowledge of a wide range of topics. As a result, it has been incorporated into some syllabuses of both undergraduate and graduate programs. In this paper, basic concepts in laser trapping theory are reviewed. To provide a better understanding of the underlying concepts for students, a Java application for simulating the behavior of a dielectric particle trapped in a highly focused beam has been developed. The program illustrates a wide range of theoretical results and features, such as the calculation of the force exerted by a beam in the Mie and Rayleigh regimes or the calibration of the trap stiffness. Some examples that are ready to be used in the classroom or in the computer lab are also supplied.", "authors": [{"name": "Artur Carnicer", "affiliation": "Applied Physics and Optics Department Fisica Aplicada i Optica, Universitat de Barcelona, Barcelona, Catalunya, Spain"}, {"name": "Arnau Farré", "affiliation": "Applied Physics and Optics Department Fisica Aplicada i Optica, Universitat de Barcelona, Barcelona, Catalunya, Spain"}, {"name": "Josep Mas", "affiliation": "Applied Physics and Optics Department Fisica Aplicada i Optica, Universitat de Barcelona, Barcelona, Catalunya, Spain"}, {"name": "Jordi Cuadros", "affiliation": "Universitat Ramon Lull, Institut Quimic de Sarria, Barcelona, Catalunya, Spain"}, {"name": "Ignasi Juvells", "affiliation": "Applied Physics and Optics Department Fisica Aplicada i Optica, Universitat de Barcelona, Barcelona, Catalunya, Spain"}], "tags": ["computer aided instruction", "electromagnetic engineering education", "physics education", "dielectric particle", "optical trapping", "Optical scattering", "ray tracing", "Rayleigh scattering", "Laser beams", "optical engineering computing", "Particle beams", "laser beam effects", "Educational technology", "highly focused beam", "optical focusing", "optical design techniques", "radiation pressure", "Charge carrier processes", "Mie scattering", "laser applications", "physical optics", "geometrical optics", "physics computing", "Java", "Optical refraction", "Force", "Java application"]}, {"title": "Measuring the Effects of Virtual Pair Programming in an Introductory Programming Java Course", "link": "https://ieeexplore.ieee.org/document/5464387/", "abstract": "This study investigated the effectiveness of virtual pair programming (VPP) on student performance and satisfaction in an introductory Java course. Students used online tools that integrated desktop sharing and real-time communication, and the metrics examined showed that VPP is an acceptable alternative to individual programming experience.", "authors": [{"name": "Nick Z. Zacharis", "affiliation": "Technological Educational Institute of Piraeus, Athens, Greece"}], "tags": ["Collaboration", "Productivity", "Real time systems", "virtual pair programming", "integrated desktop sharing", "student performance", "online tool", "Achievement", "Programming profession", "Software quality", "Java course", "real time communication", "Java", "virtual pair programming (VPP)", "computer science education", "introductory programming Java course", "educational courses", "satisfaction"]}, {"title": "Effects of Interdisciplinary Education on Technology-Driven Application Design", "link": "https://ieeexplore.ieee.org/document/5598548/", "abstract": "This paper describes the structure and the underlying rationale of a new course dedicated to capability maturity model integration (CMMI)-directed design of wireless sensor networks (WSNs)-based biomedical applications that stresses: 1) engineering-, medico-engineering-, and informatics-related issues; 2) design for general- and special-purpose systems; and 3) the creation of synergistic effects that enable formation of entrepreneurial multidisciplinary teams able to organize and implement the development of these health-related pervasive computing applications. Formal education so far still focuses on treating only strictly separated and specialized topic areas. However, as the need for cooperation and mutual learning between students oriented toward different fields grows, the need for a multidisciplinary educational approach becomes more and more important. For a technical education to be complete, it is no longer enough to train scientists and engineers solely in technical areas. In development and implementation of technology-driven applications, multidisciplinary issues should be properly addressed in the academic sense. The interdisciplinary understanding and synergy achieved are tested through examinations and workshops. The transdisciplinary knowledge improvement is also statistically evaluated, using a system of metrics developed experimentally.", "authors": [{"name": "Goran Rakocevic", "affiliation": "Department of Computer Engineering, School of Electrical Engineering, Belgrade University, Belgrade, Serbia"}, {"name": "Zhilbert Tafa", "affiliation": "Department of Computer Engineering, School of Electrical Engineering, Belgrade University, Belgrade, Serbia"}, {"name": "Djordje Mihailovic", "affiliation": "College of Technology, Arandelovac, Serbia"}, {"name": "Veljko Milutinovic", "affiliation": "Department of Computer Engineering, School of Electrical Engineering, Belgrade University, Belgrade, Serbia"}], "tags": ["transdisciplinary knowledge improvement", "Education", "interdisciplinary education", "capability maturity model integration", "Computers", "Hardware", "wireless sensor networks", "education", "multidisciplinary", "healthcare", "Wireless sensor networks", "Medical services", "wireless sensor networks (WSNs)", "biomedical measurement", "biomedical education", "telecommunication engineering education", "transdisciplinary", "technology driven application", "Capability maturity model integration (CMMI)", "biomedical applications", "entrepreneurial multidisciplinary teams", "Software", "informatics", "interdisciplinary", "engineering", "biomedical engineering", "Knowledge engineering"]}, {"title": "Design, Development, and Commissioning of a Substation Automation Laboratory to Enhance Learning", "link": "https://ieeexplore.ieee.org/document/5508394/", "abstract": "Automation of power systems is gaining momentum across the world, and there is a need to expose graduate and undergraduate students to the latest developments in hardware, software, and related protocols for power automation. This paper presents the design, development, and commissioning of an automation lab to facilitate the understanding of substation automation (SA). The laboratory has relay intelligent electronic devices (IEDs) that support IEC 61850 protocol, a universal secondary test kit for testing the relays, a protocol converter that can be programmed and can handle a large number of power automation protocols, a Global Positioning Systems (GPS) clock for time synchronization, and all related software. In this paper, the retrofitting of the latest relay IEDs with the existing control center software has been demonstrated. The commissioning process and the experimental setup of the SA laboratory have also been described. A post-training evaluation emphasizes that the student learning experience is helping students to gain a better understanding of the theory and to have better career prospects in power automation. The SA laboratory, which demonstrates all aspects of substation automation, is being used extensively for research and training in this emerging field.", "authors": [{"name": "Anupama Prakash", "affiliation": "Department of Electrical Engineering and the Center of Nanostructures, Jamia Millia Islamia University, New Delhi, India"}, {"name": "Mini S. Thomas", "affiliation": "Department of Electrical Engineering and the Center of Nanostructures, Jamia Millia Islamia University, New Delhi, India"}, {"name": "D. P. Kothari", "affiliation": "Vellore of Institute of Technology, Vellore, India"}], "tags": ["engineering education", "design", "commissioning", "power system control", "Intelligent electronic devices (IEDs)", "interoperability", "supervisory control and data acquisition (SCADA) systems", "enhance learning", "intelligent electronic devices", "substation automation", "global positioning systems", "Automation", "Substation automation", "proprietary software", "protocol", "power engineering education", "Software", "laboratory", "Protocols", "Laboratories", "substation automation laboratory", "Relays", "development"]}, {"title": "Electronics From the Bottom Up: Strategies for Teaching Nanoelectronics at the Undergraduate Level", "link": "https://ieeexplore.ieee.org/document/5439696/", "abstract": "Nanoelectronics is an emerging area of electrical and computer engineering that deals with the current-voltage behavior of atomic-scale electronic devices. As the trend toward ever smaller devices continues, there is a need to update traditional undergraduate curricula to introduce electrical engineers to the fundamentals of the field. These fundamentals encompass topics from quantum mechanics and condensed-matter physics, and they pose new teaching challenges in electronics education; specifically, unconventional ideas must be presented in a rapid and yet complete way so that engineering undergraduates can quickly yet satisfyingly absorb the key concepts, and then apply these concepts to emerging devices. This paper describes the strategies employed by the author in teaching the subject to large undergraduate classes at his institution. These strategies include the use of computer visualization, a careful introduction of quantum mechanics, and a constant demonstration of the relevance of theory by practical examples and calculations. The effectiveness of the approach is illustrated through survey results of the Universal Student Ratings of Instruction at the author's institution and by way of typical assignment and exam questions that demonstrate the level of sophistication that students can attain in what might otherwise be viewed as a purely mathematical and esoteric subject.", "authors": [{"name": "Mani Vaidyanathan", "affiliation": "Department of Electrical and Computer Engineering, University of Alberta, Edmonton, AB, Canada"}], "tags": ["computer aided instruction", "Education", "quantum theory", "computer visualization", "condensed-matter physics", "electronics from the bottom up", "Equations", "quantum mechanics", "nanoelectronics teaching", "further education", "Quantum mechanics", "Electronics education", "teaching strategies for electronics", "MATLAB", "electronic engineering education", "Mathematical model", "computer engineering", "solid-state electronics", "current-voltage behavior", "Materials", "electrical engineering", "engineering undergraduate", "emerging electronics", "Wave functions", "atomic-scale electronic device", "teaching", "nanoelectronics"]}, {"title": "A Study of Computing Undergraduates Undertaking a Systematic Literature Review", "link": "https://ieeexplore.ieee.org/document/5659500/", "abstract": "Teaching computing students about the importance of evidence and about the use of empirical methods for evaluating computing technologies can be difficult, especially within dual honors undergraduate degree programs. The aims of this study were to explore the effectiveness of second-year undergraduate computing students in carrying out a systematic literature review and to identify the elements of the process that the students found most difficult. A multicase case study of students carrying out an assignment to perform a systematic literature review (SLR) was undertaken. Students worked in groups and were studying across a range of computing programs. Data was collected from three sources: student grades, the comments made by the teaching staff on the submitted reports, and a debriefing questionnaire. All of the groups successfully completed the assignment. Results on which parts of the process were the most difficult were mixed, although much of the evidence suggests that the students found the conduct phase more problematic than the planning phase. It can be concluded that undergraduates can do SLRs, but the task is clearly quite challenging and time-consuming. SLRs are well suited to being undertaken by groups.", "authors": [{"name": "Pearl Brereton", "affiliation": "School of Computing and Mathematics, Keele University, Keele, UK"}], "tags": ["second-year undergraduate computing students", "Education", "computer science education", "evidence-based software engineering (EBSE)", "planning phase", "Planning", "systematic literature review (SLR)", "Book reviews", "evidence-based software engineering", "reviews", "further education", "Software engineering", "Systematics", "Case study", "software engineering", "Data mining", "computing education", "Protocols", "group projects", "teaching", "systematic literature review", "dual honors undergraduate degree programs", "conduct phase"]}]