[{"title": "The Design and Effect of a Scaffolded Concept Mapping Strategy on Learning Performance in an Undergraduate Database Course", "link": "https://ieeexplore.ieee.org/document/6327625/", "abstract": "This paper proposes a scaffolded concept mapping strategy, which considers a student's (high or low) prior knowledge, and provides flexible learning aids (scaffolding and fading) for reading and drawing a concept map. The goal is that the whole class should progress in synchronized fashion through this strategy, with each student achieving meaningful learning. The scaffolding is tailored to the student's needs, with various levels of support. The increasing demand for scaffolding, and its constant evolution, means that software aids are needed. The authors adopted a systematic instructional design, with associated software, to create a learning environment that supports the execution of the strategy. The paper also investigates whether this strategy improved student learning for 54 undergraduates in a database management system course. The results indicate that the students who used the strategy had better learning achievements than those who only experienced traditional lectures. Moreover, the implementation of the strategy received positive student feedback.", "authors": [{"name": "Hsuan-Hung Chen", "affiliation": "Graduate Institute of Communication Engineering, National Chung Cheng University, Chiayi, Taiwan"}, {"name": "Kim-Joan Chen", "affiliation": "Graduate Institute of Communication Engineering, National Chung Cheng University, Chiayi, Taiwan"}, {"name": "Yau-Jane Chen", "affiliation": "Graduate Institute of Curriculum and Instruction, National Chung Cheng University, Chiayi, Taiwan"}], "tags": ["Navigation", "computer science education", "learning performance", "Software", "Database systems", "synchronized fashion", "learning environment", "Education", "software aids", "undergraduate database course", "concept mapping", "database management systems", "educational courses", "constant evolution", "database systems", "scaffolding", "scaffolded concept mapping strategy", "Fading", "associated software", "Materials", "flexible learning aids", "database management system course", "computer aided instruction", "systematic instructional design", "Computer-aided instruction"]}, {"title": "A New Experiment-Based Way to Introduce Fourier Transform and Time Domain–Frequency Domain Duality", "link": "https://ieeexplore.ieee.org/document/6476041/", "abstract": "This paper describes a complex multistep problem exercise used in a problem-based learning (PBL) context to introduce the fundamentals of the Fourier transform (FT) and convey the concept of the time domain-frequency domain duality. This complex problem exercise (CPE) consists of obtaining the frequency response (network function) of an RC circuit from voltage measurements taken during the charge/discharge transient and is carried out in circuits, electronics, and electromagnetism laboratories. Although it is widely accepted that undergraduate students should be introduced to FT, this involves substantial and complex mathematics. In order to avoid this difficulty, the discrete Fourier transform (DFT) is used as an approximation to the FT because it is easier to use in a computational environment. The CPE uses a practical approach to concepts such as impulse response, sampling theorem, Nyquist frequency, aliasing, and uncertainty and causality principles; it is thought to be of pedagogical interest as an introduction to the FT. In particular, it could be of interest to instructors and undergraduate students taking courses in circuit theory, electromagnetic theory, linear systems, and digital signal processing in electrical engineering or similar degree programs.", "authors": [{"name": "Sergio Toledo-Redondo", "affiliation": "Research Center for Information Technology and Communications, (CITIC-UGR), University of Granada, Granada, Spain"}, {"name": "Jesús Fornieles-Callejón", "affiliation": "Research Center for Information Technology and Communications, (CITIC-UGR), University of Granada, Granada, Spain"}, {"name": "Alfonso Salinas", "affiliation": "Research Center for Information Technology and Communications, (CITIC-UGR), University of Granada, Granada, Spain"}, {"name": "Juan A. Morente", "affiliation": "Research Center for Information Technology and Communications, (CITIC-UGR), University of Granada, Granada, Spain"}, {"name": "Jorge Portí", "affiliation": "Research Center for Information Technology and Communications, (CITIC-UGR), University of Granada, Granada, Spain"}, {"name": "Antonio Méndez", "affiliation": "Research Center for Information Technology and Communications, (CITIC-UGR), University of Granada, Granada, Spain"}], "tags": ["transient response", "electrical engineering education", "Capacitors", "circuit theory", "CPE", "complex mathematics", "causality principles", "frequency response", "uncertainty principles", "problem-based learning", "Frequency response", "time-domain analysis", "linear systems", "Voltage measurement", "voltage measurements", "complex problem exercise", "impulse response", "aliasing", "network function", "discrete Fourier transform", "frequency-domain analysis", "RC circuit", "student experiments", "substantial mathematics", "Fourier transform (FT)", "PBL", "electromagnetic theory", "time domain-frequency domain duality", "DFT", "Discharges (electric)", "electrical engineering", "Discrete Fourier transforms", "complex multistep problem", "charge-discharge transient", "digital signal processing", "Time-frequency analysis", "undergraduate students", "Laboratories", "computational environment", "Nyquist frequency", "discrete Fourier transforms", "sampling theorem"]}, {"title": "SyRoTek—Distance Teaching of Mobile Robotics", "link": "https://ieeexplore.ieee.org/document/6341862/", "abstract": "E-learning is a modern and effective approach for training in various areas and at different levels of education. This paper gives an overview of SyRoTek, an e-learning platform for mobile robotics, artificial intelligence, control engineering, and related domains. SyRoTek provides remote access to a set of fully autonomous mobile robots placed in a restricted area with dynamically reconfigurable obstacles, which enables solving a huge variety of problems. A user is able to control the robots in real time by their own developed algorithms as well as being able to analyze gathered data and observe activity of the robots by provided interfaces. The system is currently used for education at the Czech Technical University in Prague, Prague, Czech Republic, and at the University of Buenos Aires, Buenos, Aires, Argentina, and it is freely accessible to other institutions. In addition to the system overview, this paper presents the experience gained from the actual deployment of the system in teaching activities.", "authors": [{"name": "Jan Faigl", "affiliation": "Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague, Prague, Czech Republic"}, {"name": "Libor Preucil", "affiliation": "Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague, Prague, Czech Republic"}, {"name": "Jan Chudoba", "affiliation": "Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague, Prague, Czech Republic"}, {"name": "Karel Kosnar", "affiliation": "Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague, Prague, Czech Republic"}, {"name": "Miroslav Kulich", "affiliation": "Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague, Prague, Czech Republic"}, {"name": "Tomáš Krajnik", "affiliation": "Department of Cybernetics, Faculty of Electrical Engineering, Czech Technical University in Prague, Prague, Czech Republic"}], "tags": ["distance teaching", "Argentina", "Prague", "telerobotics", "computer based training", "teaching", "SyRoTek", "distance learning", "control engineering", "Czech Technical University", "data analysis", "user interfaces", "Educational institutions", "e-learning platform", "Educational technology", "mobile robots", "teaching activities", "robot programming", "control engineering computing", "University of Buenos Aires", "Robot kinematics", "dynamic reconfigurable obstacles", "artificial intelligence", "remote access", "autonomous mobile robotics", "human-robot interaction", "educational institutions", "Laboratories", "Cameras", "Robot sensing systems", "Czech Republic", "collision avoidance"]}, {"title": "Remote Control Laboratory Using EJS Applets and TwinCAT Programmable Logic Controllers", "link": "https://ieeexplore.ieee.org/document/6220875/", "abstract": "This paper presents a new methodology to develop remote laboratories for systems engineering and automation control courses, based on the combined use of TwinCAT, a laboratory Java server application, and Easy Java Simulations (EJS). The TwinCAT system is used to close the control loop for the selected plants by means of programmable logic controllers (PLCs) deployed in PCs with the TwinCAT run-time tool. EJS is used to develop the laboratory front-end applets that let teachers and students parametrize and observe the behavior of the PLCs from any computer. The laboratory Java server application establishes the connection between the EJS applets and the PLCs, fulfilling the TwinCAT connection requirements while ensuring an individualized access to each PLC. This paper also shows how the practical work in some undergraduate control courses at the Complutense University of Madrid, Spain, already uses the TwinCAT PLC + Java server + EJS applet strategy to provide real-time support to the controllers, remote individualized access to the experiments, and a user-friendly graphic controller interface for the students.", "authors": [{"name": "Luis de la Torre", "affiliation": "Computer Science and Automatic Department, Spanish Open University, Madrid, Spain"}, {"name": "José A. Lopez-Orozco", "affiliation": "Computer Architecture and Automatic Department, Universite Complutense de Madrid, Madrid, Spain"}, {"name": "Jesus M. de la Cruz", "affiliation": "Computer Architecture and Automatic Department, Universite Complutense de Madrid, Madrid, Spain"}, {"name": "Eva Besada-Portas", "affiliation": "Computer Architecture and Automatic Department, Universite Complutense de Madrid, Madrid, Spain"}], "tags": ["virtual instrumentation", "Spain", "Control education", "PLC", "user-friendly graphic controller interface", "undergraduate control courses", "laboratory front-end applet development", "remote laboratories", "Servers", "Easy Java Simulations", "TwinCAT Programmable Logic Controllers", "programmable controllers", "TwinCAT run-time tool", "laboratory Java server application", "Remote laboratories", "EJS applet strategy", "human computer interaction", "further education", "Graphical user interfaces", "educational courses", "automation control courses", "real-time controllers", "graphical user interfaces", "Java", "Complutense University of Madrid", "control engineering education", "digital simulation", "systems engineering courses", "Libraries", "control engineering computing", "Real time systems", "TwinCAT connection requirements", "remote control laboratory", "easy Java simulations", "telecontrol", "educational institutions", "industrial programmable logic controllers (PLCs)", "control loop", "computer aided instruction"]}, {"title": "A Successful Experience of ABET Accreditation of an Electrical Engineering Program", "link": "https://ieeexplore.ieee.org/document/6243237/", "abstract": "The procedures followed and the various factors that led to the ABET accreditation of the College of Engineering, Qassim University, Buraidah, Saudi Arabia, are illustrated and evaluated for the benefit of other similar colleges. Taking the Electrical Engineering (EE) program as an example, this paper describes the procedures followed to implement a system that ensured a high-quality EE program and eventually led to ABET accreditation. It explains the preparations undertaken by the Department of Electrical Engineering in establishing and evaluating objectives and outcomes for the EE program through a well-designed continuous improvement process and applying these evaluation results to develop the program.", "authors": [{"name": "Mohammed A. Abdel-halim", "affiliation": "College of Engineering, Qassim University, Buraidah, Al Qassim, Saudi Arabia"}, {"name": "Sulaiman A. Al-Yahya", "affiliation": "College of Engineering, Qassim University, Buraidah, Al Qassim, Saudi Arabia"}], "tags": ["Accreditation", "Academic accreditation", "Electrical engineering", "electrical engineering education", "educational objectives", "high-quality EE program", "program outcomes", "Educational institutions", "continuous improvement process", "self-assessment", "Educational programs", "electrical engineering program", "Qassim University", "Knowledge engineering", "Saudi Arabia", "quality assurance", "Quality assurance", "College of Engineering", "ABET accreditation", "educational institutions", "Department of Electrical Engineering", "Buraidah"]}, {"title": "Modification of the Perrine–Baum Diagram to Improve the Calculation of High-Voltage Transmission Lines", "link": "https://ieeexplore.ieee.org/document/6320640/", "abstract": "Throughout the history of electrical engineering education, vector and phasor diagrams have been used as a fundamental learning tool. Currently, computational power has replaced these with long data lists, the result of solving equation systems with numerical methods. In this sense, diagrams have been relegated to an academic background topic that, although theoretically explained, is not used in practice. This fact may work against the understanding of the complex behavior of electrical power systems by students. This paper proposes a modification of the classic Perrine-Baum diagram construction to allow both a more practical representation and a better understanding of the behavior of a high-voltage transmission line under different load levels. A tool capable of evaluating the moment in time when demand exceeds the line's carrying capacity is also introduced. In addition, the impact of this tool on the learning process is evaluated.", "authors": [{"name": "Martí Rosas-Casals", "affiliation": "Department of Thermal Machinery, Universitat Politècnica de Catalunya, Terrassa, Spain"}, {"name": "Ricard Horta-Bernús", "affiliation": "Department of Electrical Engineering, Universitat Politècnica de Catalunya, Terrassa, Spain"}], "tags": ["Power transmission lines", "electrical power systems", "high-voltage transmission lines calculation", "Equations", "Perrine-Baum diagram construction", "electrical engineering education", "Vectors", "Reactive power", "learning process", "Mathematical model", "computational power", "Forecasting", "phasor diagrams", "Biological system modeling", "forecasting demand", "power transmission lines", "Perrine-Baum diagram modification", "learning tool", "Predictive models", "students", "transmission line", "load forecasting", "phasor diagram", "vector diagram", "high-voltage", "vector diagrams"]}, {"title": "The Robotic Decathlon: Project-Based Learning Labs and Curriculum Design for an Introductory Robotics Course", "link": "https://ieeexplore.ieee.org/document/6316106/", "abstract": "This paper presents a series of novel project-based learning labs for an introductory robotics course that are developed into a semester-long Robotic Decathlon. The last three events of the Robotic Decathlon are used as three final one-week-long project tasks; these replace a previous course project that was a semester-long robotics competition. The course assessment shows that this new approach enhances student learning with respect to the standard lecture/test style of teaching, and that the three shorter final project tasks make the course easier to manage and more enjoyable for the students.", "authors": [{"name": "David J. Cappelleri", "affiliation": "Department of Mechanical Engineering, Stevens Institute of Technology, Hoboken, NJ, USA"}, {"name": "Nikolaos Vitoroulis", "affiliation": "Department of Mechanical Engineering, Stevens Institute of Technology, Hoboken, NJ, USA"}], "tags": ["educational robots", "semester-long robotics competition", "teaching", "project-based learning labs", "course project", "robotic decathlon", "robots", "introductory robotics course", "educational technology", "Educational robots", "curriculum design", "educational courses", "control engineering education", "standard lecture/test style", "Mobile robots", "Robot kinematics", "Educational courses", "Manipulators", "course assessment", "Robot sensing systems"]}, {"title": "Experiences in Developing an Experimental Robotics Course Program for Undergraduate Education", "link": "https://ieeexplore.ieee.org/document/6297492/", "abstract": "An interdisciplinary undergraduate-level robotics course offers students the chance to integrate their engineering knowledge learned throughout their college years by building a robotic system. Robotics is thus a core course in system and control-related engineering education. This paper summarizes the experience of developing robotics courses presented in the literature and shares the author's experiences through many years of teaching and developing robotics courses with other educators in the Department of Mechatronics, Chungnam National University (CNU), Daejeon, Korea. First, the CNU robotics course described here has classroom and laboratory sections. In class, students learn the theories behind robotics and practice them by performing simulation studies. In parallel, students perform robotics exercises in the laboratory. Second, the lab exercises are focused on hands-on experiments on robot systems; these include an experimental kit, LEGO robots, humanoid robots, industrial robots, and home service robots. Third, competition-based learning is explored by assigning a class project to develop a boxing robot, which covers both manipulation and mobility. Finally, the course introduces robotics-associated outreach activities. The analysis of several years of student evaluation is presented.", "authors": [{"name": "Seul Jung", "affiliation": "Department of Mechatronics Engineering, Chungnam National University, Daejeon, South Korea"}], "tags": ["computer science education", "robotics theory", "Education", "boxing robot", "competition-based learning", "industrial robots", "robotics experiments", "Service robots", "robotics-associated outreach activities", "Educational robots", "humanoid robots", "educational courses", "home service robot", "classroom section", "undergraduate education", "laboratory section", "experimental robotics course program", "control engineering education", "hands-on experience", "LEGO robot", "Mobile robots", "Robot kinematics", "Competition-based learning", "control-related engineering education", "interdisciplinary undergraduate-level robotics course", "industrial robot", "Manipulators", "outreach activities", "humanoid robot", "computer aided instruction"]}, {"title": "Microcontroller-Based Robotics and SCADA Experiments", "link": "https://ieeexplore.ieee.org/document/6479339/", "abstract": "The recently rapid increase in research and development in automation technology has led to a gap between education and industry. Although developing countries need to keep in touch with the latest developments, that poses some difficulties for industrial automation education, such as cost, lack of student motivation, and insufficient laboratory infrastructure. Low-cost experimental setups may overcome many of these challenges. This paper describes how supervisory control and data acquisition (SCADA) and robotics experiments in control and automation education can be conducted at reasonable cost. These setups consist of a fluid tank, a Cartesian robot with a three-axis robot arm, and serial, parallel, USB, and TCP/IP communication ports. These experiments were developed and used in control and automation education in the Automation Laboratory of Ege Technical and Business College, Ege University, İzmir, Turkey. The presented experiments were also quantitatively evaluated using the one-way ANOVA test on the exam results, and qualitatively evaluated by a discussion session and survey. The results indicated that student performance improved when microcontroller-based experimental setups were used, and that increasing the complexity of experiments also helped improve students' academic success.", "authors": [{"name": "Yalçin İşler", "affiliation": "Department of Biomedical Engineering, İzmir Katip Çelebi University, İzmir, Turkey"}, {"name": "Savaş Şahin", "affiliation": "Department of Electrical and Electronics Engineering, İzmir Katip Çelebi University, İzmir, Turkey"}], "tags": ["manipulators", "SCADA systems", "TCP/IP communication ports", "Automation", "Software", "statistical analysis", "three-axis robot arm", "microcontroller-based robotics", "Izmir", "one-way ANOVA test", "Control engineering education", "robots", "Ege University", "Ports (Computers)", "supervisory control and data acquisition (SCADA) systems", "microcontrollers", "Cartesian robot", "supervisory control and data acquisition", "Instruments", "serial USB", "Automation Laboratory of Ege Technical and Business College", "SCADA experiments", "control engineering education", "control education", "Turkey", "industrial automation education", "Robots", "analysis of variance", "parallel USB", "Universal Serial Bus", "digital control", "fluid tank"]}, {"title": "White-Box or Black-Box Decision Tree Algorithms: Which to Use in Education?", "link": "https://ieeexplore.ieee.org/document/6329380/", "abstract": "University students are usually taught data mining through black-box data mining algorithms, which hide the algorithm's details from the user and optionally allow parameter adjustment. This minimizes the effort required to use these algorithms. On the other hand, white-box algorithms reveal the algorithm's structure, allowing users to assemble algorithms from algorithm building blocks. This paper provides a comparison between students' acceptance of both black-box and white-box decision tree algorithms. For these purposes, the technology acceptance model is used. The model is extended with perceived understanding and the influence it has on acceptance of decision tree algorithms. An experiment was conducted with 118 senior management students who were divided into two groups-one working with black-box, and the other with white-box algorithms-and their cognitive styles were analyzed. The results of how cognitive styles affect the perceived understanding of students when using decision tree algorithms with different levels of algorithm transparency are reported here.", "authors": [{"name": "Milan Vukićević", "affiliation": "Faculty of Organizational Sciences, University of Belgrade, Belgrade, Serbia"}, {"name": "Milija Suknović", "affiliation": "Faculty of Organizational Sciences, University of Belgrade, Belgrade, Serbia"}, {"name": "Boris Delibašić", "affiliation": "Faculty of Organizational Sciences, University of Belgrade, Belgrade, Serbia"}, {"name": "Miloš Jovanović", "affiliation": "Faculty of Organizational Sciences, University of Belgrade, Belgrade, Serbia"}], "tags": ["computer science education", "cognition", "cognitive styles", "Decision trees", "algorithm building blocks", "algorithm transparency", "Algorithms", "white-box decision tree algorithm", "senior management students", "social aspects of automation", "cognitive style analysis", "Algorithm design and analysis", "technology acceptance model", "decision support systems", "Educational institutions", "further education", "open-source software", "student experiments", "data mining", "Decision making", "Data mining", "black-box data mining algorithms", "computer aided instruction", "Decision support systems", "black-box decision tree algorithm", "decision trees"]}, {"title": "Using Intelligent Tutors to Teach Students How APIs Are Used for Software Engineering in Practice", "link": "https://ieeexplore.ieee.org/document/6422340/", "abstract": "Computer science courses typically incorporate integrated training in software engineering, which includes learning how to reuse existing code libraries in new programs. This commonly presents a need to use the libraries' application programming interfaces (APIs) during project-based learning activities. The students learn these APIs with little support from the instructor. Instead, they primarily learn from whatever code examples they find on the Web-a scattershot approach that is slow, frustrating, and sometimes fruitless. Preliminary work investigated an improved approach that provides students with intelligent API tutors. This interactive educational content walks students through code examples selectively harvested from the Web. This approach increased students' knowledge of API method names, but a key pedagogical challenge remained: Students still lacked an understanding of common problems and surprises that they might encounter when using APIs in practice. Perhaps even more crucially, the prior statistical study provided no information about how students would perceive and accept the intelligent tutor approach, when given a choice. Therefore, this paper presents an enhanced approach that augments intelligent tutors with selected information from online FAQs and online open-source code, thereby providing more explanation and context about how to use APIs in practice. A qualitative study assessed student perceptions of the system's usability as well as suggestions for improvement, revealing that 100% of students considered the approach to be useful. A key implication is that providing information from online FAQs, related articles, and open-source code could facilitate computer science students' learning how to use APIs.", "authors": [{"name": "Bharatwaj Appasamy", "affiliation": "School of Electrical Engineering and Computer Science, Oregon State University, Corvallis, OR, USA"}, {"name": "Christopher Scaffidi", "affiliation": "School of Electrical Engineering and Computer Science, Oregon State University, Corvallis, OR, USA"}, {"name": "Vasanth Krishnamoorthy", "affiliation": "Oregon State University, Corvallis, OR, US"}], "tags": ["computer science education", "Industries", "online FAQ", "statistical analysis", "system usability", "application program interfaces", "teaching", "computer science student learning", "Web", "public domain software", "intelligent tutors", "Computer science", "application programming interfaces", "educational courses", "software libraries", "Open source software", "Application programming interface (API)", "software engineering", "Libraries", "Software engineering", "computer science courses", "electronic learning", "online open source code", "Training", "Internet", "project-based learning activities", "API tutors", "interactive educational content", "instructor", "computer aided instruction"]}, {"title": "From Companies to Universities: Application of R&D&I Concepts in Higher Education Teaching", "link": "https://ieeexplore.ieee.org/document/6328296/", "abstract": "As a result of their involvement in several research and development and innovation (R&D&I) projects developed in various companies, the authors acquired knowledge of two basic concepts: quality and innovation. The application of these concepts in the teaching-learning process can help teachers to incorporate informal changes in the curriculum to provide for continuous improvement. This paper presents a simple methodology to apply quality and innovation concepts and tools in the daily teaching activity. In order to show the ease of use, as well as the efficiency and effectiveness of this methodology, the experience of applying it in an engineering course over nine years, the actions undertaken, the results obtained, and the lessons learned are described here. The methodology incorporates reflection, innovation, and decision taking based on objective data. Contact with the companies involved has enabled the teachers to learn continuously and to enhance their motivation when working with students. The methodology applied and the example described in this paper can be a starting point for other teachers interested in improving the quality of their teaching.", "authors": [{"name": "Raúl Igual", "affiliation": "R&D&I EduQTech Group, Electronics Engineering Department, Teruel Polytechnic, University of Zaragoza, Teruel, Spain"}, {"name": "Inmaculada Plaza", "affiliation": "R&D&I EduQTech Group, Electronics Engineering Department, Teruel Polytechnic, University of Zaragoza, Teruel, Spain"}, {"name": "Carlos Medrano", "affiliation": "R&D&I EduQTech Group, Electronics Engineering Department, Teruel Polytechnic, University of Zaragoza, Teruel, Spain"}, {"name": "Marian Ángeles Rubio", "affiliation": "R&D&I EduQTech Group, Faculty of Social Sciences and Humanities, University of Zaragoza, Teruel, Spain"}], "tags": ["organisational aspects", "higher education", "Software", "engineering education", "Companies", "teaching", "Europe", "reflection concept", "continuous improvement", "teaching quality improvement", "Technological innovation", "innovation management", "objective data", "decision taking", "innovation", "Educational institutions", "further education", "educational courses", "innovation concept", "open-source software", "quality", "R&D&I concepts", "teaching-learning process", "quality oncept", "Materials", "motivation enhancement", "Continuous improvement", "engineering", "decision making", "research-and-development-and-innovation projects", "research and development", "higher education teaching", "computer aided instruction", "engineering course", "informal changes"]}, {"title": "Using Multi-Robot Systems for Engineering Education: Teaching and Outreach With Large Numbers of an Advanced, Low-Cost Robot", "link": "https://ieeexplore.ieee.org/document/6363493/", "abstract": "This paper describes the experiences of using an advanced, low-cost robot in science, technology, engineering, and mathematics (STEM) education. It presents three innovations: It is a powerful, cheap, robust, and small advanced personal robot; it forms the foundation of a problem-based learning curriculum; and it enables a novel multi-robot curriculum while fostering collaborative team work on assignments. The robot design has many features specific to educators: It is advanced enough for academic research, has a broad feature set to support a wide range of curricula, and is inexpensive enough to be an effective outreach tool. The low cost allows each student to have their own robot for the semester, so they can work on activities outside the classroom. This robot was used in three different classes in which it was the foundation for an innovative problem-based learning curriculum. In particular, the robot has specialized sensors and a communications system that supports novel multi-robot curricula, which encourage student interaction in new ways. The results are promising; the robot was a big success in graduate, undergraduate, and outreach activities. Finally, student assessments indicate a greater interest and understanding of engineering and other STEM majors, and class evaluations were consistently above average.", "authors": [{"name": "Meagan John", "affiliation": "Computer Science Department, Rice University, Houston, TX, USA"}, {"name": "Andrew J. Lynch", "affiliation": "Computer Science Department, Rice University, Houston, TX, USA"}, {"name": "Quillan Kaseman", "affiliation": "Computer Science Department, Rice University, Houston, TX, USA"}, {"name": "Joshua Rykowski", "affiliation": "Computer ScienceDepartment, United States Military Academy, West Point, NY, USA"}, {"name": "James McLurkin", "affiliation": "Computer Science Department, Rice University, Houston, TX, USA"}], "tags": ["collaborative team work", "educational robots", "STEM majors", "engineering education", "STEM education", "Education", "teaching", "robot design", "academic research", "Engineering", "student interaction", "problem-based learning", "robotics education", "further education", "Educational robots", "advanced personal robot", "educational courses", "science-technology-engineering and mathematics education", "control engineering education", "outreach tool", "multi-robot systems", "Robot kinematics", "student assessments", "low-cost robot", "Hardware", "multirobot curricula", "multirobot systems", "outreach", "multirobot curriculum", "undergraduate activity", "problem-based learning curriculum", "outreach activity", "Robot sensing systems"]}, {"title": "WiFiSiM: An Educational Tool for the Study and Design of Wireless Networks", "link": "https://ieeexplore.ieee.org/document/6213162/", "abstract": "A new educational simulation tool designed for the generic study of wireless networks, the Wireless Fidelity Simulator (WiFiSim), is presented in this paper. The goal of this work was to create and implement a didactic tool to improve the teaching and learning of computer networks by means of two complementary strategies: simulating the behavior and performance of communication protocols based on the IEEE 802.11 standard widely studied in networking courses, and providing with improved scope and realism for students engaged in wireless network design and modeling. The educational interest of this tool lies in the realism of the simulation, which provides a high level of interactivity and visual information through a highly configurable graphic user interface, as well as highly intuitive and easy-to-interpret graphic results. This educational tool was tested by computer networking teachers, students, and professionals. The experience demonstrated the effectiveness of the software and resulted in a significant improvement in the students' practical work, leading to enhanced learning and consolidation of theoretical concepts.", "authors": [{"name": "Tomás de J. Mateo Sanguino", "affiliation": "Dep. Ingeniería Electrónica, University of Huelva (ETSI La Rábida), Palos de La Frontera, Huelva, Spain"}, {"name": "César Serrano López", "affiliation": "Dep. Ingeniería Electrónica, University of Huelva (ETSI La Rábida), Palos de La Frontera, Huelva, Spain"}, {"name": "Francisco A. Márquez Hernández", "affiliation": "Dep. Technologies of Information, University of Huelva (ETSI La Rábida), Palos de La Frontera, Huelva, Spain"}], "tags": ["Wireless LAN", "Computational modeling", "Design", "modeling", "engineering education", "IEEE 802.11 standard", "Protocols", "communication protocols", "virtual instrument", "educational tool", "wireless networks", "WiFiSiM", "wireless fidelity simulator", "telecommunication standards", "wireless LAN", "Wireless networks", "wireless network", "protocols", "Network topology", "didactic tool", "Topology"]}, {"title": "Teaching HW/SW Co-Design With a Public Key Cryptography Application", "link": "https://ieeexplore.ieee.org/document/6508919/", "abstract": "This paper describes a lab session-based course on hardware/software (HW/SW) co-design. Real problems often need to combine the speed of an HW solution with the flexibility of an SW solution. The goals of this course are to show that there are many alternative solutions in the design space and to teach the fundamental concepts of HW/SW co-design. The sample application for the course project is a basic public key (RSA) application. This application is attractive for pedagogic purposes because its complex arithmetic and large word lengths make it difficult to realize in SW on an embedded microcontroller. However, the alternative of a pure application-specific integrated circuit (ASIC) application is also not a satisfactory solution, as this lacks the flexibility to support multiple public key applications. The project follows a stepwise approach, with assignments that build on each other. Students are required to make their own decisions as to the partitioning between HW and SW, the interface design, and the optimizations goals. Besides imparting hard skills in HW design and embedded SW design, the course inculcates several soft skills-in particular, decision making, presentation skills, teamwork, and design creativity-generally overlooked in engineering.", "authors": [{"name": "Wim Dehaene", "affiliation": "KU Leuven, ESAT/MICAS and iMinds, Leuven-Heverlee, Belgium"}, {"name": "Markus Ullrich", "affiliation": "ESAT/SCD-COSIC and iMinds, KU Leuven, Leuven-Heverlee, Belgium"}, {"name": "Ingrid Verbauwhede", "affiliation": "ESAT/SCD-COSIC and iMinds, KU Leuven, Leuven-Heverlee, Belgium"}, {"name": "Leif Uhsadel", "affiliation": "ESAT/SCD-COSIC and iMinds, KU Leuven, Leuven-Heverlee, Belgium"}, {"name": "Josep Balasch", "affiliation": "ESAT/SCD-COSIC and iMinds, KU Leuven, Leuven-Heverlee, Belgium"}, {"name": "Duško Karaklajić", "affiliation": "ESAT/SCD-COSIC and iMinds, KU Leuven, Leuven-Heverlee, Belgium"}, {"name": "Amitabh Das", "affiliation": "ESAT/SCD-COSIC and iMinds, KU Leuven, Leuven-Heverlee, Belgium"}], "tags": ["Public key cryptography", "Software", "design creativity", "ASIC application", "embedded microcontroller", "Education", "hardware/software (HW/SW) co-design", "teaching", "Optimization", "HW-SW codesign teaching", "Algorithm design and analysis", "application specific integrated circuits", "word lengths", "educational courses", "teamwork", "pedagogic purposes", "public key cryptography", "Microcontrollers", "presentation skills", "Montgomery", "8051 microcontroller", "application-specific integrated circuit", "RSA", "public key cryptography application", "Hardware", "decision making", "stepwise approach", "lab session-based course", "hardware-software codesign", "microcontrollers"]}, {"title": "An Organic Electronics Laboratory Course for Graduate Students in Electrical Engineering", "link": "https://ieeexplore.ieee.org/document/6320631/", "abstract": "This paper presents an organic electronics laboratory course on an Electrical Engineering Master's program. The course is composed of five laboratory exercises, with supporting lectures. Each exercise takes from one to four lab sessions to complete and targets some important aspect of organic electronics: organic electronic materials and substrates, preparation of the materials for fabrication, novel flexible devices, inkjet fabrication technology, and organic electronic devices as an alternative to conventional electronic ones. Together, they give students a comprehensive insight into the field of organic electronics as well as its possibilities and applications. The students' academic results were excellent, and an anonymous end-of term questionnaire revealed that they were very satisfied with this lab-based course.", "authors": [{"name": "Nikola Bednar", "affiliation": "Faculty of Technical Sciences, University of Novi Sad, Novi Sad, Serbia"}, {"name": "Goran M. Stojanović", "affiliation": "Faculty of Technical Sciences, University of Novi Sad, Novi Sad, Serbia"}], "tags": ["organic electronic materials", "electrical engineering education", "Education", "inkjet", "Electrical Engineering Master's program", "laboratory exercises", "end of term questionnaire", "Organic electronics", "Fabrication", "Radiofrequency identification", "novel flexible devices", "organic light emitting diode (OLED)", "educational courses", "lab sessions", "Substrates", "radio frequency identification (RFID)", "inkjet fabrication technology", "materials fabrication preparation", "organic electronics laboratory course", "organic electronic substrates", "Laboratories", "organic electronics", "Organic light emitting diodes", "organic electronic devices"]}, {"title": "Intelligent Computer-Aided Instruction Modeling and a Method to Optimize Study Strategies for Parallel Robot Instruction", "link": "https://ieeexplore.ieee.org/document/6280605/", "abstract": "Parallel robots are known for their strong bearing capability and high kinematic accuracy, but they are relatively difficult to design and to teach. This paper addresses this difficulty by presenting an intelligent computer-aided instruction (ICAI) modeling method for parallel robot instruction. The paper analyzes, with reference to their incoming educational profile, Mechatronics students' cognitive processes while acquiring knowledge of parallel robots; it also compares the educational benefits of various methods of teaching this topic. The ICAI model for teaching parallel robots is rooted in machine learning, using information fusion methods based on an artificial neural network (ANN). Two terms of using the ICAI model have validated the method's effectiveness in teaching parallel robots, providing a rational study strategy and improving the students' learning process.", "authors": [{"name": "Shi-Ming Ji", "affiliation": "Key Laboratory of E&M, Ministry of Education, Hangzhou, Zhejiang, China"}, {"name": "Da-Peng Tan", "affiliation": "Zhejiang University of Technology, Hangzhou, Zhejiang, CN"}, {"name": "Ming-Sheng Jin", "affiliation": "Key Laboratory of E&M, Ministry of Education, Hangzhou, Zhejiang, China"}], "tags": ["cognition", "study strategy optimization", "Computational modeling", "parallel robot instruction", "ANN", "artificial neural network", "teaching", "information fusion methods", "Optimization", "Intelligent computer-aided instruction (ICAI)", "student learning process", "Computer aided instruction", "educational profile", "kinematic accuracy", "neural nets", "Educational robots", "teaching method", "bearing capability", "control engineering education", "learning (artificial intelligence)", "intelligent computer-aided instruction modeling", "ICAI model", "mechatronics", "knowledge acquisition", "modeling method", "parallel robots", "robot kinematics", "mechatronic student cognitive process", "Parallel robots", "machine learning", "computer aided instruction", "optimisation"]}, {"title": "A Web-Based Educational Interface for an Analog Communication Course Based on MATLAB Builder NE With WebFigures", "link": "https://ieeexplore.ieee.org/document/6403898/", "abstract": "Experimental experience has a significant effect on students' engineering education and improves their practical skills. However, experiments are high-cost, requiring laboratory space, experimental sets, and so on. Computer-assisted learning (CAL) can provide a similar educational effect. Web-based interfaces, a type of CAL often used in distance education, are therefore economical solutions in that they require neither laboratories nor experimental equipment. In particular, they facilitate students' understanding of the practical applications of their engineering education. This paper proposes the Web-based simulation of analog modulation techniques using MATLAB. To this end, a Web-based educational interface, called AnalogWeb, was designed and implemented as part of an analog communication course. AnalogWeb was developed using MATLAB Builder for NE with WebFigures and ASP.NET platform; it can be easily accessed by users/students using only a Web browser and requires no installation of MATLAB or any special program on the server or the clients. AnalogWeb is a user-friendly educational interface providing advanced visualization tools such as zoom, moving graphics, and three-dimensional imaging. AnalogWeb was validated, and its educational contributions tested, with 60 undergraduate students at Sakarya University, Turkey; the results are presented here.", "authors": [{"name": "Sezgin Kaçar", "affiliation": "Department of Electrical-Electronic Engineering, Technology Faculty, Sakarya University, Sakarya, Turkey"}, {"name": "Cüneyt Bayılmış", "affiliation": "Department of Computer Engineering, Technology Faculty, Sakarya University, Sakarya, Turkey"}], "tags": ["analog modulation techniques", "Frequency domain analysis", "Amplitude modulation", "Web services", "AnalogWeb", "three-dimensional imaging", "economical solutions", "MATLAB builder NE", "distance learning", "MATLAB", "analog communication course", "communication engineering education", "Visualization", "ASP.NET platform", "modulation", "CAL", "Web-based educational interface", "computer-assisted learning", "Analog communication", "digital simulation", "Turkey", "Sakarya University", "Frequency modulation", "Engineering education", "computer-assisted learning (CAL)", "MATLAB Builder for NE and WebFigures", "Web-based simulation", "telecommunication engineering education", "educational institutions", "student engineering education", "WebFigures", "computer aided instruction"]}, {"title": "A Behavior-Based Approach for Educational Robotics Activities", "link": "https://ieeexplore.ieee.org/document/6341861/", "abstract": "Educational robotics proposes the use of robots as a teaching resource that enables inexperienced students to approach topics in fields unrelated to robotics. In recent years, these activities have grown substantially in elementary and secondary school classrooms and also in outreach experiences to interest students in science, technology, engineering, and math (STEM) undergraduate programs. A key problem in educational robotics is providing a satisfactory, adequate, easy-to-use interface between an inexpert public and the robots. This paper presents a behavior-based application for programming robots and the design of robotic-centered courses and other outreach activities. Evaluation data show that over 90% of students find it easy to use. These activities are part of a comprehensive outreach program conducted by the Exact and Natural Science Faculty of the University of Buenos Aires, Argentina (FCEN-UBA). Statistical data show that since 2009 over 35% of new students at the FCEN-UBA have participated in some outreach activity, suggesting their significant impact on student enrollment in STEM-related programs.", "authors": [{"name": "Carlos Di Pietro", "affiliation": "Departmento de Computación, Facultad de Ciencias Exactas y Naturales, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Pablo De Cristoforis", "affiliation": "Departmento de Computación, Facultad de Ciencias Exactas y Naturales, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Facundo Pessacg", "affiliation": "Departmento de Computación, Facultad de Ciencias Exactas y Naturales, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Thomas Fischer", "affiliation": "Departmento de Computación, Facultad de Ciencias Exactas y Naturales, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Matías Nitsche", "affiliation": "Departmento de Computación, Facultad de Ciencias Exactas y Naturales, Universidad de Buenos Aires, Buenos Aires, Argentina"}, {"name": "Sol Pedre", "affiliation": "Departmento de Computación, Facultad de Ciencias Exactas y Naturales, Universidad de Buenos Aires, Buenos Aires, Argentina"}], "tags": ["computer science education", "STEM undergraduate program", "science-technology-engineering-and-math outreach", "Educational institutions", "robotic-centered courses", "Educational robots", "easy-to-use interface", "educational courses", "STEM outreach", "educational robotics", "teaching resource", "behavior-based approach", "mobile robots", "control engineering education", "robot programming", "Robot sensing systems", "robots programming interface", "Behavior-based robotics", "Programming profession", "computer aided instruction"]}, {"title": "A Remote Laboratory as an Innovative Educational Tool for Practicing Control Engineering Concepts", "link": "https://ieeexplore.ieee.org/document/6484200/", "abstract": "This paper presents the development, structure, implementation, and some applications of a remote laboratory for teaching automatic control concepts to engineering students. There are two applications: formation control of mobile robots and a ball-plate system. In teaching control engineering, there are two main approaches to control design: model-based control and non-model-based control. Students are given insight into: 1) for model-based control: identification of real processes (i.e., dealing with noise, choosing the sampling time, observing nonlinear effects at startup, pairing input-output variables); and 2) for non-model-based control: the advantages and disadvantages of auto-tuning techniques. The paper concludes by presenting an evaluation of these remote labs and discussing the advantages of using them as complementary tools for teaching control engineering at the Bachelor's and Master's level.", "authors": [{"name": "Stefana M. Cristescu", "affiliation": "Department of Electrical energy, Systems and Automation, Ghent University, Gent-Zwijnaarde, Belgium"}, {"name": "Clara M. Ionescu", "affiliation": "Department of Electrical energy, Systems and Automation, Ghent University, Gent-Zwijnaarde, Belgium"}, {"name": "Sebastin Dormido", "affiliation": "Department of Informatics and Automation, Universidad Nacional de Educación a Distancia, Madrid, Spain"}, {"name": "Robin De Keyser", "affiliation": "Department of Electrical energy, Systems and Automation, Ghent University, Gent-Zwijnaarde, Belgium"}, {"name": "Ernesto Fabregas", "affiliation": "Department of Informatics and Automation, Universidad Nacional de Educación a Distancia, Madrid, Spain"}], "tags": ["remote laboratory", "engineering students", "auto-tuning techniques", "control engineering concepts", "Servers", "Control engineering", "innovative educational tool", "teaching", "Remote laboratories", "ball-plate system", "control engineering", "Auto-tuners", "Educational institutions", "control design", "nonmodel-based control", "identification", "real processes identification", "mobile robots", "control engineering education", "automatic control concepts teaching", "control system synthesis", "nonlinear control systems", "proportional-integral-derivative (PID) control", "three-term control", "Robots", "formation control", "ball and plate", "education"]}, {"title": "Physical Student–Robot Interaction With the ETHZ Haptic Paddle", "link": "https://ieeexplore.ieee.org/document/6338310/", "abstract": "Haptic paddles-low-cost one-degree-of-freedom force feedback devices-have been used with great success at several universities throughout the US to teach the basic concepts of dynamic systems and physical human-robot interaction (pHRI) to students. The ETHZ haptic paddle was developed for a new pHRI course offered in the undergraduate Mechatronics Focus track of the Mechanical Engineering curriculum at ETH Zurich, Switzerland. Twenty students engaged in this 2-h weekly lecture over the 14 weeks of the Autumn 2011 semester, complemented by a weekly 2-h laboratory session with the ETHZ haptic paddle. In pairs, students worked through three common sets of experiments before embarking on a specialization project that investigated one of several advanced topics such as impedance control with force feedback, admittance control, the effect of velocity estimation on stability, or electromyographic control. For these projects, students received additional hardware, including force sensors, electrooptical encoders or high-performance data acquisition cards. The learning objectives were developed in the context of an accompanying faculty development program at ETH Zurich; a set of interactive sequences and the oral exam were explicitly aligned to these learning objectives. The outcomes of the specialization project presentations and oral exams, and a student evaluation of the course, demonstrated that the ETHZ haptic paddle is a valuable tool that allows students to quite literally grasp abstract principles such as mechanical impedance, passivity, and human factors and helps students create a tangible link between theory and practice in the highly interdisciplinary field of pHRI.", "authors": [{"name": "Werner L. Popp", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}, {"name": "Roger Gassert", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}, {"name": "Jean-Claude Metzger", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}, {"name": "Kaspar Leuenberger", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}, {"name": "Olivier Lambercy", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}, {"name": "Raphael Zimmermann", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}, {"name": "Bogdan Vigaru", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}, {"name": "Michael R. Tucker", "affiliation": "Department of Health Sciences and Technology, ETH Zurich, Zurich, Switzerland"}], "tags": ["haptic interfaces", "ETHZ haptic paddle", "velocity control", "pHRI course", "passivity", "low-cost one-degree-of-freedom force feedback device", "electrooptical encoder", "force sensor", "human factor", "hands-on laboratory", "haptics", "teaching", "physical human-robot interaction", "specialization project presentation", "force feedback", "hardware", "physical student-robot interaction", "mechanical engineering", "interactive sequence", "undergraduate mechatronics focus track", "dynamic system", "Force feedback", "electromyographic control", "educational courses", "student evaluation", "Data acquisition", "data acquisition", "impedance control", "control engineering education", "stability", "performance metrics", "Dynamic systems", "velocity estimation", "mechatronics", "learning objective", "electromyography", "high-performance data acquisition card", "Hardware", "admittance control", "mechanical impedance", "Switzerland", "psychophysics", "human factors", "physical human–robot interaction (pHRI)", "ETH Zurich", "human-robot interaction", "faculty development program", "Impedance", "oral exam", "Laboratories", "Universal Serial Bus", "specialization projects", "force sensors", "mechanical engineering curriculum"]}, {"title": "A Project-Based Biologically-Inspired Robotics Module", "link": "https://ieeexplore.ieee.org/document/6324400/", "abstract": "The design of any robotic system requires input from engineers from a variety of technical fields. This paper describes a project-based module, Biologically-Inspired Robotics, that is offered to Electronics and Computer Science students at the University of Southampton, U.K. The overall objective of the module is for student groups to investigate the interface between robotics and biology and develop a system (either hardware or software) to illustrate biological principles. This paper discusses the details of the implementation and delivery of the module, together with evaluation feedback. A number of the robotic systems developed by project groups are presented in order to illustrate the diversity and quality of the systems that have been developed.", "authors": [{"name": "Klaus-Peter Zauner", "affiliation": "Agents, Interaction and Complexity Group, Electronics and Computer Science, Faculty of Physics and Applied Science, University of Southampton, Southampton, UK"}, {"name": "Richard M. Crowder", "affiliation": "Agents, Interaction and Complexity Group, Electronics and Computer Science, Faculty of Physics and Applied Science, University of Southampton, Southampton, UK"}], "tags": ["educational robots", "mobile robots", "project based biologically inspired robotics module", "biological principles", "curriculum development", "Biological processes", "engineering education", "Education", "Printed circuits", "biology", "Educational robots", "Computer science", "Robot sensing systems", "Biology", "robot control", "robotic system", "project based module"]}, {"title": "Robotics and Design: An Interdisciplinary Crash Course", "link": "https://ieeexplore.ieee.org/document/6353605/", "abstract": "The authors designed and ran a crash course on emotional robotics involving students from both the Information Engineering School and the Design School of Politecnico di Milano , Milan, Italy. The course consisted of two intensive days of short introductory lessons and lab activity, done in interdisciplinary groups and supported by a well-equipped prototyping and modeling lab. People from very different backgrounds had to work efficiently together, going from problem setting through the demonstration of the physical implementation of an object able to show four different emotional states. Both teacher evaluation and questionnaire-based feedback from the students show that it was successful and useful to set up this type of intensive experience in which students share their abilities to achieve a common goal. Key aspects for the success of the course were the short time the students had to reach a well-defined, yet general, goal, the students' ability to find efficient ways of cooperating and sharing their competences, students' motivation to arrive at a working prototype, and the strong support from teachers and lab personnel.", "authors": [{"name": "Maximiliano Romero", "affiliation": "Industrial Design, Communication, Arts and Fashion Department (INDACO), Politecnico di Milano, Milan, Italy"}, {"name": "Andrea Bonarini", "affiliation": "Department of Electronics and Information (DEI), Politecnico di Milano, Milan, Italy"}], "tags": ["educational robots", "modeling lab", "Politecnico di Milano", "design school", "teaching", "Milan", "learning-by-doing", "introductory lessons", "laboratory course", "interdisciplinary course", "Educational institutions", "Computer crashes", "lab activity", "lab personnel", "Constructivism", "educational courses", "emotional robotics", "Prototypes", "control engineering education", "interdisciplinary crash course", "questionnaire-based feedback", "well-equipped prototyping lab", "Shape", "teacher evaluation", "Italy", "Face", "information engineering school", "design engineering", "Robots", "design", "Laboratories", "robotics"]}, {"title": "Effects of Anonymity in Group Discussion on Peer Interaction and Learning Achievement", "link": "https://ieeexplore.ieee.org/document/6329381/", "abstract": "When students learn collaboratively, they generally learn better when they complement one another in knowledge. Both cooperative and collaborative learning strategies involve group discussions. However, when group members meet face to face, they may be influenced by interpersonal relationships and peer pressure, which can cause group members to interact in less desirable ways. The purpose of this study is to investigate whether peers engaged in group discussions for the purpose of collaborative learning interact differently in face-to-face or anonymous conditions. The study examines how peers assess one another, to identify group interaction patterns. Different interaction patterns may result in different learning achievements, and this study shows that anonymous group discussions tend to generate better results.", "authors": [{"name": "Tsong-Wuu Lin", "affiliation": "Department of Computer Science and Information Management, Soochow University, Taipei, Taiwan"}, {"name": "Chien-Hung Lai", "affiliation": "Department of Information and Computer Engineering, Chung Yuan Christian University, Taoyuan, Taiwan"}, {"name": "Yen-Teh Hsia", "affiliation": "Department of Information and Computer Engineering, Chung Yuan Christian University, Taoyuan, Taiwan"}, {"name": "Bin-Shyan Jong", "affiliation": "Department of Information and Computer Engineering, Chung Yuan Christian University, Taoyuan, Taiwan"}], "tags": ["anonymous group discussions", "learning achievements", "group interaction pattern identification", "pattern recognition", "Social factors", "group learning", "learning strategies", "Computer mediated communication", "Interactive systems", "cooperative learning strategies", "Cultural differences", "Collaborative learning", "interpersonal relationships", "interactive learning environments", "Collaborative work", "peer interaction", "collaborative learning strategies", "anonymity effects", "computer mediated communication", "computer-mediated communication", "computer aided instruction"]}, {"title": "Estimates of Use of Research-Based Instructional Strategies in Core Electrical or Computer Engineering Courses", "link": "https://ieeexplore.ieee.org/document/6466402/", "abstract": "Many research-based instruction strategies (RBISs) have been developed; their superior efficacy with respect to student learning has been demonstrated in many studies. Collecting and interpreting evidence about: 1) the extent to which electrical and computer engineering (ECE) faculty members are using RBISs in core, required engineering science courses, and 2) concerns that they express about using them, are important aspects of understanding how engineering education is evolving. The authors surveyed ECE faculty members, asking about their awareness and use of selected RBISs. The survey also asked what concerns ECE faculty members had about using RBISs. Respondent data showed that awareness of RBISs was very high, but estimates of use of RBISs, based on survey data, varied from 10% to 70%, depending on characteristics of the strategy. The most significant concern was the amount of class time that using an RBIS might take; efforts to increase use of RBISs must address this.", "authors": [{"name": "Maura Borrego", "affiliation": "Engineering Education, State University, Blacksburg, Virginia, United States"}, {"name": "Charles Henderson", "affiliation": "Physics, Western Michigan University, Kalamazoo, United State"}, {"name": "Jeffrey E. Froyd", "affiliation": "Engineering Student Services and Academic Programs, Texas A&M University, College Station, Texas, United States"}, {"name": "Stephanie Cutler", "affiliation": "Engineering Education, State University, Blacksburg, Virginia, United States"}, {"name": "Michael J. Prince", "affiliation": "Chemical Engineering, Bucknell University, Lewisburg, Pennsylvania, United States"}], "tags": ["Statistics", "core computer engineering courses", "core electrical engineering courses", "electrical engineering education", "computer aided engineering", "teaching", "student learning", "Sociology", "Technological innovation", "research-based instructional strategies (RBISs)", "research-based instructional strategies", "educational courses", "RBIS", "faculty awareness", "faculty adoption", "Engineering education", "ECE faculty members", "Computers", "engineering science courses", "Change in engineering education", "diffusion of innovations", "Physics"]}, {"title": "Design-Oriented Enhanced Robotics Curriculum", "link": "https://ieeexplore.ieee.org/document/6353607/", "abstract": "This paper presents an innovative two-course, laboratory-based, and design-oriented robotics educational model. The robotics curriculum exposed senior-level undergraduate students to major robotics concepts, and enhanced the student learning experience in hybrid learning environments by incorporating the IEEE Region-5 annual robotics competition with open-ended design challenges, by establishing a robotics club, and by implementing a K-12 mentorship program. A four-faculty team developed two elective courses in which the theoretical concepts underlying the robotics design competition topics were supported with corresponding laboratory activities. Students took the courses sequentially. They were formed into diverse teams, whose performance was assessed via weekly team presentations and participation in an outreach day. The best robot design teams participated in the IEEE Region-5 competitions. All students participated in a service-learning activity, acting as mentors during local K-12 robotics competitions while enhancing their own robotics comprehension. The robotics curriculum's two-year evaluation results illustrate the consistent efficacy of the curriculum during the project duration, indicating a successful robotics educational model for other academic institutions to follow.", "authors": [{"name": "Selahattin Ozcelik", "affiliation": "Department of Mechanical and Industrial Engineering, Texas A and M University, Kingsville, TX, USA"}, {"name": "Reza Nekovei", "affiliation": "Department of Electrical Engineering and Computer Science, Texas A and M University, Kingsville, TX, USA"}, {"name": "Muhittin Yilmaz", "affiliation": "Department of Electrical Engineering and Computer Science, Texas A and M University, Kingsville, TX, USA"}, {"name": "Nuri Yilmazer", "affiliation": "Department of Electrical Engineering and Computer Science, Texas A and M University, Kingsville, TX, USA"}], "tags": ["Employee welfare", "design-oriented enhanced robotics curriculum", "IEEE Region-5 annual robotics competition", "elective course", "senior-level undergraduate student", "laboratory activity", "robots", "robotics concept", "Educational institutions", "Educational robots", "open-ended design challenge", "educational courses", "K–12 mentorship", "K-12 mentorship program", "control engineering education", "laboratory-based curriculum", "robotics educational model", "Design-oriented competition", "academic institution", "Robot kinematics", "student learning experience", "design engineering", "educational institutions", "Laboratories", "robotics", "robotics club", "Robot sensing systems", "hybrid learning environment"]}, {"title": "A Lab Project on the Design and Implementation of Programmable and Configurable Embedded Systems", "link": "https://ieeexplore.ieee.org/document/6341864/", "abstract": "Several courses on embedded systems have been planned and taught to students in Electrical Engineering and Computer Science Master's programs. The tutorials play an important role in these courses, not only to motivate the students, but also to expose them to the difficulties and challenges of designing real embedded systems. This paper presents a complete lab project used over the last 15 years in a semester-long course on embedded systems that, for historical reasons, was titled Computer Electronics. This project involves all the topics studied in this course, namely programmable, configurable and dedicated processors, memory technology and organization, peripherals, and the design and implementation of complete embedded systems. Targeting image processing as a case study, in this lab project students use field programmable gate arrays (FPGAs) to design real-time embedded systems based on soft-cores, hardware accelerators, and specific input and output peripherals. Analyzing the results over the last years, it can be concluded that the inclusion of this transversal lab project boosts the interest in this Master's course and encourages the students to learn the topics required to design real embedded systems.", "authors": [{"name": "José Germano", "affiliation": ""}, {"name": "Samuel Antão", "affiliation": ""}, {"name": "Leonel Sousa", "affiliation": ""}], "tags": ["computer science education", "Computer peripherals", "electrical engineering education", "Field programmable gate arrays", "transversal lab project boosts", "programmable and configurable processors", "Histograms", "soft-core accelerators", "real-time embedded systems design", "memory technology", "programmable embedded systems design", "Master's course", "field programmable gate arrays", "peripherals", "configurable embedded systems design", "educational courses", "lab project", "semester-long course", "computer science masters programs", "Embedded systems", "Field programmable gate arrays (FPGAs)", "embedded systems", "FPGA", "electrical engineering masters programs", "image processing", "Tutorials", "educational institutions", "engineering courses", "computer electronics", "memory", "hardware accelerators"]}, {"title": "Evaluating Constructive Alignment Theory Implementation in a Power Systems Analysis Course Through Repertory Grids", "link": "https://ieeexplore.ieee.org/document/6496173/", "abstract": "Individuals perceive their environment in terms of their individual mental structures that in turn determine their attitudes toward that environment. This is the focus of personal construct theory (PCT), which states that experiences are meaningful only in relation to the way they are “constructed.” Within the higher education system, the “constructs” developed by students determine the way in which they perceive their learning environment and are used to judge or evaluate their learning experiences. To reveal the constructs developed by students, a structured interview methodology known as the repertory grid technique can be used. In this paper, the repertory grid technique is exploited to evaluate a consensus-based constructive alignment theory implementation in a M.Sc.-level power systems analysis course. The repertory grid technique is utilized as an approach to effectively gather feedback from students through interviews during course evaluation meetings. It is shown that the repertory grid technique provides much valuable, insightful quantitative and qualitative data. Experience in using this technique revealed shortcomings that are illustrated and discussed in detail. Various visual and statistical methods are applied to analyze the elicited repertory grids. These analyses, along with the other traditional feedback channels, gave insight into the teaching and learning activities (TLAs) involved in implementing Constructive Alignment Theory in a course and helped determine specific elements of the course design needing improvement for future course deliveries, thus helping to improve education in a cornerstone course of power systems engineering.", "authors": [{"name": "Mostafa Farrokhabadi", "affiliation": "Electric Power Systems Division, School of Electrical Engineering, Stockholm, Sweden"}, {"name": "Luigi Vanfretti", "affiliation": "Electric Power Systems Division, School of Electrical Engineering, Stockholm, Sweden"}], "tags": ["Power systems", "Principal component analysis", "Collaboration", "personal construct theory (PCT)", "statistical analysis", "learning environment", "Education", "repertory grid technique", "Mathematical analysis", "quantitative data", "statistical methods", "power engineering education", "power systems engineering", "Context", "Consensus-based course design", "constructive alignment theory (CAT)", "course evaluation meetings", "educational courses", "M.Sc.-level power systems analysis course", "feedback channels", "revised two-factor study process questionnaire", "repertory grid", "power systems analysis", "qualitative data", "visual methods", "personal construct theory", "power systems analysis course", "repertory grids", "education system", "consensus-based constructive alignment theory implementation", "Interviews", "power grids"]}, {"title": "Exploring the Educational Benefits of Introducing Aspect-Oriented Programming Into a Programming Course", "link": "https://ieeexplore.ieee.org/document/6259821/", "abstract": "This paper explores the educational benefits of introducing the aspect-oriented programming paradigm into a programming course in a study on a sample of 75 undergraduate software engineering students. It discusses how using the aspect-oriented paradigm, in addition to the object-oriented programming paradigm, affects students' programs, their exam results, and their overall perception of the theoretically claimed benefits of aspect-oriented programming. The research methodology, consisting of automating the analysis of student-created computer programs, administering surveys, and collecting exam results, provided an objective measurement of the benefits of the paradigm for novice programmers, as well as evaluating their perception of its usefulness. The results show that the use of aspect-oriented programming as a supplement to object-oriented programming enhances the productivity of novice program code software engineering students and leads to increased understanding of theoretical concepts. Students readily accepted the new paradigm and recognized its benefits.", "authors": [{"name": "Ivica Boticki", "affiliation": "Department of Applied Computing, Faculty of Electrical Engineering and Computing, University of Zagreb, Zagreb, Croatia"}, {"name": "Sergio Martin", "affiliation": "Electrical and Computer Engineering Department, Spanish University of Distance Education, Madrid, Spain"}, {"name": "Marija Katic", "affiliation": "Department of Applied Computing, Faculty of Electrical Engineering and Computing, University of Zagreb, Zagreb, Croatia"}], "tags": ["computer science education", "higher education", "teaching/learning strategies", "aspect-oriented programming", "Education", "Aspect-oriented programming (AOP)", "student-created computer programs", "aspect-oriented paradigm", "undergraduate software engineering students", "objective measurement", "student programs", "Object oriented programming", "programming", "educational courses", "research methodology", "educational benefits", "software engineering", "novice program code software engineering students", "Measurement", "Software engineering", "object-oriented programming paradigm", "novice programmers", "Laboratories", "programming languages", "Programming profession", "programming course"]}, {"title": "Guest Editorial Special Issue on Robotics Education", "link": "https://ieeexplore.ieee.org/document/6423954/", "abstract": "The 20 papers in this special issue focus on robotics education.", "authors": [{"name": "Sonia Chernova", "affiliation": "Assistant Professor of Robotics Engineering and Electrical and Computer Engineering, Worcester Polytechnic Institute, Worcester, MA, USA"}, {"name": "Taskin Padir", "affiliation": "Assistant Professor of Robotics Engineering and Electrical and Computer Engineering, Worcester Polytechnic Institute, Worcester, MA, USA"}], "tags": ["Robotics and automation", "Best practices", "Curriculum development", "Engineering education", "Special issues and sections"]}, {"title": "Dynamically Personalized E-Training in Computer Programming and the Language C", "link": "https://ieeexplore.ieee.org/document/6461995/", "abstract": "This paper describes ELaC, a fully implemented and evaluated novel integrated environment for personalized e-training in programming and the language C. Software development relies on many different programming languages and tools, ranging from procedural to object-oriented and query languages; an individual learning a new language may already know a range of other languages, or may know no other languages at all. Given the variety of backgrounds of prospective learners of programming, developing learning environments for all of them is not easy. In the light of these problems, this work has focused on the development of an original integrated e-training environment for programming and the language C, incorporating a student model responsible for identifying and updating the student's knowledge level, which takes into account each individual user's pace of learning. The system can adapt dynamically to each individual learner's needs by scheduling the sequence of learning lessons on the fly. This personalization allows each learner to complete the e-training course on at their own pace and according to their ability.", "authors": [{"name": "Maria Virvou", "affiliation": "Department of Informatics, University of Piraeus, Greece"}, {"name": "Konstantina Chrysafiadi", "affiliation": "Department of Informatics, University of Piraeus, Greece"}], "tags": ["computer science education", "query languages", "scheduling", "object-oriented language", "learning environment", "teaching programming", "domain knowledge representation", "computer programming", "C language", "Helium", "e-training course", "programming tool", "integrated e-training environment development", "object-oriented languages", "user modelling", "Adaptivity", "query language", "educational courses", "language C", "Programming profession", "concept interdependency", "dynamic personalized e-training", "Computer languages", "software development management", "Computers", "ELaC", "software development", "training", "student knowledge level", "software tools", "programming language", "Adaptation models", "computer aided instruction", "student model", "learning lesson sequence scheduling"]}, {"title": "Consolidating the Electromagnetic Education of Graduate Students Through an Integrated Course", "link": "https://ieeexplore.ieee.org/document/6477189/", "abstract": "In the context of an international, English-spoken, post-graduate Telecommunications Engineering program, the Faculty of Engineering of the University of Bologna, Italy, offers a course “Electromagnetic Technologies for Link Design,” conceived for both telecommunications students and Master's students from various engineering fields, all with very different Bachelor degree backgrounds. The course addresses the increasing demand from industry for engineers who are comprehensively educated, rather than extremely specialized. The course lecturers have expertise in various areas of applied electromagnetics and use a deductive approach to show diverse applications, all grounded in the same basic electromagnetic concepts.", "authors": [{"name": "Marina Barbiroli", "affiliation": "DEI, Department of Electrical, Electronic and Information Engineering, Univeristy of Bologna, Bologna, Italy"}, {"name": "Vittorio Degli Esposti", "affiliation": "DEI, Department of Electrical, Electronic and Information Engineering, Univeristy of Bologna, Bologna, Italy"}, {"name": "Diego Masotti", "affiliation": "DEI, Department of Electrical, Electronic and Information Engineering, Univeristy of Bologna, Bologna, Italy"}, {"name": "Franco Fuschini", "affiliation": "DEI, Department of Electrical, Electronic and Information Engineering, Univeristy of Bologna, Bologna, Italy"}, {"name": "Giovanni Tartarini", "affiliation": "DEI, Department of Electrical, Electronic and Information Engineering, Univeristy of Bologna, Bologna, Italy"}], "tags": ["optical components", "Antennas", "international english-spoken telecommunications engineering program", "Bachelor degree backgrounds", "Electromagnetics", "engineering education", "integrated course", "Optical fiber communication", "Faculty of Engineering", "Telecommunications", "electromagnetic education", "course lecturers", "Educational institutions", "electromagnetic concepts", "Electromagnetic fields", "post-graduate telecommunications engineering program", "applied electromagnetics", "educational courses", "microwave antennas", "electromagnetic technologies for link design", "engineering fields", "electromagnetic fields", "Italy", "graduate students", "radio propagation", "telecommunication engineering education", "Radio frequency", "University of Bologna"]}, {"title": "A Contest-Oriented Project for Learning Intelligent Mobile Robots", "link": "https://ieeexplore.ieee.org/document/6317207/", "abstract": "A contest-oriented project for undergraduate students to learn implementation skills and theories related to intelligent mobile robots is presented in this paper. The project, related to Micromouse, Robotrace (Robotrace is the title of Taiwanese and Japanese robot races), and line-maze contests was developed by the embedded control system research group of the Department of Electronic Engineering, Lunghwa University of Science and Technology, Taiwan. It targets both those students who have to earn credits for a one-year special topics course and those who are just interested in making robots, and it is designed to motivate them to learn digital motion control, path planning, attitude correction, curvature detection and maze-solving algorithms. The students begin by getting acquainted with the development environment of microcontrollers, the characteristics of different sensors, and servomotor control techniques. Having learned these basic skills, they acquire further specific advanced skills and proceed to design their own mobile robots to compete in contests. The special topics course students' robots must pass examination by five teachers. Blogs and a wiki Web site for recording students' progress and experiences enhance the project's learning outcomes. Although not every student wins a prize in the contests, student feedback still shows that the contest-oriented project did motivate them to acquire the skills necessary to build and operate intelligent mobile robots.", "authors": [{"name": "Juing-Huei Su", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}, {"name": "Hsin-Hsiung Huang", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}, {"name": "Chyi-Shyong Lee", "affiliation": "Department of Electronic Engineering, Lunghwa University of Science and Technology, Taoyuan, Taiwan"}], "tags": ["student progress", "attitude control", "robotrace", "Contest-oriented project", "Optical sensors", "sensor", "microcontroller", "Taiwanese robot race", "contest-oriented project", "undergraduate student", "embedded control system", "digital motion control", "sensors", "Japanese robot race", "Educational robots", "Web sites", "Lunghwa University of Science and Technology", "path planning", "learning intelligent mobile robot", "embedded control", "motion control", "educational courses", "intelligent robots", "student feedback", "implementation skill", "DC motors", "mobile robots", "Robotrace", "Microcontrollers", "control engineering education", "embedded systems", "Department of Electronic Engineering", "blog", "line-maze contest", "Robot sensing systems", "control engineering computing", "wiki Web site", "mobile robot design", "Mobile robots", "curvature detection", "maze-solving algorithm", "attitude correction", "servomotors", "servomotor control", "micromouse", "Micromouse", "project learning outcome", "computer aided instruction", "microcontrollers"]}, {"title": "Insights From Implementing a System for Peer Review", "link": "https://ieeexplore.ieee.org/document/6269903/", "abstract": "Courses at the Master's level in automatic control and signal processing cover mathematical theories and algorithms for control, estimation, and filtering. However, giving students practical experience in how to use these algorithms is also an important part of these courses. A goal is that the students should not only be able to understand and derive these algorithms, but also be able to apply them to real-life technical problems. The latter is achieved by assigning more time to the laboratory tutorials and designing them in such a way that the exercises are open for interpretation; an example of this would be giving the students more freedom to decide how to acquire the data needed to solve the given exercises. The students are asked to hand in a laboratory report in which they describe how they solved the exercises. This paper presents a double-blind peer-review process for laboratory reports, introduced at the Department of Electrical Engineering, Linköping University, Sweden. A survey was administered to students, and the results are summarized in this paper. Also discussed are the teachers' experiences of peer review and of how students perform later in their education in writing their Master's theses.", "authors": [{"name": "Martin A. Skoglund", "affiliation": "Department of Electrical Engineering, Linköping University, Linkoping, Sweden"}, {"name": "Torkel Glad", "affiliation": "Department of Electrical Engineering, Linköping University, Linkoping, Sweden"}, {"name": "Karl Granström", "affiliation": "Department of Electrical Engineering, Linköping University, Linkoping, Sweden"}, {"name": "Christian Lundquist", "affiliation": "Department of Electrical Engineering, Linköping University, Linkoping, Sweden"}], "tags": ["electrical engineering education", "Companies", "peer review", "Writing", "reviews", "signal processing", "Sweden", "laboratory reports", "Educational institutions", "Sensor fusion", "educational courses", "student self-assessment", "survey", "Critical thinking", "double-blind peer-review process", "peer assessment student learning", "laboratory tutorials", "Master theses", "team-based projects", "automatic control", "laboratory work", "real-life technical problems", "educational institutions", "Laboratories", "Department of Electrical Engineering", "Linköping University", "mathematical theories"]}, {"title": "MASTERS: A Virtual Lab on Multimedia Systems for Telecommunications, Medical, and Remote Sensing Applications", "link": "https://ieeexplore.ieee.org/document/6257505/", "abstract": "Digital signal processing (DSP) has been an integral part of most electrical, electronic, and computer engineering curricula. The applications of DSP in multimedia (audio, image, video) storage, transmission, and analysis are also widely taught at both the undergraduate and post-graduate levels, as digital multimedia can be encountered in most human daily activities. In this paper, a virtual lab on multimedia systems for telecommunications, medical, and remote sensing applications is presented; consisting of 20 graphical user interfaces, it can support teaching activities for various DSP concepts. The virtual lab developed was used as a teaching companion for a post-graduate course on multimedia content management, to enhancing student comprehension of the material taught; it has been made freely available for similar educational or research purposes.", "authors": [{"name": "Nikolaos Mitianoudis", "affiliation": "Department of Electrical and Computer Engineering, Democritus University of Thrace, Xanthi, Greece"}, {"name": "Dimitrios S. Alexiadis", "affiliation": "Centre for Research and Technology-Hellas, Informatics and Telematics Institute Thessaloniki, Thermi, Greece"}], "tags": ["computer science education", "computer engineering curriculum", "multimedia computing", "electronic engineering curriculum", "virtual lab", "electronic engineering education", "electrical engineering curriculum", "teaching", "medical application", "visualization", "signal processing", "interactive education", "remote sensing", "post-graduate course", "Transforms", "Graphical user interfaces", "teaching activity", "graphical user interfaces", "MASTERS", "Multimedia systems", "digital multimedia", "Demonstration", "biomedical education", "multimedia", "telecommunication application", "graphical user interface", "Transform coding", "multimedia system", "telecommunication engineering education", "Image coding", "digital signal processing", "Encoding", "DSP", "multimedia content management", "remote sensing application", "computer aided instruction", "Streaming media", "digital signal and image processing"]}, {"title": "Traffic Sign Recognition for Computer Vision Project-Based Learning", "link": "https://ieeexplore.ieee.org/document/6425440/", "abstract": "This paper presents a graduate course project on computer vision. The aim of the project is to detect and recognize traffic signs in video sequences recorded by an on-board vehicle camera. This is a demanding problem, given that traffic sign recognition is one of the most challenging problems for driving assistance systems. Equally, it is motivating for the students given that it is a real-life problem. Furthermore, it gives them the opportunity to appreciate the difficulty of real-world vision problems and to assess the extent to which this problem can be solved by modern computer vision and pattern classification techniques taught in the classroom. The learning objectives of the course are introduced, as are the constraints imposed on its design, such as the diversity of students' background and the amount of time they and their instructors dedicate to the course. The paper also describes the course contents, schedule, and how the project-based learning approach is applied. The outcomes of the course are discussed, including both the students' marks and their personal feedback.", "authors": [{"name": "Joan Serrat", "affiliation": "Computer Vision Center and the Department of Computer Science, Universitat Autònoma de Barcelona, Bellaterra, Spain"}, {"name": "Antonio M. López", "affiliation": "Computer Vision Center and the Department of Computer Science, Universitat Autònoma de Barcelona, Bellaterra, Spain"}, {"name": "Ramon Baldrich", "affiliation": "Computer Vision Center and the Department of Computer Science, Universitat Autònoma de Barcelona, Bellaterra, Spain"}, {"name": "David Gerónimo", "affiliation": "Computer Vision Center and the Department of Computer Science, Universitat Autònoma de Barcelona, Bellaterra, Spain"}], "tags": ["project-based learning (PBL)", "Education", "Computer vision", "pattern classification techniques", "course project", "Video sequences", "Image color analysis", "learning objectives", "computer vision project based learning", "Computer science", "video sequences", "educational courses", "road traffic", "driving assistance systems", "image sequences", "Computer vision (CV)", "Master's degree", "traffic sign", "onboard vehicle camera", "pattern classification", "video signal processing", "real-world vision problems", "traffic sign recognition", "Testing", "computer vision", "course contents", "computer aided instruction", "traffic engineering computing"]}, {"title": "SDLDS—System for Digital Logic Design and Simulation", "link": "https://ieeexplore.ieee.org/document/6280603/", "abstract": "This paper presents the basic features of a software system developed to support the teaching of digital logic, as well as the experience of using it in the Digital Logic course taught at the School of Electrical Engineering, University of Belgrade, Serbia. The system has been used for several years, both by students for self-learning and laboratory work, and by teachers to automate the assessment and verification of students' work. The system allows users to design and simulate a switching circuit. It also collects data on all student activities and transfers these to the school's information system. Finally, the paper gives figures demonstrating the overall benefits of the system.", "authors": [{"name": "Bosko Nikolic", "affiliation": "Department of Computer Engineering, School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Vladimir Pavlovic", "affiliation": "Department of Computer Engineering, School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Jovan Djordjevic", "affiliation": "Department of Computer Engineering, School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}, {"name": "Zarko Stanisavljevic", "affiliation": "Department of Computer Engineering, School of Electrical Engineering, University of Belgrade, Belgrade, Serbia"}], "tags": ["Integrated circuit modeling", "switching circuit", "Logic circuits", "visual system", "logic circuits", "software engineering", "electrical engineering education", "logic design", "engineering education", "simulation software", "Software engineering", "software system", "SDLDS", "system for digital logic design and simulation", "Engineering education", "digital systems", "Digital circuits"]}, {"title": "The Use of Video-Gaming Devices as a Motivation for Learning Embedded Systems Programming", "link": "https://ieeexplore.ieee.org/document/6248186/", "abstract": "As embedded systems are becoming prevalent in everyday life, many universities are incorporating embedded systems-related courses in their undergraduate curricula. However, it is not easy to motivate students in such courses since they conceive of embedded systems as bizarre computing elements, different from the personal computers with which they are familiar. This problem has been overcome at the University of Granada, Spain, by taking advantage of the connection many students have with video games.", "authors": [{"name": "Pablo García-Sánchez", "affiliation": "Department of Computer Architecture and Computer Technology, University of Granada, Granada, Spain"}, {"name": "Héctor Pomares", "affiliation": "Department of Computer Architecture and Computer Technology, University of Granada, Granada, Spain"}, {"name": "Manuel Rodríguez-Álvarez", "affiliation": "Department of Computer Architecture and Computer Technology, University of Granada, Granada, Spain"}, {"name": "José M. Palomares", "affiliation": "Department of Computer Architecture and Electronics, University of Córdoba, Cordoba, Spain"}, {"name": "Miguel Damas", "affiliation": "Department of Computer Architecture and Computer Technology, University of Granada, Granada, Spain"}, {"name": "Jesús González", "affiliation": "Department of Computer Architecture and Computer Technology, University of Granada, Granada, Spain"}], "tags": ["computer science education", "Spain", "student motivation", "Embedded software", "undergraduate curricula", "firmware development", "computing elements", "Program processors", "video gaming devices", "microcomputers", "Educational institutions", "further education", "embedded system-related courses", "educational courses", "Embedded systems", "open-source development tools", "Open source software", "Games", "embedded systems", "Programming", "mobile and personal devices", "computer games", "embedded system programming", "Embedded systems teaching", "personal computers", "University of Granada", "computer aided instruction"]}, {"title": "Using University-Funded Research Projects to Teach System Design Processes and Tools", "link": "https://ieeexplore.ieee.org/document/6425525/", "abstract": "This paper highlights the development of a new course structure and an associated knowledge support system, deployed as a pilot program at the senior undergraduate and first-semester graduate level. These two new courses, run consecutively, allow the injection of funded research projects to be used as a means to teach topics related to systems engineering. During the two courses, the students analyzed a real Department of Defense (DoD) problem. Specifically, the courses sought to teach students how to apply systems engineering processes, tools, and analysis to engineering design problems. These two courses are described in depth, and details are given of the knowledge support system, educational structure, and assessment of this pilot program. Student perception of this new educational pilot program was assessed by surveys and is reported here.", "authors": [{"name": "Ivan G. Guardiola", "affiliation": "Engineering Management and Systems Engineering, Missouri University of Science and Technology, Rolla, Missouri, United States"}, {"name": "Cihan Dagli", "affiliation": "Engineering Management and Systems Engineering, Missouri University of Science and Technology, Rolla, Missouri, United States"}, {"name": "Steven Corns", "affiliation": "Engineering Management and Systems Engineering, Missouri University of Science and Technology, Rolla, Missouri, United States"}], "tags": ["knowledge support system", "Industries", "Humans", "engineering education", "teaching", "university funded research projects", "first-semester graduate level", "further education", "course structure", "educational courses", "educational pilot program", "undergraduate education", "systems engineering", "Cultural differences", "US Department of Defense", "educational structure", "industry mentors", "senior undergraduate level", "System analysis and design", "Capstone courses", "student perception", "Training", "system design processes", "engineering design problems", "design processes"]}, {"title": "Integrating Mobile Robotics and Vision With Undergraduate Computer Science", "link": "https://ieeexplore.ieee.org/document/6294470/", "abstract": "This paper describes the integration of robotics education into an undergraduate Computer Science curriculum. The proposed approach delivers mobile robotics as well as covering the closely related field of Computer Vision and is directly linked to the research conducted at the authors' institution. The paper describes the most relevant details of the module content and assessment strategy, paying particular attention to the practical sessions using Rovio mobile robots. The specific choices are discussed that were made with regard to the mobile platform, software libraries, and lab environment. The paper also presents a detailed qualitative and quantitative analysis of student results, including the correlation between student engagement and performance, and discusses the outcomes of this experience.", "authors": [{"name": "Grzegorz Cielniak", "affiliation": "School of Computer Science, University of Lincoln, Lincoln, UK"}, {"name": "Tom Duckett", "affiliation": "School of Computer Science, University of Lincoln, Lincoln, UK"}, {"name": "Nicola Bellotto", "affiliation": "School of Computer Science, University of Lincoln, Lincoln, UK"}], "tags": ["computer science education", "undergraduate computer science curriculum", "mobile platform", "Robot programming", "Education", "Computer vision", "Student as Producer", "mobile robotics", "Rovio mobile robot", "student engagement", "robotics education", "student performance", "robot vision", "Educational robots", "Computer science", "software libraries", "Conferences", "mobile robots", "control engineering education", "Mobile robots", "lab environment", "computer vision", "computer aided instruction"]}, {"title": "Project-Based Learning in Embedded Systems Education Using an FPGA Platform", "link": "https://ieeexplore.ieee.org/document/6472742/", "abstract": "With embedded systems becoming ubiquitous, there is a growing need to teach and train engineers to be well-versed in their design and development. The multidisciplinary nature of such systems makes it challenging to give students exposure to and experience in all their facets. This paper proposes a generic architecture, containing multiple processors, that allows easy integration of custom and/or predefined peripherals. The architecture allows students to explore both the hardware and software issues associated with real-time and embedded systems. Furthermore, the architecture can be extended to train students in advanced concepts in embedded multiprocessor systems. This generic architecture has been used for two courses at the National University of Singapore-one on real-time embedded systems and the other emphasizing the hardware aspects of embedded systems. The project in the real-time embedded systems course has students develop a five-a-side soccer system on multiple field-programmable gate array (FPGA) boards using embedded processors. In the embedded hardware design course project, students use an embedded processor-based system to perform decryption of a block encrypted image, accelerated through a custom co-processor. The use of displays gives students a visual/interactive experience and a sense of accomplishment, while reinforcing the theoretical concepts. Both qualitative and quantitative assessment results are presented, showing how students perceived these projects and met the learning objectives.", "authors": [{"name": "Akash Kumar", "affiliation": "Department of Electrical & Computer Engineering, National University of Singapore, Singapore"}, {"name": "Rajesh C Panicker", "affiliation": "Nanyang University of Technology, School of Computer Engineering, Singapore"}, {"name": "Shakith Fernando", "affiliation": "Department of Electrical Engineering, Eindhoven University of Technology, The Netherlands"}], "tags": ["microprocessor chips", "Servers", "Field programmable gate arrays", "five-a-side soccer system", "generic architecture", "embedded processors", "National University of Singapore", "Real-time systems", "Computer architecture", "field programmable gate arrays", "educational courses", "multiprocessor systems", "field-programmable gate array (FPGA)", "predefined peripherals", "Embedded systems", "multiple processors", "cryptography", "Hardware", "FPGA", "real-time systems", "project-based learning", "training", "courses", "hardware-software co-design", "field programmable gate array", "block encrypted image", "decryption", "visual-interactive experience", "student training", "embedded systems education", "embedded hardware design course project"]}, {"title": "Industrial-Like Vehicle Platforms for Postgraduate Laboratory Courses on Robotics", "link": "https://ieeexplore.ieee.org/document/6280604/", "abstract": "The interdisciplinary nature of robotics allows mobile robots to be used successfully in a broad range of courses at the postgraduate level and in Ph.D. research. Practical industrial-like mobile robotic demonstrations encourage students and increase their motivation by providing them with learning benefits not achieved with traditional educational robotic platforms. This paper presents VEGO, an industrial-like modular vehicle platform for robotic education with an appropriate infrastructure that has been demonstrated to be very useful at the postgraduate level. Besides learning engineering concepts, in performing industrial-like exercises, students develop valuable skills such as teamwork and the capacity to solve problems similar to those they may encounter in a real industrial environment. The developed infrastructure represents a valuable platform for robotic education that can be used in many different disciplines as a way to demonstrate how to cope with the difficulties and challenges related to the development of industrial infrastructure systems. The platform evaluation proved its ability to inculcate the expected engineering skills. A novel approach is adopted through the use of multidisciplinary and close-to-industrial-reality platforms developed under an incremental approach and using an open and customizable structure.", "authors": [{"name": "Carlos Fernandez", "affiliation": "División de Sistemas e Ingeniería Electrónica, Universidad Politécnica de Cartagena, Cartagena, Spain"}, {"name": "Pedro J. Navarro", "affiliation": "División de Sistemas e Ingeniería Electrónica, Universidad Politécnica de Cartagena, Cartagena, Spain"}, {"name": "Pedro Sanchez", "affiliation": "División de Sistemas e Ingeniería Electrónica, Universidad Politécnica de Cartagena, Cartagena, Spain"}], "tags": ["learning benefits", "industrial-like mobile robotic demonstrations", "educational robots", "Vehicles", "close-to-industrial-reality platforms", "engineering concepts", "Education", "robotized vehicle platforms", "industrial-like exercises", "educational robotic platforms", "interdisciplinary nature", "Service robots", "industrial infrastructure systems", "robotics education", "Computer architecture", "further education", "robotic education", "customizable structure", "postgraduate laboratory courses", "educational courses", "teamwork", "postgraduate courses", "industrial-like vehicle platforms", "mobile robots", "control engineering education", "platform evaluation", "multidisciplinary laboratory", "engineering skills", "Curriculum issues", "industrial environment", "Mobile robots", "multidisciplinary platforms", "VEGO", "Ph.D. research", "postgraduate level", "robotics", "industrial-like modular vehicle platform", "Robot sensing systems"]}, {"title": "Using Robots and Contract Learning to Teach Cyber-Physical Systems to Undergraduates", "link": "https://ieeexplore.ieee.org/document/6328295/", "abstract": "Cyber-physical systems are a genre of networked real-time systems that monitor and control the physical world. Examples include unmanned aerial vehicles and industrial robotics. The experts who develop these complex systems are retiring much faster than universities are graduating engineering majors. As a result, it is important for undergraduates to gain exposure to these kinds of complex systems. This paper describes UPBOT, a robotics testbed hosted at the University of Portland, Portland, OR. The testbed features an extensible robot built from an iRobot Create chassis and a computationally powerful embedded system equipped with a wireless card. In the Spring 2012 semester, the testbed was used for a course project designed and assessed in the style of contract learning. Overall, students were enthusiastic about the hands-on and self-paced nature of the course, but some were concerned by the level of freedom. The lessons learned may inform other educators in project design in robotics education.", "authors": [{"name": "Tanya Lee Ann Crenshaw", "affiliation": "School of Engineering, University of Portland, Portland, OR, USA"}], "tags": ["wireless card", "educational robots", "iRobot Create chassis", "Robot programming", "physical world monitoring", "Education", "teaching", "course project", "Control engineering education", "Networked control systems", "UPBOT", "Real-time systems", "robotics education", "Educational robots", "networked control systems", "educational courses", "Embedded systems", "cyber-physical system teaching", "control engineering education", "embedded systems", "industrial robotic", "robotics testbed", "robot programming", "physical world control", "project design", "contract learning", "networked real-time system", "embedded system", "real-time systems", "unmanned aerial vehicle"]}, {"title": "Evaluation of a UML-Based Versus an IEC 61131-3-Based Software Engineering Approach for Teaching PLC Programming", "link": "https://ieeexplore.ieee.org/document/6363495/", "abstract": "A field experiment investigated the evaluation, teaching, and application of two different approaches to automatic control in programmable logic controllers, in particular comparing the Unified Modeling Language (UML) to the classic procedural paradigm (IEC 61131-3). A total of 85 apprentices from a vocational school for production engineering with a specialization in mechatronics took part in the training and the experiment. This paper details the results of the training using both approaches, and the correlations found between the modeling and/or programming performance and cognitive abilities, interest, workload, expertise, and school grades. In general, the results show that students can be trained to carry out authentic programming tasks within one and a half days, even for beginners in programming. The data distinguish the two approaches. Function Block Diagram programming (IEC 61131-3) can be best predicted by the grade in mathematics, programming experience, and cognitive demand. For performance in UML class diagram and state chart (UML/CD+SC) modeling, the grade in mathematics plays an even more prominent role; this explains the greater variance in modeling performance in the UML group than in the 61131/Function Block Diagram group. With respect to other findings, the paper concludes that special problem-solving skills and skills for abstract thinking should be taught when teaching UML-based modeling approaches.", "authors": [{"name": "Karin Schweizer", "affiliation": "University of Education Weingarten, Weingarten, Germany"}, {"name": "Steven Braun", "affiliation": "Institute for Automation and Information Systems, Technische Universität München, Garching, Germany"}, {"name": "Kerstin Sommer", "affiliation": "Institute for Automation and Information Systems, Technische Universität München, Garching, Germany"}, {"name": "Birgit Vogel-Heuser", "affiliation": "Institute for Automation and Information Systems, Technische Universität München, Garching, Germany"}, {"name": "Fabian Jobst", "affiliation": "University of Education Weingarten, Weingarten, Germany"}, {"name": "Martin Obermeier", "affiliation": "Institute for Automation and Information Systems, Technische Universität München, Garching, Germany"}], "tags": ["computer science education", "programmable logic devices", "IEC standards", "object-oriented methods", "modeling", "Automation", "engineering education", "programmable controllers", "teaching", "cognitive abilities", "Function Block Diagram programming", "UML/CD+SC modeling", "Unified Modeling Language", "vocational school", "UML-based software engineering approach evaluation", "PLC programming teaching", "UML-based modeling approach teaching", "student training", "programmable logic controllers", "student workload", "Object oriented modeling", "mathematics grade", "state chart modeling", "Unified modeling language", "production engineering", "student school grades", "cognitive science", "UML group", "student expertise", "software engineering", "programming tasks", "programming experience", "abstract thinking skills", "modeling performance", "problem-solving skills", "IEC 61131-3-based software engineering approach evaluation", "automatic control", "programming performance", "procedural paradigm", "student interest", "Training", "UML class diagram", "educational institutions", "mechatronics specialization", "Programming profession", "computer aided instruction", "vocational training"]}, {"title": "Understanding Power Electronics and Electrical Machines in Multidisciplinary Wind Energy Conversion System Courses", "link": "https://ieeexplore.ieee.org/document/6243238/", "abstract": "Wind energy conversion systems (WECS) nowadays offer an extremely wide range of topologies, including various different types of electrical generators and power converters. Wind energy is also an application of great interest to students and with a huge potential for engineering employment. Making WECS the main center of interest when teaching power electronics and electrical machines can therefore be highly advantageous. This paper describes a novel teaching experience using wind energy as the starting point for understanding power electronics and electrical machines. The results point out the wide variety of concepts involved in the course, the numerous competences that it can enhance, and its positive reception by learners.", "authors": [{"name": "Hugo Guzman", "affiliation": "Department of Electronic Engineering, University of Seville, Seville, Spain"}, {"name": "José Fernandez", "affiliation": "Electrical Engineering Department, University of Jaen, Jaen, Spain"}, {"name": "Francisco Guzman", "affiliation": "Electrical Engineering Department, University of Malaga, Malaga, Spain"}, {"name": "Federico Barrero", "affiliation": "Department of Electronic Engineering, University of Seville, Seville, Spain"}, {"name": "Mario J. Duran", "affiliation": "Electrical Engineering Department, University of Malaga, Malaga, Spain"}, {"name": "Ana Pozo-Ruz", "affiliation": "Electronic Technology Department, University of Malaga, Malaga, Spain"}], "tags": ["Power electronics", "Industries", "wind power", "problem-based learning", "Wind energy", "Mathematical model", "power electronics", "wind energy conversion systems (WECS)", "Electrical machines", "multidisciplinary wind energy conversion system courses", "Educational institutions", "simulation tools", "power converters", "electrical machines", "Topology", "Generators", "educational courses", "electrical generators"]}, {"title": "An Electromechanical Approach to a Printed Circuit Board Design Course", "link": "https://ieeexplore.ieee.org/document/6507652/", "abstract": "This paper describes a printed circuit board (PCB) design course based on electromechanical workflow. The course relies on the premise that a PCB is an integral component of any electronic apparatus, along with its other electromechanical and mechanical components. To emphasize this to students, electrical and mechanical computer-aided design tools are used in synergy. The course content is described in detail, and the design workflow is illustrated, using a project to design a data acquisition instrument as an example.", "authors": [{"name": "Aneta Prijić", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}, {"name": "Zoran Prijić", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}, {"name": "Danijel Danković", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}, {"name": "Ljubomir Vračar", "affiliation": "Faculty of Electronic Engineering, University of Niš, Niš, Serbia"}], "tags": ["electromechanical workflow", "data acquisition instrument", "Integrated circuit modeling", "circuit CAD", "Layout", "electronic engineering education", "printed circuit board (PCB) design", "Connectors", "Assembly", "mechanical computer-aided design", "Design automation", "electromechanical components", "printed circuit design", "mechanical computer-aided design (MCAD)", "design workflow", "Instruments", "educational courses", "data acquisition", "Solid modeling", "3-D modeling", "electrical computer-aided design (ECAD)", "printed circuit board design course", "electronic computer-aided design"]}, {"title": "Embodied Computation: An Active-Learning Approach to Mobile Robotics Education", "link": "https://ieeexplore.ieee.org/document/6341863/", "abstract": "This paper describes a newly designed upper-level undergraduate and graduate course, Autonomous Mobile Robots. The course employs active, cooperative, problem-based learning and is grounded in the fundamental computational problems in mobile robotics defined by Dudek and Jenkin. Students receive a broad survey of robotics through lectures, weekly assignments, and a final capstone project that includes a community outreach element and collaboration with artists. Students were assessed on several metrics from the ASEE literature; overall, they performed well in the course. The outreach event was also a success and was enjoyed by both the community attendees and student participants.", "authors": [{"name": "Laurel D. Riek", "affiliation": "Department of Computer Science and Engineering, University of Notre Dame, Notre Dame, IN, USA"}], "tags": ["computer science education", "Communities", "embodied computation", "autonomous mobile robots", "educational robots", "active-learning approach", "capstone project", "mobile robotics education", "mobile robotics", "problem-based learning", "community outreach element", "upper-level undergraduate", "Educational institutions", "Active learning", "Educational robots", "active learning", "fundamental computational problems", "cooperative learning", "mobile robots", "control engineering education", "student participants", "graduate course", "ASEE literature", "Materials", "outreach", "Mobile communication", "robotics", "Robot sensing systems", "community attendees"]}, {"title": "A Bottom-Up Approach to Teaching Robotics and Mechatronics to Mechanical Engineers", "link": "https://ieeexplore.ieee.org/document/6363494/", "abstract": "This paper describes a multidisciplinary teaching program, designed to provide students with the broad knowledge and skills required to practice product development in robotics and mechatronics. The curriculum was designed to prepare students for the senior capstone design project, in which they design and build a working mechatronic/robotic system. It consists of a basic program in mechanical engineering, augmented with courses and laboratories in electronics, microprocessors, control, and computer programming. The early introduction of the specialty courses and the ample hands-on experience offered in the accompanying laboratories allows students to gain intuitive understanding of concepts that are usually foreign to mechanical engineers. The capstone design project attracts students to the program and serves as a beacon for the entire program. The program is now in its 11th year, receiving positive feedback from students and graduates.", "authors": [{"name": "Zvi Shiller", "affiliation": "Department of Mechanical Engineering and Mechatronics, Ariel University Center, Ariel, Israel"}], "tags": ["educational robots", "laboratories", "specialty courses", "engineering education", "product development", "Mechanical engineering", "computer programming", "senior capstone design project", "working robotic system", "mechanical engineering", "working mechatronic system", "Educational robots", "Control", "teaching robotics", "electronics", "educational courses", "student experiments", "control engineering education", "Engineering education", "mechatronics", "multidisciplinary teaching program", "microprocessors", "product design", "mechanical engineers", "Mechatronics", "robotics"]}, {"title": "Comparing the Effectiveness of an Inverted Classroom to a Traditional Classroom in an Upper-Division Engineering Course", "link": "https://ieeexplore.ieee.org/document/6481483/", "abstract": "An inverted, or flipped, classroom, where content delivery includes video lectures watched outside of the classroom, is a method that can free classroom time for learner-centered activities such as active and problem-based learning. This study compared the effectiveness of an inverted classroom to a traditional classroom in three areas: 1) content coverage; 2) student performance on traditional quizzes and exam problems; and 3) student observations and perception of the inverted classroom format. A control-treatment experiment comparing an inverted classroom to a traditional lecture-style format was used. The results show that: 1) the inverted classroom allowed the instructor to cover more material; 2) students participating in the inverted classroom performed as well or better on comparable quiz and exam questions and on open-ended design problems; and 3) while students initially struggled with the new format, they adapted quickly and found the inverted classroom format to be satisfactory and effective.", "authors": [{"name": "Kathleen E. Cook", "affiliation": "Psychology Department, Seattle University, Seattle, Washington, United States"}, {"name": "Teodora Rutar Shuman", "affiliation": "Mechanical Engineering Department, Seattle University, Seattle, Washington, United States"}, {"name": "Gregory S. Mason", "affiliation": "Mechanical Engineering Department, Seattle University, Seattle, Washington, United States"}], "tags": ["traditional classroom", "learner-centered activity", "engineering education", "problem-solving", "Education", "Control systems", "Mechanical engineering", "active-based learning", "MATLAB", "problem-based learning", "control systems", "video lecture", "Active learning", "Problem-solving", "lecture-style format", "learning (artificial intelligence)", "upper-division engineering course", "Materials", "flipped classroom", "content coverage", "inverted classroom", "semi-supervised learning", "Integrated circuits", "computer aided instruction", "education"]}, {"title": "Increasing Students' Interest With Low-Cost CellBots", "link": "https://ieeexplore.ieee.org/document/6297491/", "abstract": "This paper introduces the use of a flexible and affordable educational robot specifically developed for the practical experimentation inherent to technological disciplines. The robot has been designed to be reconfigurable and extendible, serving as an experimental platform across several undergraduate courses. As most students have a mobile cell phone, this was used as the main control computer for the so-called CellBot, thus avoiding any need to deal with the details of microcontrollers or other embedded computing devices. Assessment results are also presented, based on a pre- and post-survey of student opinion administered to 204 science and engineering students from several universities. Among the conclusions are that 83% of the students prefer to use these low-cost robots as tools to improve their learning of the theory in several disciplines, and 71% of the students stated that they prefer to have their own robot to experiment with, instead of using a didactic kit loaned to them by the university.", "authors": [{"name": "Aquiles M. F. Burlamaqui", "affiliation": "Federal University of Rio Grande do Norte, Natal, Brazil"}, {"name": "Rafael B. Gomes", "affiliation": "Federal University of Rio Grande do Norte, Natal, Brazil"}, {"name": "Rafael V. Aroca", "affiliation": "Federal University of Rio Grande do Norte, Natal, Brazil"}, {"name": "Glauco A. P. Caurin", "affiliation": "University of São Paulo, Sao Carlos, Brazil"}, {"name": "Anderson Abner S. Souza", "affiliation": "State University of Rio Grande do Norte (UERN), Mossoro, Brazil"}, {"name": "Luiz M. G. Goncalves", "affiliation": "Federal University of Rio Grande do Norte, Natal, Brazil"}, {"name": "Dalton M. Tavares", "affiliation": "Federal University of Goias, Catalao, Brazil"}], "tags": ["educational robots", "Mobile handsets", "CellBots", "engineering education", "low cost CellBots", "Buildings", "low-cost robotics", "robotics education", "Educational institutions", "Educational robots", "educational robot", "Audio interface", "didactic kit", "undergraduate course", "embedded computing device", "low cost robots", "student interest", "mobile cell phone", "Robot sensing systems", "microcontrollers"]}, {"title": "Master's in Autonomous Systems: An Overview of the Robotics Curriculum and Outcomes at ISEP, Portugal", "link": "https://ieeexplore.ieee.org/document/6336841/", "abstract": "Robotics research in Portugal is increasing every year, but few students embrace it as one of their first choices for study. Until recently, job offers for engineers were plentiful, and those looking for a degree in science and technology would avoid areas considered to be demanding, like robotics. At the undergraduate level, robotics programs are still competing for a place in the classical engineering graduate curricula. Innovative and dynamic Master's programs may offer the solution to this gap. The Master's degree in autonomous systems at the Instituto Superior de Engenharia do Porto (ISEP), Porto, Portugal, was designed to provide a solid training in robotics and has been showing interesting results, mainly due to differences in course structure and the context in which students are welcomed to study and work.", "authors": [{"name": "José Almeida", "affiliation": "INESC TEC-INESC Technology and Science and ISEPSchool of Engineering, Polytechnic Institute of Porto, Porto, Portugal"}, {"name": "Eduardo Silva", "affiliation": "INESC TEC-INESC Technology and Science and ISEPSchool of Engineering, Polytechnic Institute of Porto, Porto, Portugal"}, {"name": "Betina Campos Neves", "affiliation": "INESC TEC-INESC Technology and Science and ISEPSchool of Engineering, Polytechnic Institute of Porto, Porto, Portugal"}, {"name": "Alfredo Martins", "affiliation": "INESC TEC-INESC Technology and Science and ISEPSchool of Engineering, Polytechnic Institute of Porto, Porto, Portugal"}, {"name": "João Paulo Baptista", "affiliation": "INESC TEC-INESC Technology and Science and ISEPSchool of Engineering, Polytechnic Institute of Porto, Porto, Portugal"}], "tags": ["educational robots", "Instituto Superior de Engenharia do Porto", "ISEP", "solid training", "autonomous systems", "classical engineering graduate curricula", "Continuing education", "Further education", "graduate research", "Control engineering systems", "further education", "Educational robots", "course structure", "Autonomous systems", "educational courses", "undergraduate level", "continuing education", "control engineering education", "Master's degree", "robotics research", "Robot kinematics", "curriculum", "masters programs", "Training", "robotics programs", "training", "masters degree", "robotics", "Robot sensing systems", "robotics curriculum"]}, {"title": "Teaching Electric Drives Control Course: Incorporation of Active Learning Into the Classroom", "link": "https://ieeexplore.ieee.org/document/6508900/", "abstract": "This paper describes an attempt to improve the educational methods of an electrical drives control lecture course by incorporating active learning strategies into the classroom. The proposed active learning strategy is based on the combined use of both sample-guided and student-oriented learning approaches and student learning assessments. The main objective of this initiative is to rapidly and easily equip undergraduate engineering students with more practical knowledge of advanced adjustable speed drives control strategies through the use of a minimal number of flexible DSP-based setups. The course organization, including the educational prerequisites and strategies, is described, and several intuitive examples devoted to modeling, simulation, and implementation of ac induction motor (IM) drive control are provided. The proposed educational method gives students an intuitive way of grasping the main concepts and offers them the opportunity to apply their knowledge and explore their problem-solving capabilities. A questionnaire elicited student feedback on the development of their knowledge and practical skills as well as their achievement of learning goals; the results of this evaluation are summarized.", "authors": [{"name": "Mehmet Dal", "affiliation": "Kocaeli MYO Electric programme, Kocaeli University, Basiskele, Kocaeli, Turkey"}], "tags": ["learning goals", "electrical engineering education", "DSP-based rapid control prototyping", "teaching", "Vectors", "electrical drive control", "course organization", "Induction motors", "power engineering education", "Mathematical model", "Educational institutions", "further education", "induction motor drives", "DSP-based rapid control prototype", "Active learning", "machine control", "educational courses", "student feedback", "Variable speed drives", "DC motors", "undergraduate engineering students", "student learning assessments", "adjustable speed drives control", "student-oriented learning", "active learning strategy", "electrical drives control lecture course", "AC induction motor drive control", "variable speed drives"]}, {"title": "Geometrical Approach to Vector Analysis in Electromagnetics Education", "link": "https://ieeexplore.ieee.org/document/6375775/", "abstract": "A geometrical approach to teaching and learning vector calculus and analysis as applied to electromagnetic fields is proposed for junior-level undergraduate electromagnetics education. For undergraduate students, electromagnetics is typically the most challenging subject in the Electrical Engineering curriculum, and the most challenging component of the subject is the application of vector analysis to electromagnetic field theory and problem solving. According to the geometrical approach, the students are taught to “read” the figure and to “translate” this to equations at all times throughout the computation or derivation, instead of their “crunching” the formulas and numbers without even visualizing the structure. In performing vector manipulations, integrals, and derivatives, the students are taught to always deal with real geometrical entities and quantities (arrows, lengths, angles, points, lines, surfaces, volumes, etc.). They learn to “translate” the geometry and the electromagnetic physics attached to it into mathematical models (equations and symbolic or numerical values) using “first mathematical principles” instead of just “black-box” formulas as a computer would do. As opposed to the traditional formal algebraic approach to vector analysis in electromagnetics, which is very general but also very abstract and dry, the geometrical approach is problem-dependent but also much more intuitive and visual, and as such can do a great deal to increase students' understanding and appreciation of vector analysis and its application to electromagnetic theory and problem solving. This is confirmed by preliminary class testing and assessment of student learning, success, and satisfaction in the courses Electromagnetic Fields I and II at Colorado State University.", "authors": [{"name": "Branislav M. Notaroš", "affiliation": "Department of Electrical and Computer Engineering, Colorado State University, Fort Collins, CO, USA"}], "tags": ["Electromagnetic scattering", "Equations", "vector analysis", "Electromagnetics", "electrical engineering education", "Education", "geometrical approach", "junior-level undergraduate electromagnetics education", "electrical engineering curriculum", "teaching", "Vectors", "electromagnetic field problem solving", "electromagnetic waves", "Visualization", "calculus", "learning", "electromagnetic field theory", "mathematical models", "educational courses", "algebra", "vector calculus", "black-box formulas", "geometrical and visual approach", "Colorado State University", "Electromagnetics education", "electromagnetic fields", "electromagnetics education", "crunching", "undergraduate students", "educational institutions", "Force", "undergraduate fields courses", "electromagnetic physics"]}, {"title": "Game-Console-Based Projects for Learning the Computer Input/Output Subsystem", "link": "https://ieeexplore.ieee.org/document/6502274/", "abstract": "The input/output (I/O) subsystem is an important topic within computer architecture (CA) because it determines how the computer interacts with its environment. For this reason, computer scientists and engineers must understand how the computer manages this interaction, which is usually taught in introductory CA courses. Of course, there are many different styles of teaching, ranging from purely theoretical to completely practical. The CA course considered in this paper has already applied a practical approach for some time. For the I/O subsystem, students must be able to describe what polling and interrupts are and handle them through low-level programming. However, programming at this level in operating system (OS)-driven computers is not possible without being familiar with the kernel and drivers, which is not usually the case for students in an introductory course. Fortunately, there are many bare and specialized embedded systems around that are not OS-driven. In this proposal, the Nintendo DS (NDS) console was used in a classroom setting. It proved to be an appropriate infrastructure for developing attractive and engaging projects and was useful in providing a better understanding of the mechanisms related to the I/O subsystem. At the same time, the teaching methods were altered to make the transition from classical, passive, lecture-based classes to an active project-based learning (PBL) approach. It has been a very rewarding experience to see students learning to control the NDS devices on their own. In addition to describing the implementation of the proposed changes in two subsequent school years, this paper also presents some data and conclusions.", "authors": [{"name": "José F. Lukas", "affiliation": "Department of Research Methods and Educational Diagnose, UPV/EHU, Donostia-San Sebastian"}, {"name": "Edurne Larraza-Mendiluze", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "Txelo Ruiz-Vázquez", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "Javier Muguerza", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "Iratxe Soraluze", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "José I. Martín", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "Nestor Garay-Vitoria", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "Karlos Santiago", "affiliation": "Department of Research Methods and Educational Diagnose, UPV/EHU, Donostia-San Sebastian"}], "tags": ["computer science education", "NDS devices", "PBL approach", "operating systems (computers)", "theoretical teaching", "project-based learning (PBL)", "computer architecture", "low-level programming", "Registers", "teaching", "input/output (I/O) subsystem", "Nintendo DS console", "computer input/output subsystem", "lecture-based classes", "game console", "Proposals", "classical classes", "NDS console", "Educational institutions", "Computing education", "OS-driven computers", "active project-based learning", "programming", "educational courses", "introductory CA courses", "classroom setting", "I/O subsystem", "Games", "embedded systems", "operating system", "students learning", "Nintendo DS (NDS)", "Hardware", "Computers", "computer games", "game-console-based projects", "practical teaching", "computer aided instruction", "passive classes"]}, {"title": "Using Game-Based Cooperative Learning to Improve Learning Motivation: A Study of Online Game Use in an Operating Systems Course", "link": "https://ieeexplore.ieee.org/document/6243239/", "abstract": "Many researchers have studied the use of game-based learning. Game-based learning takes many forms, including virtual reality, role playing, and performing tasks. For students to learn specific course content, it is important that the selected game be suited to the course. Thus far, no studies have investigated the use of game-based cooperative learning in an operating systems course. For this study, an online game was developed to enable students to learn cooperatively. The findings indicate that students' desire to win the game motivates them to learn from online course materials before they play, which in turn can enable them to achieve better learning outcomes.", "authors": [{"name": "Chien-Hung Lai", "affiliation": "Department of Information and Computer Engineering, Chung Yuan Christian University, Taoyuan, Taiwan"}, {"name": "Cheng-Yu Lu", "affiliation": "Department of Information and Computer Engineering, Chung Yuan Christian University, Taoyuan, Taiwan"}, {"name": "Bin-Shyan Jong", "affiliation": "Department of Information and Computer Engineering, Chung Yuan Christian University, Taoyuan, Taiwan"}, {"name": "Yen-Teh Hsia", "affiliation": "Department of Information and Computer Engineering, Chung Yuan Christian University, Taoyuan, Taiwan"}, {"name": "Tsong-Wuu Lin", "affiliation": "Department of Computer Science and Information Management, Soochow University, Taipei, Taiwan"}], "tags": ["computer science education", "Operating systems", "operating systems (computers)", "Cooperative learning", "Computer science education", "learning motivation improvement", "course content", "learning achievement", "Computer aided instruction", "human computer interaction", "online game use", "game-based cooperative learning", "Human computer interaction", "educational courses", "virtual reality", "role playing", "learning motivation", "Virtual reality", "online course materials", "computer games", "game questionnaire", "operating systems course", "game-based learning", "computer aided instruction", "behavioural sciences computing", "performing tasks"]}, {"title": "An Online Graduate Requirements Engineering Course", "link": "https://ieeexplore.ieee.org/document/6253277/", "abstract": "Requirements engineering is one of the fundamental knowledge areas in software and systems engineering graduate curricula. Recent changes in educational delivery and student demographics have created new challenges for requirements engineering education. In particular, there is an increasing demand for online education for working professionals. This paper describes a graduate requirements engineering course designed to address these new dynamics while aligning learning objectives with the prevailing body of knowledge and professional practices.", "authors": [{"name": "Phillip A. Laplante", "affiliation": "School of Graduate Professional Studies, Pennsylvania State University, Malvern, PA, USA"}, {"name": "Nil Kilicay-Ergin", "affiliation": "School of Graduate Professional Studies, Pennsylvania State University, Malvern, PA, USA"}], "tags": ["computer science education", "Industries", "software engineering graduate curricula", "Software", "asynchronous online education", "Education", "online education demand", "Adult learner", "graduate requirements engineering course", "distance learning", "Context", "formal verification", "learning objectives", "formal specification", "educational delivery", "educational courses", "systems engineering graduate curricula", "Knowledge engineering", "systems analysis", "Systems engineering and theory", "professional students", "Software engineering", "working professionals", "professional practices", "student demographics", "knowledge practices", "online graduate requirements engineering course", "fundamental knowledge areas", "professional aspects", "computer aided instruction"]}, {"title": "Power Block Geometry Applied to the Building of Power Electronics Converters", "link": "https://ieeexplore.ieee.org/document/6248715/", "abstract": "This paper proposes a new methodology, Power Block Geometry (PBG), for the presentation of power electronics topologies that process ac voltage. PBG's strategy uses formal methods based on a geometrical representation with particular rules and defines a universe with axioms and conjectures to establish a formation law. It allows power electronics configurations observed in the technical literature to be obtained by just following PBG's proposed rules, taking a systematic approach and using the familiar concept of connection blocks. Such an approach provides the formal outline needed for a comprehensive didactic presentation .", "authors": [{"name": "Edison Roberto Cabral da Silva", "affiliation": "Electrical Engineering Department, Federal University of Campina Grande, Campina Grande, Brazil"}, {"name": "Euzeli Cipriano dos Santos", "affiliation": "Department of Electrical and Computer Engineering, Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA, Electrical Engineering Department, Federal University of Campina Grande, Campina Grande, Brazil"}], "tags": ["power block geometry", "dc–ac power converter", "formation law", "Voltage control", "axiom", "Capacitors", "Control systems", "DC-AC power converter", "pulse width modulation converter", "geometrical representation", "power electronics topology", "power electronics converter", "PWM power convertors", "energy conversion", "Power electronics", "Shape", "power control", "formal method", "conjecture", "Geometry", "pulse width modulation converters", "power electronics", "Topology", "DC-AC power convertors", "PBG strategy"]}, {"title": "Circuits Kit K–12 Outreach: Impact of Circuit Element Representation and Student Gender", "link": "https://ieeexplore.ieee.org/document/6353606/", "abstract": "Outreach to K-12 schools is important for attracting students to electrical engineering. Circuits kits provide K-12 students hands-on interactions with electrical circuits. The goal of this experimental study was to investigate the effects of two types of electrical circuit element representations on the self-reported perceptions of the outreach activity and learning of elementary and high school students. In the abstract representation type, the circuit elements were marked with the standard engineering symbols. In the concrete representation type, the circuit elements, such as batteries and light bulbs, were familiar to the students. Perceived student enjoyment, understanding, and cognitive load were assessed through surveys. Student learning was measured with a post-test. The impacts of student gender and developmental level were also analyzed. Results indicate that for elementary school students, the concrete representation led to higher understanding ratings and lower cognitive load ratings than the abstract representation, while there was no difference in student learning between the two representation conditions. For high school students, there were no significant differences in student perceptions or learning between the two representation conditions. However, male high school students gave significantly higher interest and understanding ratings as well as lower cognitive load ratings than their female counterparts, even though there was no significant difference in student learning between the genders. Elementary school students reported higher enjoyment for the circuits kit activity and higher cognitive load than the high school students.", "authors": [{"name": "Kristen L. Bishop", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Jana Reisslein", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Justin Harvey", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Gamze Ozogul", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Amy M. Johnson", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}, {"name": "Martin Reisslein", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, AZ, USA"}], "tags": ["Electrical engineering", "electrical engineering education", "student learning", "circuits kit K-12 outreach", "Circuit element representation", "electrical circuits kit", "developmental level", "cognitive load ratings", "Standards", "K-12 students", "Educational institutions", "K–12 outreach, student gender", "cognitive load", "high school students", "Batteries", "K-12 schools", "student perceptions", "electrical circuits", "Concrete", "student gender", "networks (circuits)", "electrical engineering", "Abstracts", "circuit element representation", "Resistance"]}, {"title": "An Embedded Systems Laboratory to Support Rapid Prototyping of Robotics and the Internet of Things", "link": "https://ieeexplore.ieee.org/document/6375774/", "abstract": "This paper describes a new approach for a course and laboratory designed to allow students to develop low-cost prototypes of robotic and other embedded devices that feature Internet connectivity, I/O, networking, a real-time operating system (RTOS), and object-oriented C/C++. The application programming interface (API) libraries provided permit students to work at a higher level of abstraction. A low-cost 32-bit SOC RISC microcontroller module with flash memory, numerous I/O interfaces, and on-chip networking hardware is used to build prototypes. A cloud-based C/C++ compiler is used for software development. All student files are stored on a server, and any Web browser can be used for software development. Breadboards are used in laboratory projects to rapidly build prototypes of robots and embedded devices using the microcontroller, networking, and other I/O subsystems on small breakout boards. The commercial breakout boards used provide a large assortment of modern sensors, drivers, display ICs, and external I/O connectors. Resources provided include eBooks, laboratory assignments, and extensive Wiki pages with schematics and sample microcontroller application code for each breakout board.", "authors": [{"name": "Gijsbert M. E. van Bekkum", "affiliation": "Google, Inc., Mountain View, CA, USA"}, {"name": "James O. Hamblen", "affiliation": "School of Electrical and Computer Engineering, Georgia Institute of Technology, Atlanta, GA, USA"}], "tags": ["breakout boards", "Internet of Things", "laboratory assignments", "electrical engineering education", "embedded systems laboratory", "embedded devices", "application program interfaces", "object-oriented C", "Program processors", "microcontroller", "I-O interfaces", "system-on-chip", "object-oriented C++", "32-bit SOC RISC microcontroller module", "robots", "program compilers", "flash memory", "display IC", "Internet connectivity", "educational courses", "online front-ends", "application programming interface libraries", "I-O subsystems", "rapid prototyping support", "Internet-of-things", "Wiki pages", "embedded systems", "RTOS", "API", "cloud-based C++ compiler", "Electronic publishing", "Design project", "control engineering computing", "electrical engineering computing", "real-time operating system (RTOS)", "mechatronics", "cloud computing", "networking", "Hardware", "cloud-based C compiler", "breadboards", "microprocessor", "C++ language", "Internet", "Information services", "eBooks", "software development", "Robots", "software prototyping", "real-time operating system", "Laboratories", "Web browser", "input-output programs", "robotics", "microcontroller application code", "external I-O connectors", "computer aided instruction", "onchip networking hardware", "microcontrollers"]}, {"title": "A One-Year Introductory Robotics Curriculum for Computer Science Upperclassmen", "link": "https://ieeexplore.ieee.org/document/6335453/", "abstract": "This paper describes a one-year introductory robotics course sequence focusing on computational aspects of robotics for third- and fourth-year students. The key challenges this curriculum addresses are scalability, i.e., how to teach a robotics class with a limited amount of hardware to a large audience,student assessment, i.e., how to assess the students' success on robotic design and programming assignments, and depth versus breadth, i.e., how to down-select content from the interdisciplinary field of robotics to computer science students. This is achieved by combining simulation-based laboratory assignments, which can be conducted anywhere and anytime, with compatible hardware devices that allow a seamless transition from simulation to real hardware, and a focus on performance-based assessment with an open-ended final project/competition. Content learning and retention is assessed for a subset of students who successfully went through the proposed curriculum. All class materials as well as hardware-in particular, a low-cost, highly articulated robotic arm developed for teaching advanced robotics concepts-are open-source and available online.", "authors": [{"name": "David Coleman", "affiliation": "Department of Computer Science, University of Colorado, Boulder, Boulder, CO, USA"}, {"name": "Rowan Wing", "affiliation": "Department of Computer Science, University of Colorado, Boulder, Boulder, CO, USA"}, {"name": "Nikolaus Correll", "affiliation": "Department of Computer Science, University of Colorado, Boulder, Boulder, CO, USA"}], "tags": ["computer science education", "robotic design", "performance-based assessment", "educational robots", "depth versus breadth", "simulation-based laboratory assignment", "Education", "hardware device", "Computer science education", "content retention", "computer science upperclassmen", "content learning", "Educational robots", "Computer science", "one-year introductory robotics curriculum", "control engineering education", "robot programming", "Simultaneous localization and mapping", "Hardware", "robotic programming assignment", "robotic arm", "computer aided instruction"]}, {"title": "Teaching Robotics Software With the Open Hardware Mobile Manipulator", "link": "https://ieeexplore.ieee.org/document/6331578/", "abstract": "The open hardware mobile manipulator (OHMM) is a new open platform with a unique combination of features for teaching robotics software and algorithms. On-board low- and high-level processors support real-time embedded programming and motor control, as well as higher-level coding with contemporary libraries. Full hardware designs and software source codes are available under free licenses enabling the community to adapt and update the design as the field (and available hardware) evolves. Digital manufacturing (3-D printing and laser cutting) methods, now available as low-cost Internet services, enable OHMM to be easily modified and to be built from scratch for a competitive price. Five hands-on curriculum modules are presented that use OHMM to teach robotics software and algorithms at the undergraduate and graduate levels, and results are presented based on student performance and feedback.", "authors": [{"name": "Marsette Vona", "affiliation": "College of Computer and Information Science, Northeastern University, Boston, MA, USA"}, {"name": "N.H. Shekar", "affiliation": "College of Computer and Information Science, Northeastern University, Boston, MA, USA"}], "tags": ["manipulators", "on-board low-level processor", "OHMM", "Education", "Digital manufacturing", "on-board high-level processor", "laser beam cutting", "teaching", "software source code", "Program processors", "visual servoing", "open hardware mobile manipulator", "higher-level coding", "Educational robots", "real-time embedded programming", "educational robot", "embedded computing", "open platform", "mobile robots", "control engineering education", "hands-on curriculum module", "hardware design", "robot programming", "open hardware", "control engineering computing", "open systems", "robotics software teaching", "digital manufacturing", "Hardware", "Internet service", "3D printing", "Internet", "laser cutting", "motor control", "mobile manipulation", "Cameras", "machine control"]}]