[{"title": "A Study on the Difficulties of Learning Phase Transition in Object-Oriented Analysis and Design From the Viewpoint of Semantic Distance", "link": "https://ieeexplore.ieee.org/document/6857435/", "abstract": "Students in object-oriented analysis and design (OOAD) courses typically encounter difficulties transitioning from object-oriented analysis (OOA) to logical design (OOLD). This study conducted an empirical experiment to examine these learning difficulties by evaluating differences between OOA-to-OOLD and OOLD-to-object-oriented-physical-design (OOPD) transitions from the perspective of semantic distance in the context of semantic network theory. The experimental results indicated that two factors inhibit the learning of OOA-to-OOLD transition: the semantic distance between phases and the precise degree of transition relations. The OOA-to-OOLD transition exhibits a greater semantic distance than the OOLD-to-OOPD transition, which causes difficulty in retrieving and understanding the semantics of OOA-to-OOLD transition relations. OOA-to-OOLD transition relations are less precise, which causes learners to have difficulty in developing efficient schema acquisition and automation when learning OOA-to-OOLD transition. These results provide further insight into the cognitive processes of learners who are learning phase transition. This may guide educators to develop an effective learning instruction method for phase transition and motivate researchers to remedy the inherent deficiency of phase transition in OOAD by considering the cognitive processes of developers.", "authors": [{"name": "Shin-Shing Shin", "affiliation": "Information Science and Management Systems, National Taitung University, Taitung, Taiwan, R.O.C."}], "tags": ["object-oriented methods", "semantic network theory", "Automation", "semantic distance", "Object-oriented analysis and design", "computer science education", "OOA-to-OOLD transition learning", "semantic networks", "network theory (graphs)", "Unified modeling language", "OOPD transitions", "cognition", "phase transition", "learning phase transition", "object-oriented analysis and design courses", "OOLD-to-object-oriented-physical-design transitions", "Object oriented modeling", "Semantics", "Problem-solving", "educational courses", "learning instruction method", "OOA-to-OOLD transition relations", "cognitive processes", "Computational modeling", "OOAD courses", "object-oriented analysis and logical design", "Materials"]}, {"title": "DSP-Based Hands-On Laboratory Experiments for Photovoltaic Power Systems", "link": "https://ieeexplore.ieee.org/document/6823188/", "abstract": "This paper presents a new photovoltaic (PV) power systems laboratory module that was developed to experimentally reinforce students' understanding of design principles, operation, and control of photovoltaic power conversion systems. The laboratory module is project-based and is designed to support a renewable energy course. By using MATLAB real-time software tools in combination with digital signal processor (DSP) hardware tools, the module enables students to: 1) design and build dc-dc and dc-ac power converters; 2) design and implement control algorithms for maximum power point tracking (MPPT) and voltage and current regulation; and 3) design and fabricate a printed circuit board for voltage and current sensing, isolation, and gate driving. In these hands-on experiments, by designing and building their hardware and software integrated systems themselves, students learn by doing and experience the engineering transformative process of building a product out of an idea. This paper is motivated by the dearth of literature on the application of project-based learning methodology to PV systems. The module description, the pedagogical and evaluation methodologies adopted, and reflections on the implementations are discussed.", "authors": [{"name": "Ameen Gargoom", "affiliation": "Centre for Renewable Energy and Power Systems, University of Tasmania, Hobart, Australia"}, {"name": "Md. Enamul Haque", "affiliation": "Centre for Renewable Energy and Power Systems, University of Tasmania, Hobart, Australia"}, {"name": "Michael Negnevitsky", "affiliation": "University of Tasmania, Hobart, TAS, AU"}, {"name": "Polycarp I. Muoka", "affiliation": "Centre for Renewable Energy and Power Systems, University of Tasmania, Hobart, Australia"}], "tags": ["digital signal processor hardware", "printed circuits", "Voltage control", "dc-dc power converters", "voltage sensing", "dc–dc power conversion", "hardware integrated systems", "MATLAB real-time software tools", "DC-DC power convertors", "project-based learning methodology", "Logic gates", "Sensors", "Software", "digital signal processors", "Switches", "current sensing", "Laboratories", "DC-AC power convertors", "maximum power point tracking", "software integrated systems", "dc-ac power converters", "photovoltaic power systems laboratory module", "design principles", "maximum power point trackers", "DSP hardware tools", "DSP-based hands-on laboratory", "photovoltaic power systems", "energy conversion", "PV systems", "photovoltaic power conversion systems", "digital signal processing chips"]}, {"title": "ReAct!: An Interactive Educational Tool for AI Planning for Robotics", "link": "https://ieeexplore.ieee.org/document/6807834/", "abstract": "This paper presents ReAct!, an interactive educational tool for artificial intelligence (AI) planning for robotics. ReAct! enables students to describe robots' actions and change in dynamic domains without first having to know about the syntactic and semantic details of the underlying formalism, and to solve planning problems using state-of-the-art reasoners without having to know about their input/output language or usage. In particular, ReAct! can be used to represent sophisticated dynamic domains that feature concurrency, indirect effects of actions, and state/transition constraints. ReAct! also allows the embedding of externally defined calculations (e.g., checking for collision-free continuous trajectories) into domain representations of hybrid domains that require a tight integration of (discrete) high-level reasoning with (continuous) geometric reasoning. ReAct! also allows students to solve planning problems that involve complex temporal goals. This broad applicability, and the intelligent interactive user interface, mean that students can work on interesting and challenging domains, ranging from service robotics to cognitive factories, leading to hands-on robotic applications. The efficacy of ReAct! was evaluated from three different points of view: 1) the course outcomes that demonstrate its utility in achieving the learning objectives of a research-oriented cognitive robotics course; 2) the user friendliness and usefulness of ReAct! for students, as evaluated by quantitative student surveys; and 3) instructors' experience of teaching the course either with or without ReAct!.", "authors": [{"name": "Volkan Patoglu", "affiliation": "Faculty of Engineering and Natural Sciences, Sabancı University, İstanbul, Turkey"}, {"name": "Esra Erdem", "affiliation": "Faculty of Engineering and Natural Sciences, Sabancı University, İstanbul, Turkey"}, {"name": "Zeynep Dogmus", "affiliation": "Faculty of Engineering and Natural Sciences, Sabancı University, İstanbul, Turkey"}], "tags": ["cognitive factories", "research-oriented cognitive robotics course", "spatial reasoning", "AI planning", "control engineering computing", "hybrid planning", "Education", "automated reasoning", "state-transition constraints", "Planning", "geometric reasoning", "user interfaces", "Cognitive robotics", "artificial intelligence planning", "knowledge representation", "interactive educational tool", "Cognition", "Educational robots", "quantitative student surveys", "educational courses", "teaching", "high-level reasoning", "indirect action effects", "instructor teaching experience", "interactive systems", "ReAct", "Artificial intelligence", "intelligent interactive user interface", "Artificial intelligence (AI) planning", "planning (artificial intelligence)", "robot actions", "robotics", "dynamic domains", "computer aided instruction", "concurrency", "service robotics", "educational robots", "control engineering education"]}, {"title": "Teaching Sustainable Energy and Power Electronics to Engineering Students in a Laboratory Environment Using Industry-Standard Tools", "link": "https://ieeexplore.ieee.org/document/6891372/", "abstract": "Power electronics and renewable energy are two important topics for today's power engineering students. In many cases, the two topics are inextricably intertwined. As the renewable energy sector grows, the need for engineers qualified to design such systems grows as well. In order to train such engineers, new courses are needed that highlight the unique engineering challenges presented by renewable energy systems. This paper presents the theory, implementation, and assessment of a new laboratory course designed to teach power electronics and renewable energy to engineering students. A key element of the course is the use of real renewable energy systems in the laboratory setting. Students design, test, and troubleshoot power electronic circuits (such as dc/dc converters and pulse-width-modulated inverters) with tools used widely in industry (such as MATLAB/Simulink and dSPACE digital signal processors). Ten unique experiments are presented, as well as detailed descriptions of two open-ended design projects: a maximum power point tracker for a photovoltaic array and a full converter for a permanent-magnet wind turbine. Results from students' work on the experiments and final projects, as well as an assessment of the effectiveness of the course based on pre- and post-testing, are also presented.", "authors": [{"name": "David S. Ochs", "affiliation": "General Motors Powertrain, Pontiac, MI, USA"}, {"name": "Ruth Douglas Miller", "affiliation": "Department of Electrical and Computer Engineering, Kansas State University, Manhattan, KS, USA"}], "tags": ["electrical engineering education", "power converter", "Inverters", "sustainable development", "dc/dc power converters", "Maximum power point trackers", "permanent-magnet wind turbine", "Renewable energy sources", "Laboratories", "Software packages", "ac/dc power converters", "laboratory environment", "sustainable energy teaching", "photovoltaic array", "renewable energy system", "solar cell arrays", "student experiments", "renewable energy sources", "educational courses", "teaching", "open-ended design project", "maximum power point tracker", "industry-standard tool", "maximum power point trackers", "wind turbines", "power engineering student", "Wind turbines", "power electronic teaching", "power electronics", "converters", "troubleshoot power electronic circuit", "power engineering education"]}, {"title": "Experimental Evaluation of a Serious Game for Teaching Software Process Modeling", "link": "https://ieeexplore.ieee.org/document/7072571/", "abstract": "Software process modeling (SPM) is an important area of software engineering because it provides a basis for managing, automating, and supporting software process improvement (SPI). Teaching SPM is a challenging task, mainly because it lays great emphasis on theory and offers few practical exercises. Furthermore, as yet few teaching approaches have aimed at teaching SPM by introducing innovative features, such as games. The use of games has mainly been focused on other areas of software engineering, for example software project management. In an attempt to fill this gap, this paper describes a formal experiment carried out to assess the learning effectiveness of a serious game (DesigMPS), designed to support the teaching of SPM, and to compare game-based learning with a project-based learning method. In the DesigMPS game, the student models a software process from an SPI perspective, based on the Brazilian SPI model (MPS.BR). The results indicate that playing the game can have a positive learning effect and results in a greater degree of learning effectiveness than does the project-based learning instructional method.", "authors": [{"name": "Rafael Oliveira Chaves", "affiliation": "Federal University of Pará, Instituto de Tecnologia, Pará, Belém, Brazil"}, {"name": "Julio Cezar Costa Furtado", "affiliation": "Department of Exact Sciences and Technology, Federal University of Amapá, Amapá, Macapá, Brazil"}, {"name": "Christiane Gresse von Wangenheim", "affiliation": "Department of Informatics and Statistics, Federal University of Santa Catarina, Santa Catarina, Florianópolis, Brazil"}, {"name": "Sandro Ronaldo Bezerra Oliveira", "affiliation": "Federal University of Pará, Instituto de Tecnologia, Pará, Belém, Brazil"}, {"name": "Eloi Luiz Favero", "affiliation": "Federal University of Pará, Instituto de Tecnologia, Pará, Belém, Brazil"}, {"name": "Alex Santos", "affiliation": "Biostatistical Institute-Biostatistical, Pará, Belém, Brazil"}], "tags": ["software process improvement", "software engineering", "Software engineering", "Training", "software process modeling", "software engineering education", "Software", "Project-based learning", "serious game", "DesigMPS game", "Software measurement", "serious games (computing)", "SPM", "project-based learning method", "software project management", "game-based learning", "Brazilian SPI model", "Games", "computer aided instruction", "Computational modeling"]}, {"title": "Approaches and Tools Used to Teach the Computer Input/Output Subsystem: A Survey", "link": "https://ieeexplore.ieee.org/document/6777580/", "abstract": "This paper surveys how the computer input/output (I/O) subsystem is taught in introductory undergraduate courses. It is important to study the educational process of the computer I/O subsystem because, in the curricula recommendations, it is considered a core topic in the area of knowledge of computer architecture and organization (CAO). It is also a basic knowledge to be acquired in order to work in areas such as human-computer interaction (HCI) or embedded systems. Examination questions, course syllabi, and textbooks were analyzed to identify which teaching approaches are being used. Individuals teaching the I/O subsystem could choose between the options explained here, according to their intended learning outcomes. In addition, a literature survey was conducted on the development and use of tools to improve student understanding of I/O and to make the topic less abstract and more attractive. A goal is to indicate to computing education researchers that the majority of the literature reports experiences in developing or using different resources or educational methodologies, but that these are not based on a theory of learning.", "authors": [{"name": "Edurne Larraza-Mendiluze", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "Nestor Garay-Vitoria", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}], "tags": ["examination questions", "Programming", "Computer architecture", "Computers", "computer science education", "human-computer interaction", "undergraduate courses", "Hardware", "curricula", "student I/O understanding improvement", "CAO", "educational methodologies", "educational process", "survey", "computer input/output subsystem teaching", "further education", "embedded systems", "computer I/O subsystem", "Organizations", "educational courses", "Educational institutions", "teaching", "human computer interaction", "computer architecture", "HCI", "computer architecture-and-organization", "education", "curricula recommendations", "computer aided instruction", "computer input/output subsystem", "course textbooks", "course syllabi"]}, {"title": "Design of a Microlecture Mobile Learning System Based on Smartphone and Web Platforms", "link": "https://ieeexplore.ieee.org/document/6949155/", "abstract": "This paper first analyzes the concept and features of microlecture, mobile learning, and ubiquitous learning, then presents the combination of microlecture and mobile learning, to propose a novel way of micro-learning through mobile terminals. Details are presented of a microlecture mobile learning system (MMLS) that can support multiplatforms, including PC terminals and smartphones. The system combines intelligent push, speech recognition, video annotation, Lucene full-text search, clustering analysis, Android development, and other technologies. The platform allows learners to access microlecture videos and other high-quality microlecture resources wherever and whenever they like, in whatever time intervals they have available. Teachers can obtain statistical analysis results of the microlecture in MMLS to provide teaching/learning feedback and an effective communication platform. MMLS promotes the development of microlecture and mobile learning. A statistical analysis of the implementation of the system shows that students using MMLS to assist their learning had improved results on their final exams and gave a higher evaluation of the curriculum than those who did not. The advantages and disadvantages of MMLS are also analyzed.", "authors": [{"name": "Junfei Zhang", "affiliation": "Information Technology Teaching and Research Department, Guangzhou Medical University, Guangzhou, Guangdong, China"}, {"name": "Chuanxue Wen", "affiliation": "Information Technology Teaching and Research Department, Guangzhou Medical University, Guangzhou, Guangdong, China"}], "tags": ["video annotation", "Indexes", "Android development", "mobile learning", "Mobile communication", "Internet", "Android", "Android (operating system)", "teaching feedback", "ubiquitous learning", "Learning systems", "clustering analysis", "microlecture", "Lucene full-text search", "microlecture videos", "Educational institutions", "teaching", "Web platforms", "smart phone", "MMLS", "high-quality microlecture resources", "microlecture mobile learning system", "intelligent push", "Servers", "statistical analysis", "Streaming media", "interactive video", "smartphone", "learning feedback", "speech recognition"]}, {"title": "Editor-in-Chief’s Introduction to “Development of a Taxonomy of Keywords for Engineering Education Research”", "link": "https://ieeexplore.ieee.org/document/7312382/", "abstract": "Presents an editorial that explains the availability of a taxonomy report which presents a controlled vocabulary for keywords and metadata for engnineering education.", "authors": [{"name": "Jeffrey E. Froyd", "affiliation": "Texas A&M University, College Station, TX, USA"}], "tags": ["Taxonomy", "Engineering education"]}, {"title": "Comments on “Fair and Square Computation of Inverse $\\cal Z$-Transforms of Rational Functions”", "link": "https://ieeexplore.ieee.org/document/6807827/", "abstract": "In the recent paper “Fair and Square Computation of Inverse Ƶ-Transforms of Rational Functions” (IEEE Trans. Educ., vol. 55, no. 2, pp. 285-290, May 2012), Moreira and Basilio present methods for finding the inverse Ƶ-transform of a rational function X(z), which has: 1) poles at the origin of the z-plane, and 2) multiple poles anywhere in the z-plane. Compared to their methods, it is shown here that the partial fraction expansion method for inversion of Ƶ-transforms can be used to take care of both the cases in a simpler manner. For the case of multiple poles, some easier alternatives to the laborious multiple differentiation formula, as prescribed in textbooks, are presented. These have been applied in courses taught by the author and have proved to be student-friendly .", "authors": [{"name": "Suhash C. Dutta Roy", "affiliation": "Department of Electrical Engineering, Indian Institute of Technology Delhi, Hauz Khas, New Delhi, India"}], "tags": ["Digital signal processing", "Laplace equations", "Indexes", "partial fraction expansion", "Standards", "signals and systems", "inverse transforms", "textbooks", "differentiation", "inverse Z-transforms", "rational functions", "multiple poles", "teaching", "partial fraction expansion method", "inversion", "multiple differentiation formula", "Real-time systems", "$\\cal Z$-transforms", "Equations", "physics education"]}, {"title": "Joint Editors' Introduction to the Special Report \"Development of a Taxonomy of Keywords for Engineering Education Research\"", "link": "https://ieeexplore.ieee.org/document/7313593/", "abstract": "As the engineering education literature has proliferated across disciplines and continents, the growing number of publications has become difficult to navigate. Recognizing the need to better find and organize publications, authors, and reviewers, Doctors Cindy Finelli and Maura Borrego led an inclusive effort to develop a taxonomy of engineering education terms from a United States perspective. They conducted workshops in several countries and drew on our expertise in an advisory capacity. The resulting taxonomy has the potential to connect engineering education scholarship worldwide.We are pleased to jointly publish this report on the development of the taxonomy, to reach all of our journals' audiences.", "authors": [{"name": "Ahmad Ibrahim", "affiliation": ""}, {"name": "Les Dawes", "affiliation": ""}, {"name": "Michael C. Lou", "affiliation": ""}, {"name": "Erik de Graaff", "affiliation": ""}, {"name": "Jeffrey E. Froyd", "affiliation": ""}], "tags": ["Taxonomy", "Engineering education"]}, {"title": "An Interactive Computer-Aided Instructional Strategy and Assessment Methods for System Identification and Adaptive Control Laboratory", "link": "https://ieeexplore.ieee.org/document/7069181/", "abstract": "This study describes a set of real-time interactive experiments that address system identification and model reference adaptive control (MRAC) techniques. In constructing laboratory experiments that contribute to efficient teaching, experimental design and instructional strategy are crucial, but a process for doing this has yet to be defined. This paper is an attempt towards filling this gap. Its contributions are: 1) to describe a sample set of experiments for both senior undergraduate- and graduate-level students, to strengthen their understanding of system identification and control; 2) to help instructors wishing to set up a laboratory with an interactive learning strategy; and 3) to propose a set of assessment criteria for engineering accreditation in system identification and control laboratories. A benefit of this paper for engineering educators is that it provides a roadmap for transferring complex theory problems into prototypes in the laboratory. Furthermore, the instructional strategies proposed can easily be adapted to other engineering courses.", "authors": [{"name": "İlyas Eker", "affiliation": "Electrical and Electronics Engineering Department, Çukurova University, Adana, Turkey"}, {"name": "Necdet Sinan Özbek", "affiliation": "Electrical and Electronics Engineering Department, Adana Science and Technology University, Adana, Turkey"}], "tags": ["adaptive control laboratory", "identification", "Adaptive control", "Control engineering education", "system identification", "Laboratories", "further education", "interactive learning strategy", "interactive computer-aided instructional strategy", "model reference adaptive control", "MRAC technique", "Mathematical model", "interactive graphical user interface (GUI)", "assessment method", "model reference adaptive control techniques", "model reference adaptive control systems", "computer aided instruction", "Analytical models", "Adaptation models", "Graphical user interfaces", "Computational modeling", "control engineering education"]}, {"title": "Addressing Electronic Communications System Learning Through a Radar-Based Active Learning Project", "link": "https://ieeexplore.ieee.org/document/7056574/", "abstract": "In the Master's of Telecommunication Engineering program at the University of Deusto, Spain, courses in communication circuit design, electronic instrumentation, advanced systems for signal processing and radiocommunication systems allow students to acquire concepts crucial to the fields of electronics and communication. During the educational project presented in this paper, students build a continuous-wave frequency-modulation (CWFM) Doppler radar system from components as simple as ordinary cocoa cans and common electronics components placed on a breadboard without any soldering. One of the goals of the project is to stimulate students' interest in building an entire, completely functional communication system that integrates the knowledge acquired in the various courses and whose functioning they can check in real scenarios. This paper describes this learning project and the ways in which it helps students understand and connect all the concepts that underlie a fully operative communications system, thus meeting the competencies and learning outcomes of the courses involved in the project.", "authors": [{"name": "J. Emilio Rodríguez-Seco", "affiliation": "Telecommunications, University of Deusto, Spain"}, {"name": "Unai Hernandez-Jayo", "affiliation": "Telecommunications, University of Deusto, Spain"}, {"name": "Juan-Manuel López-Garde", "affiliation": "Telecommunications, University of Deusto, Spain"}], "tags": ["Spain", "FM radar", "electronic instrumentation", "signal processing", "CWFM Doppler radar system", "continuous-wave frequency-modulation (CWFM) radar", "electronic engineering education", "continuous-wave frequency-modulation Doppler radar system", "radar-based active learning project", "radiocommunication system", "telecommunication engineering program", "Laboratories", "Embedded systems", "CW radar", "Radar", "Educational institutions", "educational courses", "radar signal processing", "Doppler radar", "University of Deusto", "Active learning", "communication electronics", "Radio frequency", "addressing electronic communication system learning", "Instruments", "instrumentation"]}, {"title": "Electrical Machines Laminations Magnetic Properties: A Virtual Instrument Laboratory", "link": "https://ieeexplore.ieee.org/document/6894641/", "abstract": "Undergraduate courses in electrical machines often include an introduction to their magnetic circuits and to the various magnetic materials used in their construction and their properties. The students must learn to be able to recognize and compare the permeability, saturation, and losses of these magnetic materials, relate each material to its specific properties, and understand the impact of these properties on the major performance metrics of electrical machines. This paper describes a new test equipment setup and lab guide that helps students achieve these learning goals. The test equipment consists of two transformers of grain-oriented and non-grain-oriented electrical steel, transducers, a data acquisition (DAQ) board and a PC-based virtual instrument. The virtual instrument shows voltage, current, and core flux time waveforms, the rms voltage versus current curves and, most importantly, the lamination material magnetic cycle. Students' laboratory work was organized into a series of experiments that guide their achievement of these magnetic materials-related abilities. Pre- and post-lab exams assessed student learning, which was shown to have increased significantly. Students' opinions of the relevance, usefulness, and motivational effect of the laboratory were also positive.", "authors": [{"name": "Ruben Puche-Panadero", "affiliation": "Electrical Engineering Department, Polytechnic University of Valencia, Valencia, Spain"}, {"name": "Jose Roger-Folch", "affiliation": "Electrical Engineering Department, Polytechnic University of Valencia, Valencia, Spain"}, {"name": "Angel Sapena-Baño", "affiliation": "Electrical Engineering Department, Polytechnic University of Valencia, Valencia, Spain"}, {"name": "Juan Perez-Cruz", "affiliation": "Electrical Engineering Department, Polytechnic University of Valencia, Valencia, Spain"}, {"name": "Martin Riera-Guasp", "affiliation": "Electrical Engineering Department, Polytechnic University of Valencia, Valencia, Spain"}, {"name": "Javier Martinez-Roman", "affiliation": "Electrical Engineering Department, Polytechnic University of Valencia, Valencia, Spain"}, {"name": "Manuel Pineda-Sanchez", "affiliation": "Electrical Engineering Department, Polytechnic University of Valencia, Valencia, Spain"}], "tags": ["electrical engineering education", "magnetic materials", "PC-based virtual instrument laboratory", "data acquisition", "Electrical engineering", "DAQ board", "electric machines", "Windings", "Lamination", "Magnetic cores", "test equipment setup", "core flux time waveforms", "student experiments", "magnetic circuits", "educational courses", "data acquisition board", "Magnetic hysteresis", "test equipment", "virtual instrumentation", "Magnetic circuits", "grain-oriented transformer", "student learning", "transformers", "nongrain-oriented electrical steel transformer", "electrical machine lamination magnetic property", "transducer", "undergraduate course", "Instruments", "Data acquisition"]}, {"title": "Augmented Reality-Based Simulators as Discovery Learning Tools: An Empirical Study", "link": "https://ieeexplore.ieee.org/document/6994871/", "abstract": "This paper reports empirical evidence on having students use AR-SaBEr, a simulation tool based on augmented reality (AR), to discover the basic principles of electricity through a series of experiments. AR-SaBEr was enhanced with knowledge-based support and inquiry-based scaffolding mechanisms, which proved useful for discovery learning in Web-based simulation environments. Learning performance factors evaluated included students' learning behavior while interacting with the system, AR-SaBEr's learning effectiveness, and students' motivation in using the AR-based simulation environment. The study suggests that AR simulators can be exploited as effective learning environments for learning the basic principles of electricity. It would, however, be necessary to consider a number of scaffolding options to improve the learning effectiveness of AR-based simulation environments when used with students who have low levels of either: 1) self-regulation skills, or 2) motivation to engage in AR-based simulation activities.", "authors": [{"name": "Ángela Di-Serio", "affiliation": "Departamento de Computación y Tecnología de Información, Universidad Simón Bolívar, Caracas, Venezuela"}, {"name": "Diego Villarán-Molina", "affiliation": "Departamento de Ingeniería Telemática, Universidad Carlos III de Madrid, Leganés, Madrid, Spain"}, {"name": "María-Blanca Ibáñez", "affiliation": "Departamento de Ingeniería Telemática, Universidad Carlos III de Madrid, Leganés, Madrid, Spain"}, {"name": "Carlos Delgado-Kloos", "affiliation": "Departamento de Ingeniería Telemática, Universidad Carlos III de Madrid, Leganés, Madrid, Spain"}], "tags": ["discovery learning tools", "human factors", "student learning behavior", "self-regulation skills", "mobile learning", "Internet", "Web-based simulation environments", "Resistance", "AR-based simulation environments", "Correlation", "augmented reality-based simulators", "Augmented reality", "self-regulation", "AR-SaBEr", "student motivation", "inquiry-based scaffolding mechanisms", "AR-based simulation environment", "Encoding", "Computational modeling", "Battery charge measurement", "Electricity", "learning performance factors", "computer aided instruction", "digital simulation", "computer simulation", "knowledge-based support", "learning effectiveness", "augmented reality", "physics education"]}, {"title": "A Radionavigation Systems Course", "link": "https://ieeexplore.ieee.org/document/6853421/", "abstract": "This paper presents a new course, Radionavigation Systems, whose laboratory and theoretical components complement each other to enhance student learning. Radionavigation skills and knowledge are taught by means of various instructional methods, and the laboratory successfully merges hands-on learning using specific instrumentation and software simulation tools, with m-learning and a competition. The relationship between cognitive and psychomotor learning outcomes is discussed. These instructional methods proved highly motivating to students. Oral presentations and report preparation skills also improved in students who completed the course. The experiments designed for the course are discussed in the light of student surveys, student grades, and the work carried out by the lecturer. The evaluation results demonstrate a high degree of success in meeting the initial goals of the course. The main drawback of the current course is related to equipment availability. Student motivation was high throughout the course. The course as designed is transferable to other universities.", "authors": [{"name": "Juan Francisco Valenzuela-Valdés", "affiliation": "Universidad de Extremadura, Centro Universitario de Mérida, Mérida, Spain"}, {"name": "Antonio José Lozano-Guerrero", "affiliation": "Departament of Tecnologı´as de la Información y las Comunicaciones, Universidad Politécnica de Cartagena, Cartagena, Spain"}], "tags": ["telecommunication engineering education", "psychomotor learning", "Software", "hands-on learning", "Correlation", "Laboratories", "hands-on experience", "cognitive learning", "radionavigation systems course", "radionavigation systems", "student experiments", "Radar", "educational courses", "software simulation tools", "m-learning", "telecommunication", "Engineering education", "student learning", "radionavigation", "Global Positioning System", "Instruments"]}, {"title": "Virtualization for Cost-Effective Teaching of Assembly Language Programming", "link": "https://ieeexplore.ieee.org/document/7056564/", "abstract": "This paper describes a virtual system that emulates an ARM-based processor machine, created to replace a traditional hardware-based system for teaching assembly language. The virtual system proposed here integrates, in a single environment, all the development tools necessary to deliver introductory or advanced courses on modern assembly language programming. The virtual system runs a Linux operating system in either a graphical or console mode on a Windows or Linux host machine. Student feedback indicates that teaching with the virtual system has become progressively easier, clearer and more interesting while keeping staff support to a minimum. Since no software licenses or extra hardware are required to use the virtual system, students are able to carry their own ARM emulator with them on a USB memory stick. Institutions adopting this, or a similar, virtual system can also benefit by reducing the capital investment in hardware-based development kits, and by enabling distance-learning courses.", "authors": [{"name": "Karsten O. Lundqvist", "affiliation": "School of Systems Engineering, University of Reading, Berkshire, UK"}, {"name": "Chris G. Guy", "affiliation": "School of Systems Engineering, University of Reading, Berkshire, UK"}, {"name": "Des Howlett", "affiliation": "School of Systems Engineering, University of Reading, Berkshire, UK"}, {"name": "R. Simon Sherratt", "affiliation": "School of Systems Engineering, University of Reading, Berkshire, UK"}, {"name": "José O. Cadenas", "affiliation": "School of Systems Engineering, University of Reading, Berkshire, UK"}], "tags": ["Programming", "software libraries", "virtual machines", "teaching assembly language", "hardware-based development kit", "Hardware", "Software", "USB memory stick", "autoregressive moving average processes", "assembly language", "distance learning", "educational courses", "Educational institutions", "Electronic learning", "software licenses", "Linux operating system", "microprocessors", "ARM-based processor machine", "assembly language programming", "Windows host machine", "Linux", "Assembly", "distance-learning course", "Linux host machine"]}, {"title": "Realization of a Comprehensive Multidisciplinary Microfabrication Education Program at Binghamton University", "link": "https://ieeexplore.ieee.org/document/6813625/", "abstract": "Microfabrication is a critical area to many branches of science and engineering. However, to many students accustomed to seeing transistors as things that come in a lab kit, it is an obscure subtopic of their discipline. Beginning in 2009, the authors undertook a broad multidisciplinary approach to bring microfabrication into all aspects of the Binghamton University science and engineering curriculum. This program was coupled with a comprehensive assessment activity to evaluate the program's effectiveness and continuously improve it year by year. This paper reports the details of the implementation process, the techniques that were found to bring a hands-on experience to large classes, and the lessons learned from the assessments of this program to make this topic a mainstream part of engineering and science education.", "authors": [{"name": "Bruce White", "affiliation": "Physics Department, Binghamton University, Binghamton, NY"}, {"name": "Wayne E. Jones", "affiliation": "Chemistry Department, Binghamton University, Binghamton, NY"}, {"name": "David Klotzkin", "affiliation": "Electrical Engineering Department, Binghamton University, Binghamton, NY"}, {"name": "Greta L. Myers", "affiliation": "Binghamton University, Center for Learning and Teaching, Binghamton, NY"}, {"name": "Weili Cui", "affiliation": "Bioengineering Department, Binghamton University, Binghamton, NY"}, {"name": "Shawn Wagoner", "affiliation": "Physics Department, Binghamton University, Binghamton, NY"}], "tags": ["microfabrication", "comprehensive multidisciplinary microfabrication education program", "science and engineering curriculum", "Transistors", "Educational institutions", "Active learning", "transistors", "multidisciplinary", "Pipelines", "nanofabrication", "Videos", "Binghamton University", "educational institutions", "engineering-science education", "Fabrication", "comprehensive assessment activity", "electronic engineering education", "engineering education"]}, {"title": "Color Coding of Circuit Quantities in Introductory Circuit Analysis Instruction", "link": "https://ieeexplore.ieee.org/document/6783753/", "abstract": "Learning the analysis of electrical circuits represented by circuit diagrams is often challenging for novice students. An open research question in electrical circuit analysis instruction is whether color coding of the mathematical symbols (variables) that denote electrical quantities can improve circuit analysis learning. The present study compared two groups of high school students undergoing their first introductory learning of electrical circuit analysis. One group learned with circuit variables in black font. The other group learned with colored circuit variables, with blue font indicating variables related to voltage, red font indicating those related to current, and black font indicating those related to resistance. The color group achieved significantly higher post-test scores, gave higher ratings for liking the instruction and finding it helpful, and had lower ratings of cognitive load than the black-font group. These results indicate that color coding of the notations for quantities in electrical circuit diagrams aids the circuit analysis learning of novice students.", "authors": [{"name": "Jana Reisslein", "affiliation": "School of Electrical, Computer, and Energy Eng., Arizona State Univ., Tempe"}, {"name": "Martin Reisslein", "affiliation": "School of Electrical, Computer, and Energy Engineering, Arizona State University, Tempe, United States"}, {"name": "Amy M. Johnson", "affiliation": "College of Technology and Innovation, Arizona State University, Tempe"}], "tags": ["circuit variables", "Circuit diagram", "circuit quantities", "blue font", "font color", "electronic engineering education", "multiple representations", "network analysis", "novice learners", "Circuit analysis", "Resistance", "introductory learning", "circuit diagrams", "color coding", "electrical circuit analysis", "novice students", "electrical circuit analysis instruction", "black font", "Color", "circuit analysis learning improvement", "Encoding", "mathematical symbols", "cognitive load", "red font", "Equations", "Abstracts", "Materials"]}, {"title": "A Multidisciplinary PBL Robot Control Project in Automation and Electronic Engineering", "link": "https://ieeexplore.ieee.org/document/6895312/", "abstract": "This paper presents a multidisciplinary problem-based learning (PBL) project consisting of the development of a robot arm prototype and the implementation of its control system. The project is carried out as part of Industrial Informatics (II), a compulsory third-year course in the Automation and Electronic Engineering (AEE) degree program at the School of Engineering at Universitat Politècnica de València, València, Spain. The robot arm is a low-cost prototype, initially controlled with a joystick. The aim of the project is, first, to design and implement a full control system for the robot, including the necessary circuitry for microcomputer (ARM Cortex)-based control and, second, to pit the designed robot in competition against other students' robots. Incorporation of multidisciplinary PBL required changes in the organization of the course, which features various learning activities and their continuous evaluation; it also required knowledge of five other courses in the AEE program. PBL methodology is compared to a traditional method; the results obtained proved highly satisfactory. Moreover, the PBL robotic experience was highly rated by some 900 students.", "authors": [{"name": "Angel Perles", "affiliation": "Department of Computer Engineering, Universidad Politécnica de Valencia, Valencia, Valencia, Spain"}, {"name": "Houcine Hassan", "affiliation": "Department of Computer Engineering, Universidad Politécnica de Valencia, Valencia, Valencia, Spain"}, {"name": "José Albaladejo", "affiliation": "Department of Computer Engineering, Universidad Politécnica de Valencia, Valencia, Valencia, Spain"}, {"name": "Juan-Vicente Capella", "affiliation": "Department of Computer Engineering, Universidad Politécnica de Valencia, Valencia, Valencia, Spain"}, {"name": "Carlos Domínguez", "affiliation": "Department of Computer Engineering, Universidad Politécnica de Valencia, Valencia, Valencia, Spain"}, {"name": "Juan-Miguel Martínez", "affiliation": "Department of Computer Engineering, Universidad Politécnica de Valencia, Valencia, Valencia, Spain"}], "tags": ["Spain", "problem-based learning (PBL) methodology", "microcomputers", "Electronics", "manipulators", "Education", "School of Engineering", "multidisciplinary PBL robot control project", "Universitat Politècnica de València", "control system synthesis", "multidisciplinary problem-based learning project", "Robot sensing systems", "ARM Cortex", "Optical sensors", "industrial informatics", "Robot control", "embedded systems", "project management", "Educational robots", "educational courses", "multidisciplinary projects", "AEE degree program", "microcomputer", "València", "robot arm prototype", "robot programming", "teamwork", "joystick", "automation-and-electronic engineering degree program"]}, {"title": "Students' Achievements and Misunderstandings When Solving Problems Using Electronics Models—A Case Study", "link": "https://ieeexplore.ieee.org/document/6844903/", "abstract": "This paper examines students' achievements in solving problems and their misunderstandings when using models. A mixed research methodology was applied. Quantitative research investigated how the performance of students with various levels of high school GPAs correlated with their rating of their lecturers' teaching proficiency. Four lecturers and 336 mechanical and electronics engineering students participated in the study. Achievement tests, consisting of problems to be solved by using models of a diode and an ideal operational amplifier, were implemented in introductory courses in electronics. Students taught by lecturers whom they rated as having high levels of teaching expertise achieved significantly higher grades on these tests than did students taught by lecturers receiving lower ratings for their teaching expertise. The tests investigated performance on three taxonomy levels, and the results were consistent on all three levels. The grades on the knowledge taxonomy level were higher than the grades on the routine level, and both were higher than the grades on the interpretation level, as expected. Qualitative research, based on analysis of students' written explanations and on face-to-face interviews, exposed three kinds of misunderstanding: 1) that the purpose of engineering models is just to simplify calculations, not to yield usable, reliable results; 2) that a nonlinear problem can be solved using linear concepts; and 3) that the accuracy of a solution is indicated by the number of decimal places in the result, rather than by its closeness to the actual value.", "authors": [{"name": "Nissim Sabag", "affiliation": "Department of Elecrical and Electronics Engineering, ORT Braude College, Karmiel, Israel"}, {"name": "Elena Trotskovsky", "affiliation": "Department of Elecrical and Electronics Engineering, ORT Braude College, Karmiel, Israel"}, {"name": "Shlomo Waks", "affiliation": "Education in Technology and Science, Technion-Israel Institute of Technology, Haifa, Israel"}], "tags": ["electronic models", "integrated circuit modelling", "mixed research methodology", "Integrated circuit modeling", "electronic engineering education", "operational amplifier", "mechanical engineering", "teaching expertise", "achievement tests", "problem solving", "Taxonomy", "diode", "models", "operational amplifiers", "student achievements", "lecturer teaching proficiency", "engineering models", "Educational institutions", "teaching", "Mathematical model", "diodes", "knowledge taxonomy level", "misconception", "Interviews", "high school GPA", "Analytical models", "misunderstanding", "electronics engineering students", "mechanical engineering students", "Electrical engineering education"]}, {"title": "An iLab for Teaching Advanced Logic Concepts With Hardware Descriptive Languages", "link": "https://ieeexplore.ieee.org/document/7031441/", "abstract": "One of the more interesting approaches to teaching advanced logic concepts is the use of online laboratory frameworks to provide student access to remote field-programmable devices. There is as yet, however, no conclusive evidence of the effectiveness of such an approach. This paper presents the Advanced Digital Lab, a remote laboratory based on the batched MIT iLab Architecture. With a hardware system under test designed around an Altera EP2C20F484 field-programmable gate array (FPGA), the lab makes it possible for students to implement finite-state machines on a field-programmable device using VHDL. A study was carried out to evaluate the lab. Study results indicated that the Advanced Digital Lab is an effective pedagogical tool. Some observations drawn from the results of the study are also discussed; these may have far-reaching implications for the argument about the effectiveness of the general class of remote laboratories. An important contribution of this paper is that it provides a template for the proper evaluation of remote laboratories along multiple dimensions, particularly those of pedagogy, logistics, and cost.", "authors": [{"name": "Kayode P. Ayodele", "affiliation": "Department of Electrical and Electronic Engineering, Obafemi Awolowo University, Ile-Ife, Nigeria"}, {"name": "Isaac A. Inyang", "affiliation": "Department of Electrical and Electronic Engineering, Obafemi Awolowo University, Ile-Ife, Nigeria"}, {"name": "Lawrence O. Kehinde", "affiliation": "Department of Electrical and Electronic Engineering, Obafemi Awolowo University, Ile-Ife, Nigeria"}], "tags": ["Computer architecture", "hardware system under test", "computer science education", "finite state machines", "Education", "Hardware", "Software", "field programmable gate arrays", "batched MIT iLab architecture", "finite-state machines", "Laboratories", "iLab", "Altera EP2C20F484 field-programmable gate array", "FPGA", "hardware description languages", "advanced logic concept teaching", "teaching", "remote field-programmable devices", "hardware descriptive languages", "logic testing", "Field-programmable gate array (FPGA)", "Field programmable gate arrays", "Servers", "VHDL", "advanced digital lab", "online laboratory frameworks", "online laboratories"]}, {"title": "Analysis of Introducing Active Learning Methodologies in a Basic Computer Architecture Course", "link": "https://ieeexplore.ieee.org/document/6851215/", "abstract": "This paper presents an analysis of introducing active methodologies in the Computer Architecture course taught in the second year of the Computer Engineering Bachelor's degree program at the University of the Basque Country (UPV/EHU), Spain. The paper reports the experience from three academic years, 2011-2012, 2012-2013, and 2013-2014, in which three types of data were considered for analysis: students' dedication, as measured by time spent on the project, their marks, and their level of satisfaction. The study shows that about 86% of students are satisfied with the teaching methodology and are willing to continue using it in future courses. The study also shows that the active methodologies used contribute to the students' cross-curricular training and do not generate any great increase in student workload. Finally, a statistical analysis of the evolution of student performance showed that marks improved to a statistically significant extent after introducing active methodologies.", "authors": [{"name": "Javier Muguerza", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "José I. Martı´n", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}, {"name": "Olatz Arbelaitz", "affiliation": "Department of Computer Architecture and Technology, UPV/EHU, Donostia-San Sebastian"}], "tags": ["UPV-EHU", "Computer architecture", "student cross-curricular training", "continuous assessment", "Computers", "computer science education", "Computer Engineering Bachelor degree program", "Active learning methodologies", "collaborative learning", "active learning methodology analysis", "basic computer architecture course", "training", "Collaboration", "project-based learning (PBL)", "Parallel processing", "University of the Basque Country", "educational courses", "Educational institutions", "teaching", "Collaborative work", "statistical analysis", "cross-curricular competencies", "teaching methodology"]}, {"title": "Mobile Robot Lab Project to Introduce Engineering Students to Fault Diagnosis in Mechatronic Systems", "link": "https://ieeexplore.ieee.org/document/6914629/", "abstract": "This paper proposes lab work for learning fault detection and diagnosis (FDD) in mechatronic systems. These skills are important for engineering education because FDD is a key capability of competitive processes and products. The intended outcome of the lab work is that students become aware of the importance of faulty conditions and learn to design FDD strategies for a real system. To this end, the paper proposes a lab project where students are requested to develop a discrete event dynamic system (DEDS) diagnosis to cope with two faulty conditions in an autonomous mobile robot task. A sample solution is discussed for LEGO Mindstorms NXT robots with LabVIEW. This innovative practice is relevant to higher education engineering courses related to mechatronics, robotics, or DEDS. Results are also given of the application of this strategy as part of a postgraduate course on fault-tolerant mechatronic systems.", "authors": [{"name": "Jesús Manuel Gómez-de-Gabriel", "affiliation": "Departamento de Ingeniería de Sistemas y Automática, Universidad de Málaga, Andalucía Tech, Málaga, Spain"}, {"name": "Jesús Fernández-Lozano", "affiliation": "Departamento de Ingeniería de Sistemas y Automática, Universidad de Málaga, Andalucía Tech, Málaga, Spain"}, {"name": "Anthony Mandow", "affiliation": "Departamento de Ingeniería de Sistemas y Automática, Universidad de Málaga, Andalucía Tech, Málaga, Spain"}, {"name": "Alfonso García-Cerezo", "affiliation": "Departamento de Ingeniería de Sistemas y Automática, Universidad de Málaga, Andalucía Tech, Málaga, Spain"}], "tags": ["faulty conditions", "higher education engineering courses", "Education", "mechatronics", "mobile robot lab project", "electronic engineering education", "Mechatronics", "mechanical engineering", "fault detection and diagnosis", "Robot sensing systems", "fault diagnosis", "Navigation", "LEGO Mindstorms NXT", "higher education", "further education", "competitive process", "engineering students", "mobile robots", "educational courses", "fault detection-and-diagnosis learning", "virtual instrumentation", "discrete event systems", "Engineering education", "FDD learning", "LabVIEW", "Mobile robots", "real system", "discrete event dynamic system diagnosis", "autonomous mobile robot task", "project-based learning", "postgraduate course", "fault tolerant control", "fault-tolerant mechatronic systems", "DEDS diagnosis", "LEGO Mindstorms NXT robots", "Fault tolerance", "control engineering education", "engineering education"]}, {"title": "Improving the Laboratory Learning Experience: A Process to Train and Manage Teaching Assistants", "link": "https://ieeexplore.ieee.org/document/6862929/", "abstract": "This paper describes in detail a successful training program developed for sessional (part-time or nonpermanent) laboratory demonstrators employed in the Electrical Engineering Department of an Australian university. Such demonstrators play an important role in teaching practical concepts and skills in engineering. The success of the program relies on a centralized approach coordinated by a carefully selected Laboratory Manager responsible for the recruitment, allocation, training, and development of sessional teachers, and for assessing student satisfaction with them. The paper examines the overall impact of the program on these teachers': 1) introducing laboratory material; 2) preparation; 3) communication; 4) interest in student learning; 5) ability to respond to questions; and 6) overall effectiveness. Sessional teacher satisfaction with the training program is also examined, and the data were used to inform the program's further development. The results show that the training program successfully improved the demonstrators' teaching skills and thus led to greater satisfaction and hence learning experience of both students and demonstrators.", "authors": [{"name": "Peter James Vial", "affiliation": "School of Electrical, Computer and Telecommunications Engineering, University of Wollongong, Wollongong, NSW"}, {"name": "Montserrat Ros", "affiliation": "School of Electrical, Computer and Telecommunications Engineering, University of Wollongong, Wollongong, NSW"}, {"name": "Christian Ritz", "affiliation": "School of Electrical, Computer and Telecommunications Engineering, University of Wollongong, Wollongong, NSW"}, {"name": "David Stirling", "affiliation": "School of Electrical, Computer and Telecommunications Engineering, University of Wollongong, Wollongong, NSW"}, {"name": "Sasha Nikolic", "affiliation": "School of Electrical, Computer and Telecommunications Engineering, University of Wollongong, Wollongong, NSW"}], "tags": ["electrical engineering education", "teaching assistant", "learning experience", "Australian university", "Training", "sessional teacher satisfaction", "Australia", "student satisfaction", "Continuous improvement", "training program", "laboratory", "Laboratories", "sessional laboratory demonstrators", "training", "student learning interest", "laboratory manager", "teacher training", "Educational institutions", "teaching", "demonstrators", "continuous improvement", "Electrical Engineering Department", "Tutorials", "teaching skills", "Interviews", "laboratory material"]}, {"title": "A Smart Home Test Bed for Undergraduate Education to Bridge the Curriculum Gap From Traditional Power Systems to Modernized Smart Grids", "link": "https://ieeexplore.ieee.org/document/6815765/", "abstract": "There is a worldwide trend to modernize old power grid infrastructures to form future smart grids, which will achieve efficient, flexible energy consumption by using the latest technologies in communication, computing, and control. Smart grid initiatives are moving power systems curricula toward smart grids. Although the components of smart grids fall within the broader discipline of electrical and computer engineering, undergraduate students are rarely assigned single design projects that require classic power systems knowledge combined with communication, computing, and control. Therefore, as a significant step toward potential curriculum changes, this paper presents such a project, a smart home test bed based on the pedagogical model of project-based learning (PBL) for undergraduate education. The proposed test bed allows undergraduates to gain key knowledge in smart grid topics, such as flattening demand peaks, real-time price response, wireless sensor networks, machine learning, pattern recognition, embedded system programming, user interface design, circuit design, and databases. This is well aligned with smart grid initiatives and provides a platform for students to develop their creativity in engineering design. It also offers real-life examples to be used for raising general public awareness of energy conservation.", "authors": [{"name": "Chien-fei Chen", "affiliation": "Department of Electrical Engineering and Computer Science, The University of Tennessee, Knoxville, TN"}, {"name": "Fangxing Li", "affiliation": "Department of Electrical Engineering and Computer Science, The University of Tennessee, Knoxville, TN"}, {"name": "Qinran Hu", "affiliation": "Department of Electrical Engineering and Computer Science, The University of Tennessee, Knoxville, TN"}], "tags": ["Smart homes", "undergraduate student", "traditional power system", "PBL pedagogical model", "moving power system knowledge", "Smart grids", "energy conservation", "future smart power grid infrastructure modernization", "flexible energy consumption", "Sensors", "user interfaces", "power consumption", "smart power grids", "smart home test bed", "further education", "project-based learning pedagogical model", "general public awareness", "project-based learning (PBL)", "research experience for undergraduates (REU)", "curriculum gap bridging", "Educational institutions", "Demand response", "senior design", "undergraduate education", "smart home", "energy management system", "smart grid component", "Prototypes", "smart grids", "electrical engineering design", "Home appliances", "power engineering computing", "power system education", "computer engineering", "computer aided instruction", "power engineering education"]}, {"title": "Decoding Student Satisfaction: How to Manage and Improve the Laboratory Experience", "link": "https://ieeexplore.ieee.org/document/6883242/", "abstract": "The laboratory plays an important role in teaching engineering skills. An Electrical Engineering department at an Australian University implemented a reform to monitor and improve student satisfaction with the teaching laboratories. A Laboratory Manager was employed to oversee the quality of 27 courses containing instructional laboratories. Student satisfaction surveys were carried out on all relevant laboratories every year, and the data were used for continuous improvement. This paper will investigate the reforms that were implemented and outline a number of the improvements made. It also examines the program's overall impact on: (1) overall satisfaction; (2) laboratory notes; (3) learning experiences; (4) computer facilities; (5) engineering equipment; and (6) condition of the laboratory. Student satisfaction with the laboratories increased by 32% between 2007 and 2013. The results show that the laboratory notes (activity and clarity) and the quality of the equipment used are among the most influential factors on student satisfaction. In particular, it is important to have notes or resources that explain in some detail how to use and troubleshoot equipment and software used in the laboratory.", "authors": [{"name": "Peter James Vial", "affiliation": "Faculty of Engineering & Information Sciences, University of Wollongong, Gwynneville, Wollongong, NSW"}, {"name": "Montserrat Ros", "affiliation": "Faculty of Engineering & Information Sciences, University of Wollongong, Gwynneville, Wollongong, NSW"}, {"name": "David Stirling", "affiliation": "Faculty of Engineering & Information Sciences, University of Wollongong, Gwynneville, Wollongong, NSW"}, {"name": "Christian Ritz", "affiliation": "Faculty of Engineering & Information Sciences, University of Wollongong, Gwynneville, Wollongong, NSW"}, {"name": "Sasha Nikolic", "affiliation": "Faculty of Engineering & Information Sciences, University of Wollongong, Gwynneville, Wollongong, NSW"}], "tags": ["electrical engineering education", "learning experience", "Computers", "engineering skill teaching", "Australia", "student satisfaction", "Software", "laboratory", "Laboratories", "troubleshoot equipment", "student satisfaction improvement", "engineering facilities", "Australian University", "Web sites", "student experiments", "educational courses", "Educational institutions", "teaching", "Engineering education", "laboratory management", "laboratory experience management", "electrical engineering department", "computer facility", "engineering equipment"]}, {"title": "The Relevance of Software Development Education for Students", "link": "https://ieeexplore.ieee.org/document/7008550/", "abstract": "Despite a widely-acknowledged shortage of software developers, and reports of a gap between industry needs and software education, the possible gap between students' needs and software development education has not been explored in detail. In their university education, students want to take courses and carry out projects that clearly relate to their lives and their goals. This paper reports on a quantitative study of 297 software development students. The analysis of the results suggests that software development education has a predominantly social relevance to students and also has moderate personal and professional relevance. The following approaches are recommended to improve students' views of the relevance of software development education: use various learning environments; pay special attention to female students, students who did not have IT as a school subject, and students who rate their own academic performance as low; update educators on the latest developments; design programs to appeal to students and to meet societal demands.", "authors": [{"name": "Janet Liebenberg", "affiliation": "Department of Computer Science and Information Systems"}, {"name": "Magda Huisman", "affiliation": "Department of Computer Science and Information Systems"}, {"name": "Elsa Mentz", "affiliation": "Faculty of Education Sciences, North-West University, Potchefstroom, South Africa"}], "tags": ["Computers", "software engineering", "computer science education", "Programming profession", "university education", "Software", "societal demands", "curriculum development", "female students", "school subject", "student needs", "engineering students", "project management", "Computer industry", "Industries", "Educational institutions", "educational institutions", "software development education", "professional relevance", "learning environments", "software development students", "personal relevance", "academic performance"]}, {"title": "Multi-Institution Study of Student Demographics and Outcomes in Electrical and Computer Engineering in the USA", "link": "https://ieeexplore.ieee.org/document/6881755/", "abstract": "Electrical Engineering (EE) and Computer Engineering (CpE) programs have similar curricula, but different demographics and student outcomes. This paper extends earlier longitudinal studies to a larger and more diverse dataset with 90 000 first-time-in-college and 26 000 transfer students who majored in engineering at USA institutions, including students who started in first-year engineering programs, those switching majors, and those transferring from other institutions. Black men and women and Asian men in engineering are strongly attracted to EE when they start in college. Black students and Asian and Hispanic men are attracted to CpE more than other engineering disciplines, but at lower rates than EE. Asian students have the highest graduation rates in EE. EE students are much more likely to graduate than CpE students. Compared to other engineering disciplines, CpE graduation rates are low for women of all races/ethnicities and Black men. Both EE and CpE lose many of those starting the programs, but switchers and transfers compensate for some of the loss. Considering Asian students and White men, switching to EE accounts for the high attrition rate from CpE, but attrition in other populations cannot be explained so easily. Trajectories of student enrollment differ by race/ethnicity. The approach used here could serve as a model for other fields studying their own demographic distributions.", "authors": [{"name": "Matthew W. Ohland", "affiliation": "Purdue University, West Lafayette, IN, U.S.A., Central Queensland University, Rockhampton, QLD, Australia"}, {"name": "Susan M. Lord", "affiliation": "University of San Diego, San Diego, CA, U.S.A."}, {"name": "Richard A. Layton", "affiliation": "Rose-Hulman Institute of Technology, Terre Haute, IN, U.S.A."}], "tags": ["electrical engineering education", "USA", "Computers", "computer science education", "demography", "multiinstitution study", "Computer engineering education", "transfer students", "CpE program", "Sociology", "student demographic distribution", "Switches", "gender", "race", "Trajectory", "Educational institutions", "Aggregates", "retention", "educational institutions", "stickiness", "EE program", "Statistics", "computer engineering", "electrical engineering", "gender issues"]}, {"title": "Consolidating Learning in Power Systems: Virtual Reality Applied to the Study of the Operation of Electric Power Transformers", "link": "https://ieeexplore.ieee.org/document/7027870/", "abstract": "Within the field of electric power systems, the study of electrical equipment can be frustrating and demotivating because of the lack of a clear vision of how this equipment functions and operates in a real environment. The use of virtual reality can provide a more concrete representation for students, who rarely have the opportunity to visit a power substation or generating plant to acquire an understanding of how the equipment operates when integrated into an actual system. This paper describes work undertaken to improve the classroom study of such equipment , and to motivate students, by providing a clear overview of the equipment, approximating theory and practical functions, and simulating real situations that would be encountered on the equipment in an actual system. A virtual reality authoring tool was developed to provide students with a visualization of an autotransformer installed in an electric power substation, and to allow them to perform virtual maintenance and operating procedures on it. The influence of the software on students' levels of motivation and their performance was evaluated using questionnaires and reports. Finally, a framework is proposed that can help others create virtual reality trainings.", "authors": [{"name": "Pebertli Nils Alho Barata", "affiliation": "Federal University of Pará, ITEC, Belém, Pará, Brazil"}, {"name": "Manoel Ribeiro Filho", "affiliation": "Federal University of Pará, ITEC, Belém, Pará, Brazil"}, {"name": "Marcus V. Alves Nunes", "affiliation": "Federal University of Pará, ITEC, Belém, Pará, Brazil"}], "tags": ["virtual reality", "Windings", "virtual maintenance", "transformer substations", "Training", "Maintenance engineering", "electric power substation", "Power transformers", "generating plant", "virtual reality training", "Software", "consolidating learning", "power apparatus", "power transformers", "electric power transformer operation", "Substations", "power system", "training", "student motivation", "virtual reality authoring tool", "electrical equipment", "classroom study", "transformers", "electric power system", "power engineering computing", "computer aided instruction", "Authoring tool", "power engineering education"]}, {"title": "Conceptual Gaps in Circuits Textbooks: A Comparative Study", "link": "https://ieeexplore.ieee.org/document/6914630/", "abstract": "Many university-level electrical engineering courses continue to use textbooks as curriculum scaffolds, prescribed texts, and/or reference volumes. Textbook reliance is even more pronounced in courses that teach foundational principles of the discipline, such as introductory circuit theory. This paper reports on the conceptual coverage of introductory electric circuit theory as presented in textbooks. More specifically, a comparative study of six texts was performed using an analytic framework based on prior research on conceptual understanding and organized around multiple criteria. The ideas of conceptual framework and conceptual links are used to identify potential conceptual gaps in each textbook. This analysis reveals that the majority of the books are missing many important conceptual features. Findings from this study can be beneficial for authors as they develop new editions of books, and for instructors as they evaluate and select texts for use in their courses. This study can also inform ongoing efforts to both develop more effective instructional materials and investigate how textbooks affect conceptual understanding.", "authors": [{"name": "Deepika Sangam", "affiliation": "Purdue University, School of Electrical and Computer Engineering, West Lafayette, IN, USA"}, {"name": "Brent K. Jesiek", "affiliation": "Purdue University, Schools of Engineering Education and Electrical and Computer Engineering, West Lafayette, IN, USA"}], "tags": ["misconceptions", "circuit theory", "electrical engineering education", "Context", "Computers", "analytic framework", "electric circuit theory", "circuit textbook conceptual gap", "introductory electric circuit theory conceptual coverage", "educational courses", "Educational institutions", "conceptual understanding", "Physics", "university-level electrical engineering course", "textbooks", "Encoding", "Materials", "Circuit theory"]}, {"title": "Enhancing Practice and Achievement in Introductory Programming With a Robot Olympics", "link": "https://ieeexplore.ieee.org/document/7006692/", "abstract": "Computer programming is notoriously difficult to learn. To this end, regular practice in the form of application and reflection is an important enabler of student learning. However, educators often find that first-year B.Sc. students do not readily engage in such activities. Providing each student with a programmable robot, however, could be used to facilitate application and reflection since, potentially, robots facilitate engaging learning experiences while providing immediate and intuitive feedback. This paper explores whether an introductory course centered upon programming personal robots in preparation for an end-of-course event day-a Robot Olympics-can help students to, first, engage in programming practice more frequently and, second, improve the quality of their code. A survey was conducted to examine the students' programming practice behavior, and students' final coursework submissions were also reviewed for aspects of program quality. The findings from this cohort were compared to a reference group from a previous cohort that shared similar learning objectives and entry requirements, but had focused on Web programming instead of using robots. The results reveal statistically significant increases in programming practice compared to the reference group. Furthermore, being enrolled in the course that culminated in the Robot Olympics was a significant predictor of two aspects of program quality: functional coherence and sophistication. This suggests that robot-centered courses can promote engagement with, and enhance some aspects of, programming practice.", "authors": [{"name": "Stanislao Lauria", "affiliation": "Department of Computer Science, Brunel University London, Uxbridge, Middlesex, United Kingdom"}, {"name": "Steve Counsell", "affiliation": "Department of Computer Science, Brunel University London, Uxbridge, Middlesex, United Kingdom"}, {"name": "Michael James Scott", "affiliation": "Department of Computer Science, Brunel University London, Uxbridge, Middlesex, United Kingdom"}, {"name": "Allan Tucker", "affiliation": "Department of Computer Science, Brunel University London, Uxbridge, Middlesex, United Kingdom"}, {"name": "Stephen Swift", "affiliation": "Department of Computer Science, Brunel University London, Uxbridge, Middlesex, United Kingdom"}, {"name": "Martin Shepperd", "affiliation": "Department of Computer Science, Brunel University London, Uxbridge, Middlesex, United Kingdom"}, {"name": "Gheorghita Ghinea", "affiliation": "Department of Computer Science, Brunel University London, Uxbridge, Middlesex, United Kingdom"}], "tags": ["computer science education", "Education", "Web programming", "learning objectives", "Robot Olympics", "Achievement", "Programming profession", "program quality", "code quality improvement", "reference group", "B.Sc. students", "CS1", "Laboratories", "robot-centered courses", "Educational robots", "Coherence", "introductory programming", "programmable robot", "entry requirements", "educational courses", "personal robot programming", "student final coursework submissions", "motivation", "quality", "student learning", "immediate intuitive feedback", "end-of-course event day", "statistical analysis", "personal robots", "practice", "computer aided instruction", "robot programming", "student programming practice behavior", "computer programming course", "learning experiences"]}, {"title": "Interactive Learning Environment for Bio-Inspired Optimization Algorithms for UAV Path Planning", "link": "https://ieeexplore.ieee.org/document/7057693/", "abstract": "This paper describes the development of BOLE, a MATLAB-based interactive learning environment, that facilitates the process of learning bio-inspired optimization algorithms, and that is dedicated exclusively to unmanned aerial vehicle path planning. As a complement to conventional teaching methods, BOLE is designed to help students consolidate the concepts taught in the course and motivate them to explore relevant issues of bio-inspired optimization algorithms through interactive and collaborative learning processes. BOLE differs from other similar tools in that it places greater emphasis on fundamental concepts than on complex mathematical equations. The learning tasks using BOLE can be classified into four steps: introduction, recognition, practice, and collaboration, according to task complexity. It complements traditional classroom teaching, enhancing learning efficiency and facilitating the assessment of student achievement, as verified by its practical application in an undergraduate course “Bio-Inspired Computing.” Both objective and subjective measures were evaluated to assess the learning effectiveness.", "authors": [{"name": "Changhao Sun", "affiliation": "School of Automation Science and Electronic Engineering, Beihang University, Beijing, PR China"}, {"name": "Yuhui Shi", "affiliation": "Department of Electrical and Electronic Engineering, Xi'an Jiaotong-Liverpool University, Suzhou, PR China"}, {"name": "Haibin Duan", "affiliation": "School of Automation Science and Electronic Engineering, Beihang University, Beijing, PR China"}, {"name": "Xiangyin Zhang", "affiliation": "School of Automation Science and Electronic Engineering, Beihang University, Beijing, PR China"}, {"name": "Pei Li", "affiliation": "School of Automation Science and Electronic Engineering, Beihang University, Beijing, PR China"}], "tags": ["bioinspired optimization algorithms", "unmanned aerial vehicle path planning", "UAV path planning", "Unmanned aerial vehicles", "Ant colony optimization", "particle swarm optimization", "Path planning", "learning (artificial intelligence)", "complex mathematical equations", "interactive learning processes", "unmanned aerial vehicles (UAVs)", "Optimization", "interactive learning environment", "path planning", "Heuristic algorithms", "mobile robots", "Educational institutions", "telerobotics", "Mathematical model", "MATLAB", "autonomous aerial vehicles", "artificial bee colony", "collaborative learning processes", "Algorithm design and analysis", "aerospace control", "bio-inspired optimization"]}, {"title": "A Flipped First-Year Digital Circuits Course for Engineering and Technology Students", "link": "https://ieeexplore.ieee.org/document/6902829/", "abstract": "This paper describes a flipped and improved first-year digital circuits (DC) course that incorporates several active learning strategies. With the primary objective of increasing student interest and learning, an integrated instructional design framework is proposed to provide first-year engineering and technology students with practical knowledge of DC. The research presented here compares the effectiveness of the flipped course to the previous traditional course through a controlled experimental study. The improved effectiveness of the flipped course is confirmed through the significant increase in course content and significant improvements in students' performance and their perceptions of their learning experience. Preliminary results suggest that students' academic success, and their engagement and interest in engineering, can be enhanced by refinement of an integrated instructional design framework. The authors believe that this positive outcome is a result of alignment of online preview of lectures, face-to-face student/instructor and peer interactions, discussions, hands-on activities, combined with several active learning strategies infused into the class.", "authors": [{"name": "Eron Drake", "affiliation": "Faculty Center for Innovative Teaching, Central Michigan University, Mt Pleasant, MI, USA"}, {"name": "Kumar Yelamarthi", "affiliation": "School of Engineering and Technology, Central Michigan University, Mt Pleasant, MI, USA"}], "tags": ["online lecture preview", "Temperature sensors", "Education", "learning strategy", "electronic engineering education", "learning (artificial intelligence)", "flipped first-year digital circuits course", "Logic gates", "engineering and technology", "Digital circuits", "flipped classroom", "integrated instructional design framework", "Microcontrollers", "engineering student", "educational courses", "Active learning", "DC course", "controlled experimental study", "Collaborative work", "student learning", "digital circuits", "hands-on activity", "peer interaction"]}, {"title": "Noise and Vibration Risk Prevention Virtual Web for Ubiquitous Training", "link": "https://ieeexplore.ieee.org/document/7079513/", "abstract": "This paper describes a new Web portal offering experimental labs for ubiquitous training of university engineering students in work-related risk prevention. The Web-accessible computer program simulates the noise and machine vibrations met in the work environment, in a series of virtual laboratories that mimic an actual laboratory and provide the corresponding calculations and plots. The main goal of this work is to provide new learning strategies and methodologies to motivate students and challenge them to learn risk prevention strategies for the workplace. Students can perform the virtual experiments before taking their actual laboratory classes and repeat them whenever and as often as they want. Evaluation results show the system was considered very satisfactory, with an average student rating of 8.95 out of a maximum of 10. As well as being used for educational purposes, the program can be used in industry as a decision tool for factory workers and technicians.", "authors": [{"name": "José Miguel Martínez-Valle", "affiliation": "Department of Rural Engineering, Cordoba University Polytechnic School of Engineering, Córdoba, Córdoba, Spain"}, {"name": "Gerardo Pedrós-Pérez", "affiliation": "Department of Rural Engineering, Cordoba University Polytechnic School of Engineering, Córdoba, Córdoba, Spain"}, {"name": "María Dolores Redel-Macías", "affiliation": "Department of Rural Engineering, Cordoba University Polytechnic School of Engineering, Córdoba, Córdoba, Spain"}, {"name": "María del Pilar Martínez-Jiménez", "affiliation": "Department of Applied Physics, Cordoba University Polytechnic School of Engineering, Córdoba, Córdoba, Spain"}, {"name": "Antonio J. Cubero-Atienza", "affiliation": "Department of Rural Engineering, Cordoba University Polytechnic School of Engineering, Córdoba, Córdoba, Spain"}], "tags": ["technicians", "ubiquitous computing", "workplace", "Training", "virtual laboratory", "educational purposes", "programming", "machine vibrations", "ubiquitous training", "virtual laboratories", "factory workers", "Laboratories", "portals", "university engineering students", "decision tool", "vibration risk prevention virtual Web", "risk prevention", "Engineering education", "noise vibrations", "Safety", "simulation", "Noise", "Tutorials", "computer aided instruction", "Web-accessible computer program", "learning strategies", "Vibrations", "Web portal"]}, {"title": "An Animated Introduction to Relational Databases for Many Majors", "link": "https://ieeexplore.ieee.org/document/6827953/", "abstract": "Database technology affects many disciplines beyond computer science and business. This paper describes two animations developed with images and color that visually and dynamically introduce fundamental relational database concepts and querying to students of many majors. The goal is for educators in diverse academic disciplines to incorporate the animations in their existing courses in order to meet their pedagogical needs. The introduction of the animations was assessed and evaluated within several contexts, including non-majors courses offered by computer scientists as well as a course on computational molecular biology. The evaluation indicated that student knowledge of fundamental database concepts improved significantly with the use of the courseware. The animations provide visual learners with an engaging method to learn the topics presented with the ability to replay the dynamic presentation. Overall, the evaluation indicates the accessibility of database topics across the disciplines as well as the specific concepts that need further elaboration.", "authors": [{"name": "Connie M. Borror", "affiliation": "School of Mathematical and Natural Sciences, Arizona State University, Phoenix, AZ, USA"}, {"name": "Don Goelman", "affiliation": "Department of Computing Sciences, Villanova University, Villanova, PA, USA"}, {"name": "Suzanne W. Dietrich", "affiliation": "School of Mathematical and Natural Sciences, Arizona State University, Phoenix, AZ, USA"}, {"name": "Sharon M. Crook", "affiliation": "School of Mathematical and Statistical Sciences and School of Life Sciences, Arizona State University, Tempe, AZ, USA"}], "tags": ["Computer science", "computer science education", "pedagogical needs", "computer animation", "nonmajor courses", "database topic learning", "computational molecular biology course", "relational databases", "visualization", "Animation", "Courseware", "query processing", "visual learners", "dynamic presentation", "fundamental relational database concepts", "educational courses", "Educational institutions", "querying", "Relational databases", "Computer science education", "animations", "Visualization", "courseware"]}, {"title": "Bioinspiring an Interest in STEM", "link": "https://ieeexplore.ieee.org/document/6822652/", "abstract": "Attracting K-12 students to pursue careers in science, technology, engineering, and mathematics (STEM) is viewed as a critical element for benefiting both the economy and society. This paper describes an outreach program, conducted in a Brooklyn, NY, USA, public middle school, aimed at educating students in mechatronics, biology, and bioinspiration. The program is designed to foster student interest in STEM subjects, especially engineering-related concepts, by actively demonstrating their application in solving tangible real-world problems. It consists of a series of lectures and practical activities that culminate with a hands-on bioinspiration-based event at the New York Aquarium. Survey results show that students who participated in the program have a better understanding of the relationship between engineering and nature, demonstrate improved knowledge of select STEM topics, and are more interested in pursuing STEM careers.", "authors": [{"name": "Maurizio Porfiri", "affiliation": "Department of Mechanical and Aerospace Engineering, New York University Polytechnic School of Engineering, Brooklyn, USA, United States"}, {"name": "Tiziana Bartolini", "affiliation": "Department of Mechanical and Aerospace Engineering, New York University Polytechnic School of Engineering, Brooklyn, NY, USA"}, {"name": "Jeffrey Laut", "affiliation": "Department of Mechanical and Aerospace Engineering, New York University Polytechnic School of Engineering, Brooklyn, NY, USA"}], "tags": ["science, technology, engineering, and mathematics", "educational technology", "mechatronics", "knowledge", "Mechatronics", "educational robots", "STEM", "K-12 students", "bio-inspired materials", "Bioinspired robots", "engineering-related concepts", "mobile robots", "outreach program", "student experiments", "Educational institutions", "underwater vehicles", "Mobile robots", "hands-on bioinspiration-based event", "education", "tangible real-world problems", "educational aids", "public middle school", "K–12 education", "lectures", "practical activities", "biology", "computer aided instruction", "Biodiversity", "science, technology, engineering, and mathematics (STEM)", "Servomotors", "physics education"]}, {"title": "Development of a Taxonomy of Keywords for Engineering Education Research", "link": "https://ieeexplore.ieee.org/document/7313574/", "abstract": "The diversity of engineering education research provides an opportunity for cross-fertilization of ideas and creativity, but it also can result in fragmentation of the field and duplication of effort. One solution is to establish a standardized taxonomy of engineering education terms to map the field and communicate and connect research initiatives. This report describes the process for developing such a taxonomy, the EER Taxonomy. Although the taxonomy focuses on engineering education research in the United States, inclusive efforts have engaged 266 individuals from 149 cities in 30 countries during one multiday workshop, seven conference sessions, and several other virtual and in-person activities. The resulting taxonomy comprises 455 terms arranged in 14 branches and six levels. This taxonomy was found to satisfy four criteria for validity and reliability: (1) keywords assigned to a set of abstracts were reproducible by multiple researchers, (2) the taxonomy comprised terms that could be selected as keywords to fully describe 243 articles in three journals, (3) the keywords for those 243 articles were evenly distributed across the branches of the taxonomy, and (4) the authors of 31 conference papers agreed with 90% of researcher-assigned keywords. This report also describes guidelines developed to help authors consistently assign keywords for their articles by encouraging them to choose terms from three categories: (1) context/focus/topic, (2) purpose/target/motivation, and (3) research approach.", "authors": [{"name": "Golnoosh Rasoulifar", "affiliation": "University of Michigan"}, {"name": "Cynthia J. Finelli", "affiliation": "University of Michigan"}, {"name": "Maura Borrego", "affiliation": "The University of Texas at Austin"}], "tags": ["Ontologies", "Guidelines", "Vocabulary", "Taxonomy", "Databases", "Engineering education"]}, {"title": "Adapting Team-Based Learning for Application in the Basic Electric Circuit Theory Sequence", "link": "https://ieeexplore.ieee.org/document/6844897/", "abstract": "Team-based learning (TBL) is a form of student-centered active learning in which students independently study new conceptual material before it is treated in the classroom, and then subsequently spend considerable classroom time working in groups on increasingly challenging problems and applications based on that new material. TBL provides students with opportunities to not only learn course content better than in the traditional lecture-based setting, but also to develop various transferable professional skills, such as self-directed independent learning, problem solving, and interpersonal team skills. Because of these potential benefits, TBL was adapted as the principal teaching and learning strategy in a two-course sophomore-level electric circuit theory sequence, where it has been used since 2010. This paper describes beneficial changes that have evolved in the implementation of TBL in the circuit theory sequence. Those changes have been based, in part, on student evaluations of the strategy, which are described. Finally, instruments used to assess student learning in the TBL-taught courses are also described. They provide evaluation information that suggests the described revised version of TBL is an effective way to facilitate learning of both technical content and several professional skills in the sophomore-level electric circuit theory sequence.", "authors": [{"name": "Robert M. O'Connell", "affiliation": "Department of Electrical and Computer Engineering, University of Missouri, Columbia, MO, USA"}], "tags": ["electrical engineering education", "Computers", "Education", "Learning groups", "sophomore-level electric circuit theory sequence", "adapting team-based learning", "TBL", "Teamwork", "teaching electric circuit theory", "Problem-solving", "principal teaching", "interpersonal team skills", "traditional lecture-based setting", "Circuit theory", "self-directed independent learning", "circuit theory", "networks (circuits)", "student-centered active learning", "Instruments", "Materials", "team-based learning"]}, {"title": "Smartphone Response System Using Twitter to Enable Effective Interaction and Improve Engagement in Large Classrooms", "link": "https://ieeexplore.ieee.org/document/6837506/", "abstract": "This paper proposes a method for seamless interaction between students and their professor using Twitter, one of the typical social network service (SNS) platforms, in large lectures. During the lecture, the professor poses surprise questions in the form of a quiz on an overhead screen at unexpected moments, and students submit their answers through a smartphone response system using Twitter. Since points are awarded on a first-come-first-served basis to only a limited number of the students who submit correct answers, students are required to concentrate on the lecture if they want to score. The proposed method solves both the problem of decreased concentration arising from frequent use of smartphones for nonlearning purposes in lectures and of inefficient interaction that occurs in large university classrooms. Evaluation through analysis of exam results and a post-course survey confirm that the proposed solution produces better results in terms of both students' academic achievement and their concentration during lectures.", "authors": [{"name": "Jae Wook Jeon", "affiliation": "College of Information and Communication Engineering, Sungkyunkwan University, Suwon, Korea"}, {"name": "Yeongjun Kim", "affiliation": "College of Information and Communication Engineering, Sungkyunkwan University, Suwon, Korea"}, {"name": "Soonmook Jeong", "affiliation": "College of Information and Communication Engineering, Sungkyunkwan University, Suwon, Korea"}, {"name": "Sangeun Lee", "affiliation": "Center for Teaching and Learning, Sungkyunkwan University, Seoul, Korea"}, {"name": "Key Ho Kwon", "affiliation": "College of Information and Communication Engineering, Sungkyunkwan University, Suwon, Korea"}, {"name": "Yongwoon Ji", "affiliation": "College of Information and Communication Engineering, Sungkyunkwan University, Suwon, Korea"}], "tags": ["large university classrooms", "Classroom interactivity", "student academic achievement", "student-professor interaction", "interactive response system", "student engagement improvement", "Mobile communication", "exam analysis", "Twitter", "student concentration", "Wireless communication", "postcourse survey", "nonlearning purposes", "Atmosphere", "overhead screen", "Educational institutions", "first-come-first-served method", "smart phones", "SNS platforms", "educational institutions", "interactive systems", "smart phone response system", "large classroom", "graphical user interfaces", "correct answer submission", "social networking (online)", "social network service platforms", "Wireless sensor networks", "computer aided instruction", "smartphone"]}]