[{"title": "Effects of Using Requirements Catalogs on Effectiveness and Productivity of Requirements Specification in a Software Project Management Course", "link": "https://ieeexplore.ieee.org/document/7169627/", "abstract": "This paper presents the results of two educational experiments carried out to determine whether the process of specifying requirements (catalog-based reuse as opposed to conventional specification) has an impact on effectiveness and productivity in co-located and distributed software development environments. The participants in the experiments were 76 students enrolled in three courses on project management for software development at the University of Murcia, Spain, and the Mohammed V University of Rabat, Morocco. The results of a fixed effects meta-analysis (Hedges' g) obtained a medium effect ( -0.495, p=0.034) for productivity, and a large effect ( -1.077, ) for effectiveness, in favor of using a catalog-based reuse process rather than a conventional specification process. The other co-factor examined, distribution (either global or co-located), had no statistically significant interaction with the process used (catalog-based reuse or conventional specification) for either effectiveness or productivity. Further research is required to study the effectiveness and productivity of the catalog-based requirements engineering learning method so that it can be taught in software engineering courses and applied in real software engineering projects.", "authors": [{"name": "José Luis Fernández-Alemán", "affiliation": "Department of Informatics and Systems, University of Murcia, Spain"}, {"name": "Ambrosio Toval", "affiliation": "Department of Informatics and Systems, University of Murcia, Spain"}, {"name": "Joaquín Vidal Meca", "affiliation": "Department of Informatics and Systems, University of Murcia, Spain"}, {"name": "Juan Manuel Carrillo-de-Gea", "affiliation": "Department of Informatics and Systems, University of Murcia, Spain"}, {"name": "Joaquín Nicolás Ros", "affiliation": "Department of Informatics and Systems, University of Murcia, Spain"}, {"name": "Ali Idri", "affiliation": "Software Project Management research team, ENSIAS, University Mohammed V, Rabat, Morocco"}], "tags": ["requirements reuse", "distributed software development environments", "cataloguing", "student experiments", "Catalogs", "Cultural differences", "Mohammed V University of Rabat, Morocco", "requirements specification", "requirements engineering learning method", "project management", "ISO standards", "computer science education", "Productivity", "global software development", "software project management course", "formal verification", "University of Murcia Spain", "requirements catalogs", "Software", "Electronic learning", "educational courses", "software engineering courses", "computer aided instruction", "Project management"]}, {"title": "More Time or Better Tools? A Large-Scale Retrospective Comparison of Pedagogical Approaches to Teach Programming", "link": "https://ieeexplore.ieee.org/document/7440799/", "abstract": "Learning to program is a complex task, and the impact of different pedagogical approaches to teach this skill has been hard to measure. This study examined the performance data of seven cohorts of students (N = 1168) learning programming under three different pedagogical approaches. These pedagogical approaches varied either in the length of the introductory programming block of courses (two or three semesters) or in the programming tool used in the first semester (C language or the programming support tool Raptor). In addition, gender and initial course selection differences were investigated. Raw pass rates under the three pedagogical approaches were compared; they were also compared, controlling for initial ability levels, using a logistic regression. Results showed that a more extensive duration of the introductory block produced a higher pass rate in students, but changing the programming tool used did not. Raw gender differences were not statistically significant; admission phase differences were initially statistically different, but not once initial ability and pedagogical approach received had been accounted for. Findings are discussed in relation to existing literature.", "authors": [{"name": "P. David Arjona-Villicaña", "affiliation": "School of Engineering, Universidad Autónoma de San Luis Potosí, San Luis, Mexico"}, {"name": "F. Edgar Castillo-Barrera", "affiliation": "School of Engineering, Universidad Autónoma de San Luis Potosí, San Luis, Mexico"}, {"name": "Gabriela Silva-Maceda", "affiliation": "School of Psychology, Universidad Autónoma de San Luis Potosí, San Luis, Mexico"}], "tags": ["logistic regression", "programming learning", "Programming profession", "regression analysis", "Admission phase", "Context", "Education", "learning programming", "programming", "programming curriculum", "programming tool", "computer science education", "admission phase differences", "pedagogical approaches", "introductory programming block courses", "Computer languages", "gender differences", "course selection differences", "Software", "programming teaching", "educational courses", "teaching"]}, {"title": "Virtual Laboratory for QoS Study in Next-Generation Networks With Metro Ethernet Access", "link": "https://ieeexplore.ieee.org/document/7332255/", "abstract": "Teaching in university engineering departments is currently facing a number of challenges, especially for those involved in the most innovative and dynamic areas of information and communication technology. Learning model developments that place greater weight on laboratory activities require investment in specific equipment that is often very expensive, difficult to manage, and soon obsolete. This paper describes a virtual laboratory education platform, QoSLab, for training in and research into quality-of-service (QoS) mechanisms used for Metro Ethernet access in next-generation networks (NGNs). QoSLab integrates three experiments and 21 tasks with a pedagogical model to help students achieve learning goals; it also promoting student teamwork, iteration with lecturers, and autonomy. QoSLab was developed using OMNeT++, an open-source framework environment that allows students to run the code on their personal computers. Evaluations have shown that since 2013, QoSLab has produced a significant increase in student grades on NGN-related topics, as well as good results in student satisfaction surveys.", "authors": [{"name": "Miguel A. Rodriguez-Hernandez", "affiliation": "ITACA Universitat Politècnica de València, Valencia, Spain"}, {"name": "Victor M. Sempere-Paya", "affiliation": "ITACA Universitat Politècnica de València, Valencia, Spain"}, {"name": "Angel Gomez-Sacristan", "affiliation": "ITACA Universitat Politècnica de València, Valencia, Spain"}], "tags": ["metropolitan area networks", "learning model developments", "Computational modeling", "Metro Ethernet access", "virtual laboratory", "NGN", "Collaborative learning", "Internet", "university engineering departments", "Next generation networking", "Computers", "personal computers", "quality of service", "quality of service (QoS)", "QoSLab", "local area networks", "Quality of service", "virtual laboratory education platform", "quality-of-service mechanisms", "next generation networks", "Training"]}, {"title": "Investigating Student Motivation and Performance in Electrical Engineering and Its Subdisciplines", "link": "https://ieeexplore.ieee.org/document/7412741/", "abstract": "Factors influencing choice of major in electrical engineering and later curricular and professional choices are investigated. Studies include both quantitative and qualitative analyses via student transcripts, surveys, and focus groups. Student motivation for choosing an electrical engineering major and later subdiscipline in the field is interpreted through expectancy-value theory, where primary factors of strong perceived value of future professional opportunities and strong influence of course instructors are identified. Performances in select required electrical engineering courses appear to serve as predictors for student choice of subdiscipline emphasis. In contrast, participation in student professional activities does not show statistically significant correlations with subdiscipline. Curricular and professional choices appear to be explained by expectancy-value theory with inclusion of socializers. The findings suggest that early and integrative exposure of all electrical engineering technical areas, including high-quality teaching, may provide an optimal basis for students to make future decisions on academic path and participation in professional activities.", "authors": [{"name": "Jamie Phillips", "affiliation": "University of Michigan, Ann Arbor, MI, USA"}, {"name": "Justin M. Foley", "affiliation": "University of Michigan, Ann Arbor, MI, USA"}, {"name": "Catherine Lenaway", "affiliation": "University of Michigan, Ann Arbor, MI, USA"}, {"name": "Shanna Daly", "affiliation": "University of Michigan, Ann Arbor, MI, USA"}], "tags": ["Statistics", "subdiscipline emphasis", "qualitative analysis", "Sociology", "Electrical engineering", "expectancy-value theory", "high-quality teaching", "Computer science", "electrical engineering education", "curricular choice", "electrical engineering courses", "student motivation", "Education", "social influences", "subdiscipline", "Engineering profession", "quantitative analysis", "Professional activities", "electrical engineering technical areas", "professional choice", "Choice of major", "course instructors", "teaching", "educational courses", "professional opportunities", "student performance"]}, {"title": "Assessing the Impact of Continuous Evaluation Strategies: Tradeoff Between Student Performance and Instructor Effort", "link": "https://ieeexplore.ieee.org/document/7086086/", "abstract": "Current opinion on undergraduate studies has led to a reformulation of teaching methodologies to base them not just on learning, but also on skills and competencies. In this approach, the teaching/learning process should accomplish both knowledge assimilation and skill development. Previous works demonstrated that a strategy that uses continuous evaluation is able to meet both objectives. However, those studies did not evaluate and quantify the additional effort required to implement such strategies. This paper evaluates the additional instructor effort required when implementing continuous evaluation in a first-year Computer Fundamentals course in the Computer Engineering degree program at the Technical University of Valencia, Spain. The experiment quantifies how instructor workload increases under different continuous evaluation strategies and how this affects the overall student grade. Both the “standard” continuous evaluation method and the intensive continuous evaluation method are analyzed, the latter being a proposal that builds upon the standard method by increasing the number of tests and examinations. The results obtained reveal that continuous evaluation improves student grades but that intensive continuous evaluation is liable to generate an excessive instructor overload without having a significant impact on student scores.", "authors": [{"name": "Carlos T. Calafate", "affiliation": "Department of Computer Engineering (DISCA), The Universitat Politècnica de València (UPV), Valencia, Spain"}, {"name": "Juan-Carlos Cano", "affiliation": "Department of Computer Engineering (DISCA), The Universitat Politècnica de València (UPV), Valencia, Spain"}, {"name": "Jose-Luis Poza-Lujan", "affiliation": "Department of Computer Engineering (DISCA), The Universitat Politècnica de València (UPV), Valencia, Spain"}, {"name": "Juan-Luis Posadas-Yagüe", "affiliation": "Department of Computer Engineering (DISCA), The Universitat Politècnica de València (UPV), Valencia, Spain"}], "tags": ["standard continuous evaluation method", "student scores", "Seminars", "student performance", "computer fundamentals course", "Continuous assessment", "student grade improvement", "Indexes", "skill development", "further education", "undergraduate studies", "knowledge assimilation", "educational institutions", "Education", "learning process", "Computers", "computer science education", "teaching methodology reformulation", "formative assessment", "computer engineering degree program", "teaching process", "Spain", "intensive continuous evaluation method", "Europe", "educational courses", "Measurement", "instructor workload", "Standards", "Technical University of Valencia", "teaching"]}, {"title": "Insights Into Students' Conceptual Understanding Using Textual Analysis: A Case Study in Signal Processing", "link": "https://ieeexplore.ieee.org/document/7403926/", "abstract": "Concept inventory tests are one method to evaluate conceptual understanding and identify possible misconceptions. The multiple-choice question format, offering a choice between a correct selection and common misconceptions, can provide an assessment of students' conceptual understanding in various dimensions. Misconceptions of some engineering concepts exist due to a lack of mental frameworks, or schemas, for these types of concepts or conceptual areas. This study incorporated an open textual response component in a multiple-choice concept inventory test to capture written explanations of students' selections. The study's goal was to identify, through text analysis of student responses, the types and categorizations of concepts in these explanations that had not been uncovered by the distractor selections. The analysis of the textual explanations of a subset of the discrete-time signals and systems concept inventory questions revealed that students have difficulty conceptually explaining several dimensions of signal processing. This contributed to their inability to provide a clear explanation of the underlying concepts, such as mathematical concepts. The methods used in this study evaluate students' understanding of signals and systems concepts through their ability to express understanding in written text. This may present a bias for students with strong written communication skills. This study presents a framework for extracting and identifying the types of concepts students use to express their reasoning when answering conceptual questions.", "authors": [{"name": "Dhammika Jayalath", "affiliation": "Science and Engineering Faculty, Electrical Engineering and Computer Science School, Queensland University of Technology (QUT), Brisbane, QLD, Australia"}, {"name": "Wageeh Boles", "affiliation": "Science and Engineering Faculty, Electrical Engineering and Computer Science School, Queensland University of Technology (QUT), Brisbane, QLD, Australia"}, {"name": "Andrea M. Goncher", "affiliation": "Queensland University of Technology (QUT), Charles Sturt University, Bathurst, NSW, Australia"}], "tags": ["student conceptual understanding", "signal processing", "multiple-choice question format", "system concept inventory questions", "Text analysis", "engineering education", "multiple-choice concept inventory test", "textual analysis", "Manuals", "Encoding", "open textual response component", "text analysis", "Cognition", "conceptual understanding", "Software", "discrete-time signals", "computer aided instruction", "Concept inventories", "Australia", "cognition", "Training"]}, {"title": "Using the Wiimote to Learn MEMS in a Physics Degree Program", "link": "https://ieeexplore.ieee.org/document/7254249/", "abstract": "This paper describes a learning experience designed to introduce students in a Micro- and Nanosystems course in a Physics Bachelor's degree program to the use of professional tools for the design and characterization of microelectromechanical systems (MEMS) through a specific commercial case: the MEMS used by the well-known gaming platform Nintendo Wii. For this project, all the MEMS' fabrication steps were adapted to a teaching environment, from its design using specific software, to its experimental characterization after fabrication. The implementation of this learning strategy enhances students' learning autonomy while fostering multidirectional learning and active feedback between teachers and students. This innovative approach allows students to carry out collaborative work in a realistic environment and serves to introduce science students to tools and workflow typical of the engineering field. Although this learning strategy is particularized for students in a Micro- and Nanosystems course of a Physics Bachelor's degree program, it can be adapted to students of any scientific technical degree.", "authors": [{"name": "Cecilia Gimeno", "affiliation": "Group of Electronic Design (GDE), Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Santiago Celma", "affiliation": "Group of Electronic Design (GDE), Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Carlos Sánchez-Azqueta", "affiliation": "Group of Electronic Design (GDE), Universidad de Zaragoza, Zaragoza, Spain"}, {"name": "Concepción Aldea", "affiliation": "Group of Electronic Design (GDE), Universidad de Zaragoza, Zaragoza, Spain"}], "tags": ["Acceleration", "microelectromechanical systems (MEMS)", "physics bachelor degree program", "micromechanical devices", "Active learning", "Wiimote", "Nintendo Wii", "Micromechanical devices", "professional tools", "realistic learning environments", "further education", "engineering education", "microelectromechanical systems", "physics degree program", "Education", "professional design tools", "MEMS", "Fabrication", "teaching environment", "realistic environment", "active feedback", "MEMS fabrication", "Accelerometers", "Software", "computer aided instruction", "multidirectional learning"]}, {"title": "A Large-Scale Blended and Flipped Class: Class Design and Investigation of Factors Influencing Students' Intention to Learn", "link": "https://ieeexplore.ieee.org/document/7435269/", "abstract": "This paper reports a study of a large-scale blended and flipped class and has two major parts. First, it presents the design of the class, i.e., a coordinated and multisection undergraduate introduction-to-computer-information-systems course. The detailed design of various teaching methods used in the class is presented, including a digital textbook, video tutorials, several quizzes, allowing multiple attempts at those quizzes, self-paced online homework, Cornell Notes, and in-class activities. Second, it presents the research model developed to systematically examine the impact of various factors on students' intention to learn in the blended and flipped class. A survey was conducted and the data analyzed by structural equation modeling. The results showed that the teaching method used and students' motivation and computer self-efficacy could significantly influence their intention to learn in this new learning environment. However, instructor characteristics were found to have no significant impact on intention to learn. Students' written comments on the helpfulness of different teaching methods adopted in the class were also collected and are discussed here.", "authors": [{"name": "Yan Dang", "affiliation": "Information Systems Area, The W. A. Franke College of Business, Northern Arizona University, Flagstaff, AZ, USA"}, {"name": "Yulei Zhang", "affiliation": "Information Systems Area, The W. A. Franke College of Business, Northern Arizona University, Flagstaff, AZ, USA"}, {"name": "Beverly Amer", "affiliation": "Information Systems Area, The W. A. Franke College of Business, Northern Arizona University, Flagstaff, AZ, USA"}], "tags": ["Cornell notes", "self-paced online homework", "Computational modeling", "computer self-efficacy (CSE)", "video tutorials", "class design", "teaching method", "instructor characteristics (IC)", "large-scale blended class", "inclass activities", "motivation", "teaching methods", "flipped class", "Mathematical model", "Blended and flipped learning", "digital textbook", "computer-information-systems course", "Computers", "computer science education", "structural equation modeling", "Electronic learning", "Learning management systems", "intention to learn (ITL)", "Tutorials", "statistical analysis", "teaching"]}, {"title": "Tracking Students’ Cognitive Processes During Program Debugging—An Eye-Movement Approach", "link": "https://ieeexplore.ieee.org/document/7312518/", "abstract": "This study explores students' cognitive processes while debugging programs by using an eye tracker. Students' eye movements during debugging were recorded by an eye tracker to investigate whether and how high- and low-performance students act differently during debugging. Thirty-eight computer science undergraduates were asked to debug two C programs. The path of students' gaze while following program codes was subjected to sequential analysis to reveal significant sequences of areas examined. These significant gaze path sequences were then compared to those of students with different debugging performances. The results show that, when debugging, high-performance students traced programs in a more logical manner, whereas low-performance students tended to stick to a line-by-line sequence and were unable to quickly derive the program's higher-level logic. Low-performance students also often jumped directly to certain suspected statements to find bugs, without following the program's logic. They also often needed to trace back to prior statements to recall information, and spent more time on manual computation. Based on the research results, adaptive instructional strategies and materials can be developed for students of different performance levels, to improve associated cognitive activities during debugging, which can foster learning during debugging and programming.", "authors": [{"name": "Cheng-Chih Wu", "affiliation": "Graduate Institute of Information and Computer Education, National Taiwan Normal University, Taipei, Taiwan"}, {"name": "Ting-Yun Hou", "affiliation": "Graduate Institute of Information and Computer Education, National Taiwan Normal University, Taipei, Taiwan"}, {"name": "Chia-Hu Chang", "affiliation": "Graduate Institute of Networking and Multimedia, National Taiwan University, Taipei, Taiwan"}, {"name": "Yu-Tzu Lin", "affiliation": "Graduate Institute of Information and Computer Education, National Taiwan Normal University, Taipei, Taiwan"}, {"name": "Yu-Chih Lin", "affiliation": "Department of Biomedical Engineering, Yuanpei University, HsinChu, Taiwan"}, {"name": "Fang-Ying Yang", "affiliation": "Graduate Institute of Science Education, National Taiwan Normal University, Taipei, Taiwan"}], "tags": ["C programs", "Debugging", "computer science undergraduates", "C language", "Programming profession", "sequential analysis", "eye-movement approach", "further education", "program higher-level logic", "student cognitive processes", "Cognition analysis", "program codes", "Sequential analysis", "eye-movement analysis", "computer science education", "programming instruction", "adaptive instructional strategies", "Tracking", "Computer bugs", "Cognition", "program debugging", "gaze tracking", "cognition", "eye tracker"]}, {"title": "A Senior Project-Based Multiphase Motor Drive System Development", "link": "https://ieeexplore.ieee.org/document/7464309/", "abstract": "Adjustable-speed drives based on multiphase motors are of significant interest for safety-critical applications that necessitate wide fault-tolerant capabilities and high system reliability. Although multiphase machines are based on the same conceptual theory as three-phase machines, most undergraduate electrical machines and electric drives courses do not cover this topic. Setting aside the analysis challenges addressed in state-of-the-art literature, undergraduate electrical machines and power electronics courses are a good opportunity for students to understand the main concepts underlying such electric drive systems. This paper presents an adjustable-speed multiphase drive system senior project for electrical engineering undergraduate students that addresses their attainment of the course's learning outcomes. Eight of the course's students were assigned to build the multiphase variable-speed motor drive system. From a pedagogical point of view, this paper describes the methodology of using a senior project to engage students through experiential learning of electric drive systems, which span disciplines such as electrical machines, control, power electronics, and electronics. Students acquire both technical skills and soft skills, which are evaluated through various assessment activities. A number of lessons for future work have been drawn from the experience of applying this project-based learning approach.", "authors": [{"name": "Ahmed M. Massoud", "affiliation": "Department of Electrical Engineering, Qatar University, Doha, Qatar"}, {"name": "Ayman S. Abdel-Khalik", "affiliation": "Department of Electrical Engineering, Alexandria University, Alexandria, Egypt"}, {"name": "Shehab Ahmed", "affiliation": "Texas A&M University at Qatar, Doha, Qatar"}], "tags": ["senior project", "Fault tolerance", "Fault tolerant systems", "Electrical engineering", "fault-tolerant", "adjustable-speed multiphase drive system", "multiphase variable-speed motor drive system", "senior project-based multiphase motor drive system development", "Asymmetrical winding", "Motor drives", "course learning outcomes", "motor drive", "six-phase", "design", "Power electronics", "power engineering education", "variable speed drives", "symmetrical winding", "electrical engineering undergraduate students", "Software", "educational courses", "Windings", "project-based learning approach"]}, {"title": "Design and Configuration of a Medical Imaging Systems Computer Laboratory Syllabus", "link": "https://ieeexplore.ieee.org/document/7192737/", "abstract": "Medical imaging systems (MIS) constitute an important emergent subdiscipline of engineering studies. In the context of electrical and electronics engineering (EEE) education, MIS courses cover physics, instrumentation, data acquisition, image formation, modeling, and quality assessment of various modalities. Many well-structured MIS courses are available for EEE curricula, providing introduction to all modern diagnostic imaging systems. However, in these courses the laboratory component is limited to image formation and analysis. This paper proposes a wide range of experiments that incorporate various disciplines of EEE education into MIS courses. These experiments are designed to integrate knowledge that students have acquired previously from key EEE courses (such as circuit theory, differential equations, wave theory, energy conversion, control theory, and signal processing) into their new MIS knowledge. The proposed laboratory was adapted to a senior-year MIS class in the EEE Department of Dokuz Eylül University, Turkey. This paper presents the application of these new laboratory experiments, along with the assessment results.", "authors": [{"name": "M. Alper Selver", "affiliation": "EEE department, Dokuz Eylül University, Izmir, Turkey"}], "tags": ["diagnostic imaging systems", "physics", "electronic engineering computing", "data acquisition", "EEE Department of Dokuz Eylül University", "MIS courses", "instrumentation", "Biomedical imaging", "biomedical education", "medical imaging", "quality assessment", "Integrated circuit modeling", "Computer laboratory", "electrical and electronics engineering education", "X-ray imaging", "image quality", "image analysis", "electrical and electronics engineering curriculum", "electronic engineering education", "Magnetic resonance imaging", "medical image processing", "Turkey", "EEE education", "Image quality", "educational courses", "medical imaging systems", "computer laboratory syllabus", "image formation", "Signal to noise ratio", "computer aided instruction"]}, {"title": "5E Mobile Inquiry Learning Approach for Enhancing Learning Motivation and Scientific Inquiry Ability of University Students", "link": "https://ieeexplore.ieee.org/document/7258408/", "abstract": "In recent years, many universities have opened courses to increase students' knowledge in the field of nanotechnology. These have been shown to increase students' knowledge of nanotechnology, but beyond this, advanced and applied nanotechnology courses should also focus on learning motivation and scientific enquiry abilities to equip students to develop the deeper knowledge and skills required for scientific application. This paper addresses this challenge. Due to the abstract nature of many nanotechnology concepts and in order to move from abstract knowledge to hands-on learning, an inquiry-based learning approach was adopted. Among the diverse inquiry-based learning models proposed, the 5E mobile inquiry-based approach, including the steps of engagement, exploration, explanation, elaboration, and evaluation, was considered most effective to enhance learners' understanding of nanotechnology. To evaluate the effectiveness of this proposed approach, a pretest-posttest quasi-experimental design was adopted with a total of 32 university students. Two sections of Nanotechnology Engineering, a general education course, were randomly assigned as either the comparison group (18 students; receiving lecture-based instruction, and using mobile devices) or the experimental group (14 students; receiving 5E inquiry learning, and using mobile devices). Mobile devices were adopted to enhance learners' experience, provide immediate access to information online, and provide enhanced hands-on learning. The empirical results demonstrate that the experimental condition, 5E mobile inquiry learning, had a positive impact on participants' learning motivation and scientific inquiry abilities.", "authors": [{"name": "Ya-Ting Carolyn Yang", "affiliation": "National Cheng Kung University, Institute of Education, Tainan, Taiwan"}, {"name": "Ping-Han Cheng", "affiliation": "National Cheng Kung University, Institute of Education, Tainan, Taiwan"}, {"name": "Shih-Hui Gilbert Chang", "affiliation": "Department of Photonics, National Cheng Kung University, Tainan, Taiwan"}, {"name": "Fan-Ray Revon Kuo", "affiliation": "National Cheng Kung University, Institute of Education, Tainan, Taiwan"}], "tags": ["mobile computing", "mobile devices", "explanation step", "nanotechnology engineering", "engagement step", "university students", "nanotechnology", "evaluation step", "lecture-based instruction", "natural sciences computing", "Mobile communication", "Internet", "5E mobile inquiry learning approach", "Information technology", "Education", "learning motivation", "pretest-posttest quasi-experimental design", "Mobile handsets", "5E mobile inquiry-based learning", "Gold", "learning motivation enhancement", "scientific inquiry ability enhancement", "general education course", "Nanotechnology", "applied nanotechnology courses", "educational courses", "elaboration step", "computer aided instruction", "exploration step", "scientific inquiry abilities"]}, {"title": "Teaching Power Electronics With a Design-Oriented, Project-Based Learning Method at the Technical University of Denmark", "link": "https://ieeexplore.ieee.org/document/7101878/", "abstract": "Power electronics is a fast-developing technology within the electrical engineering field. This paper presents the results and experiences gained from applying design-oriented project-based learning to switch-mode power supply design in a power electronics course at the Technical University of Denmark (DTU). Project-based learning (PBL) is known to be a motivating problem-centered teaching method that not only places students at the core of teaching and learning activities but also gives them the ability to transfer their acquired scientific knowledge into industrial practice. Students choose a specification to implement from various power converter application projects, such as a fuel cell power conditioning converter, a light-emitting diode (LED) driver or a battery charger. The students select the topology, design magnetic components, calculate input/output filters and design closed-loop controllers necessary to fulfill the requirements listed in the chosen specification and thus meet the project's goals. This paper presents the course teaching plan and teaching methods, assessment method and student feedback.", "authors": [{"name": "Zhe Zhang", "affiliation": "Technical University of Denmark, Kgs. Lyngby, Denmark"}, {"name": "Claus Thorp Hansen", "affiliation": "Technical University of Denmark, Kgs. Lyngby, Denmark"}, {"name": "Michael A. E. Andersen", "affiliation": "Technical University of Denmark, Kgs. Lyngby, Denmark"}], "tags": ["Magnetic cores", "Topology", "electronic engineering computing", "power converter application project", "DTU", "human factors", "DC-DC converters", "project-based learning", "topology", "design magnetic component", "Education", "closed loop systems", "design-oriented project-based learning", "DC-DC power convertors", "PBL", "control system synthesis", "power electronics", "switch-mode power supply design", "Technical University of Denmark", "Power electronics", "electronic engineering education", "Switches", "power electronics course", "Writing", "knowledge acquisition", "Power supplies", "educational courses", "closed-loop controller", "group work", "electrical engineering field"]}, {"title": "Bioinstrumentation: A Project-Based Engineering Course", "link": "https://ieeexplore.ieee.org/document/7145486/", "abstract": "This paper presents the development, implementation, and assessment of a project-based Bioinstrumentation course. All course lectures and hands-on laboratory activities are related to a central project theme: a cardiac pacemaker. The students create a benchtop cardiac pacemaker by applying instrumentation knowledge acquired in the course to each stage of device development. This approach emphasizes both conceptual and practical student learning: The students must apply theory learned in the course to create their devices. Indirect and direct assessment performed with respect to the major course objective demonstrated that course participants were able to successfully design, construct, and test a bioinstrumentation system. The students perceived a marked increase in their instrumentation knowledge, objectively corroborated by their performance on specific exercises related to the creation of their benchtop pacemakers. The outcomes of the course development presented here, along with the course structure and pedagogical methodology, may enhance engineering education by acting as a guideline for the creation of courses in which a central project theme is used as a platform for concept instruction.", "authors": [{"name": "Matthew E. Downs", "affiliation": "Department of Biomedical Engineering, Columbia University, New York, New York, United States"}, {"name": "David C. Jangraw", "affiliation": "Department of Biomedical Engineering, Columbia University, New York, New York, United States"}, {"name": "Matthew B. Bouchard", "affiliation": "Department of Biomedical Engineering, Columbia University, New York, New York, United States"}, {"name": "Aaron M. Kyle", "affiliation": "Department of Biomedical Engineering, Columbia University, New York, New York, United States"}], "tags": ["Instruments", "bioinstrumentation system testing", "pacemakers", "Sensors", "Biological system modeling", "project-based Bioinstrumentation course development", "laboratory activities", "benchtop cardiac pacemaker", "project-based engineering course", "practical student learning", "biomedical measurement", "Pacemakers", "project-based bioinstrumentation course implementation", "project-based learning", "bioinstrumentation system design", "biomedical engineering education", "device development", "conceptual student learning", "Indirect assessment", "engineering education", "cardiology", "course objective", "Performance evaluation", "direct assessment", "Biomedical measurement", "MATLAB", "project-based bioinstrumentation course assessment", "pedagogical methodology", "instrumentation knowledge", "engineering education enhancement", "bioinstrumentation system construction", "Bioinstrumentation", "biomedical electronics", "educational courses", "course structure"]}, {"title": "Factors That Influence Students' Motivation to Start and to Continue Studying Information Technology in Estonia", "link": "https://ieeexplore.ieee.org/document/7422090/", "abstract": "Despite the high competition for places to study curricula related to information technology (IT) at the higher education level in Estonia, a large number of IT students drop out. Therefore, it is important to explore what influences students to start studying IT and what influences them to persist with their degree program. In this study, data were collected from 301 IT students in Estonia. The students completed a questionnaire at the beginning of their studies and after their first semester. Five factors influencing students' motivation were identified from analysis of these questionnaires. Three of these factors were the same at the beginning of and during studies: previous personal contact with IT, the reputation of the IT field, and development (including self-development and IT field development). A fourth factor related to a desire to continue previous IT studies was found to influence students' motivation only when entering university. A fifth, i.e., learning environment, factor was found to influence motivation only during studies. The outcomes of this study are important for developing new interventions to increase students' interest in IT, their enrollment in IT studies, and their retention.", "authors": [{"name": "Margus Pedaste", "affiliation": "Institute of Educational Sciences, University of Tartu, Tartu, Estonia"}, {"name": "Eno Tõnisson", "affiliation": "Institute of Computer Science, University of Tartu, Tartu, Estonia"}, {"name": "Külli Kori", "affiliation": "Institute of Educational Sciences, University of Tartu, Tartu, Estonia"}, {"name": "Tauno Palts", "affiliation": "Institute of Computer Science, University of Tartu, Tartu, Estonia"}, {"name": "Heilo Altin", "affiliation": "Institute of Technology, University of Tartu, Tartu, Estonia"}], "tags": ["student retention", "Career choice", "Employment", "information technology (IT)", "degree program", "Computer science", "human factors", "motivation", "further education", "higher education level", "student motivation", "educational institutions", "Information technology", "information technology", "Education", "Media", "IT studies", "computer science education", "Engineering profession", "Estonia", "Europe", "university", "higher education"]}, {"title": "An Undergraduate Research Experience Studying Ras and Ras Mutants", "link": "https://ieeexplore.ieee.org/document/7206617/", "abstract": "Each January from 2010 to 2014, an undergraduate workshop on modeling biological systems was held at Lehman College of the City University of New York. The workshops were funded by a National Science Foundation (NSF) Expedition in Computing, “Computational Modeling and Analysis of Complex Systems (CMACS).” The primary goal was to encourage students, especially women and under represented minorities, to persist in a science, technology, engineering and mathematics (STEM) career. A secondary goal was for the students to develop habits supporting collaborative, interdisciplinary work. To these ends, the workshop staff engaged the students in active learning, using discussions, teaming exercises, and research projects. The student research projects were small, carefully delimited parts of the NSF project's investigation of how to use computational modeling and analysis to improve understanding of pancreatic cancer and atrial fibrillation. Post-workshop surveys show that the students who participated were enthusiastic about the workshops and about working in STEM fields; long-term follow-up of the students' careers found that 55 of the 61 college graduates (90%) had STEM jobs. The goal of this paper is to provide enough information, in conjunction with the workshop Web page, for other researchers to organize similar workshops. With this in mind, it describes the pedagogy, lists the lecture and exercise materials, and details the student research projects for 2014.", "authors": [{"name": "Ravnit Bhatia", "affiliation": "Lehman College"}, {"name": "Eitan Pearl", "affiliation": "City College of New York"}, {"name": "Stephanie Salarbux", "affiliation": "Queens College"}, {"name": "Dylan Sun", "affiliation": "University of Michigan"}, {"name": "Neno Fuller", "affiliation": "Brooklyn College"}, {"name": "Nancy Griffeth", "affiliation": "Lehman College"}, {"name": "Lyle Kingsbury", "affiliation": "Hunter College"}, {"name": "Piotr Gauza", "affiliation": "Lehman College"}, {"name": "Terri Grosso", "affiliation": "The Graduate Center City University of New York"}, {"name": "Rui Yan Ma", "affiliation": "Queens College"}, {"name": "Alessandro Rosa", "affiliation": "Hunter College"}, {"name": "Gianluca Arianna", "affiliation": "Hunter College"}, {"name": "Alina Levine", "affiliation": "Hunter College"}, {"name": "Nicholas Crispi", "affiliation": "Hunter College"}, {"name": "Faiza Boukerche", "affiliation": "City College of New York"}, {"name": "Naralys Batista", "affiliation": "Lehman College"}, {"name": "Jennifer Nam", "affiliation": "Hunter College"}, {"name": "Kamil Krynski", "affiliation": "Queens College"}], "tags": ["Biological system modeling", "NSF project", "Economic indicators", "ras mutant", "Computational modeling", "Computational Modeling and Analysis of Complex Systems", "computational biology", "undergraduate research experience", "physiological models", "biological system", "cancer", "biomedical engineering education", "biomedical education", "further education", "biochemistry", "systems biology", "active learning", "biomedical computing", "research project", "exercise material", "discussion", "lecture material", "Conferences", "computational analysis", "Proteins", "atrial fibrillation", "pancreatic cancer", "computational modeling", "molecular biophysics", "teaming exercise", "workshop Web page", "biology computing", "pedagogy", "proteins", "Collaboration", "student career"]}, {"title": "Evaluating the Effects of Scripted Distributed Pair Programming on Student Performance and Participation", "link": "https://ieeexplore.ieee.org/document/7089313/", "abstract": "The results presented in this paper contribute to research on two different areas of teaching methods: distributed pair programming (DPP) and computer-supported collaborative learning (CSCL). An evaluation study of a DPP system that supports collaboration scripts was conducted over one semester of a computer science course. Seventy-four students participated in the study and used the DPP model to solve programming assignments in pairs, rather than individually. Students were divided into two cohorts in order to examine how best to distribute programming tasks to students, to maximize learning outcomes. The results suggest that while the use of DPP improves pass rates and gets positive feedback from students, the use of collaboration scripts yields equal task contributions from each of the student pair. For a small number of students, overall performance was improved by the adaptive assignment of programming activities, designed to engage students equally in diverse roles and activities.", "authors": [{"name": "Stelios Xinogalos", "affiliation": "Dept. of Applied Informatics, University of Macedonia, Thessaloniki, Thessaloniki, Greece"}, {"name": "Despina Tsompanoudi", "affiliation": "Dept. of Applied Informatics, University of Macedonia, Thessaloniki, Thessaloniki, Greece"}, {"name": "Maya Satratzemi", "affiliation": "Dept. of Applied Informatics, University of Macedonia, Thessaloniki, Thessaloniki, Greece"}], "tags": ["collaboration scripts", "collaborative programming", "Adaptive collaboration support", "computer science education", "Collaborative work", "adaptive collaboration support", "CSCL", "DPP system", "computer science course", "Programming profession", "Java", "computer-supported collaborative learning", "scripted distributed pair programming", "computer aided instruction", "distributed pair programming (DPP)", "Collaboration", "Switches"]}, {"title": "Implementation of a Low-Cost Automated LED Photometer for Enzymatic Reaction Detection to Teach Basic Bioelectronics Technologies in Vocational High Schools", "link": "https://ieeexplore.ieee.org/document/7352377/", "abstract": "This study proposes a home-assembled, low-cost blue light-emitting diode (LED) photometer that uses simple and low-cost hardware and software, costing about US $150. This 425-nm wavelength photometer is controlled by an 89C51 microcontroller chip. Glucose concentration detection experiments involving enzyme coupling reactions were carried out to verify the performance of the proposed system. Measurement errors for the system were between 3% and 4%, which can be further improved to less than 2%. The proposed LED photometer can be used by students in electronics classes to conduct biotechnological tests as part of their electrical and electronics vocational high school education. This can help them to explore the basic applications of biosensors and enhance their professional abilities in executing fundamental bioelectronics processes. Pretest and post-test assessments of students' knowledge of bioelectronics were conducted to determine the efficacy of the proposed system in enhancing students' knowledge. The LED photometer can be modified to test various samples in biochemistry and analytical chemistry, and it can also be applied to various fields such as electronics, chemical engineering, and biochemistry.", "authors": [{"name": "Je-Wen Liou", "affiliation": "Biochemistry Department, Tzu Chi University, Taiwan"}, {"name": "Jui-Hsu Chung", "affiliation": "Nature Science Department, Neihu Vocational High School, Taiwan"}, {"name": "Ming-Feng Yang", "affiliation": "Electronics Engineering Department, Neihu Vocational High School, Taiwan"}, {"name": "Hwa-Ming Nieh", "affiliation": "Service Industries and Management Institute, Minghsin University of Science and Technology, Taiwan"}, {"name": "Huai-Yi Chen", "affiliation": "Electronic Engineering Department, Huafan University, Taiwan"}, {"name": "Yu-Kung Chou", "affiliation": "Electronics Engineering Department, Neihu Vocational High School, Taiwan"}], "tags": ["Biochemistry", "photometers", "Automatic testing", "light-emitting diodes (LEDs)", "biomedical measurement", "Absorption", "glucose concentration detection", "microcontroller", "Light emitting diodes", "Optical switches", "light emitting diodes", "Biosensors", "chemical analysis", "low-cost automated LED photometer", "biomedical education", "light-emitting diode", "biosensors", "biochemistry", "vocational high schools", "bioelectronics technologies", "student experiment", "electronic engineering education", "Hardware", "enzymatic reaction detection", "measurement errors", "analytical chemistry", "biotechnology", "Standards", "teaching"]}, {"title": "Recommender System and Web 2.0 Tools to Enhance a Blended Learning Model", "link": "https://ieeexplore.ieee.org/document/7104183/", "abstract": "Blended learning models that combine face-to-face and online learning are of great importance in modern higher education. However, their development should be in line with the recent changes in e-learning that emphasize a student-centered approach and use tools available on the Web to support the learning process. This paper presents research on implementing a contemporary blended learning model within the e-course “Hypermedia Supported Education”. The blended model developed combines a learning management system (LMS), a set of Web 2.0 tools and the E-Learning Activities Recommender System (ELARS) to enhance personalized online learning. As well as incorporating various technologies, the model combines a number of pedagogical approaches, focusing on collaborative and problem-based learning, to ensure the achievement of the course learning outcomes. The results of the comparative study show the effectiveness of the proposed model in that students who performed personalized collaborative e-learning activities achieved better course results. These findings encourage the further application of the model to other computer science courses.", "authors": [{"name": "Vedran Mornar", "affiliation": "Ministry of Science, Education and Sports of Republic Croatia, Zagreb, Croatia"}, {"name": "Natasa Hoic-Bozic", "affiliation": "Department of Informatics, University of Rijeka, Rijeka, Croatia"}, {"name": "Martina Holenko Dlab", "affiliation": "Department of Informatics, University of Rijeka, Rijeka, Croatia"}], "tags": ["Computational modeling", "ELARS", "online learning", "Web 2.0 tool", "Least squares approximations", "computer science courses", "learning management system", "further education", "Internet", "hypermedia supported education", "modern higher education", "e-learning activity recommender system", "computer science education", "problem-based learning", "contemporary blended learning model", "Recommender systems", "Web 2.0", "Blended learning model", "learning management systems", "collaborative e-learning", "collaborative learning", "Electronic learning", "educational courses", "recommender systems", "e-course", "blended learning model", "Collaboration", "LMS"]}, {"title": "3-D Printing as an Effective Educational Tool for MEMS Design and Fabrication", "link": "https://ieeexplore.ieee.org/document/7389438/", "abstract": "This paper presents a series of course modules developed as a high-impact and cost-effective learning tool for modeling and simulating the microfabrication process and design of microelectromechanical systems (MEMS) devices using three-dimensional (3-D) printing. Microfabrication technology is an established fabrication technique for small and high-precision MEMS devices; these processes typically take place in a cleanroom with the use of expensive high-vacuum equipment. These course modules were developed to provide engineering educators a more affordable and effective method for teaching MEMS modeling in settings without a cleanroom, as is the case in many undergraduate institutions. Feedback from student evaluations as well as course grades all support the efficacy of these course modules. In these hands-on modules, by designing and building the MEMS prototypes, the students learn by experiencing the process of building a MEMS device from the specifications given. The results are also compared to similar assessments made in the course before the introduction of these course modules to verify success. The detailed description of the modules, the evaluation methodologies adopted, and reflections on the implementation are discussed.", "authors": [{"name": "Reena Dahle", "affiliation": "Division of Engineering Programs, State University of New York (SUNY) New Paltz, New Paltz, NY, USA"}, {"name": "Rafiul Rasel", "affiliation": "Division of Engineering Programs, State University of New York New Paltz, New Paltz, NY, USA"}], "tags": ["Electrical engineering education", "Printing", "fabrication", "micromechanical devices", "Micromechanical devices", "Semiconductor device modeling", "microfabrication", "course modules", "Silicon", "Solid modeling", "microfabrication process simulation", "student evaluations", "further education", "printing", "undergraduate institutions", "3D printing", "educational institutions", "microelectromechanical systems", "Fabrication", "educational tool", "high-precision MEMS devices", "electronic engineering education", "Switches", "microfabrication process modeling", "microelectromechanical systems (MEMS) devices", "cost-effective learning tool", "MEMS fabrication", "MEMS design", "three-dimensional printing", "educational courses", "high-impact learning tool", "hands-on modules"]}, {"title": "Teaching Network Security With IP Darkspace Data", "link": "https://ieeexplore.ieee.org/document/7086349/", "abstract": "This paper presents a network security laboratory project for teaching network traffic anomaly detection methods to electrical engineering students. The project design follows a research-oriented teaching principle, enabling students to make their own discoveries in real network traffic, using data captured from a large IP darkspace monitor operated at the University of California, San Diego (UCSD). Although darkspace traffic does not include bidirectional conversations (only attempts to initiate them), it contains traffic related to or actually perpetrating a variety of network attacks originating from millions of Internet addresses around the world. This breadth of coverage makes this darkspace data an excellent choice for a hands-on study of Internet attack detection techniques. In addition, darkspace data is less privacy-critical than other network traces, because it contains only unwanted network traffic and no legitimate communication. In the lab exercises presented, students learn about network security challenges, search for suspicious anomalies in network traffic, and gain experience in presenting and interpreting their own findings. They acquire not only security-specific technical skills but also general knowledge in statistical data analysis and data mining techniques. They are also encouraged to discover new phenomena in the data, which helps to ignite their general interest in science and engineering research. The Vienna University of Technology, Austria, first implemented this laboratory during the summer semester 2014, with a class of 41 students. With the help of the Center for Applied Internet Data Analysis (CAIDA) at UCSD, all exercises and IP darkspace data are publicly available.", "authors": [{"name": "Félix Iglesias Vázquez", "affiliation": "Institute of Telecommunications, Vienna University of Technology, Vienna, Austria"}, {"name": "K. C. Claffy", "affiliation": "Center for Applied Internet Data Analysis (CAIDA), La Jolla, CA, USA"}, {"name": "Tanja Zseby", "affiliation": "Institute of Telecommunications, Vienna University of Technology, Vienna, Austria"}, {"name": "Alistair King", "affiliation": "Center for Applied Internet Data Analysis (CAIDA), La Jolla, CA, USA"}], "tags": ["IP networks", "Austria", "Center for Applied Internet Data Analysis", "Internet address", "data mining", "Communication networks", "research-oriented teaching principle", "network security laboratory project", "electrical engineering education", "Vienna University of Technology", "CAIDA", "Internet", "University of California", "engineering education", "San Diego", "Education", "Communication system security", "electrical engineering student", "electrical engineering computing", "security", "Data analysis", "IF darkspace monitor", "UCSD", "IP darkspace data", "data analysis", "Knowledge engineering", "network traffic anomaly detection method", "Security", "statistical data analysis", "statistical analysis", "computer network security", "data mining technique", "teaching"]}, {"title": "The Magnitude Response Learning Tool for DSP Education: A Case Study", "link": "https://ieeexplore.ieee.org/document/7452590/", "abstract": "Many concepts in digital signal processing are intuitive, despite being mathematically challenging. The lecturer not only has to teach the complicated math but should also help students develop intuition about the concept. To aid the lecturer in this task, the Magnitude Response Learning Tool has been introduced, a computer-based learning game addressing the connection between the pole/zero chart of a discrete-time linear time-invariant (LTI) system and its magnitude response. In each game round, the student has to draw a magnitude response given only the poles and zeros of the LTI system. The accuracy of the student's estimate acts as a game score, allowing leaderboards and player-versus-player comparisons on the tool's webpage. This paper analyzes how the tool affects student performance. While the qualitative results show that the students are satisfied with the tool and consider it a useful supplement to the available teaching material, the quantitative part of the study suggests a strong positive correlation between the number of rounds played and the student performance in related tasks.", "authors": [{"name": "Bernhard C. Geiger", "affiliation": "Signal Processing and Speech Communication Laboratory, Technical University of Munich, Munich, Germany"}, {"name": "Christian Gun Wurzer", "affiliation": "Signal Processing and Speech Communication Laboratory, University of Graz, Graz, Austria"}, {"name": "Florian Kulmer", "affiliation": "Signal Processing and Speech Communication Laboratory, University of Graz, Graz, Austria"}], "tags": ["complicated math", "Digital signal processing (DSP) education", "poles and zeros", "student performance", "computer-based learning game", "digital signal processing", "pole/zero charts", "electrical engineering education", "pole-zero chart", "Education", "discrete-time linear time-invariant system", "magnitude response", "Linear systems", "Digital signal processing", "teaching material", "MATLAB", "Poles and zeros", "Games", "magnitude response learning tool", "DSP education", "discrete time systems", "computer aided instruction", "game score", "learning games", "teaching"]}, {"title": "A Brain–Computer Interface Project Applied in Computer Engineering", "link": "https://ieeexplore.ieee.org/document/7469877/", "abstract": "Keeping up with novel methods and keeping abreast of new applications are crucial issues in engineering education. In brain research, one of the most significant research areas in recent decades, many developments have application in both modern engineering technology and education. New measurement methods in the observation of brain activity open a new frontier in engineering applications. Electroencephalogram (EEG)-based brain activity observation processes are very promising and have been used in several engineering studies, primarily for the implementation of control tasks. This paper presents the development, implementation, and assessment of an EEG-based engineering education project, in which engineering students applied the theory they had learned and improved their knowledge and skills in the area of observation and evaluation of electrical signals generated by brain activity and measured by biosensors. The main project goal was to develop and test a brain-computer interface that is able to measure the average attention level. The effectiveness of this project-based learning was evaluated by student questionnaire responses and analysis of students' exam results; students who had participated in the project were shown to have higher levels of acquired knowledge.", "authors": [{"name": "Attila Kovari", "affiliation": "Department of Information and Engineering, Budapest University of Technology and Economics, Budapest, Hungary"}, {"name": "Jozsef Katona", "affiliation": "Department of Information and Engineering, University of Dunaújváros, Dunaújváros, Hungary"}], "tags": ["project-based learning (PjBL)", "Electroencephalography", "electroencephalogram (EEG)", "engineering technology", "project-based learning", "brain-computer interfaces", "Biosensors", "Control systems", "electrical signal evaluation", "biosensors", "engineering education", "brain-computer interface project", "EEG-based brain activity observation process", "electroencephalogram", "Education", "electrical signal observation", "Brain", "Signal processing", "Computers", "computer science education", "computer engineering", "computer aided instruction", "Brain–computer interface (BCI)", "student questionnaire response"]}, {"title": "Recursion Removal as an Instructional Method to Enhance the Understanding of Recursion Tracing", "link": "https://ieeexplore.ieee.org/document/7226881/", "abstract": "Recursion is one of the most difficult programming topics for students. In this paper, an instructional method is proposed to enhance students' understanding of recursion tracing. The proposal is based on the use of rules to translate linear recursion algorithms into equivalent, iterative ones. The paper has two main contributions: the instructional method itself, and its evaluation, which is based on previous works of other authors on mental models of recursion. As a result, an enhancement was measured in the viability of mental models exhibited by students (both for linear and multiple recursion), but no significant improvement was detected in their skills for designing recursive algorithms. Evidence was also obtained of the fact that many students with (relatively) viable mental models for linear recursion have unviable mental models for multiple recursion. Finally, it was noticed that many students adopt inaccurate mental models if those models are adequate to handle the given algorithm.", "authors": [{"name": "M. Eugenia Castellanos", "affiliation": "Department of Computing and Statistics, Universidad Rey Juan Carlos, Móstoles, Madrid, Spain"}, {"name": "J. Ángel Velázquez-Iturbide", "affiliation": "Department of Computing and Statistics, Universidad Rey Juan Carlos, Móstoles, Madrid, Spain"}, {"name": "Raquel Hijón-Neira", "affiliation": "Department of Computing and Statistics, Universidad Rey Juan Carlos, Móstoles, Madrid, Spain"}], "tags": ["Biological system modeling", "Computational modeling", "Cognitive science", "recursion mental models", "Iterative methods", "tracing", "iterative recursion algorithms", "recursion", "Computer science education", "student understanding", "recursion tracing", "Algorithm design and analysis", "Education", "programming", "mental models", "computer science education", "recursive algorithm design", "evaluation", "recursion removal", "Java", "linear recursion algorithms", "program control structures", "instructional method", "multiple recursion"]}, {"title": "Distance Learning Engineering Students Languish Under Project-Based Learning, But Thrive in Case Studies and Practical Workshops", "link": "https://ieeexplore.ieee.org/document/7169622/", "abstract": "The International Engineering Alliance lists 12 important graduate attributes that students must demonstrate during their higher educational career. One of these important graduate attributes is the ability to solve problems, which can be demonstrated by the use of project-based learning, case studies, and practical workshops. The purpose of this paper is to highlight student academic results of practical work done in an electrical engineering qualification that feature these three pedagogies. These three pedagogies are used in an open-distance learning environment to assess engineering students in an electrical engineering qualification involving three separate electronic communication modules. A time-lag study using a nonexperimental descriptive design is employed. Results show that the most frequent student grade for practical workshop assignments was 80%, while the most frequent student grade for case study assignments was 70%. However, the most frequent student grade for project-based learning assignments was 50%. The results show that distance learning engineering students languish under project-based learning, while they thrive in case studies and practical workshops. Possible reasons are given for this, based on the challenges faced by students engaging with these three pedagogies.", "authors": [{"name": "Arthur James Swart", "affiliation": "Florida Science Campus, University of South Africa, Roodepoort, South Africa, Central University of Technology, Bloemfontein, South Africa"}], "tags": ["Throughput", "Electrical engineering", "electrical engineering qualification", "Assessment", "project-based learning", "electrical engineering education", "distance learning engineering students", "Engineering students", "open distance learning (ODL)", "electronic communication modules", "Conferences", "graduate attributes", "International engineering alliance", "Satellites", "higher educational career", "problem solving", "Computer aided instruction", "electronic communications", "distance learning", "challenges"]}, {"title": "Multi-Role Project (MRP): A New Project-Based Learning Method for STEM", "link": "https://ieeexplore.ieee.org/document/7219467/", "abstract": "This paper presents the “Multi-Role Project” method (MRP), a broadly applicable project-based learning method, and describes its implementation and evaluation in the context of a Science, Technology, Engineering, and Mathematics (STEM) course. The MRP method is designed around a meta-principle that considers the project learning activity as a role-playing game based on two projects: a learning project and an engineering project. The meta-principle is complemented by five principles that provide a framework to guide the working practices of student teams: distribution of responsibilities; regular interactions and solicitations within the team; anticipation and continuous improvement; positive interdependence and alternating individual/collective work; and open communication and content management. This paper presents the implementation of MRP in a course teaching software engineering, UML language, and project management. The results show that MRP helped the course's students to acquire important professional knowledge and skills, experience near-real-world professional realities, and develop their abilities to work both in teams and autonomously.", "authors": [{"name": "Christophe Kolski", "affiliation": "Computer Science, Univ. Lille Nord de France, Lille, Nord, France"}, {"name": "Bruno Warin", "affiliation": "IUT Informatique, University of Littoral Côted'Opale, Calais, Pas-de-Calais, France"}, {"name": "Omar Talbi", "affiliation": "LISIC, University of Littoral Côte d'Opale, Calais, Pas-de-Calais, France"}, {"name": "Frédéric Hoogstoel", "affiliation": "Computer Science, Univ. Lille Nord de France, Lille, Nord, France"}], "tags": ["science, technology, engineering, and mathematics course", "project-based learning method", "role-playing game", "Learning systems", "project-based learning", "Content management", "multirole project method", "UML language", "Moodle", "Unified modeling language", "Web sites", "higher education", "multi-role project", "E-learning", "Unified Modeling Language", "Games", "course teaching software engineering", "Materials requirements planning", "project management", "courseware", "Project management", "STEM", "teaching"]}, {"title": "Concept Maps as Instructional Tools for Improving Learning of Phase Transitions in Object-Oriented Analysis and Design", "link": "https://ieeexplore.ieee.org/document/7084702/", "abstract": "Students attending object-oriented analysis and design (OOAD) courses typically encounter difficulties transitioning from requirements analysis to logical design and then to physical design. Concept maps have been widely used in studies of user learning. The study reported here, based on the relationship of concept maps to learning theory and semantic memory, suggests that integrating OOAD instruction with concept maps might help learners understand these transitions more clearly. An empirical experiment, involving two treatments based on concept maps and conventional instruction, was conducted to examine the relevance of concept map-based instruction for an effective understanding of phase transitions. The results indicate that compared with conventional instruction, concept map-based instruction is more efficient in improving learner understanding because of greater learner engagement and because of concept maps' properties when they are used as an information medium. This study can aid instructors in realizing the difficulties in learning phase transitions and motivate researchers to develop more effective learning instructions.", "authors": [{"name": "Shin-Shing Shin", "affiliation": "Information Science and Management Systems, National Taitung University, Taitung, Taiwan"}], "tags": ["instructional tools", "object-oriented analysis and design", "Catalogs", "Object oriented modeling", "Couplings", "object-oriented analysis and design (OOAD)", "phase transitions learning", "Cognitive load theory", "Unified modeling language", "learning theory", "computer science education", "Semantics", "information system curricula", "Load modeling", "semantic memory", "concept maps", "information medium", "concept map-based instruction", "educational courses", "OOAD courses", "Analytical models", "learning phase transition"]}, {"title": "An Experience of CACSD for Networked Control Systems: From Mechatronic Platform Identification to Control Implementation", "link": "https://ieeexplore.ieee.org/document/7458172/", "abstract": "Continual advances in information and communication technologies (ICT) are revolutionizing virtual education and bringing new tools on the market that provide virtual solutions to a range of problems. Nevertheless, nonvirtual experimentation using computer-aided control system design tools is still fundamental for future engineers. This paper describes a control course laboratory element, which is designed to teach electronic control engineering, in which students use a networked control system to steer and drive an electric car prototype. Multidisciplinary in nature, this laboratory allows students to take advantage of their previous academic training, as they model the plant from an open-loop test and contrast the simulated behavior with experimental results obtained on the prototype. A goal in this work was that students, across multiple engineering disciplines, should be able to integrate the knowledge acquired throughout their degree studies. An evaluation of students' grades, and their perception of the course, was conducted; this confirmed the educational benefits of the approach.", "authors": [{"name": "Marta Marrón", "affiliation": "Department of Electronics, University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Francisco J. Rodríguez", "affiliation": "Department of Electronics, University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Cristina Losada", "affiliation": "Department of Electronics, University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Manuel Gálvez", "affiliation": "Department of Electronics, University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Emilio J. Bueno", "affiliation": "Department of Electronics, University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Carlos Santos", "affiliation": "Department of Electronics, University of Alcalá, Alcalá de Henares, Spain"}, {"name": "Felipe Espinosa", "affiliation": "Department of Electronics, University of Alcalá, Alcalá de Henares, Spain"}], "tags": ["mechatronic platform identification", "control engineering", "Mechatronics", "Actuators", "CACSD", "electronic control engineering", "virtual education", "ICT", "control engineering education", "networked control systems", "electric car prototype", "Mathematical model", "computer-aided instruction", "engineering education", "Control engineering", "Real-time systems", "Computer-aided control system design (CACSD)", "control system synthesis", "MATLAB", "open-loop test", "control course laboratory element", "control engineering computing", "information and communication technologies", "computer-aided control system design", "computer aided instruction", "computing"]}, {"title": "A Network Steganography Lab on Detecting TCP/IP Covert Channels", "link": "https://ieeexplore.ieee.org/document/7405338/", "abstract": "This paper presents a network security laboratory to teach data analysis for detecting TCP/IP covert channels. The laboratory is mainly designed for students of electrical engineering, but is open to students of other technical disciplines with similar background. Covert channels provide a method for leaking data from protected systems, which is a major concern for big enterprises and governments. The inclusion of covert channels in the curricula of network security students and network data analysts is therefore considered a valuable extension. In the lab exercises presented, students learn how covert channels in TCP/IP network traffic can be hidden and detected. Since the detection of covert channels requires an in-depth understanding of protocol standards and typical behavior of TCP/IP flows, the lab also provides a “playground” in which students can deepen their communication networks knowledge. Students learn how to use and interpret statistical analysis to discover abnormal patterns and footprints in network data. They are also trained to deal with noisy scenarios that increase ambiguity and uncertainty. The laboratory was first implemented during the winter semester 2014 with a class of 18 students at TU Wien, Austria. This experience showed that students consolidated the targeted skills as well as increased their interest in the topics explored. All exercises and datasets for the introduced “Network Security Advanced” lab are made publicly available.", "authors": [{"name": "Tanja Zseby", "affiliation": "Institute of Telecommunications, TU Wien, Vienna, Austria"}, {"name": "Robert Annessi", "affiliation": "Institute of Telecommunications, TU Wien, Vienna, Austria"}, {"name": "Valentin Bernhardt", "affiliation": "Institute of Telecommunications, TU Wien, Vienna, Austria"}, {"name": "Davor Frkat", "affiliation": "Institute of Telecommunications, TU Wien, Vienna, Austria"}, {"name": "Félix Iglesias Vázquez", "affiliation": "Institute of Telecommunications, TU Wien, Vienna, Austria"}], "tags": ["TCPIP", "Communication networks", "electrical engineering students", "protocol standards", "network security laboratory", "network steganography lab", "abnormal patterns", "engineering education", "steganography", "detecting TCP/IP covert channels", "Communication system security", "TCP/IP network traffic", "security", "teach data analysis", "Data analysis", "data analysis", "transport protocols", "Protocols", "Servers", "Knowledge engineering", "Security", "network security students"]}, {"title": "Enhancing Project-Based Learning Through Student and Industry Engagement in a Video-Augmented 3-D Virtual Trade Fair", "link": "https://ieeexplore.ieee.org/document/7467449/", "abstract": "Project-based learning is a widely used pedagogical strategy in engineering education shown to be effective in fostering problem-solving, design, and teamwork skills. There are distinct benefits to be gained from giving students autonomy in determining the nature and scope of the projects that they wish to undertake, but a lack of expert guidance and of a clear direction at the outset can result in confusion, frustration, and unfulfilled goals. Moreover, engineering schools face the imperative of providing students with opportunities to engage with industry during their courses, which can be difficult to accomplish due to logistical and time constraints. This paper reports on a case study in which undergraduate students of electrical, computer, mechatronics, and telecommunications engineering interacted with representatives from industry to obtain feedback at the inception phase of their design projects. Students pitched their ideas to the industry guests at a virtual “trade fair” held within a hybrid video conferencing and three-dimensional (3-D) virtual world environment, in preparation for the assessable pitches that they had to deliver on campus to a faculty audience. Survey and assessment results attest to the participants' satisfaction as well as to the effectiveness of the approach in improving student self-efficacy and performance. The paper concludes with recommendations for engineering educators looking to implement similar initiatives and a brief outline of the authors' plans for the future.", "authors": [{"name": "Peter J. Vial", "affiliation": "Faculty of Engineering and Information Sciences, University of Wollongong, Wollongong, NSW, Australia"}, {"name": "Tom Goldfinch", "affiliation": "Faculty of Engineering and Information Sciences, University of Wollongong, Wollongong, NSW, Australia"}, {"name": "Mark J. W. Lee", "affiliation": "School of Education, Charles Sturt University, Wagga Wagga, NSW, Australia"}, {"name": "Sasha Nikolic", "affiliation": "Faculty of Engineering and Information Sciences, University of Wollongong, Wollongong, NSW, Australia"}, {"name": "Christian H. Ritz", "affiliation": "Faculty of Engineering and Information Sciences, University of Wollongong, Wollongong, NSW, Australia"}, {"name": "Wanqing Li", "affiliation": "Faculty of Engineering and Information Sciences, University of Wollongong, Wollongong, NSW, Australia"}], "tags": ["engineering design", "teamwork skill", "video communication", "Employment", "hybrid video conferencing", "Industries", "electrical engineering", "project-based learning", "industry engagement", "virtual world environment", "engineering education", "video conferencing", "design skill", "mechatronics engineering", "engineering school", "telecommunications engineering", "student engagement", "Avatars", "pedagogical strategy", "video-augmented 3D virtual trade fair", "teleconferencing", "computer engineering", "problem-solving skill", "authentic learning", "virtual reality", "Engineering education", "3-D virtual world", "computer aided instruction", "Australia", "Collaboration"]}, {"title": "Motivating Power System Protection Course Students by Practical and Computer-Based Activities", "link": "https://ieeexplore.ieee.org/document/7160785/", "abstract": "This paper presents several methods for motivating students taking a power system protection (PSP) course. The paper reviews the laboratory activities developed for the PSP course at Curtin University, Australia; these methods are applicable and can be used for PSP course instruction at any institution. These activities were developed to improve the learning experience of the electrical engineering undergraduate and postgraduate students enrolled in this course. Initially, the PSP course at Curtin University consisted of lectures and tutorials accompanied by two sessions of software-based simulations and one session of laboratory demonstration. To motivate the students, several computer-based simulations and practical laboratory experiments were developed. PSCAD and ETAP power system analysis software tools are introduced and used to demonstrate the performance and coordination of different protection relays from steady-state and dynamic points of view. Also, a practical setup composed of a LabVolt power system simulator and industrial relays is used to carry out several practical experiments. The experiments help students observe the performance of protection systems for transformers and induction motors during faults and abnormal operating conditions. Finally, the concept of relay testing and commissioning is introduced by relay standalone experiments using a secondary injection relay test set. The results of these activities were evaluated according to the students' satisfaction, comments, total scores, and interest in PSP.", "authors": [{"name": "Hadi Hosseinian Yengejeh", "affiliation": "Department of Electrical and Computer Engineering, Curtin University, Perth, Australia"}, {"name": "Farhad Shahnia", "affiliation": "Department of Electrical and Computer Engineering, Curtin University, Perth, Australia"}, {"name": "Moayed Moghbel", "affiliation": "Department of Electrical and Computer Engineering, Curtin University, Perth, Australia"}], "tags": ["relay protection", "practical activities", "PSP course instruction", "transformer protection", "laboratory activities", "learning experience improvement", "Computational modeling", "secondary injection relay test set", "LabVolt power system simulator", "power system CAD", "transformers", "electrical engineering postgraduate students", "software-based simulations", "student satisfaction", "Circuit breakers", "Relays", "computer-based simulations", "student motivation", "computer-based activities", "power system protection course student motivation", "Education", "Curtin University", "power engineering education", "induction motors", "software tools", "PSCAD", "PSCAD power system analysis software tool", "electrical engineering undergraduate students", "power system protection", "Circuit faults", "power system simulation", "educational courses", "ETAP power system analysis software tool", "computer aided instruction", "industrial relays", "Australia"]}, {"title": "Student and Staff Perceptions of Key Aspects of Computer Science Engineering Capstone Projects", "link": "https://ieeexplore.ieee.org/document/7106575/", "abstract": "In carrying out their capstone projects, students use knowledge and skills acquired throughout their degree program to create a product or provide a technical service. An assigned advisor guides the students and supervises the work, and a committee assesses the projects. This study compares student and staff perceptions of key aspects of completing this type of project, such as project characteristics, student competencies, advisor involvement, and student perceived learning. The primary finding of this study is that the students' expectations differ greatly from those of staff. In particular, students tend to have a better opinion of their project, their competencies, and the supervision received than does the staff. However, advisors and evaluation committees have a similar opinion about projects characteristics. The students' perception of their learning, furthermore, is not always consistent with the grade obtained or student satisfaction. This disagreement suggests the need to more clearly and effectively communicate actual expectations to students and staff.", "authors": [{"name": "Arturo Jaime", "affiliation": "Dept. Matemáticas y Computación, Universidad de La Rioja., Logroño, Spain"}, {"name": "Francisco José Garcı´a-Izquierdo", "affiliation": "Universidad de la Rioja, Logrono, La Rioja, ES"}, {"name": "Juan José Olarte", "affiliation": "Dept. Matemáticas y Computación, Universidad de La Rioja., Logroño, Spain"}, {"name": "César Domı´nguez", "affiliation": "Universidad de la Rioja, Logrono, La Rioja, ES"}], "tags": ["student knowledge", "staff perceptions", "Correlation", "Capstone project", "Industries", "Computer science", "human factors", "Complexity theory", "advisor involvement", "student satisfaction", "student perceptions", "student competencies", "student perceived learning", "technical service", "Computers", "computer science education", "project assessment", "staff expectation", "student expectations", "computer science engineering capstone projects", "Writing", "computer science engineering", "student degree program", "project characteristics", "student skills", "Standards"]}, {"title": "An Embedded Systems Course for Engineering Students Using Open-Source Platforms in Wireless Scenarios", "link": "https://ieeexplore.ieee.org/document/7422092/", "abstract": "This paper presents a case study analyzing the advantages and disadvantages of using project-based learning (PBL) combined with collaborative learning (CL) and industry best practices, integrated with information communication technologies, open-source software, and open-source hardware tools, in a specialized microcontroller and embedded systems engineering Master's course. In addition to addressing industry requirements in both contents and methodology, the course develops capabilities and competencies in problem solving, independent learning, teamwork, and technical knowledge. Since PBL methodology alone does not ensure teamwork, it was complemented with CL. Design review meetings (as described in IEC 61160), deliverables, and organizational resources were also introduced to mirror industry demands. This structure integrated course content and student academic achievement in a simulated industrial environment. The course had students build a modular management system for home appliances, implementing control software on the “Arduino” open-source platform, as well as using wireless communications. The results show that teaching, learning, and student assessment processes can be improved by using PBL with CL. In addition, the introduction of industry practices, such us peer review meetings, brings academia closer to a real-world context.", "authors": [{"name": "Juan A. Hernandez-Tamames", "affiliation": "Department of Electronics, Rey Juan Carlos University, Madrid, Spain"}, {"name": "M. C. Rodriguez-Sanchez", "affiliation": "Department of Electronics, Rey Juan Carlos University, Madrid, Spain"}, {"name": "Joaquin Vaquero", "affiliation": "Department of Electronics, Rey Juan Carlos University, Madrid, Spain"}, {"name": "Susana Borromeo", "affiliation": "Department of Electronics, Rey Juan Carlos University, Madrid, Spain"}, {"name": "Angel Torrado-Carvajal", "affiliation": "Department of Electronics, Rey Juan Carlos University, Madrid, Spain"}], "tags": ["IEC 61160", "Embedded systems", "PBL methodology", "Open source software", "Industries", "Computer science", "project-based learning", "telecommunication engineering education", "open-source platforms", "CL", "teaching strategies", "engineering education", "student academic achievement", "wireless communications", "Education", "Cooperative/collaborative learning", "embedded systems course", "open-source hardware", "course content", "Arduino open-source platform", "Hardware", "groupware", "collaborative learning", "open-source software", "computer aided instruction", "innovation"]}, {"title": "Experiential Learning of Robotics Fundamentals Based on a Case Study of Robot-Assisted Stereotactic Neurosurgery", "link": "https://ieeexplore.ieee.org/document/7175083/", "abstract": "Robotics has been playing an important role in modern surgery, especially in procedures that require extreme precision, such as neurosurgery. This paper addresses the challenge of teaching robotics to undergraduate engineering students, through an experiential learning project of robotics fundamentals based on a case study of robot-assisted stereotactic neurosurgery. The project was integrated into the curriculum of a Biomedical Engineering and Electrical and Computer Engineering program, but can also be integrated in related courses. First, students are given a presentation on the planning and execution of a stereotactic neurosurgery procedure, with special attention being paid to the concepts involved, namely spatial transformations, kinematics, and trajectory planning. Students are then taught to use a robotics simulation tool for robot-assisted stereotactic neurosurgery. They are shown how this can be used as a specialized control application, providing direct feedback on the robot's motion in a neurosurgery scenario. They are then required to select a robotic manipulator, and to develop and implement its control code to make it perform as a robot assistant in this surgical procedure. Project efficacy was evaluated through student self-report data (with dedicated anonymous surveys) and through the impact on academic and pedagogical results (by means of statistical inference). The results of the student surveys show that the robotics simulator for stereotactic neurosurgery is well suited to its role as an experiential learning tool since it enhances the understanding and application of several robotics concepts in an appealing manner. The positive impact of the project learning experience is supported by a comparison to earlier years of student grades, pass rates, and feedback from an institutional survey.", "authors": [{"name": "Sérgio Monteiro", "affiliation": "Department of Industrial Electronics and Centre Algorithm, University of Minho, Guimarães, Portugal"}, {"name": "Estela Bicho", "affiliation": "Department of Industrial Electronics and Centre Algorithm, University of Minho, Guimarães, Portugal"}, {"name": "Wolfram Erlhagen", "affiliation": "Department of Mathematics and Applications, University of Minho, Guimarães, Portugal"}, {"name": "Toni Machado", "affiliation": "Department of Industrial Electronics and Centre Algorithm, University of Minho, Guimarães, Portugal"}, {"name": "Manuel Rito", "affiliation": "Neurosurgery Service, Coimbra University Hospital Centre, Coimbra, Portugal"}, {"name": "Carlos Faria", "affiliation": "Department of Industrial Electronics and Centre Algorithm, University of Minho, Guimarães, Portugal"}, {"name": "Carolina Vale", "affiliation": "Department of Physics, University of Lisbon, Lisbon, Portugal"}], "tags": ["Trajectory", "biomedical engineering program", "undergraduate engineering students", "path planning", "electrical engineering program", "computer engineering program", "Joints", "project learning experience", "medical robotics", "trajectory planning", "robotics fundamentals", "biomedical education", "further education", "experiential learning project", "Neurosurgery", "surgery", "robotics simulation tool", "experiential learning", "robot kinematics", "surgical procedure", "robotics simulator", "robotic manipulators", "robot motion", "robotics teaching", "robot-assisted stereotactic neurosurgery", "manipulators", "Educational robots", "spatial transformations", "neurosurgery", "Robot kinematics", "direct feedback", "Experiential learning", "educational courses", "robotic manipulator", "statistical inference", "statistical analysis", "teaching"]}, {"title": "Measuring the Impact of Agile Coaching on Students’ Performance", "link": "https://ieeexplore.ieee.org/document/7372484/", "abstract": "Nowadays, considerable attention is paid to agile methods as a means to improve management of software development processes. The widespread use of such methods in professional contexts has encouraged their integration into software engineering training and undergraduate courses. Although several research efforts have focused on teaching Scrum through simulating a software development project, they covered only the learning of programming practices within a Scrum team. Furthermore, few studies tackle nontechnical skills other than the development practices themselves. The work presented here introduces an original Scrum-based training model enhanced with agile coaching to maximize student performance. This was validated by a case study on a capstone project in a Scrum course. This paper summarizes the positive results of introducing agile coaching, which resulted in approximately 22% more coverage of software engineering practices. In addition, a survey data showed that, compared to students who did not receive coaching, coached students gained valuable insight into the internalization of Scrum, problem solving, and guidance by means of checkpoint meetings.", "authors": [{"name": "Marcelo Campo", "affiliation": "CONICET – UNICEN – Computer Sciences, ISISTAN Research Institute, Buenos Aires, Argentina"}, {"name": "Guillermo Rodríguez", "affiliation": "CONICET – UNICEN – Computer Sciences, ISISTAN Research Institute, Buenos Aires, Argentina"}, {"name": "Álvaro Soria", "affiliation": "CONICET – UNICEN – Computer Sciences, ISISTAN Research Institute, Buenos Aires, Argentina"}], "tags": ["Scrum team", "Scrum (Software development)", "student performance", "undergraduate courses", "software development project", "Industries", "Software engineering", "further education", "Context", "teaching/learning strategies", "agile coaching", "capstone project", "programming practices", "computer science education", "Agile coaching", "computer based training", "Scrum course", "software development management", "software development process management", "software engineering training", "Software", "software prototyping", "educational courses", "Scrum-based training model", "software engineering education", "Scrum", "Training"]}]